{"name":"","transcript":[{"content":"Aaron Brent Transcription REDACTIONS FINAL"},{"speaker":"Aaron","time":"00:00:03-4","content":"My name is Aaron Brent, everybody knows me here by the name, nickname Red Bird. I was born February 20th, 1957. I got convicted in 1976 around April. And, what else did you need to know?"},{"speaker":"Marcus","time":"00:00:24-2","content":"How long have you been here?"},{"speaker":"Aaron","time":"00:00:25-7","content":"Well I been here going on 41 years and it's really been a long transition for me. When I first got here, I guess you would want to know that, this place was in an uproar."},{"speaker":"Marcus","time":"00:00:43-9","content":"What year was that?"},{"speaker":"Aaron","time":"00:00:44-3","content":"That was in 1976, when I first come. And this place I guess from other guys that when you first come to this place, it's like you either be a man, or you get a man. So that mean that you had to come in being a different kind of breed. And when I first come, I thought about a lot of things that was told to me about this prison when you first get here. So all imagine plants fear. Because you hear a lot of long stories about Angola and Angola was a mess at one time."},{"speaker":"Aaron","time":"00:00:44-3","content":"So when I got here, I was determined to be a man. So I got involved with a lot of things that require people to respect you. Once you establish a certain respect in this place, when you get be here for a minute, guys don't bother you anymore. You don't have to worry about if somebody going to do you something when you sleep, or somebody going to do you something when you shower, somebody going to do you something when you go use the bathroom, somebody going to do you something when you in a certain area by yourself."},{"speaker":"Aaron","time":"00:00:44-3","content":"You don't have to worry about things like that no more. And once you get that type of respect, it begin to start be a little bit better for you to live in this place. Because like I say, nobody want your trouble. That's because you establish yourself here. This is when you start making your transition here, you can start doing things and get involved with things that would have another kind of worry or problem"},{"speaker":"Marcus","time":"00:02:39-3","content":"Yeah I've heard from a number of folks that came in during the '70s that it was a different planet than it is today."},{"speaker":"Aaron","time":"00:02:45-4","content":"Yeah it was, yes it was. And you used to have to almost walk around with a knife on you every day. You had to sleep very lightly because even when you in the bed sometimes, you'll hear people hollering and screaming and that mean somebody had done somebody something in the bed. And it kept you alert. It really was pretty twisted."},{"speaker":"Aaron","time":"00:02:45-4","content":"And sorry to say I ended up getting twisted up in the same crowd in a whirl. But now I don't have that problem because like I said the prison had changed and it makes you have to come and do the changing too."},{"speaker":"Aaron","time":"00:02:45-4","content":"Because at one time they had it where the security officers told us that they was taking the prison away from the inmates and given it back to security. But just like I had wrote in the Angolite and asked them, I told them I said I'm so confused."},{"speaker":"Aaron","time":"00:02:45-4","content":"I said why wasn't we told that the prison was taken back from security and being given to the weak and the gays. And they kind of like questioned me about that but it was true. Now you got the weak trying to be something they never been which is strong."},{"speaker":"Aaron","time":"00:02:45-4","content":"And it made the prison flip. So the guys now that used to be in the mix of foolishness, they not doing it anymore because them got guys going on. They gave dudes hope. So that makes you all feel like someday my number going to come. Because they give you motivation to do the right things because you want to do your jacket a certain way whereas when if by chance your chance come up, they will see that you changed the way you were doing things when you first come here."},{"speaker":"Aaron","time":"00:02:45-4","content":"I had a few write-ups that cost me a stay in the cellblocks but when the wardens come through one day and they see me in the block, I stopped and talk to them and the first thing they ask me say, \"Red Bird you ready get out these cell blocks?\""},{"speaker":"Aaron","time":"00:02:45-4","content":"I told them I'm ready whenever security was ready for me. And they took a chance and they got me out the same day, put me on the east yard, and made me health care orderly. And that was in 2009. And right now today I'm still with the health care program. Warden Stagg and a few other men gave me the opportunity to be over the program so I'm the coordinator over the program. And now it's to the point where when guys go to look for jobs they send them to me."},{"speaker":"Marcus","time":"00:05:34-7","content":"Let me ask you something. How long into the 41 year sentence that you've already served, how far into that were you when you just turned around, changed your life around."},{"speaker":"Aaron","time":"00:05:51-1","content":"I'd say about 20, 21 year. It was like that for 21 years and I just took up all my time and I said what, I really don't have to live like this no more. And my people, my family they been coming to see me for the whole 41 years, twice a month, and that's how we visit."},{"speaker":"Aaron","time":"00:05:51-1","content":"And they been asking me to change, I been seeing a lot of friends of mine get out of the blocks, come down walk and get involved with a few things. And they been pushing me, saying Bird why don't you come out the blocks man, you need to do something with your jacket man."},{"speaker":"Aaron","time":"00:05:51-1","content":"I say no man I'm alright, I'm cool where I'm at. Because every time I come out at this particular time cause my name was really twisted with security at the time. And every time I came out they let me come out within seven months I was going back to the blocks. For somebody wrote a letter on me and stuff like that. And then you had a few guys that was afraid of me at the time. But I was trying to change then, but it had this deal about letters."},{"speaker":"Aaron","time":"00:05:51-1","content":"And anybody they don't like you or dislike you or afraid of you, they could write a letter to the ranking security and the first thing they going to do with you with that is 'That's Red Bird, put him back in the blocks\" and separate you. So that, it was about 21 years before I made that transition."},{"speaker":"Marcus","time":"00:07:24-4","content":"Let's go back to life before Angola for a little bit. Where did you grow up?"},{"speaker":"Aaron","time":"00:07:29-5","content":"I grew up in Baton Rouge in the park and then they moved me to South Baton Rouge."},{"speaker":"Marcus","time":"00:07:37-0","content":"Can you tell me a little bit about your family and the folks who raised you?"},{"speaker":"Aaron","time":"00:07:41-1","content":"Well from the beginning when I was young, we was, my mom had, it was about 5 of us. And we was kind of poor at the time. And my grandmother, which was my mom mother, they live in a big white house in the front. We stayed in the back in like a little shack. And my mom, she did everything she knew how to try to raise us. And my stepfather, it wasn't my real father, my stepfather, he was working with Sunbeam Bakery at the time. And as I grew up I always like to hang around the older people."},{"speaker":"Aaron","time":"00:07:41-1","content":"Man I used to like and what I used to see all the time, they used to get in fights and I couldn't understand that. And it's just like my stepfather, when we grew up, he smoked, I didn't. And none of the kids smoked in the family. And they used to always ask me to go light his cigarette. \"Now you mom I got to light that cigarette?\" \"Boy go light the cigarette.\""},{"speaker":"Aaron","time":"00:07:41-1","content":"And I used to go stick it by the stove and light it and the flame would be about this high and I'd bring it back to him and he used to get drunk and go fall asleep and be burning up the house."},{"speaker":"Aaron","time":"00:07:41-1","content":"But as we was growing up as kids, my little sisters and brothers, they didn't have nothing. And I was the oldest. I caught myself getting a little grass-cutting job. Had the little lawnmower, I used to be peeping up on the lawnmower, going around trying to cut grass."},{"speaker":"Aaron","time":"00:07:41-1","content":"Because at that time, they used to have two for a penny cookies and stuff like that. And people used to see me trying to cut grass, trying to earn a little living, I didn't know what I was doing but I was seeing other people do it. So they used to call me, 'Baby look come cut this for me,\""},{"speaker":"Aaron","time":"00:07:41-1","content":"Usually give me about five or ten dollars. I used to go to the store, if I had $5 I'd go to there, and there was plenty cookies for me to bring home to my little sister and brother. So I was calling myself trying to be the little man in the family help my momma."},{"speaker":"Aaron","time":"00:07:41-1","content":"And as we grew up my mom and my stepfather end up finding a home over in South Baton Rouge. We moved to South Baton Rouge and I got in junior high. And we first went over there, the guys they was kind of like new kid in the neighborhood so they wanted to beat me up and stuff like that."},{"speaker":"Aaron","time":"00:07:41-1","content":"And during that time I was a kid that used to come up fighting. I used to fight a lot when I was young because I was overprotective about my little sisters and my baby brother. And I was just a little kid that felt like if you make one of them mad, I was going to fight you, I grew up fighting. I end up fighting in elementary school and I got put out and I end up breaking some other kid's jaw. I broke his jaw and I ran home because he was going to get his big brother."},{"speaker":"Aaron","time":"00:07:41-1","content":"So I run home and they called my grandparents and my mom and told them what happened. I'm scared to death but I was fighting because they had beat up my friend. They had two guys, two brothers that beat up a friend of mine. And when my bus come in the school, all the kids in the school was telling me about what they had done to my little friend."},{"speaker":"Aaron","time":"00:07:41-1","content":"So when they told me that I go to see the brothers and I make my little friend fight them back. And as he were fighting them, the other little brother tried to crowd them and that's when I ended up doing what I did. But he, it was right next door to senior school and that's where they, brother was at so they're going to go get they brother and that's when I run home. I was always fighting in school."},{"speaker":"Aaron","time":"00:07:41-1","content":"Then when we moved to South Baton Rouge, I was too stupid to understand that the guys who are going to crowd me, I was a fighter anyway, I was going to let them crowd me. I was going to catch them one at a time and beat them back up. And as we was coming up doing that, I finally got a chance to get the guys in the neighborhood to understand that I wasn't a kid to be messed with."},{"speaker":"Aaron","time":"00:07:41-1","content":"Because I didn't mind fighting and I was going to fight and I was going to fight to protect my little brother and my little sister and them. I always grew up feeling like I was supposed to be the protector and that's what I did."},{"speaker":"Marcus","time":"00:12:25-8","content":"Did you fight with your stepfather at all?"},{"speaker":"Aaron","time":"00:12:27-3","content":"No I never, my step, never fought with him. But I see him one time, I don't lie to you, one time I seen him come home and he jumped on my momma. And I used to tell my momma, I said when I grow up I'm going to do that man something. Because he beat her up pretty bad. And she crying, how kids are, they cry. And I'm crying and I'm feeling like she don't like being beat up with her lip all busted, black eye and all that."},{"speaker":"Aaron","time":"00:12:27-3","content":"And she trying do everything she can to be a good mother to the kids cause that's what she was doing, she was at staying home being with the kids. So that's why I try to be the big brother and like when he be gone and traveling I just try to be father with them too. And that, most of my kids, the kids up under than me, they looked up to me more than they did to the step-dad, so. But now through growing up, my grandfather, my grandfather was trine get me from my mom."},{"speaker":"Aaron","time":"00:12:27-3","content":"And he actually, my mom actually allowed him to take me to New Orleans. I went to New Orleans, trying to adjust to something new and my stepmother couldn't really get along. I guess she thought I was trying to take my grandfather from her. But they put me in different schools and I, and I fought in those schools."},{"speaker":"Aaron","time":"00:12:27-3","content":"I got put out school for fighting so much because guys down in New Orleans was teasing the guy from Baton Rouge. We talk different and they was kept calling me a country boy and I felt offended by that and I wanted to fight, I wanted to fight."},{"speaker":"Aaron","time":"00:12:27-3","content":"And my step-grandmother, she was coming more to school than I was. Because when you do badly at school, they send for the parents. And they transferred me from one school to the next school and before long I end up back in Baton Rouge with my mom."},{"speaker":"Marcus","time":"00:14:30-4","content":"Do you remember the first time you were arrested?"},{"speaker":"Aaron","time":"00:14:33-4","content":"I'd say the first time I was arrested, I wouldn't be able to think of the year but it had to be for a burglary, the first time I came here, for a burglary. Matter of fact, no that's not true. The first time I got arrested was I think I was about 15. Because I and a friend of mine were playing with some firecrackers, it was New Years. How they shoot the guns and all that. We popping firecrackers, we playing with each other with the shaker thing. And the police come down and come tell us about popping firecrackers."},{"speaker":"Aaron","time":"00:14:33-4","content":"Now you hear all these other, and they done run just and come down in front of our house. And I just told my friends, I said man light this. And I popped the firecracker anyway. So the policeman he got offended about it, and he called my momma, told my momma put me inside."},{"speaker":"Aaron","time":"00:14:33-4","content":"So my mom was doing that and after they got me inside, she trying to talk to him and he done called reinforcements. And as the reinforcements got come there, they got more aggressive and they come inside the house now where she done made me go. And she trying to talk to them and they trying to arrest me."},{"speaker":"Aaron","time":"00:14:33-4","content":"And he telling my mom to get out the way and my momma got me behind her and she said well talk to me, it's my child. And the man act like he was going to hold he's holds hand up and that's when I come from behind my mom and start fighting with them. And they crowd me all in the house, drug me outside, put me on the ground in the parking lot, in the driveway and had a dog breathing in my face."},{"speaker":"Aaron","time":"00:14:33-4","content":"They done beat me all the head with the flashlights and the clubs and my little friend that was with me, they did them the same thing. And they end up taking me to a boys' home. And when they took me, they made me shower cause I had a nice little afro, made me shower and when I showered, all the dried blood, they seen all the blood that got up in there. That was the first time I got arrested."},{"speaker":"Marcus","time":"00:17:06-9","content":"And was it pretty much just a path downhill from there in terms of trouble with the law?"},{"speaker":"Aaron","time":"00:17:13-2","content":"Yeah well after that it was a burglary that caught me. I try to mingle with friends and the guys I met when I did decide to start hanging out with the guys in the south. Well they was doing a lot of things, burglarizing and doing the wrong things. And to fit in, I started to do the same things."},{"speaker":"Aaron","time":"00:17:13-2","content":"And pretty much got down here when I got caught this first time with a burglary. I ended up getting caught in the house on the burglary, never got the chance to move nothing but we was in these people house."},{"speaker":"Aaron","time":"00:17:13-2","content":"And they brought me here the first time, I think I had about 12 months. I got out of prison, and went after I got out of prison, I went out and got a job, start living the right way then. And this particular incident happened with me in April 1976 now I'm back here with this."},{"speaker":"Marcus","time":"00:18:16-1","content":"So let me try to understand that person who arrived here with a conviction for second-degree murder. Can you, how would you describe that person when you look back on that person now?"},{"speaker":"Aaron","time":"00:18:35-7","content":"That person was arrogant, selfish, and searching for something he didn't have. And he had a chip on his shoulder, he wanted to prove himself that he wasn't the type of person to really be messed with. All he was concerned about was getting that reputation in a place like this so he wouldn't have to worry about doing something he had no business doing. Which was being somebody else wife, what I'm saying."},{"speaker":"Aaron","time":"00:18:35-7","content":"So he live to the point where if you cooked him the wrong way, which mean that you mess with him the wrong way, he felt like the only thing you was going to understand was pain. Because you just couldn't talk to people at that particular time, you had to show them that you was about your business instead of just, 'Man leave me alone, let me go about my business, I don't feel like being bossed.'"},{"speaker":"Aaron","time":"00:18:35-7","content":"You couldn't talk like that because in this place at that particular time trying to talk things out was a sign of weakness. And that's pretty much what everybody was looking for. I needed some weakness to attack. But that particular person was, like I said he was arrogant and he was selfish. And like I said he was like I said he was searching to be somebody that he really wasn't."},{"speaker":"Aaron","time":"00:18:35-7","content":"And you had to, like I said you had to pretend to be something that you really wasn't deep down inside. But you had to be that way. But now this particular person they got older. And the way I'm going to describe that is like this. When we young, we have a tendency to act before we think."},{"speaker":"Aaron","time":"00:18:35-7","content":"And how many times we all did something and we'd done laid there and got a spankings about it and then we said well what I could have did that another way. Now you thinking after you'd get punished. But when you get older, you think before you act. Because you try to think of all kind of ways to attack the situation before you act on it. And that's the difference between then and the one that's now, because I'm older."},{"speaker":"Marcus","time":"00:21:05-5","content":"You're less impulsive."},{"speaker":"Aaron","time":"00:21:06-4","content":"Yes I am, very less impulsive. I'm, to be honest with you, I'm accepting a lot of things now that I would've never accepted. Ain't no sense in me lying to you? But just like I say, when you grow older, you do more thinking than you do actin. But when you young man, you can't do nothing believe in one thing, he ain't going to believe in nothing but seeing himself bleed or whatever."},{"speaker":"Aaron","time":"00:21:06-4","content":"And once you do something violent like that, it gets around. Whatever person that you are, whatever person that you presented before these people here, that's what spreads about you. And you can go from camp to camp to camp, they going to know about you before you get there. Once you land, oh that's Red Bird, you don't want to mess with him. That's the attitude people will have so they stay at bay before they cross the line with you."},{"speaker":"Marcus","time":"00:22:05-2","content":"When was the last time you had a fight?"},{"speaker":"Aaron","time":"00:22:07-5","content":"Well let me see, I had a fight in, I don't want to lie to you, it had to be in about, think it was 2, '02, I think it was in 2 '02 I think."},{"speaker":"Marcus","time":"00:22:22-7","content":"15 years ago"},{"speaker":"Aaron","time":"00:22:23-6","content":"Yeah"},{"speaker":"Marcus","time":"00:22:24-3","content":"That's a long time ago."},{"speaker":"Aaron","time":"00:22:25-0","content":"I don't like to fight no more. People listen to me a lot now. I mean if you stop and go to east camp and you ask some of them guys before you even interview me, \"Red Bird?\" And they going to tell you about Red Bird. That's what they know me by. A lot of me don't even know my real name. Because everybody, even security, everybody calls me Red Bird and that's my nickname"},{"speaker":"Marcus","time":"00:22:48-9","content":"So you're one of the 100 or so folks who fall into that category of being convicted of second-degree murder between '73 and '79."},{"speaker":"Aaron","time":"00:22:58-5","content":"Yes sir I am."},{"speaker":"Marcus","time":"00:23:00-4","content":"And so there's parole eligibility in your future. When you try to imagine, and this is something fairly recent, when you try to imagine your life when you leave here, how do you envision your life?"},{"speaker":"Aaron","time":"00:23:21-2","content":"You want me to be honest with you?"},{"speaker":"Marcus","time":"00:23:22-5","content":"Yeah."},{"speaker":"Aaron","time":"00:23:23-6","content":"I been thinking about that ever since they come up with the bill. And right now to be honest with you, deep down inside I'm kind of afraid. Because it's the adjustment I got to make. And I had already talked to my daughter and my lady friend that been coming to see me. And I been telling me, I say now what I'm going to humble myself to y'all so y'all can teach me a lot of things about things I don't know."},{"speaker":"Aaron","time":"00:23:23-6","content":"Because I been gone 41 years. In 41 years, a lot of things done changed. I say right now, you can give me your cell phone, tell me turn this cell phone on and go home. I'll be sitting here for a minute until somebody say \"Bird, you got to do this.\""},{"speaker":"Aaron","time":"00:23:23-6","content":"I don't know about the technology. They even got cars talk to you now. That wasn't even existing when I was in the street. And they even got me parking thyself now. I'm going to be looking at things like that, but I'm just going to allow them to teach me a lot of things that I really don't know."},{"speaker":"Aaron","time":"00:23:23-6","content":"Because I'm not going to go out there pretending that I know this because I been watching TV or I been reading the newspaper. I'm just going to allow myself to be guided by my family because they've been very supportive of me and I want to go out there and be able to stay out there with them."},{"speaker":"Aaron","time":"00:23:23-6","content":"I got grandkids, I want to be able to do things with my grandkids and my great-grand kids I wasn't even able to do with my own kids. And 30 something years later, I been raisin this boy, been talking to my kid since I been here."},{"speaker":"Aaron","time":"00:23:23-6","content":"Because how all families got a missing link, and I'm like the missing link to my family. I am the master link to the family because they'll try to do decisions in the street and they still won't be fine until they \"I'm going to go see Aaron, we going to see what Aaron has to say about this\" 30 years later, my son that I'm partially in here for, is in this prison with me."},{"speaker":"Aaron","time":"00:23:23-6","content":"So that hurts me, it makes me feel bad. And it definitely made me change a lot of things I did. I have a baby brother here, I have my baby son here, I have a nephew here, and I have a first cousin here."},{"speaker":"Marcus","time":"00:25:58-9","content":"All serving life sentences?"},{"speaker":"Aaron","time":"00:26:00-0","content":"All of me serving a life sentence for the same thing. But I think 2 of me, 3 of me, is on the juvenile thing. That's the only thing I'm blessed them. But when the youngsters came, before they even come here, I told them about this prison, I told them about the way they should change the way they thinking in the street, and I even try to tell me to cop out so they wouldn't have so much town."},{"speaker":"Aaron","time":"00:26:00-0","content":"And he didn't want to listen to none of that. But my son behavior was, he loved his dad so much because he was, I stayed in the street with him three weeks. And he used to come see me. He loved his dad so much until he wanted to be in here with him. And that's not the attitude I wanted him with. Grow up and do what you can to help me get out on the street with you."},{"speaker":"Aaron","time":"00:26:00-0","content":"But now he's here, he working over there in the hospital right now as a healthcare orderly too. He love the job too. But those things too help me change here. Because how could I tell him not to do this and not to that in the prison when I'm still affiliated with it?"},{"speaker":"Marcus","time":"00:27:16-3","content":"Do you think you would go into the healthcare field?"},{"speaker":"Aaron","time":"00:27:18-7","content":"That's where I would like to go. I would love to go right out there now and get involved with that because messing with the older people now is a passion for me."},{"speaker":"Marcus","time":"00:27:28-3","content":"The hospice?"},{"speaker":"Aaron","time":"00:27:28-8","content":"Yes, I'm a healthcare orderly down there in Ash 2 right now and I been working with that almost 9 years. Warden Stagg is the one that made me coordinator over this program. And it does well to me inside when I know I'd invoke a smile on an old man face."},{"speaker":"Aaron","time":"00:27:28-8","content":"Because some of these old people, if they don't trust you, they're not going to talk to you. You're not going to be able to deal with them. But once you sit down, and you talk to me and you make them begin to understand you and start trusting you."},{"speaker":"Aaron","time":"00:27:28-8","content":"And you make them understand that what's going on with them is in your best interest, they begin to relax and start relating to you. Now it's easier for you to deal with them because now what they problem is, what they medical concern and I be able to go and talk to the head nurse or the head doctor over there, let me know what's going on with this guy. But I would love to mess with hospice if I get out on the street."},{"speaker":"Marcus","time":"00:28:33-4","content":"Mr. Givens said that sometimes he gets asked whether the guys in the seminary are for real or are they just kind of trying to get people to think of them in a certain way. And he said that what he tells them is go and have a look at the people that help the old guys in hospice."},{"speaker":"Aaron","time":"00:29:00-3","content":"Yeah."},{"speaker":"Marcus","time":"00:29:01-1","content":"Because there's no faking that."},{"speaker":"Aaron","time":"00:29:02-4","content":"No there's not. You can't. I mean I'm going to run something to you. See the Aaron that came here from the beginning, you would have never made me believe that I'd be now washing another man's butt, cleaning him like I'm doing, emptying his urine, making his bed."},{"speaker":"Aaron","time":"00:29:02-4","content":"All that was considered weak at the time when I told you I first come here. You would have never made me think that I would have did that. But it was a friend of mine that really got sick and he had a lot of respect in this prison too. And you had some young guys that really were looking up to him."},{"speaker":"Aaron","time":"00:29:02-4","content":"He got real sick on the, he was on the other side, he was on the west yard and I'm on the east. And there was concern about his health because it was going down because that's not the guy that we remember. And they was trying to convince him to go to the doctor over there. He didn't want to go, he got stubborn on them. And they was kind of afraid of him too but they respected him. So they know how I and he was so they sent for me and they told me what his problem was."},{"speaker":"Aaron","time":"00:29:02-4","content":"So I went back and I told them to tell him that I say let y'all take him to the hospital. And that's the only way he went over to the hospital. When he went to the hospital, his health was failing so bad until the hospital kept him. So and when they kept him over there, they had him in a room."},{"speaker":"Aaron","time":"00:29:02-4","content":"So the guys was going visit him and everything and he start telling the guy \"Why don't y'all go head on and let me die in peace?\" So they come back and they told me what he said. I said look don't y'all worry about him, they used to call him Pony Cat, I said don't y'all worry about Pony Cat I'm going to see him."},{"speaker":"Aaron","time":"00:29:02-4","content":"So I got a pass and I went over there and by me and him being best friends, I got on him. And I made him understand that's not the one that we remember, we always remember a strong man, a fighter. And you give up. If I been knowing you was weak like that, I'd have been stop messing with you."},{"speaker":"Aaron","time":"00:29:02-4","content":"But by him hearing that from me is doing something to him so he start getting up out his bed, I start going with him then. I told them to start going back, I said he going to be alright y'all go head on. So he came around, he came around, got his health back."},{"speaker":"Aaron","time":"00:29:02-4","content":"He went to being the same one we remember. And some of the guys was afraid of him so the guys on the ward, somebody start saying he was stealing they zoo zoos. So the security put him back in the room and told him he couldn't get visitors."},{"speaker":"Aaron","time":"00:29:02-4","content":"After they did him that, he caught himself going on a hunger strike. And that would kill him. And from that day forward, I made up my mind that I was going to be a part of this healthcare program. I start being a part of the healthcare program. I start loving it with a passion, and I start understanding how other people feel."},{"speaker":"Aaron","time":"00:29:02-4","content":"And the reason why I feel like that because you could always look and take a picture of yourself believing that either you going to be like that one day or somebody you love is going to be like that. If I go back in the street today or tomorrow, my mother's getting old."},{"speaker":"Aaron","time":"00:29:02-4","content":"Ain't no way in the world I'd rather for my mom to go to an old folks home when I can stay there and take care of her myself? Why? Why let her go there? I love doing it, I don't mind doing it, I don't have them complexes like the young Red Bird had. The older Red Bird don't care nothing about all that now what you say about me how you feel."},{"speaker":"Aaron","time":"00:29:02-4","content":"I'm going to do and I'm going to do it like these particular people are a family of mine. Right now down there in Ash 2, I run Ash 2 and they got Cyprus 2. They know they don't have a voice down there, I'm their voice. Security know it and the rest of the inmate's population know it. Anytime you come in there and it's not in the best interest of the old people in there, or somebody trying to mess me, Red Bird ain't going to stand for it. We, I done got a lot of me straight about those patients of mine so they know not to come play with me about them at all."},{"speaker":"Aaron","time":"00:29:02-4","content":"And I'm like this, see if you got a friend in there, like in the old people dormitory, automatically you going to come visit him. Automatically you going to do nice things for him. When you bringing your friend something to eat, you got these other guys that's around him don't have them kind of friends. They got to fake like they sleep or they got to go do something because the hunger pains hitting them."},{"speaker":"Aaron","time":"00:29:02-4","content":"So what I do, I go talk to all the clubs they got round here, all the ministers they got round here, and I get them to come together and give me some meals, like hot dogs cold drinks and stuff, that everybody can eat. And I ask them to help me give them something to eat and they work with me and I bless all the patients so everybody happy. And I bless my healthcare orderlies because they need a blessing to because you got to be a special man to really actually being there taken care of other men."},{"speaker":"Marcus","time":"00:35:12-6","content":"Absolutely. Did you ever imagine yourself becoming a mentor to all these younger folks?"},{"speaker":"Aaron","time":"00:35:22-0","content":"Yeah, because I do it like I said. I do it now with the family, I do it with the family. I do it with a lot of these youngsters because the youngsters always have the tendency to get an older guy and look up to me regardless of what kind of life they lived. For some apparent reason we can relate to them now. And it's got a lot of catching bout my age now."},{"speaker":"Aaron","time":"00:35:22-0","content":"They don't mind talking to them, they listen to them. But I'm, just like I was telling Mr. Stagg and them, if I get the opportunity to go out today or tomorrow, I would like to get involved in going to some of the little youth homes."},{"speaker":"Aaron","time":"00:35:22-0","content":"Because I like to go there and restructure they thoughts on the way they doing things because some already know what it's going to lead to. And I really like to talk to them because I like to talk to them about things that I done experienced, things I'd have did. Not things that you always hear other guys talking about."},{"speaker":"Aaron","time":"00:35:22-0","content":"Because the story I'm going to tell them is going to be the truth. I'm going to give it to them raw and then you got to canticle some of it for them because they'll go lock it in the head that that's the way they should live and I don't want to see them do that."},{"speaker":"Aaron","time":"00:35:22-0","content":"Because you going to end up in this prison and once you get to this prison it's just like old folks home. Or they look like all they want you to do is die here. And what's funny about it? Majority of the guys here they got a life sentence. There's the guys that's mentoring and helping the reentry people over there. They don't want us teaching them. And that's strange. We helping the reentry to understand about life period."},{"speaker":"Aaron","time":"00:35:22-0","content":"But the guys that's teaching them can't get no plea to go on the street. I don't understand that. But like I say, if given the opportunity, I would like to be able to go and show society that we are capable of being able to cope with society and stay in society. I understand that we did something wrong and I understand what society feel about it."},{"speaker":"Marcus","time":"00:37:33-8","content":"So one of the things I think a lot of people don't really have a sense of is the extraordinary breadth of offense that end up with a life sentence."},{"speaker":"Marcus","time":"00:37:33-8","content":"So from being a principal to a second-degree murder, providing a weapon, driving a car, all the way to really what we think of as more heinous types of crimes that end up being maybe first-degree murder and you name it, and everything in between has the same exact punishment in Louisiana. So how do you make sense of that?"},{"speaker":"Aaron","time":"00:38:18-0","content":"Well I mean because I was just talking to a friend of mine right before y'all come in and we was discussing different things about the way things being ran. And I asked him, I said this is one thing that confuse me, how is it that, let's say I got a burglary charge, I got a DWI charge, and I went pay the fine for the DWI say and I done did the charge for the burglary charge."},{"speaker":"Aaron","time":"00:38:18-0","content":"Now I got, let's say a domestic dispute charge. They would take the other charges out I just told you about and enhance the domestic dispute and give you a life sentence for it. Just like this guy just come in and stole some tennis shoes."},{"speaker":"Marcus","time":"00:39:17-6","content":"That's the habitual offender law"},{"speaker":"Aaron","time":"00:39:19-4","content":"Yeah I don't understand how it is so that you could still get time for something that you done paid society for. That's, I don't understand, if you pay society, supposed to be washed. Whatever you do now is what you supposed to get you punishment for. I can't understand that. That's something that's funny."},{"speaker":"Marcus","time":"00:39:42-2","content":"How much punishment is enough for second-degree murder?"},{"speaker":"Aaron","time":"00:39:45-6","content":"For second degree murder should be 15-20 years. And I was given a life sentence with a 40-year eligibility date. I been out the blocks for 9 years. I'm a Class A trustee, I been working with this program and the coordinator over this program, I got 100 hours, I got anger management, I got my GED, and I filed for clemency and they denied me. There's something wrong with the picture here. Here I am, still striving to do better and get better."},{"speaker":"Aaron","time":"00:39:45-6","content":"Hopefully I can get some plea to go in the street while I'm still healthy, while my family is still alive. Because majority of the guys that's been here the time that we done served, most of the families dying on them. My family's still alive. They were striving and asking God to help free me so they can at least get the chance to see me on freedom ground. I been doing exactly what my family want me to do, I been doing exactly what security done ask of me, I restructure, if you talk to security right now, if you say \"You know Red Bird?\""},{"speaker":"Aaron","time":"00:39:45-6","content":"And they would give you a story you wouldn't believe. But now, you say well what's going on with him now? And they'll give you another story. Some of them didn't believe it. I was so bad at one time they used to bet that I wasn't going to stay down there this last time. Security was betting. Bet you don't stay down there seven months. And they bet me. But I done fool a lot of them. I told them that the game is over and the way I'm living, the way I used to live, I don't have to live like that no more."},{"speaker":"Aaron","time":"00:39:45-6","content":"All I have to do, if guys have a tendency that don't really know me, get out of line and doing something that's, totally against the way I believe, I pull them, I say let me holler at you little brother. And I talk to them and let them know. Man I'm doing this for your benefit, not mine. Don't do me that no more. Please don't do me that no more. I know you don't understand, go ask a few of your friends around here about me before you, find yourself in a wreck."},{"speaker":"Aaron","time":"00:39:45-6","content":"Don't do that no more, please I'm asking you. And some youngsters are listening and some of them don't believe what you, you still have to get an older person or somebody that that's affiliated to go talk to him and make him understand. Yeah, you better, not him. Go find somebody else to play with. But like I said, my world now is totally different because of the family members I have here now."},{"speaker":"Marcus","time":"00:42:46-3","content":"That's actually a really good place to stop."}]}