{"name":"","transcript":[{"content":"Adonis Brooks REDACTIONS FINAL"},{"speaker":"AB:Resp:Adonis","time":"00:00:04-8","content":"My name is Adonis Brooks, I was convicted of 2nd degree murder and armed robbery, I've incarcerated for 26 years now."},{"speaker":"MK:Intvr:Marcus","time":"00:00:16-7","content":"And how old were you at the time?"},{"speaker":"AB:Resp:Adonis","time":"00:00:18-4","content":"I was a 18 the time, when the crime was committed."},{"speaker":"MK:Intvr:Marcus","time":"00:00:22-3","content":"Okay, um, I want to start by asking you some questions about your time before that. So the first 18 years of your life. Where did you grow up?"},{"speaker":"AB:Resp:Adonis","time":"00:00:32-3","content":"In New Orleans, Louisiana."},{"speaker":"MK:Intvr:Marcus","time":"00:00:33-7","content":"Okay, where?"},{"speaker":"AB:Resp:Adonis","time":"00:00:34-4","content":"In and area around city park. Between Lafitte Housing Project, right in a middle class neighborhood."},{"speaker":"MK:Intvr:Marcus","time":"00:00:46-9","content":"Yeah, what street?"},{"speaker":"AB:Resp:Adonis","time":"00:00:47-9","content":"On St. Phillip."},{"speaker":"MK:Intvr:Marcus","time":"00:00:48-7","content":"Okay, yeah. $$ there. Um, Tell me a little bit about the folks who raised you and your family."},{"speaker":"AB:Resp:Adonis","time":"00:00:56-8","content":"I was raised by a single mother after my father passed,- my father passed when I was about 9. And my mom raised us, 4 girls and 1 boy."},{"speaker":"MK:Intvr:Marcus","time":"00:01:08-3","content":"Where are you in the birth order?"},{"speaker":"AB:Resp:Adonis","time":"00:01:11-1","content":"Next to the last."},{"speaker":"MK:Intvr:Marcus","time":"00:01:12-3","content":"Okay. Um, Grandparents? Did you have grandparents who were important in your life?"},{"speaker":"AB:Resp:Adonis","time":"00:01:22-8","content":"No, just basically my mom and my sisters."},{"speaker":"MK:Intvr:Marcus","time":"00:01:25-7","content":"What did your mom do for a living?"},{"speaker":"AB:Resp:Adonis","time":"00:01:29-5","content":"She was a housekeeper. She worked at various hotels."},{"speaker":"MK:Intvr:Marcus","time":"00:01:34-9","content":"Okay, alright. Um, So would you characterize your childhood as a loving caring family that you felt there were adults who could take care of you or did you feel like you kind of had to figure it out by yourself?"},{"speaker":"AB:Resp:Adonis","time":"00:01:51-3","content":"Well up until my father died everything was good, then after that I felt like I had to kind of stand up on my own."},{"speaker":"MK:Intvr:Marcus","time":"00:02:00-0","content":"Sure, kind of the only man of the house."},{"speaker":"AB:Resp:Adonis","time":"00:02:02-6","content":"Yeah in a house with all women."},{"speaker":"MK:Intvr:Marcus","time":"00:02:04-6","content":"As a 9 year old that's a big responsibility to take on. Um, So what about school, any memories of school? What was school like for you?"},{"speaker":"AB:Resp:Adonis","time":"00:02:17-1","content":"Well up until I started junior high in the 7th grade. School was important, it played an important role. When I got in junior high, things just started to change. CauseBecause I didn't haveain't had nobody attending football games, I was in the band, so it was almost like being alone because it wasn't no male figure around for the role model. And my mom she was working, my sisters they not into football. So when I got to junior high I kind of like swayed away formfrom the things that was really being instilled in me."},{"speaker":"MK:Intvr:Marcus","time":"00:02:54-2","content":"Sure. soSo what are those types of things did you start to do for fun, I mean when you're not in school, how else were you applying your time?"},{"speaker":"AB:Resp:Adonis","time":"00:03:03-9","content":"Well before I started $$squaring them off football, basketball, the swim team. Then when I didn't have the attention from my family, I ventured off with the wrong crowd. Got into trying to sell drugs and things of that nature."},{"speaker":"MK:Intvr:Marcus","time":"00:03:24-8","content":"Okay sure. Were drugs and alcohol part of your own lifestyle.lifestyle? Or just selling?"},{"speaker":"AB:Resp:Adonis","time":"00:03:29-9","content":"No, just selling them. Wasn't part of my homestylehome-style, it was away from my home."},{"speaker":"MK:Intvr:Marcus","time":"00:03:36-8","content":"Yeah, well that means was it part of,- you were using drugs and alcohol yourself?"},{"speaker":"AB:Resp:Adonis","time":"00:03:41-7","content":"Yes I was drinking in junior high school. and-"},{"speaker":"MK:Intvr:Marcus","time":"00:03:45-6","content":"Can you tell me the name of your school again?"},{"speaker":"AB:Resp:Adonis","time":"00:03:47-9","content":"Macdonald number 2$."},{"speaker":"MK:Intvr:Marcus","time":"00:03:49-0","content":"Okay, alright. So you stopped doing these conventional things with school, you start doing these unconventional things. Did you drop out of school or did you finish school?"},{"speaker":"AB:Resp:Adonis","time":"00:04:02-0","content":"Actually I still went to school, just was going to school not really participating in school. It became a fashion show. I was just really there."},{"speaker":"MK:Intvr:Marcus","time":"00:04:14-9","content":"What do you mean it became a fashion show?"},{"speaker":"AB:Resp:Adonis","time":"00:04:16-4","content":"That became the interesting thing, girls, clothes, motorbikes, cars, so iI really got away from the things I knew were right. And started participating in other things, started getting in trouble."},{"speaker":"MK:Intvr:Marcus","time":"00:04:31-9","content":"Okay. So what kind of trouble?"},{"speaker":"AB:Resp:Adonis","time":"00:04:35-9","content":"Well I started off stealing cars, and clubbing,didclubbing, did a lot of fighting, drinking, smoking marijuana, and just small crimes,- breaking into car meters, getting the money out of there. Go to the game rooms and $$ games- different things like that. 5 MIN"},{"speaker":"MK:Intvr:Marcus","time":"00:04:58-7","content":"Okay. Did you ever get arrested for any of that stuff.stuff? Ran into trouble with the law?"},{"speaker":"AB:Resp:Adonis","time":"00:05:06-6","content":"Yes."},{"speaker":"MK:Intvr:Marcus","time":"00:05:08-4","content":"Tell me a little bit about that."},{"speaker":"AB:Resp:Adonis","time":"00:05:09-1","content":"My first time I got in trouble I got in trouble for breaking in a meter, a car meter. And uh, it brought us to $$ my mom came down, my mom didn't really have an idea what was going on because she was working two jobs and I was being raised by my older sister. She was the only one able to come get me. And that really started me going the wrong way."},{"speaker":"MK:Intvr:Marcus","time":"00:05:35-4","content":"Okay. So, um, did you have any convictions before this or was this the first time that you.-"},{"speaker":"AB:Resp:Adonis","time":"00:05:43-1","content":"It was my first time in trouble as an adult, but prior to that I've been in juvenile facility."},{"speaker":"MK:Intvr:Marcus","time":"00:05:51-7","content":"Oh okay. Alright, since how old?"},{"speaker":"AB:Resp:Adonis","time":"00:05:53-4","content":"Since 11."},{"speaker":"MK:Intvr:Marcus","time":"00:05:55-5","content":"So it kind of sounds to me it was really marked by your fathersfather's death, that's when things started totoo really.-"},{"speaker":"AB:Resp:Adonis","time":"00:06:01-6","content":"Yeah when I look back on it I was craving attention and start hanging out with the wrong people. Like I grewowed up not in the projects, in a middle class neighborhood. But I ventured off into the projects just to hang out. Teachers a that time, they would just pass me. So really I, after about the 7th grade was really when I really stopped learning as far as school and academics."},{"speaker":"MK:Intvr:Marcus","time":"00:06:31-0","content":"Sure. He passed, you keep going from grade to grade, what was the last grade you completed?"},{"speaker":"AB:Resp:Adonis","time":"00:06:35-9","content":"The 9th."},{"speaker":"MK:Intvr:Marcus","time":"00:06:36-7","content":"Okay, and after that, was it interrupted by being in juvenile facilitieSfacilities?"},{"speaker":"AB:Resp:Adonis","time":"00:06:42-7","content":"Yeah. $$ Juvenile facility, when you get there they put you in school in the juvenile facility, then you come home and they put you back in school again."},{"speaker":"MK:Intvr:Marcus","time":"00:06:52-8","content":"So were you in the same group, did you find yourself with the same group of guys coming in and an out. Getting arrested together and going through this.-"},{"speaker":"AB:Resp:Adonis","time":"00:07:02-9","content":"Yeah. And then I went to juvenile jail."},{"speaker":"MK:Intvr:Marcus","time":"00:07:05-5","content":"Okay. Any particular folks stand out in your mind to this day?"},{"speaker":"AB:Resp:Adonis","time":"00:07:09-5","content":"As for the juvenile jail? Yeah, first time I had actually got real sentences when I was uh 13, and the judge had given me- I had got convicted of robbery. And the judge gave me the juvenile life, thatlife that mean till your 21st birthday at that time. And my mom plead with the judge, came back and gave me 2 years. $$LTI and that stood out to me because that was a big change going through the local jails and sitting with the $$."},{"speaker":"MK:Intvr:Marcus","time":"00:07:48-8","content":"How is that?"},{"speaker":"AB:Resp:Adonis","time":"00:07:50-4","content":"Totally different, but to me it was the same because you're basically around the same people you knew. Except the guy that come romfrom $$ and other parts of Louisiana. And you hung out with the group of people that you basically knew from your area. The difference was always fighting and those kinds of situations."},{"speaker":"MK:Intvr:Marcus","time":"00:08:17-2","content":"Yeah. whenWhen you look back on it now, do you think the time that you spent in those juvenile facilities helped you more than it hurt you or hurt you more than it helped you?"},{"speaker":"AB:Resp:Adonis","time":"00:08:31-1","content":"Personally I believe it hurts. I believe in my head now that juvenile facilities was actually a breeding ground for crime. Because when I went in there I knew about petty crimes, when iI came out iI knew more about crimes and dealing drugs and scheming to do other things. It was like an educational ground..."},{"speaker":"MK:Intvr:Marcus","time":"00:08:53-9","content":"For crime."},{"speaker":"AB:Resp:Adonis","time":"00:08:54-4","content":"For crime. BecCause you're interacting with other kids that know about other things that you didn't know about, and you learn it. And you come home and you practice it."},{"speaker":"MK:Intvr:Marcus","time":"00:09:08-2","content":"Sure. um So at the age of 13 you already have a firearm then?"},{"speaker":"AB:Resp:Adonis","time":"00:09:11-3","content":"Yes sir."},{"speaker":"MK:Intvr:Marcus","time":"00:09:12-1","content":"Yeah, easy to get ahold of?"},{"speaker":"AB:Resp:Adonis","time":"00:09:16-3","content":"Easy to get ahold of. It wawas just in the neighborhood when crack cocaine actually hit in our neighborhood it was easy to access any type of firearm because you had older people that were using crack that were selling they guns and everything to use for crack. So it was always easy to get a firearm, not that you'd ever use them but just getting one was the thing."},{"speaker":"MK:Intvr:Marcus","time":"00:09:42-5","content":"Y Yeah. Did you, in terms of getting money for yourself as an adolescent 10 MIN and as a teenager. Did you have any little sides jobs or anything like that?"},{"speaker":"AB:Resp:Adonis","time":"00:09:55-5","content":"I did a lot of side jobs growing up, that's because of the things my mom had bought me. She bought me a new lawn mower to cut grass in the neighborhood. But that wasn't what I was really after, I wanted to get involved with the local thing because it brought money faster, drugs brought money to you faster and you get to spend it faster."},{"speaker":"MK:Intvr:Marcus","time":"00:10:20-5","content":"So I know city parkCity Park, I know that area that you're talking about, so I was gonnagoing to ask you to describe it but I think I have a pretty good picture of it. Um, Was there any kind of- were there men in your mothersmother's life that came into your life?"},{"speaker":"AB:Resp:Adonis","time":"00:10:39-3","content":"No. We knew that my mom had guy friends but she didn't allow him to stay in the house with us."},{"speaker":"MK:Intvr:Marcus","time":"00:10:47-9","content":"So you never ifndfind yourself budding heads with people that your mom was with over the years?"},{"speaker":"AB:Resp:Adonis","time":"00:10:52-8","content":"No."},{"speaker":"MK:Intvr:Marcus","time":"00:10:53-4","content":"Okay, and in your own home, was there fighting or was that something that was strictly outside of the home?"},{"speaker":"AB:Resp:Adonis","time":"00:11:00-9","content":"We had siblings $$ but I had all sisters, so I didn't do no fighting with my sister.ssister's they fought amongst each other. My fighting was basically outside."},{"speaker":"MK:Intvr:Marcus","time":"00:11:14-6","content":"So I mean again, you weren't in a violent household is what I'm trying to.-"},{"speaker":"AB:Resp:Adonis","time":"00:11:19-0","content":"No."},{"speaker":"MK:Intvr:Marcus","time":"00:11:21-5","content":"Okay. Um, Were you physically or sexually abused at all?"},{"speaker":"AB:Resp:Adonis","time":"00:11:27-0","content":"No sir."},{"speaker":"MK:Intvr:Marcus","time":"00:11:27-5","content":"Okay. wellWell so I assume that some of these things happened at school. Did you ever get kicked out of school?"},{"speaker":"AB:Resp:Adonis","time":"00:11:35-4","content":"Yeah I got kicked out of schools several times. I had to go to, they call it $$grapsgrasp, it was for problem students. I've been there twice. Usually after totoo long you take a test and they put you back in regular school which was the public school. And I've been there twice as a juvenile."},{"speaker":"MK:Intvr:Marcus","time":"00:11:54-9","content":"Okay. didDid you find school pretty easy or did you struggle with it, I mean academically."},{"speaker":"AB:Resp:Adonis","time":"00:12:00-7","content":"Well school was real easy for me. It's just that I lost the interest in school. I didn't have a problem with the school work or anything I just lost the interest. It was more like, not seeing my people care, I didn't care."},{"speaker":"MK:Intvr:Marcus","time":"00:12:15-6","content":"Yeah, I get it. Um, What about girlfriends?"},{"speaker":"AB:Resp:Adonis","time":"00:12:22-5","content":"Oh yeah. That was the whole thing of it."},{"speaker":"MK:Intvr:Marcus","time":"00:12:25-1","content":"Okay right. So tell me a little bit more about that, that's part of that lifestyle, was also as you said earlier, was a fashion show."},{"speaker":"AB:Resp:Adonis","time":"00:12:32-7","content":"Yeah that's what it was basically like a fashion show. Everybody had a girlfriend from the neighborhood, then you mess with other girls outside the neighborhood, but you always had one main girlfriend that everybody knew was your girlfriend."},{"speaker":"MK:Intvr:Marcus","time":"00:12:47-6","content":"Who was your main girlfriend?"},{"speaker":"AB:Resp:Adonis","time":"00:12:49-5","content":"My oldest daughter mother, her name Felicia."},{"speaker":"MK:Intvr:Marcus","time":"00:12:52-6","content":"Felicia. Tell me about her."},{"speaker":"AB:Resp:Adonis","time":"00:12:55-8","content":"Well she moved around the neighborhood basically when we probably about 12, 13, somewhere up in there. And she was the one I wanted, and them and her had started going out and kicking it and hanging out."},{"speaker":"MK:Intvr:Marcus","time":"00:13:13-9","content":"How old were you when you started going out?"},{"speaker":"AB:Resp:Adonis","time":"00:13:15-1","content":"About 12."},{"speaker":"MK:Intvr:Marcus","time":"00:13:15-8","content":"Wow, thatsthat's young."},{"speaker":"AB:Resp:Adonis","time":"00:13:17-7","content":"Yeah, we wasn't- you know you got this girlfriend in the neighborhood, it's just you hanging out with her, you're on her porch, or you walking to the park. It was just somebody who I could talk to and I was somebody she could talk to because her mom was deceased."},{"speaker":"MK:Intvr:Marcus","time":"00:13:34-0","content":"Okay."},{"speaker":"AB:Resp:Adonis","time":"00:13:35-1","content":"That's where we began at."},{"speaker":"MK:Intvr:Marcus","time":"00:13:38-2","content":"And how old were you when your daughter was born?"},{"speaker":"AB:Resp:Adonis","time":"00:13:41-0","content":"Actually my daughter was born the year I come to prison."},{"speaker":"MK:Intvr:Marcus","time":"00:13:44-4","content":"Okay so you were with her for a long time."},{"speaker":"AB:Resp:Adonis","time":"00:13:44-4","content":"Yeah. $$."},{"speaker":"MK:Intvr:Marcus","time":"00:13:49-6","content":"Yeah. doDo you have any other children?"},{"speaker":"AB:Resp:Adonis","time":"00:13:53-6","content":"Yeah I have one other daughter, but it's by another female."},{"speaker":"MK:Intvr:Marcus","time":"00:13:58-0","content":"Okay sure. What's her name?"},{"speaker":"AB:Resp:Adonis","time":"00:13:59-9","content":"Her name is Dejane, her mom name is Gloria."},{"speaker":"MK:Intvr:Marcus","time":"00:14:02-8","content":"So what's your relationship like with your daughter?"},{"speaker":"AB:Resp:Adonis","time":"00:14:06-4","content":"Well my relationship with my oldest daughter is great. And I've just basically getting a relationship back with my youngest daughter. Because of my incarceration she had a lot of bitter feelings toward me. Felt like I had abandoned her and iI didntdidn't care and stuff like that."},{"speaker":"AB:Resp:Adonis","time":"00:14:06-4","content":"AB: But when she was young she aintain't understand that. That her dad's not around and everybody saying he in prison so."},{"speaker":"MK:Intvr:Marcus","time":"00:14:33-3","content":"Right. And how old are theythey are now,- I would assume?-"},{"speaker":"AB:Resp:Adonis","time":"00:14:36-7","content":"26 and 27."},{"speaker":"MK:Intvr:Marcus","time":"00:14:39-4","content":"Okay. Um, Do you have any kind of relationship with the mothers of your daughters today?"},{"speaker":"AB:Resp:Adonis","time":"00:14:49-5","content":"Well we don't have relationship, we communicate. We don't have a relationship."},{"speaker":"MK:Intvr:Marcus","time":"00:14:54-2","content":"Sure no I understand that. But you're still in touch with them. Who visits you up here?"},{"speaker":"AB:Resp:Adonis","time":"00:15:00-0","content":"Um, My mom, she still come. My sisters come. My oldest daughter come. And that's it basically."},{"speaker":"MK:Intvr:Marcus","time":"00:15:08-6","content":"Okay, alright. So if you had to hone in on one factor, if there is such a thing, thatthing that took you down this path that ended up putting you in here. What would you say it would be?"},{"speaker":"AB:Resp:Adonis","time":"00:15:35-4","content":"Uh, The choices I made in school, when I decided to just be like- I wasn't concerned about school anymore I was more concerned about you know, the fashion then among other guys and basically hanging out with my friends. I chose that over school."},{"speaker":"MK:Intvr:Marcus","time":"00:15:54-4","content":"Okay, and then things just $$ from there."},{"speaker":"MK:Intvr:Marcus","time":"00:15:54-4","content":"MK: So um, so you're arrested and thrown into OPP and you're going through the whole trial process. How much time passed between being arrested and being convicted?"},{"speaker":"AB:Resp:Adonis","time":"00:16:13-6","content":"Actually it was, it had to be 13 months, itand it was a year and a month later."},{"speaker":"MK:Intvr:Marcus","time":"00:16:18-9","content":"Okay. Um, Did it sink in, did you understand as an 18 year old what a life without parole sentence meant?"},{"speaker":"AB:Resp:Adonis","time":"00:16:31-7","content":"No . $$ at that time I didn't even understand what I was facing, because iI was in and out of juvenile jails and at that time you believe in the system. So you felt like you didn't do something you were gonnagoing to be alright going through the court procedure. And I was totally ignorant to how things actually worked and in the parish, waiting to go back and forth to trial I didn't even know, I didn't take nothing real- I was working a job at the time. I was working at $$ as a cook at the time of this crime, just trying to get myself together. And all this just come down at one time."},{"speaker":"MK:Intvr:Marcus","time":"00:17:17-9","content":"Um, How do you think your life would have turned out, honestly, if you think about what else you were doing.doing? How would your life have turned out had this not happened? Let's say you weren't picked up as a suspect for this and you just continued on with your life. I'm sure you spent a lot of time thinking about what if."},{"speaker":"AB:Resp:Adonis","time":"00:17:36-1","content":"I always looked at it in 2 ways. By knowing I had a kid, getting somebody pregnant- a kid on the way. I thought I'm gonnagoing to straighten up, that's what caused me to start working. And then I always thought if I wouldn't, I'd probably be dead. I'd have been killed, honestly putting it I don't think I'd even see 21. BecCause I had a don't care attitude about life at that time, I was young."},{"speaker":"MK:Intvr:Marcus","time":"00:17:36-1","content":"And you're in a dangerous lifestyle."},{"speaker":"AB:Resp:Adonis","time":"00:18:12-2","content":"Yes sir."},{"speaker":"MK:Intvr:Marcus","time":"00:18:14-2","content":"So, um, when this happens though, you're somewhat accustomed to the criminal justice system, right? CauseBecause you were in and out of these juvenile facilities and you've got OPP. Do you remember the bus ride?"},{"speaker":"AB:Resp:Adonis","time":"00:18:28-9","content":"To Angola? Yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:18:31-4","content":"What's going through your head, as you're coming down that road?"},{"speaker":"AB:Resp:Adonis","time":"00:18:37-2","content":"Making an example. Coming up here causebecause you heard so many stories about Angola and you don't want to be a victim coming to angolaAngola. So my whole mindset was: I have to make an example. So they called me to come up here and hurt somebody, I'd hurt somebody- when I first came here. But then upon getting here just- 25 MIN it's totally different. Your mindset different. And coming here at 18, I feel like they put you in a bad position, being young."},{"speaker":"AB:Resp:Adonis","time":"00:18:37-2","content":"At that time when you came they kind of like separated you into other camps where they had juveniles and homosexuals and you know, people they considered $$ and things like that. They had certain camps and I didn't feel like that was right to put somebody first when they coming to prison in that setting."},{"speaker":"MK:Intvr:Marcus","time":"00:19:41-7","content":"Mhmm, Were they putting you there- what do you think the logic was?"},{"speaker":"AB:Resp:Adonis","time":"00:19:44-4","content":"Their logic ...I ain't got no facts on it but my understanding of their logic was they were helping you out instead of putting you in a situation-"},{"speaker":"MK:Intvr:Marcus","time":"00:19:54-1","content":"So it was for your own protection."},{"speaker":"AB:Resp:Adonis","time":"00:19:55-0","content":"Yeah they think they helping you but iI think it was causing more harm for a juvenile, a kid basically getting this type of impression that this is how prison is really ran. Seeing their understanding of life. It was just messed up."},{"speaker":"MK:Intvr:Marcus","time":"00:20:20-5","content":"And are you talking about the homosexuality?"},{"speaker":"AB:Resp:Adonis","time":"00:20:23-5","content":"Homosexuality, $$, checking out, people that actually doing things and $$ for protection."},{"speaker":"MK:Intvr:Marcus","time":"00:20:34-2","content":"I see, I see. So they put you in there, and how long is it before you're in general population?"},{"speaker":"AB:Resp:Adonis","time":"00:20:41-7","content":"Well they bring you before a board to see if you're ready to go into general population. If you wind up getting in trouble, they will put you in general population. And for me, I figured out the way to get from over there was to get into a fight with somebody and get put in the general population. And that's what I did to get put in general population. So you know so I could live and survive. $$. And that's how I got into the general population."},{"speaker":"AB:Resp:Adonis","time":"00:20:41-7","content":""},{"speaker":"MK:Intvr:Marcus","time":"00:21:18-3","content":"Mhmm. And Was that, when you look back on it, a much better environment for you to be in than the one they put you in?"},{"speaker":"AB:Resp:Adonis","time":"00:21:25-3","content":"The general population is a better environment to be put in. Camp, it was camp d, it was sectioned off from everyone else. So there was dormitories but it was sectioned off- it was camp D $$, I meant to say $$. And it was sectioned off from all other camps."},{"speaker":"MK:Intvr:Marcus","time":"00:21:44-7","content":"26 years have passed since then and you're clearly not the same person, neither should anybody be the same person after 26 years. How are you different? When you look back at that kid who came here; and you look at yourself now, in what ways are you different?"},{"speaker":"AB:Resp:Adonis","time":"00:22:08-0","content":"I care about life now, and I care about the decisions I make now. In my age in my life now, I wouldn't sell drugs, causebecause I realize drugs affect more than the person that's using them. And that only come from just growing up. I realize that I took money from this woman or man to have something for myself. But I was taking money from their kids, so their kids were put in bad situations without having things and that kid maybe had to turn to doing wrong too. So uh, I think my change is that I grewowed up."},{"speaker":"AB:Resp:Adonis","time":"00:22:08-0","content":"I care more about life and other people. And I don't want my life to be remembered as just the person that always was fighting and and things like that. I want to be at least left with the understanding that I cared and I want to help other people so they won't be put in this position that I'm in. Even in this population, a lot of young guys have the, don't care attitude and they go$$ away. So I try to spend time as much as I can,-"},{"speaker":"MK:Intvr:Marcus","time":"00:23:24-6","content":"Do you think it works? I mean when you see them coming in, do you see yourself a little bit when you were that age?"},{"speaker":"AB:Resp:Adonis","time":"00:23:30-8","content":"Oh yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:23:31-9","content":"And if somebody had taken you to the side and said look you shouldn't be doing this- it's almost like you gottagot to figure it out yourself."},{"speaker":"AB:Resp:Adonis","time":"00:23:38-9","content":"Yeah, I don't approach them with that attitude. Because nobody wannawant to be told what they shouldn't 30 MIN and should be doing. Especially at that time, they're impressionable so they worried about their reputation, they don't wannawant to be seeming like they underneath somebody wing, somebody looking out for them. So I try- I go play basketball with them, I walk the yard. Just try to get familiar with them and try to lead by example. But never, I don't never be.…"},{"speaker":"MK:Intvr:Marcus","time":"00:24:10-8","content":"Trying to give them advice."},{"speaker":"AB:Resp:Adonis","time":"00:24:11-9","content":"I'd give them advice, but in the sense of I'm just saying what I did."},{"speaker":"MK:Intvr:Marcus","time":"00:24:16-5","content":"Yeah, not like let me take care of you."},{"speaker":"AB:Resp:Adonis","time":"00:24:18-4","content":"Yeah not like that. I tell them the things I did and the mistakes I made while I was in this prison. Selling drugs in this prison and fighting and different things like that. I'm letting them see that had lost 15, 16 years up in this prison with no concerns about my life and what my family, how they were being affected by it. And when they open up I'm able to share."},{"speaker":"MK:Intvr:Marcus","time":"00:24:44-7","content":"So, let me put it this way. If you could go back to you know the 20 year old Adonis Brooks, knowing what you know now, what advice would you tell him?"},{"speaker":"AB:Resp:Adonis","time":"00:25:01-5","content":"Oh, get into programs, getting into educational program, getting into school. Instead of following this way, try to follow paths of people that are doing something that will prepare them for the future. Even if it's not leaving prison, I think you still can do some things that can help you in your future stay here that can help other people in their lives when they enter this prison."},{"speaker":"MK:Intvr:Marcus","time":"00:25:29-0","content":"Yeah. whatWhat types of programs have you taken advantage of?"},{"speaker":"AB:Resp:Adonis","time":"00:25:35-0","content":"Faith based, malachiMalachi dads, just basically all the self helpself-help programs you can basically get here. When I came to understand, I got involved. But when I first came it was like I chose to do other things with some of the partners I had here, the ones that did go the right way, and I went this way. And years later when I really came to grips with this ain't where I wannawant to be. And we talked and they helped me get involved in a lot of programs."},{"speaker":"MK:Intvr:Marcus","time":"00:26:13-9","content":"Like anger management, 100 hours. What about the GED program?"},{"speaker":"AB:Resp:Adonis","time":"00:26:19-9","content":"I got my GED yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:26:22-9","content":"That's a big deal."},{"speaker":"AB:Resp:Adonis","time":"00:26:22-9","content":"And I got a trade in culinary; and right now I'm in $$ school."},{"speaker":"MK:Intvr:Marcus","time":"00:26:35-5","content":"Okay, so you are $$. Um, for some people, making that turn around in your life happens gradually, like they just age, they get older and they get tired. Other people have a really life altering experience or they have a mentor that takes an interest in them- for you, what lead to that change? For 15 years you're still bugging the system and getting in trouble …and I mean from what you're saying, I'm assuming sometimes you are caught doing those things, right."},{"speaker":"MK:Intvr:Marcus","time":"00:26:35-5","content":""},{"speaker":"MK:Intvr:Marcus","time":"00:26:35-5","content":"MK: So what made you decide to turn around?"},{"speaker":"AB:Resp:Adonis","time":"00:27:15-2","content":"Well the program came about, the $$return where you get to spend the day with children. I got involved in that, felt like they were my daughters. But the point came to, the program at the end of it there's a part where you can pray with your children, and uh we went in the arena to pray, and realized they $$ u. Understand what life was like. And um, We went to pray and during the course of praying.,"},{"speaker":"AB:Resp:Adonis","time":"00:27:15-2","content":"My daughter was praying but all I heard her say was lord - she didn't ask god to free me, she asked god to save me. And that right there changed my whole perception of life. Because I heard her saving save me, not send my dad home- something you'd expect a child to say. After we finished we sit down and I say, why you ask god to save me? She said, I don't want you to die. That was my changing part."},{"speaker":"MK:Intvr:Marcus","time":"00:27:15-2","content":"Hmm. So she didn't want you to die. How old was she?"},{"speaker":"AB:Resp:Adonis","time":"00:28:28-0","content":""},{"speaker":"MK:Intvr:Marcus","time":"00:28:41-6","content":"Yeah so then that happens, and what do you make of that?"},{"speaker":"AB:Resp:Adonis","time":"00:28:45-0","content":"That was just mind blowing for me. It was mind blowing, so I started gradually making changes. Started going to church, got in school, got my GED, I wanted to do things that were gonnagoing to give her a different understanding of who I was."},{"speaker":"MK:Intvr:Marcus","time":"00:29:03-6","content":"Yeah...$$."},{"speaker":"AB:Resp:Adonis","time":"00:29:09-8","content":"Yeah, exactly."},{"speaker":"MK:Intvr:Marcus","time":"00:29:14-7","content":"Yeah. It...yeah. It's interesting to me to see like what it is. Very often it's a family member- makes sense. In some way your daughter is responsible for ala lot of good things in your life."},{"speaker":"AB:Resp:Adonis","time":"00:29:36-5","content":"Oh yeah, definitely."},{"speaker":"MK:Intvr:Marcus","time":"00:29:39-2","content":"Does she know that?"},{"speaker":"AB:Resp:Adonis","time":"00:29:40-7","content":"Basically no, I never had a chance to really sit down and tell her what lead me changing."},{"speaker":"MK:Intvr:Marcus","time":"00:29:49-5","content":"Yeah, I think that might be $$difficult for you to tell her that. Um, So what's your typical day like now? I mean, tell me what your routine is when you get up in the morning to when you go the bed at night."},{"speaker":"AB:Resp:Adonis","time":"00:30:09-1","content":"I get up every morning at about 4:30 and 5. I get up, say my prayers, I read the daily devotion, I read the scripture. I get up, I'll eat something, watch the news. And now I'm in brick mason school so I go to school. I come from school; and wait till the hobby shop open, I'm in the hobby shop doing woodwork."},{"speaker":"MK:Intvr:Marcus","time":"00:30:44-0","content":"What do you do there, you say?"},{"speaker":"AB:Resp:Adonis","time":"00:30:44-5","content":"Woodwork."},{"speaker":"MK:Intvr:Marcus","time":"00:30:44-9","content":"Oh okay.-- There's a spiritual side to everyday, sure."},{"speaker":"AB:Resp:Adonis","time":"00:30:48-4","content":"Yeah everydayevery day. That's what keeps me, even when I get upset about something. That's what holds me."},{"speaker":"MK:Intvr:Marcus","time":"00:30:59-9","content":"So when you're confronted by the prospect of- the possibility that you would die here, do you find that- what's your coping mechanism?"},{"speaker":"AB:Resp:Adonis","time":"00:31:17-5","content":"Praying. I just pray- and I understand, I don't want this to be the end of my story, but that's not what I fear. My biggest fear is losing my mother here, losing my daughters. But as far as me passing while I'm here, I don't really give much thought to that. I just don't wannawant to have to cope with losing my family while i'mI'm still in here."},{"speaker":"MK:Intvr:Marcus","time":"00:31:47-3","content":"So in your family, who's taken it the worst.worst? WhosWho's it been the hardest for you think?"},{"speaker":"AB:Resp:Adonis","time":"00:31:54-4","content":"Uh, I think it's been the worst for my mom. But it's affecting my sisters, dramatically, my baby sister. I think it affected her, causebecause she always $$talks about how things got harder for her once I got incarcerated. Course she ain't have me to help provide with things while she was still in school. So she was affected by it. My whole family; but my mom was the worst."},{"speaker":"MK:Intvr:Marcus","time":"00:32:22-2","content":"Yeah. What happened with your mom, how did it affect her?"},{"speaker":"AB:Resp:Adonis","time":"00:32:26-9","content":"Well since I've been here, I've watched my mom deteriorate. deteroitiate. Now she's in the early stages of dementia. And over the years I've watched her gradually- like this place tore her down. I try not to let it break me as much as it used to because I understand the ride is long, she's gotten up in age, even when she wannawant to come sometimes I make excuses for her not to come. 40 MIN Not because I don't wannawant to see her but I understand what this place is doing to her."},{"speaker":"MK:Intvr:Marcus","time":"00:33:01-1","content":"It takes a toll. And I imagine it takes a toll on you everytimeevery time you see her. You get to see her but then it brings up all these other emotions I'm sure."},{"speaker":"AB:Resp:Adonis","time":"00:33:09-5","content":"Yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:33:13-2","content":"And your sisters? Aside from the youngest one. How's it affected their life?"},{"speaker":"AB:Resp:Adonis","time":"00:33:20-9","content":"They not really open with how it affected them. We visit, they know where I'm at and…"},{"speaker":"MK:Intvr:Marcus","time":"00:33:28-7","content":"Okay alright."},{"speaker":"AB:Resp:Adonis","time":"00:33:30-7","content":"Talk, laugh, joke."},{"speaker":"MK:Intvr:Marcus","time":"00:33:34-7","content":"So um I assume that if the parole board asks you how are you different, why should we give you this second chance. You would say that you care about the consequences of your actions and that you changed. Is there anything else that you would want them to know about you?"},{"speaker":"AB:Resp:Adonis","time":"00:33:58-1","content":"Let them know that I feel like I wasn't given a chance growing up. And uh being forced into a system that I knew nothing about, as a juvenile- because they said 17s a juvenile, I feel like I was still a juvenile at 18. I had just turned 18. I just feel like I was cheated of my opportunity at life because of bad choices I made when I was younger. That's the only thing I think. I would like them to really know that I'm a changed person."},{"speaker":"MK:Intvr:Marcus","time":"00:34:34-7","content":"Mhmm, Sure. Um, Tell me this, obviously there's all kinds of things about prison that one would consider pretty bad. But what's the worst part of prison for you now? What's the worst part of the daily experience for you?"},{"speaker":"AB:Resp:Adonis","time":"00:34:53-2","content":"Huh, Waking up. Nah I'm just joking. The worst part, I think the worst part of prison now is actually seeing myself in other people, that's just my opinion of them. I see younger guys going through the same things I'm going through. If he's not doing it right- that just- that bothers me causebecause my coneronconcern now is actually for other people 45 MIN that's the worst thing for me, besides being her.ehere."},{"speaker":"MK:Intvr:Marcus","time":"00:35:24-2","content":"Is seeing other people dealing with prison who are trying to do the right thing, is that what you're saying?"},{"speaker":"AB:Resp:Adonis","time":"00:35:31-8","content":"Yes."},{"speaker":"MK:Intvr:Marcus","time":"00:35:36-6","content":"Um, So of all the things that you've accomplished, let's say, over your life. What are you the most proud of?"},{"speaker":"AB:Resp:Adonis","time":"00:35:46-7","content":"I'm the most proud right now of getting my GED because I'm the only one of my momsmy mom's children that didn't graduate from high school. And my certification culinary. And I'm pursuing masonry certification now. Those would be the biggest accomplishments for me."},{"speaker":"MK:Intvr:Marcus","time":"00:36:09-8","content":"I agree. So let's say after the court proceeding or the pardon board proceedings that you get another shot and you get released. Again I'm sure you've spent some time thinking about what that would be like as well. What are your plans? Paint a picture for me. What do you plan to do when you're released?"},{"speaker":"AB:Resp:Adonis","time":"00:36:33-3","content":"Well right now I have a fiancefiancé, we should be getting married up in November. We been really studying real estate, buying homes and selling homes. And I really want to give back to young kids, not 13-17, I mean young kids because I realize that it starts at a young age. So I really want to go back home and create things that help them out. For single parents...just really to help them out. And I got grandkids."},{"speaker":"MK:Intvr:Marcus","time":"00:37:13-6","content":"Mhmm, Sure. So tell me about this fiancefiancé, I didn't know about that. What does she come from? How did you meet her?"},{"speaker":"AB:Resp:Adonis","time":"00:37:20-9","content":"Well it's somebody I went to school with."},{"speaker":"MK:Intvr:Marcus","time":"00:37:22-6","content":"Oh okay."},{"speaker":"AB:Resp:Adonis","time":"00:37:24-4","content":"And Throughout the years later, out at the rodeo, it's been about 12 years now..sawnow. Saw her at the rodeo, we kindakind of talked and then started writing."},{"speaker":"MK:Intvr:Marcus","time":"00:37:36-3","content":"What's her name?"},{"speaker":"AB:Resp:Adonis","time":"00:37:37-1","content":"Her name is Alicia. We uh... She visit, she staying in Florida. So she come down every other month. We visit."},{"speaker":"MK:Intvr:Marcus","time":"00:37:48-3","content":"Okay. And is that- wedding is that gonnagoing to happen here?"},{"speaker":"AB:Resp:Adonis","time":"00:37:53-3","content":"Yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:37:54-1","content":"Where do they do those things?"},{"speaker":"AB:Resp:Adonis","time":"00:37:55-8","content":"In the chapel."},{"speaker":"MK:Intvr:Marcus","time":"00:37:57-1","content":"Okay. And they'll allow your daughters to come and folks from outside to come, yeah?"},{"speaker":"AB:Resp:Adonis","time":"00:38:05-9","content":"Yeah."},{"speaker":"MK:Intvr:Marcus","time":"00:38:07-9","content":"Um, Well Adonis can you,- in my attempt to try to capture your story and asking you certain questions- is there anything I should've asked you that I didn't ask you that is important about your story?"},{"speaker":"AB:Resp:Adonis","time":"00:38:26-2","content":"Not that I can really think of."},{"speaker":"MK:Intvr:Marcus","time":"00:38:26-2","content":"Alright, okay. Well thank you very much for sitting with us and talking with us."},{"speaker":"AB:Resp:Adonis","time":"00:38:32-9","content":"Appreciate it."}]}