{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Allen Pharr Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:00",
      "content": "Would you mind starting by stating your name?"
    },
    {
      "speaker": "Allen",
      "time": "00:00:00",
      "upperBoundTime": "00:01:54",
      "content": "Yeah, my name is Allen Pharr. I was born in April 28th, 1964. Unfortunately, I committed a crime in 1986, second degree murder, armed robbery currently serving a life sentence here in Angola."
    },
    {
      "speaker": "Allen",
      "time": "00:00:00",
      "upperBoundTime": "00:01:54",
      "content": "At the time of my conviction, I just turned 22 and at that age, I don't think I was a matured adult. I don't know if I was going in a channel of peer pressure, or trying to hang with the joneses' or whatever the nature may be, but I made a mistake, man and committed a murder charge and I was like out for like a week or something and I walked right into the police station and turned myself in."
    },
    {
      "speaker": "Allen",
      "time": "00:00:00",
      "upperBoundTime": "00:01:54",
      "content": "I was being wanted, armed and dangerous, and I walked right there, and they didn't even know who I was when I walked into the police station and turned myself in because I knew I had done wrong. And I come up, man. You know, my mom and my dad were separated periodically. I lived with at least one of them, but my childhood I lived with my grandmother and my grandfather, Georgiana and Dave Pharr."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:54",
      "upperBoundTime": "00:01:53",
      "content": "Where did you grow up?"
    },
    {
      "speaker": "Allen",
      "time": "00:01:53",
      "upperBoundTime": "00:02:06",
      "content": "I grew up in Gibson, Louisiana. That's right outside of, that's Terrebonne Parish, but it's like eight miles outside of Houma, Louisiana. H-O-U-M-A."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:06",
      "upperBoundTime": "00:02:04",
      "content": "Darrell Walkers is from there."
    },
    {
      "speaker": "Allen",
      "time": "00:02:04",
      "upperBoundTime": "00:02:10",
      "content": "Yeah that's right, that's my homeboy."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:10",
      "upperBoundTime": "00:02:11",
      "content": "I really enjoyed talking with him."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "Yeah. He's real good. Me and his mom and real cool. And I went to H.L. Bousie High School, Evergreen Middle School, Greenwood Elementary school, and you know, up until my junior year in school, I was doing real good. I think I started hanging out with the wrong guys' man and trying to do the things of other people and not doing my own thing because I wasn't a dumb guy."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "I got my work, had good academic scores in school, conduct record wasn't that bad but when I got to junior high, I got a little wild and smoking weed and doing everything that the crowd do, so I got kicked out because I got in a fight."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "I joined Job Corp, went to Texas. Austin, Texas. I went to the biggest Job Corp in the United States. And it's Gary Job Corp in San Marcos, Texas. And I think Gary's the size of Angola, man, that's how big it is. Unfortunately, I got kicked out of there. I went with my cousin and he brought a Hitachi boom box with him and when we got there, unfortunately, he'd stole another guy's boom box. And tried to hit the tracks. The tracks is like here to St. Francis Ville, and that's 20 miles on the tracks."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "So, he tried to take it to the tracks and go sell it."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "I said, \"Man I just got here man, I ain't going on no tracks.\" So that morning when they tried to go, the security at the facility that we're at, Gary Job Corps as soon as they went across the street, the people came and apprehended them. So, I came to the station to try to help them."
    },
    {
      "speaker": "Allen",
      "time": "00:02:11",
      "upperBoundTime": "00:05:29",
      "content": "I said, \"Excuse me I'm here for Fredrick Hansey.\" And they had the box on the table. I said, \"Look if you all let me get his box I will put it up for him until you let him go.\" They said, \"Hold up, stay right there.\" Man they come back and tell me that dude said that I was with them when he stole the bike. I said, no man. And then they locked me up. The final verdict of that was as the facility said that we have to terminate ourselves or they will terminate us and if they terminate us we can't go to no more Job Corps, so I terminated myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:29",
      "upperBoundTime": "00:05:30",
      "content": "How old were you?"
    },
    {
      "speaker": "Allen",
      "time": "00:05:30",
      "upperBoundTime": "00:05:51",
      "content": "I was 19 then man. I was 19, then nineteen or 20 because a longest you could stay at job corps was 24. And at that time I think I was like 19, or 20. I come back home, I come back home man, and I ain't got a job."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:51",
      "upperBoundTime": "00:05:59",
      "content": "Let's go back a little bit earlier than that, I want you to tell me a little bit more about your grandparents. They were the ones that raised you?"
    },
    {
      "speaker": "Allen",
      "time": "00:05:59",
      "upperBoundTime": "00:07:42",
      "content": "Yeah Georgiana and Dave. Yeah, they raised me. That was real quiet time for me. She was a real good baker and a cook, man. My grandfather he tended in the field. He would plant potatoes, corn you know Country. If you come to the steps of my grandmother's house, you're going to smell the potato pies coming through the front window. She's got to be singing."
    },
    {
      "speaker": "Allen",
      "time": "00:05:59",
      "upperBoundTime": "00:07:42",
      "content": "And we didn't really have no flowers in the yard we had the weeping willow tree, if you stand on it, you would think it was raining. That's the only thing she had in her front yard but you know man, it was a real quiet time. I think my grandfather was alive up to 102, years old, and my grandmother lived to be 88 years old. She dies first and then he died like two weeks after her. They ain't never been divorced or nothing. So I know their love is real, you know what I'm saying. I don't know man, I'll try to do is correct me. I do try to do that."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:42",
      "upperBoundTime": "00:07:46",
      "content": "Can I ask you something? What's your last memory of your grandmother?"
    },
    {
      "speaker": "Allen",
      "time": "00:07:46",
      "upperBoundTime": "00:07:48",
      "content": "Wow."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:48",
      "upperBoundTime": "00:08:07",
      "content": "The last time you interacted with her…"
    },
    {
      "speaker": "Allen",
      "time": "00:08:07",
      "upperBoundTime": "00:08:37",
      "content": "Well she had this thing. She had this silky gray hair. She always liked for me to comb her hair. I used to comb her hair. I ain't seen no hair like this. I mean it was real silky. You didn't have to fight through it, the comb would just go straight through it, and she was just really amazing. My grandfather, when he got in the 80s, so I had to bathe him and everything. At 102, he couldn't really do anything."
    },
    {
      "speaker": " Marcus",
      "time": "00:08:37",
      "upperBoundTime": "00:08:36",
      "content": "Do you remember the last time you were with your grandmother?"
    },
    {
      "speaker": "Allen",
      "time": "00:08:36",
      "upperBoundTime": "00:08:41",
      "content": "Oh yeah."
    },
    {
      "speaker": " Marcus",
      "time": "00:08:41",
      "upperBoundTime": "00:08:42",
      "content": "Tell me about that memory."
    },
    {
      "speaker": "Allen",
      "time": "00:08:42",
      "upperBoundTime": "00:09:53",
      "content": "Well it's a real serenity memory, where I see that, she would be in the kitchen. This particular time I didn't like cabbage, the way it smelled. I'm telling you man, I just didn't like cabbage. And she made me eat that cabbage, bro, and I can vividly remember it."
    },
    {
      "speaker": "Allen",
      "time": "00:08:42",
      "upperBoundTime": "00:09:53",
      "content": "I wasn't a vegetable person. And by her making me eat that cabbage, I just fell in love with all vegetables. And cabbage it was a hell of, she always cooked it, you know. By me eating the cabbage, I think you can see a pretty healthy guy, and I like to eat my vegetables bro. My grandmother man, she was my heart."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:53",
      "upperBoundTime": "00:09:58",
      "content": "Did she visit you here?"
    },
    {
      "speaker": "Allen",
      "time": "00:09:58",
      "upperBoundTime": "00:10:22",
      "content": "No. Well unfortunately, they she passed before I got into all this trouble. Yeah, they passed before I got into this trouble. My father passed in '84 and my grandmother passed, in I think, '78, and my grandfather passed in '79 and my mother passed in 2008. I was here, but."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:22",
      "upperBoundTime": "00:10:23",
      "content": "What was your relationship like with your mother?"
    },
    {
      "speaker": "Allen",
      "time": "00:10:23",
      "upperBoundTime": "00:11:32",
      "content": "Oh it was good man, it was good. My mother, I respected my mother. Like I said, I come up, yes sir, no sir. I couldn't do no anything. But once I have 17-18, my mum, I couldn't smoke in front of her but she knew I smoked. She just didn't want me to do it in her presence. You know, she let me know, if I do something and I understood that. But my father man was in a different end, me and him, we sat around. We smoked, joked. He and me were cool. He was a real chef. He was like Chef Jeff, my father was real good at cooking."
    },
    {
      "speaker": "Allen",
      "time": "00:10:23",
      "upperBoundTime": "00:11:32",
      "content": "I had a real good relationship with him, and down, they would just split."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:32",
      "upperBoundTime": "00:11:39",
      "content": "Is it fair to say that you've up in a household where you felt loved and cared for?"
    },
    {
      "speaker": "Allen",
      "time": "00:11:39",
      "upperBoundTime": "00:11:42",
      "content": "Oh yes, indeed."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:42",
      "upperBoundTime": "00:11:49",
      "content": "So, you wouldn't characterize your childhood has something where you would where you were mistreated?"
    },
    {
      "speaker": "Allen",
      "time": "00:11:49",
      "upperBoundTime": "00:12:50",
      "content": "No not at all, man. I remember my uncles, I remember me and my uncles used to come down, I get my uncles. All my uncles are deceased now, Freddy, Frank, Gideon, and David. They used all come over to my grandmother's house along with my father Elton, that's five. They used to like, one in Texas, one in California, three of them in New Orleans. So, they would always try to get us to come for vacation, school break or something, I will come with them. My mother had 12 kids, I'm the youngest of all them. I'm the only one that got in a mess. I'm the youngest."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:50",
      "upperBoundTime": "00:12:53",
      "content": "Who visits you here?"
    },
    {
      "speaker": "Allen",
      "time": "00:12:53",
      "upperBoundTime": "00:13:28",
      "content": "I got a cousin in the military named Desiree Jordan. My uncle Frank, that's his daughter. And I met her, I didn't know she was my cousin. She was talking to my partner, who landed in here, named Bobby Wallace, he played Jesus I don't know if you've ever seen that documentary, they did a play it's called The Passion of the Christ, have you seen it?"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:28",
      "upperBoundTime": "00:13:32",
      "content": "No."
    },
    {
      "speaker": "Allen",
      "time": "00:13:32",
      "upperBoundTime": "00:16:02",
      "content": "But anyways, Bobby, he does the Christ part. He was portraying Christ. So, one day he asks me what my name was, so I said \"Allen Pharr.\" And a girl on the phone asked him to reach me the phone, and she said well, \"What's your name?\" I said \"Allen Pharr.\" \"Who are your people?\" I went calling my uncles. She said, \"Those are her uncles.\" I said, \"What?\" But that's how things happen, man."
    },
    {
      "speaker": "Allen",
      "time": "00:13:32",
      "upperBoundTime": "00:16:02",
      "content": "I don't think is by mere chance or coincidence, everything happens for reason. And I'm a God-fearing man, and I've really become God-fearing since I've come to Angola. I come up going to Baptist Church, now I'm in nondenominational. I was raised Baptist. I seen where people go to church on Sundays, come out, not changed, they do the same thing."
    },
    {
      "speaker": "Allen",
      "time": "00:13:32",
      "upperBoundTime": "00:16:02",
      "content": "Since I've come here, I knew that this change has got to happen. This change has to come. Jesus went everywhere, showing love, healing people, and the people couldn't understand it, man, it was just amazing. Even the disciples' man, the people that were close to him every day, seeing the miracles he was doing, couldn't understand. They didn't grasp the whole, I ain't saying, I'm working progress, man."
    },
    {
      "speaker": "Allen",
      "time": "00:13:32",
      "upperBoundTime": "00:16:02",
      "content": "And I will say that Jesus is the epitome of love. In this world right now we have a calamity of love, that people turn their back on God. When you turn your back on God, bad things happen. We see that through the course of the Bible, not to be religious and none of that. It's just the facts of life, you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:02",
      "upperBoundTime": "00:16:09",
      "content": "Let me ask you about some other things. What about girlfriends? Did you have one person particularly close to you before you got in here?"
    },
    {
      "speaker": "Allen",
      "time": "00:16:09",
      "upperBoundTime": "00:16:13",
      "content": "Well I wish I did, man. I had a lot of flings out there."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:13",
      "upperBoundTime": "00:16:15",
      "content": "Do you have any kids?"
    },
    {
      "speaker": "Allen",
      "time": "00:16:15",
      "upperBoundTime": "00:18:11",
      "content": "No, unfortunately, at the age of 53, I have no kids, man. I hurt inside about that because my legacy, to pass my name on hopefully. I didn't really grasp that. I am not living in a fictitious mind. I'm realistic. And I will tell you that, if I was to pass right now, while talking to you, I know that I'm going home to see my grandmother and my grandfather again because they were Christ fearing Christians, man. They ain't play. That's my ultimate goal."
    },
    {
      "speaker": "Allen",
      "time": "00:16:15",
      "upperBoundTime": "00:18:11",
      "content": "Yes, I want to be a free man again but that's not, I know no more passing through. I took someone's life and I know that I'm going to die one day, and there is a life after this life. That's where I'm trying to get myself straight. I know I'm going to go through this life. I see God down here for entry. I try to mentor by passing by, meaning I don't want them to look at me like I'm a free man or something, I'm your brother."
    },
    {
      "speaker": "Allen",
      "time": "00:16:15",
      "upperBoundTime": "00:18:11",
      "content": "I'm telling you that I've been year 31 years, man, you got the chance to be here for 18 months, get a trade and go back out there and do the right thing. You don't have to be doing no drugs, or stealing, or trying to do nothing. I am the only example. You're looking in the mirror right now. I shouldn't have to lead your hand or watch you. That should be enough motivation for you to get your life straight, you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:11",
      "upperBoundTime": "00:18:15",
      "content": "Do you find yourself mentoring the reentry guys quite a bit?"
    },
    {
      "speaker": "Allen",
      "time": "00:18:15",
      "upperBoundTime": "00:18:22",
      "content": "Well, when I come in contact with them, because you know I'm not."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:22",
      "upperBoundTime": "00:18:19",
      "content": "I mean informally."
    },
    {
      "speaker": "Allen",
      "time": "00:18:19",
      "upperBoundTime": "00:18:44",
      "content": "Yeah like Pastor Walters. He's a mentor. He's in there with those guys but I'm affiliated with a lot of sports, just going by certain guys I might take a liking to, and holler at them because some will receive and some will reject."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:44",
      "upperBoundTime": "00:18:47",
      "content": "Right. So, let's go back to the 22-year-old that you were some of these guys are like."
    },
    {
      "speaker": "Allen",
      "time": "00:18:47",
      "upperBoundTime": "00:19:46",
      "content": "I always reflect on how I was, but at the age of 22, I wasn't rebellious, man. And respect was everything. Yes sir, no sir, I didn't get that here. When I talked to my grandmother and my grandfather, it was yes ma'am yes sir, no sir. And I noticed that with these guys, they don't have that form of respect, you know. I think it really forms at home, and I thank my upbringing for that part. I didn't lose those traits of respect, you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:46",
      "upperBoundTime": "00:19:50",
      "content": "So, you come out of Job Corp and go back to Gibson."
    },
    {
      "speaker": "Allen",
      "time": "00:19:50",
      "upperBoundTime": "00:19:51",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:51",
      "upperBoundTime": "00:19:53",
      "content": "Then what happens?"
    },
    {
      "speaker": "Allen",
      "time": "00:19:53",
      "upperBoundTime": "00:20:30",
      "content": "I get a job at a rostral ball company called Dewy Landry's Rostral Ball. And I was paid, what, $5.75 an hour for doing jobs like pressure water testing or going on another job and cleaning the ends of the test pipe, clean them with the deiseal and recoat them with the grease and put the cap back on."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:30",
      "upperBoundTime": "00:20:34",
      "content": "So, you did that for a few years?"
    },
    {
      "speaker": "Allen",
      "time": "00:20:34",
      "upperBoundTime": "00:21:53",
      "content": "Did that for a few years, seeing partying and them, man they were slinging, making money, driving nice cars with the wheels, got the girls. It's kind of catchy. And I started doing that and one thing led to another, man. I'll tell you that, you know, the one with confused is the Devil, man. At that time, I'm telling you man. I take this as a beautiful learning experience."
    },
    {
      "speaker": "Allen",
      "time": "00:20:34",
      "upperBoundTime": "00:21:53",
      "content": "This might be idiotic to say, man, don't look at me that I'm crazy man but I'm telling you that God saved me by sending me here, because I was headed down a road that could've got killed, you know what I'm saying. And I've endured some hardships. I'm not regretful. I'm regretful of taking a man's life, but I'm not regretful of being in Angola man, I'm telling you, because I've learned how to be a real man and I know that I got to work for what I want."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:53",
      "upperBoundTime": "00:22:01",
      "content": "So, let's go back to that guy, who came in, I'm sure you did a little bit, a little stint in the Parish"
    },
    {
      "speaker": "Allen",
      "time": "00:22:01",
      "upperBoundTime": "00:22:04",
      "content": "A little bit yea, I did two years in the Parish."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:04",
      "upperBoundTime": "00:22:12",
      "content": "And then you're brought in through those gates in 24?"
    },
    {
      "speaker": "Allen",
      "time": "00:22:12",
      "upperBoundTime": "00:22:55",
      "content": "Yeah, that road, you see that road that you'll came on, that road wasn't like that, it was like this. They called it a snake road. It was, I was scared to death, you looked on the side of the ravines, on that old bus I was on. I was, where the world I'm headed. I got to the gates and I got the A building, and I'm sitting down and they got the classifications and people they're categorizing where they're going to send you and I'm going t, headed to Raven, Camp D. That's where I'm headed. I was sent to Raven, man."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:55",
      "upperBoundTime": "00:22:59",
      "content": "Looking back, can you describe that process to me? When you go back?"
    },
    {
      "speaker": "Allen",
      "time": "00:22:59",
      "upperBoundTime": "00:25:31",
      "content": "I was categorized. I was scared man I ain't go lying. I was scared, terrified. And you know, I cried all to the Lord man, just be with me and guide me though this journey, man, and I got to Raven. When I got here man, it was working, I'm talking about actually working where you might a weight pile, when you look outside, and you'll might the weight pile. They are had 50 dudes out there with a 20 pound of weight pile breaking their fingers. Dudes taking the razors and cutting their Achilles. That's the work that we were doing. See, now they really ain't doing nothing here, they're picking a lot of vegetables."
    },
    {
      "speaker": "Allen",
      "time": "00:22:59",
      "upperBoundTime": "00:25:31",
      "content": "And they ain't, I'm taking about we were, I can honestly say guys were healthier back then. You ain't had all these guys sick or taking these medicines and dying, dudes dying every day. You know, they had a lot of violence going on man, because the devil was running havoc here. When I first got here, I had to get a knife man. I had to. It wasn't violence, ugly dudes, pretty dudes, big dudes, crazy man, but you know, you see the change up until when Warren came, stuff revolutionized, stuff started changing."
    },
    {
      "speaker": "Allen",
      "time": "00:22:59",
      "upperBoundTime": "00:25:31",
      "content": "Because the illiteracy rate was so high man, dudes didn't really know how to read and nothing. And so, out of mind, man, the devil, out of mind, you know. And I think that every day, even when I came, I didn't have my GED, and a lot of guys that was going to school at that time, they was only going to school to get out of the field. There was working, but my thing was, I'm going to get my GED. It ain't take me but 6 or 8 months to get my GED because I went in there to get it."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:31",
      "upperBoundTime": "00:25:54",
      "content": "So you know, we're talking to you, because you are considered, you know, a model trusted member of the community now. When, now, you didn't start that way, so can you tell me a little bit about the transition?"
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "Yeah, I can tell you- like, man, look, when I come, ain't a drug you couldn't get. Literally. It ain't like now though but I'm saying like when I come, it was more plentiful, you wasn't pissed and all that. There wasn't a drug you couldn't get man and you know, if you had the money, you could buy and I come- man, don't get me wrong, I come 22 was still smoking weed, and you know like about let's see, '95."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "I think '96, '97, they might have started piss testing, that's when I stopped smoking weed, and a bag would cost at that time, 5 packs of camels man 5 of them, a pack of camels at that time was a dollar 80-something. So we looking at 5, that's like $80 but I was, you know, looking at man wow, instead of doing this, I got to get right man."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "Myself and then I was hanging around some older guys too, always telling me, \"Look, don't mess with no drug, don't mess with no cult. Don't mess with no gambling, you ain't going to get in no trouble. You know, do what you got to do, always look for better.\" It kind of stuck with me. It took me a while though. Had to go, how always, you got to get into something man."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "So I had one incident, I got a job in the kitchen once I come out of Raven. I got a job in the kitchen, working in the baking area. The guy said, \"Man, yeast man, we make some good beer man.\" Real yeast in the kitchen so, wow, me, I'm bold and man risks, I don't take no risks, you know."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "And I say \"well, I'm going to make beer in my box, man.\" In my lock box, 2, 5 gallon buckets. Every two days, we make beer. Sort of unfortunately, this day, Freeman walking down the said, \"Smell like a distillery in here.\" Because I'm feeling up the bottles to get them to dudes in other dorm. Man, the man walked back there. So I leave my bed, I light some, we have buck cans by our bed right."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "I light some paper in the buck can, to kind of like kill the scent, they don't do nothing, and the man walking up the hall find my bed. I'm sitting in the TV room, he calling my name and \"Allen Pharr, Allen Pharr.\" I get to my bed, he said \"Look, open up this box.\" But I got all the bottles on the floor, he sees all them bottles."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "I said \"Look Mr. Tiller. I said, \"Look Mr. Tiller, I said who you about to knock off man?\" I said, \"Man, I got some beer, want me to go pull it out in the.\" \"Oh no.\" he hit the beep. It was almost shift change, so me and the people, the people that's coming on for the night shift, they come down."
    },
    {
      "speaker": "Allen",
      "time": "00:25:54",
      "upperBoundTime": "00:30:35",
      "content": "Man they locked me up, I told them, \"Man that's on at night.\" He said \"Look, I can cut you lose. I know you're going to Camp J.\" That's where all them drugs, and them knives at so. I said, \"What drugs and knives, man.\" Because, you know I got to do stuff prison. So, I go to the block. I get sentenced to the block. Man, I got to tighten up. I can't, I'm already in trouble doing a life sentences. So, on my own, I kind of like turned it around, you know, after that instance."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:35",
      "upperBoundTime": "00:30:39",
      "content": "How far into your sentence did that happen?"
    },
    {
      "speaker": "Marcus",
      "time": "00:30:35",
      "upperBoundTime": "00:30:39",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:30:39",
      "upperBoundTime": "00:31:52",
      "content": "It's alright I got '88? Like about 5 years into my sentence, like 5 years running around. At that time, see, we had the plan here. We were able to breeze twice a week and you know, let me see, we were getting 7.50 a breeze. So that's 14 dollars a week plus whatever we was getting from home or whatever. So you know, it was like man, it was crazy man."
    },
    {
      "speaker": "Allen",
      "time": "00:30:39",
      "upperBoundTime": "00:31:52",
      "content": "So, literally I took it upon myself to say well, man you got to make a change man for the better literally. And that's what I did man. I turned it around man, from one job to the next, I said well I'm get trustee man, I can't be get trustee. I did it. I worked. My first time on the trustee board. I went on the trustee board full-time before I made it, you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:52",
      "upperBoundTime": "00:31:59",
      "content": "Can you describe your typical day here now?"
    },
    {
      "speaker": "Allen",
      "time": "00:31:59",
      "upperBoundTime": "00:34:00",
      "content": "Oh, my typical day is now is like, well I just moved, man, I'm glad you said that man. I was at Cypress 4 and I just moved into Ash 1. That's the first unit on the East shelf, Ash, so you got Ash, Mag, Cypress, and Spruce. Spruce all the way on the end. They call that \"the ghetto\" Spruce, but Ash, we call that the \"White House\" Because like other than Pastor Waters, like. He lives in the, you met Gillam? George Gillam? He lives in Mag, but they call Ash pretty much the White House. I moved to Ash 1 and man I'm talking about it's so quiet and its man, serenity, but the dorm that I was in, it was an old Trustee dorm Cypress 4 right?"
    },
    {
      "speaker": "Allen",
      "time": "00:31:59",
      "upperBoundTime": "00:34:00",
      "content": "But guys, man, I'm telling you it's, not to be critical, I'm 53 years old man and you know, nothing has been handed to me, and I can honestly say that I have a name when you say, I don't think. Did you hear them this morning when they said, \"What do you call first?\" You see that little. Who did well, I'm known. You know, I'm known because I made myself known in a positive way."
    },
    {
      "speaker": "Allen",
      "time": "00:31:59",
      "upperBoundTime": "00:34:00",
      "content": "I work at, let me tell you where I work at right now. I was working at old elementary school, pre-k school, middle school and the high school in West Louisiana Parish, 4 days a week."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:00",
      "upperBoundTime": "00:34:02",
      "content": "What were you doing there?"
    },
    {
      "speaker": "Marcus",
      "time": "00:34:00",
      "upperBoundTime": "00:34:02",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:34:02",
      "upperBoundTime": "00:36:12",
      "content": "We was cutting grass and doing janitorial work 4 days a week and unfortunately, they shut the crew down because they didn't renew the contract. Angola had a contract with them and you know I was working out there and when they shut that crew down, they put me on the kitchen truck."
    },
    {
      "speaker": "Allen",
      "time": "00:34:02",
      "upperBoundTime": "00:36:12",
      "content": "So, a guy got into it at the control center. The control center is where they keep all the guns and everything. It's a high risk area so when that guy lost his job, I heard it in the grapevine. I said, \"Oh man I'm going to get that job.\" You know, I have Mr. Hollis Milton, Mr. Milton Hollis, he is superintendent of the Western Louisiana Parish School Board. And he gave us a letter of recommendation on how good we worked and efficient that every time they call on us man, we do it. It was like an 8 man crew."
    },
    {
      "speaker": "Allen",
      "time": "00:34:02",
      "upperBoundTime": "00:36:12",
      "content": "And you know man, I try to do my thing to where people will be appreciated. Man, I tell you, it don't take much man to do wrong. It takes so much effort to do the right thing man. It takes a lot of effort man and that's how it is. So right now, I got a good job at the center, but getting back to where I was living in, Cypress 4, you got guys who are really not working. Trustees, this an all Trustee dorm."
    },
    {
      "speaker": "Allen",
      "time": "00:34:02",
      "upperBoundTime": "00:36:12",
      "content": "I was living in Bay 1, the windows full of cobwebs man, they got dudes they call dorm audits, they're supposed to clean up every day and dudes are so disrespectful man, you know? It's just do things idiotically. So I just made it up on my mind. I'm not going to get in trouble with no guys man, it ain't worth that. I'm just move out of there and that's what I did. Thank the Lord man."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:12",
      "upperBoundTime": "00:36:24",
      "content": "What, aside from that job, what other organizations are you active with here or have you been active?"
    },
    {
      "speaker": "Allen",
      "time": "00:36:24",
      "upperBoundTime": "00:38:09",
      "content": "Well, I've been active with the Lifer's club and I'm affiliated with a club called Dale Carnegie right now, DC Lyons. I'm affiliated with them, but I've got my Anger Management, Mis-management, substance abuse, I got my GED, you know and Clubs, I don't too much. The only reason I'm affiliated with DC is because I got a couple of friends that's really into it and so political man, and you know, I don't think."
    },
    {
      "speaker": "Allen",
      "time": "00:36:24",
      "upperBoundTime": "00:38:09",
      "content": "See, not, but Norris Henderson, do you remember Norris? Norris, that guy there man, he was really a go-getter meaning that when Norris was here, you had Texas Southern, Prairie View, LSU, and a whole lot of other institutions coming in here, speaking and you know, learning how this place was revolutionizing other institutions but guys had to put forth the effort. You know, because like all other institutions, there's a negative and a positive, you just got to tap into the one you want, you know?"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:09",
      "upperBoundTime": "00:39:09",
      "content": "So, let me ask you a difficult question because you know this project is about life without parole and it's difficult because to me, it would seem a very painful thing to continuously deal with. When you think about your own life, you surely must have time where you realize that it's likely that you may never leave here. How do you cope with that? How do you make sense of that?"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:09",
      "upperBoundTime": "00:39:09",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:39:09",
      "upperBoundTime": "00:40:27",
      "content": "Man, every day, I could literally say, man I earned this, but my tears don't roll out my eye. But I'm telling you man that God is my shelter bro, for real, and you know, since I come here, I learned that this is not a thing of being a churchy person. What keeps me because before come here, we used to have church in the classroom or in the kitchen? Now they got a Cathedral everywhere, man. But that's not the thing."
    },
    {
      "speaker": "Allen",
      "time": "00:39:09",
      "upperBoundTime": "00:40:27",
      "content": "See, a lot of people get stuck up, even on the outside with a program how things are supposed to go ain't the way it is. Not in my reading and I've accepted Jesus, my lord and savior man. I'm telling you if I were to die right now as we speak, I knew that I'm going home because I changed the person I used to be to a God fearing man and the reason I want to be free again is to tell some youngster to do the right thing, that's the reason, and hope that to have a kid and raising yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:27",
      "upperBoundTime": "00:40:52",
      "content": "Fair enough. And I think that's a very good answer. This is also a difficult question. So, it's been 30- you've spend 30 years being punished for this charge. How much punishment is enough punishment?"
    },
    {
      "speaker": "Allen",
      "time": "00:40:52",
      "upperBoundTime": "00:43:01",
      "content": "For a first offender, man, a guy that's never been in trouble man, no criminal record, that's amazing to me, to the way it is. I got a guy named Wolf that the Supreme Court granted him, he the one of the juveniles that got, been down 52 years as a juvenile. He's still down there on Spruce."
    },
    {
      "speaker": "Allen",
      "time": "00:40:52",
      "upperBoundTime": "00:43:01",
      "content": "I'm 31 years. Man, how long it is for a man to get out 53 still walking here, in good shape, he work at the. What I'm saying is how long it is for a guy to be incarcerated and do his time, especially if he's meeting all the programs. If he is, why can't receive we can let him out again and give him another chance."
    },
    {
      "speaker": "Allen",
      "time": "00:40:52",
      "upperBoundTime": "00:43:01",
      "content": "If he mess up again, I can understand it but mainly for first offender, I'm a first offender and I can only speak for me. I can't be critical of the people, and guess what? I've seen guys been here 6 times at Angola, they're gone."
    },
    {
      "speaker": "Allen",
      "time": "00:40:52",
      "upperBoundTime": "00:43:01",
      "content": "Man, I've seen some guys who come here two, three times gone. So, you know, the figmentation in my mind is saying, \"Wow, it ain't for everybody.\" You know, everybody got time, and I've seen since, right now, it's the most guys have been going home man, you know, it's changing. And I tell you God is in control man. You know what controls a man is what's inside a man. You know?"
    },
    {
      "speaker": "Marcus",
      "time": "00:43:01",
      "upperBoundTime": "00:43:06",
      "content": "If you were to go before a parole board, pardon board, what would you want them to know about you?"
    },
    {
      "speaker": "Marcus",
      "time": "00:43:01",
      "upperBoundTime": "00:43:06",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:43:06",
      "upperBoundTime": "00:45:33",
      "content": "I would want them to know that first of all, the State of Louisiana, the city of home, Tremé Parish, that I'm sorry for the crime I committed and the victim's family that I'm sorry. At that time, I ain't know who I was, man. I was doing something that was contrary and I'm so remorseful that I can't take it back but I can be a role model man to somebody that's really going through some things that have similar went through, you know?"
    },
    {
      "speaker": "Allen",
      "time": "00:43:06",
      "upperBoundTime": "00:45:33",
      "content": "And I can honestly say that the mistake I made, made me a better person. I don't want nobody else to go through that man, a guy that's in elementary school or middle school or high school. You know, I think I can really be an impact out there on the street, not just waiting to go to church and. I'm talking about having dudes always tell me that. They say, \"Man, you going to church tonight?\" I say \"bro, we can have church right here? When two or more gather, God is in the midst.\""
    },
    {
      "speaker": "Allen",
      "time": "00:43:06",
      "upperBoundTime": "00:45:33",
      "content": "I'm trying to figure out why we can go to church to hear the word from the pastor, don't get me wrong. As a member, but don't get it twisted that that building is the church, we are the church, the people. Where do you think him coming, to the building or the people? It's just, you know, it don't take Einstein to figure that out but that's the part, that I've matured in, my spirituality part is so intact right now, the way I think I'm invincible."
    },
    {
      "speaker": "Allen",
      "time": "00:43:06",
      "upperBoundTime": "00:45:33",
      "content": "I think when the hurricane come, I can withstand it. I don't have to run to the shelter. I am the shelter. Jesus is my fortress, you know? Have you ever been the rodeo?"
    },
    {
      "speaker": "Marcus",
      "time": "00:45:33",
      "upperBoundTime": "00:45:35",
      "content": "Yeah."
    },
    {
      "speaker": "Allen",
      "time": "00:45:35",
      "upperBoundTime": "00:47:08",
      "content": "Man it's a look, and I never went to the rodeo until 2001. I come here in '88. 2001 was my first time going to the rodeo because I had just made trustee. And the person that helped me make trustee said, \"Well, you coming for me we going to pay you 15 dollars for the rodeo.\" That's yeah. And man, look, when I was out there, I was ecstatic. I couldn't believe it. I said, \"I'm scared to death man, it's not a real rodeo.\" But I'm thinking we are behind a cage or something but there's others behind the cage, trustees are able to walk around."
    },
    {
      "speaker": "Allen",
      "time": "00:45:35",
      "upperBoundTime": "00:47:08",
      "content": "And it's just another step like here at Angola we got guys that work at the Ranch House. Been the Ranch House? That's my boy. You got the Vietnamese dude. They live at the Dog Pen. See that's another step. That's the next step from getting to the police barriers as a trustee here. You know, that's my mind man. My mind is set on you know, doing all the positive things and getting in the right position man. You know?"
    },
    {
      "speaker": "Marcus",
      "time": "00:47:08",
      "upperBoundTime": "00:49:08",
      "content": "Yeah. So, of all the things that you've accomplished in your life, most of that's been here. What are you most proud of?"
    },
    {
      "speaker": "Marcus",
      "time": "00:47:08",
      "upperBoundTime": "00:49:08",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:49:08",
      "upperBoundTime": "00:50:29",
      "content": "Really, I'm most proud of being able to have a good name, man. That's what I'm most proud of people saying, \"Yeah he yeah. Call him.\" Let me tell you what happened one time."
    },
    {
      "speaker": "Allen",
      "time": "00:49:08",
      "upperBoundTime": "00:50:29",
      "content": "This just recently last year happened. A guy got hurt at work, at the museum outside the front gate. He got hurt. He gone home now, Slick Rick. He got hurt, yeah I think it was like a, it was Thursday he got hurt. They shipped him to the emergency room. Friday, they thought he wasn't going to be able to go to work. So Warden Dobie said one of the most near to him find somebody man, and I need him up there for tomorrow."
    },
    {
      "speaker": "Allen",
      "time": "00:49:08",
      "upperBoundTime": "00:50:29",
      "content": "So he called me. He said, \"Look warden told me to find somebody.\" That's the trust he had in me. He said, \"Look, go down there, get you some whites, be ready.\" Got the whites pressed and everything. That morning I get to the A Bill, and I'm ecstatic about going. \"Why you get the museum.\" I said, \"One step in there, one day is going to have two of us working in there.\" They only have one but if I get in there, we going to have two."
    },
    {
      "speaker": "Allen",
      "time": "00:49:08",
      "upperBoundTime": "00:50:29",
      "content": "Look, I get up in there the next morning, man they said \"Slick Rick, check yourself out.\" He went back. He got out at, he got sick like about 11 or 12 o'clock that day and they put him on the emergency room, IVs and all that. Man he come up off that bed so he had to go back to work the next day."
    },
    {
      "speaker": "Allen",
      "time": "00:49:08",
      "upperBoundTime": "00:50:29",
      "content": "So you know, literally, man, I think, you know from where I was when I came and where I'm at now man, I'm a respectable person man and that's all I want to be is respectable. Everybody is not going to respect me and I don't look that but I want people to see well, he's a hard working guy. He's trustworthy. Yeah, that's just the name I want. What I want for my kids, same thing. You know, and I've earned that. That ain't come from nobody giving me that. I really put out work for that man."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:29",
      "upperBoundTime": "00:50:47",
      "content": "I'm sure. You also I expect, you know, yes, you think about the possibility of never leaving here and you explained your hope with that but I'm sure you spent some time also thinking about what you would do with your life if you were to get out."
    },
    {
      "speaker": "Allen",
      "time": "00:50:47",
      "upperBoundTime": "00:52:50",
      "content": "Yeah, because look. My thing is, right now, my job criteria is a janitor, cleaner. And I'm all feeling, man I love cleaning bro. It's just a thing that I wound up doing. You know, janitor is my trade man, I love to get out there man and have a janitorial service. And even now, I would branch of to the lawn/gardening, because I don't think a lot of people like cutting grass, getting out there in the hot sun man and I know that's not easy but you know, your U-turns, 0f $3000, $4000 you've got to have money to have weed eaters, and brawlers and all that."
    },
    {
      "speaker": "Allen",
      "time": "00:50:47",
      "upperBoundTime": "00:52:50",
      "content": "Same thing with the janitorial service. When I went to St. Francis Xavier Seelos, the work on the project clean up, it blew my mind when they had the, when we put the water down, they had a thing that deal. You don't even got to mop it up, they got a thing like a vacuum cleaner man, pick it up. I'm talking about the floors is dry, wow. I wouldn't have been, that's how time and prayers, wasn't even you know what I'm saying? You know, that's I'd sure like to get out there and."
    },
    {
      "speaker": "Allen",
      "time": "00:50:47",
      "upperBoundTime": "00:52:50",
      "content": "Man, I'm telling you, I would love to be a free man again. It's just that you know, I'm serving a life sentence man for taking a man's life. Now I got to either go on the pardon board or have a sentence by the governor or you know, the legislature change they mind and say well, that's why I say that, you know, I'll put my faith in man, man. I know God is in control and this is the most I ever seen guys go home."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:50",
      "upperBoundTime": "00:53:02",
      "content": "Yeah, it is there a question that I should have asked you that I didn't ask you? Something that I didn't give you the opportunity to talk about that you wanted to?"
    },
    {
      "speaker": "Marcus",
      "time": "00:52:50",
      "upperBoundTime": "00:53:02",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:53:02",
      "upperBoundTime": "00:53:05",
      "content": "I don't know man, because."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:05",
      "upperBoundTime": "00:53:08",
      "content": "What would you want the legislators to know? I can ask you that as the last question."
    },
    {
      "speaker": "Allen",
      "time": "00:53:08",
      "upperBoundTime": "00:53:25",
      "content": "That a hideous crime, I understand."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:25",
      "upperBoundTime": "00:53:29",
      "content": "What would that be?"
    },
    {
      "speaker": "Marcus",
      "time": "00:53:25",
      "upperBoundTime": "00:53:29",
      "content": ""
    },
    {
      "speaker": "Allen",
      "time": "00:53:29",
      "content": "I would think a brutal killing of a kid or I can't say a rape charge looks like they more lenient with people raping older people and kids and they still let them out. I got a life sentence for taking a man's life at the age of 22. I can't go back into them but I'm saying I can. I learned and man I just think that, man, I'm a first offender. I only speak on guys in my- not to be critical or be judgmental, but I think that a guy deserves a second chance."
    },
    {
      "speaker": "Allen",
      "time": "00:53:29",
      "content": "You know? I really do think that and the Lord I serve, says that we should get a second chance, you know. And you know legislature man, if they're God fearing people man. You know, a lot of things is politically and economically inclined, and people don't want to do stuff because they might lose their job, or they might lose their money. I understand that man."
    },
    {
      "speaker": "Allen",
      "time": "00:53:29",
      "content": "But, when it hits home, if your kids or nephew or somebody goes through the same thing that I went through, now you trying to figure out a way to get the, you know, it shouldn't be that way."
    }
  ]
}
