{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Alvin Catchings Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Alvin",
      "time": "00:00:00",
      "upperBoundTime": "00:00:12",
      "content": "My name is Alvin Catchings, I'm serving a life sentence for second degree murder. I have been now incarcerated as of 27 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:12",
      "upperBoundTime": "00:00:31",
      "content": "Okay. So, I would like to ask you a few questions about your life before that. Those first 18 years of your life. And then we'll look at that punctuation point and talk about your life since then. But again, the purpose is just to learn more about you, who you are."
    },
    {
      "speaker": "Alvin",
      "time": "00:00:31",
      "upperBoundTime": "00:00:33",
      "content": "Okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:33",
      "upperBoundTime": "00:00:39",
      "content": "So can you start by telling me a little about the folks who raised you, your family?"
    },
    {
      "speaker": "Alvin",
      "time": "00:00:39",
      "upperBoundTime": "00:01:20",
      "content": "My mother raised me. My mother with the help of my grandmother on my daddy's side, and my mama's mama. My mother was a hardworking woman, she was raising 6 of us. Off of very low income trying to support 6 of us. We were raised up in a housing project, in New Orleans. Magnolia Housing Projects."
    },
    {
      "speaker": "Alvin",
      "time": "00:00:39",
      "upperBoundTime": "00:01:20",
      "content": "My daddy had left, well let's use the word incarcerated when I was about 4 years old. So he left everything on my mama to take care of us. Still as of today she did a good job at raising us with the help of my grandma. I gave my helping hand as well to raise us all."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:20",
      "upperBoundTime": "00:01:25",
      "content": "You said 6 of you so? So you're, where are you in the birth order?"
    },
    {
      "speaker": "Alvin",
      "time": "00:01:25",
      "upperBoundTime": "00:01:27",
      "content": "Fourth."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:27",
      "upperBoundTime": "00:01:30",
      "content": "Okay, alright tell me about the siblings, who are they?"
    },
    {
      "speaker": "Alvin",
      "time": "00:01:30",
      "upperBoundTime": "00:01:43",
      "content": "I've got my oldest sister Eva. Then you have my brother Pete. Then you got Tyron. Then you got me. My sister Trisha that's right under me, we're a year apart. Then you got my baby sister Vanessa."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:43",
      "upperBoundTime": "00:01:46",
      "content": "Okay, and are they all alive?"
    },
    {
      "speaker": "Alvin",
      "time": "00:01:46",
      "upperBoundTime": "00:01:47",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:47",
      "upperBoundTime": "00:01:48",
      "content": "Okay."
    },
    {
      "speaker": "Alvin",
      "time": "00:01:48",
      "upperBoundTime": "00:01:53",
      "content": "We lost two of them. My oldest sister and my baby sister. Eva and Vanessa."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:53",
      "upperBoundTime": "00:01:54",
      "content": "Okay. What happened to them?"
    },
    {
      "speaker": "Alvin",
      "time": "00:01:54",
      "upperBoundTime": "00:01:57",
      "content": "Eva died in a car accident."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:57",
      "upperBoundTime": "00:01:59",
      "content": "Okay."
    },
    {
      "speaker": "Alvin",
      "time": "00:01:59",
      "upperBoundTime": "00:02:02",
      "content": "Vanessa was killed at the age of 12."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:02",
      "upperBoundTime": "00:02:05",
      "content": "Oh goodness."
    },
    {
      "speaker": "Alvin",
      "time": "00:02:05",
      "upperBoundTime": "00:02:06",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:06",
      "upperBoundTime": "00:02:08",
      "content": "Why you were still out?"
    },
    {
      "speaker": "Alvin",
      "time": "00:02:08",
      "upperBoundTime": "00:02:50",
      "content": "Yeah. I was still in society at the time. I was about 15 years old. Her and my sister, Trisha, were going to a convenience store to go get some cigarettes for my mama. On their way to the store, there was some guys messing with her and teasing her. Because she used to wear glasses. Making fun of her."
    },
    {
      "speaker": "Alvin",
      "time": "00:02:08",
      "upperBoundTime": "00:02:50",
      "content": "My little sister, even though at that age, she was outspoken. I don't think she said nothing at the time, but after they went to the grocery store, it was on their way back and the guy messed with her again. She told him something that he didn't like that had the guys that he was with laughing at him."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:50",
      "upperBoundTime": "00:02:52",
      "content": "Okay."
    },
    {
      "speaker": "Alvin",
      "time": "00:02:52",
      "upperBoundTime": "00:02:59",
      "content": "Then the tables changed on him so he got mad, and chased them at first. Then he pulled out a gun and shot her."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:59",
      "upperBoundTime": "00:03:00",
      "content": "Goodness. A 12 year old child?"
    },
    {
      "speaker": "Alvin",
      "time": "00:03:00",
      "upperBoundTime": "00:03:03",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:03",
      "upperBoundTime": "00:03:12",
      "content": "Wow. So, you're really in a house with a lot of women."
    },
    {
      "speaker": "Alvin",
      "time": "00:03:12",
      "upperBoundTime": "00:03:14",
      "content": "Huh?"
    },
    {
      "speaker": "Marcus",
      "time": "00:03:14",
      "upperBoundTime": "00:03:21",
      "content": "You're in a house with a lot of women. And your mother and grandmother, are they in the same house? Grandmother's still leaving there?"
    },
    {
      "speaker": "Alvin",
      "time": "00:03:21",
      "upperBoundTime": "00:03:23",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:23",
      "upperBoundTime": "00:03:30",
      "content": "Okay. Approximately how much time would you spend with grandmother and mother? Were you split there? Or was it."
    },
    {
      "speaker": "Alvin",
      "time": "00:03:30",
      "upperBoundTime": "00:03:45",
      "content": "It's like we were split. Like when my mama had to go to work then we was like during the summer time, we would go stay with our grandmother for a while. Days out of a week. Yeah we would split the difference between the two grandparents."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:45",
      "upperBoundTime": "00:03:51",
      "content": "Alright. Of the two women, who do you think had the greatest influence in your life?"
    },
    {
      "speaker": "Alvin",
      "time": "00:03:51",
      "upperBoundTime": "00:03:56",
      "content": "My daddy's mama. My grandmother on my daddy's side."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:56",
      "upperBoundTime": "00:04:04",
      "content": "Alright. So now we're talking about 3, because I think you first told me there was your mother and your mother's mother."
    },
    {
      "speaker": "Alvin",
      "time": "00:04:04",
      "upperBoundTime": "00:04:06",
      "content": "And my daddy's mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:06",
      "upperBoundTime": "00:04:08",
      "content": "Okay so the grandmothers."
    },
    {
      "speaker": "Alvin",
      "time": "00:04:08",
      "upperBoundTime": "00:04:51",
      "content": "My mama's mama when I was coming up, we really didn't see, she wasn't my favorite person who I wanted to go by. To go hangout by. Because I'm a boy and I like to get out a lot and when we would go over by her house we couldn't go out, we had to wait a certain time to go out, the sun had to be down, there had to be a, I just couldn't handle it. But when I go by my daddy's mama I could be a boy, I could go outside. I'm not going to get in no trouble I just like to go outside, I just want to be trapped in the house all day."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:51",
      "upperBoundTime": "00:04:53",
      "content": "Sure."
    },
    {
      "speaker": "Alvin",
      "time": "00:04:53",
      "upperBoundTime": "00:05:04",
      "content": "By my mama's mama I'm surrounded by a bunch of females. I got my 2 sisters, my other female cousins. Man, that's a headache."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:04",
      "upperBoundTime": "00:05:19",
      "content": "Okay. So, would you say that of all of the folks you knew, took an interest in you when you were coming up, your daddy's mother was the most important person in your life?"
    },
    {
      "speaker": "Alvin",
      "time": "00:05:19",
      "upperBoundTime": "00:05:29",
      "content": "Yeah that was grandmother she would say, you should call me grandmother, and she would say there goes my little black boy right there. Because I was dark skinned like her. And I looked just like her."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:29",
      "upperBoundTime": "00:05:30",
      "content": "What did you call her?"
    },
    {
      "speaker": "Alvin",
      "time": "00:05:30",
      "upperBoundTime": "00:05:33",
      "content": "Grandma."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:33",
      "upperBoundTime": "00:05:35",
      "content": "Okay. When was the last time you talked with her?"
    },
    {
      "speaker": "Alvin",
      "time": "00:05:35",
      "upperBoundTime": "00:05:39",
      "content": "Right before, moments before she passed."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:39",
      "upperBoundTime": "00:05:42",
      "content": "Okay. Can you tell me about that?"
    },
    {
      "speaker": "Alvin",
      "time": "00:05:42",
      "upperBoundTime": "00:06:26",
      "content": "Yeah when I called home one day right after Katrina when they all started residing back in New Orleans. I happened to call and they told me she had been taken real ill. So my daddy gave her the phone and she was like, \"Alvin\" I said, \"I'm right here grandma.\" She called my name about four times but she couldn't really hear me because I guess the disease it had really taken over, and the phone wound hanging up. So when I tried to call back."
    },
    {
      "speaker": "Alvin",
      "time": "00:05:42",
      "upperBoundTime": "00:06:26",
      "content": "No I told them I was going to call back the next day. So when I called back the next day, they said that she had passed. I said that's the last thing I ever heard my grandmother say was calling out my name."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:26",
      "upperBoundTime": "00:06:33",
      "content": "Right, right."
    },
    {
      "speaker": "Alvin",
      "time": "00:06:33",
      "upperBoundTime": "00:06:42",
      "content": "You know and it took a toll on me. It stayed with me for a long time. It still does. When people ask me about her, it does."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:42",
      "upperBoundTime": "00:06:54",
      "content": "So, your mom and your mother's mom do they still come visit you? Are they able to come visit you?"
    },
    {
      "speaker": "Alvin",
      "time": "00:06:54",
      "upperBoundTime": "00:07:30",
      "content": "Yeah. Me and my mama's mama right now we're like bosom buddies. We developed a beautiful relationship now. She'd be getting on my mama about coming up here. When I told her she be like, \"They don't even want to tell me when they coming up, they always sneak up then they're going to tell me after they get back that they been up to see you.\" I'd be like, \"Calm down, grandma. Calm down.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:06:54",
      "upperBoundTime": "00:07:30",
      "content": "I said sometimes, you know a lot of times, I just don't want her to travel because of her age now. She's up in age and I don't want her to take those long rides up here. I try to let, tell my mama to try and bring her at least like twice a year 3 times a year. Something you know, work it in with her."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:30",
      "upperBoundTime": "00:07:34",
      "content": "When they come up, how long do you get to spend together?"
    },
    {
      "speaker": "Alvin",
      "time": "00:07:34",
      "upperBoundTime": "00:07:39",
      "content": "It all depends what time I make and the finish is. I stay the whole day."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:39",
      "upperBoundTime": "00:07:40",
      "content": "Sure."
    },
    {
      "speaker": "Alvin",
      "time": "00:07:40",
      "upperBoundTime": "00:09:16",
      "content": "Yeah. And there would some good times. She came to, I'm surprised she came to the rodeo. And we had a good time. It felt like a family reunion. Because I had one of my aunties was there that I hadn't seen in years, cousins, uncles. When she comes strutting around that bend I was like lord I ain't gone sell nothing. A dude like, \"Man what you want for that.\" I said, \"Y'all selling, I'm going to spend time with my grandmother right now\""
    },
    {
      "speaker": "Alvin",
      "time": "00:07:40",
      "upperBoundTime": "00:09:16",
      "content": "You know it was a beautiful time because I had to rebuild our relationship up with her and start all over again with her. Open up about a lot of things, asking her a lot of questions. I don't think none of my cousins around my age or under never really sat down and asked the questions I asked her. About her past and her upbringing and about our family history."
    },
    {
      "speaker": "Alvin",
      "time": "00:07:40",
      "upperBoundTime": "00:09:16",
      "content": "Nobody else never did that. I guess she was like, \"Where are you coming from with all these questions.\" When I do, it sparks a memory. she is happy, she just goes running and she starts telling me everything. Just like my other grandma too that passed. Because I never really knew she was really from Dansville until I started asking her questions. My other grandmother, my mama's mama she was originally from Houma, Louisiana. So then I just asked a lot of questions."
    },
    {
      "speaker": "Alvin",
      "time": "00:07:40",
      "upperBoundTime": "00:09:16",
      "content": "Aunties and uncles and my brother and sister were staying in New Orleans they didn't even know much about. I'm like what?"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:16",
      "upperBoundTime": "00:09:17",
      "content": "Yeah, all you have to do was ask."
    },
    {
      "speaker": "Alvin",
      "time": "00:09:17",
      "upperBoundTime": "00:09:33",
      "content": "Yeah. I'm not really close, I was never too close to that side of my family. I was always more to my daddy's side. Not too many people on my daddy's side. It was just my grandpa and grandma that I always used to be close to."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:33",
      "upperBoundTime": "00:09:38",
      "content": "Yeah, sure. Is it safe for me to assume that there was no physical or sexual abuse in your childhood?"
    },
    {
      "speaker": "Alvin",
      "time": "00:09:38",
      "upperBoundTime": "00:09:40",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:40",
      "upperBoundTime": "00:09:44",
      "content": "That you felt loved and somewhat secure in it?"
    },
    {
      "speaker": "Alvin",
      "time": "00:09:44",
      "upperBoundTime": "00:10:10",
      "content": "Yeah. It was cool. I just didn't really have any male role models in my life besides my oldest brother. Because he had to take care, he and my oldest sister took care of me and my other two sisters under me. They helped raise us as well. A lot of times my mama had to work at night, so they had to take care of us in the day."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:10",
      "upperBoundTime": "00:10:13",
      "content": "Sure. What was she doing for a living?"
    },
    {
      "speaker": "Alvin",
      "time": "00:10:13",
      "upperBoundTime": "00:10:15",
      "content": "During that time she was working as a waitress. A waitress at a bar…"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:15",
      "upperBoundTime": "00:10:18",
      "content": "Okay."
    },
    {
      "speaker": "Alvin",
      "time": "00:10:18",
      "upperBoundTime": "00:10:29",
      "content": "…in New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:29",
      "upperBoundTime": "00:10:39",
      "content": "That's Okay. So what about school? Tell me about school. How was school for you?"
    },
    {
      "speaker": "Alvin",
      "time": "00:10:39",
      "upperBoundTime": "00:10:42",
      "content": "It was good. I never wanted to miss a day."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:42",
      "upperBoundTime": "00:10:43",
      "content": "Where did you go to school?"
    },
    {
      "speaker": "Alvin",
      "time": "00:10:43",
      "upperBoundTime": "00:10:46",
      "content": "Which one? Like elementary? High school?"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:46",
      "upperBoundTime": "00:10:48",
      "content": "Yeah, tell me about all of them."
    },
    {
      "speaker": "Alvin",
      "time": "00:10:48",
      "upperBoundTime": "00:11:04",
      "content": "Tom LaForme when I was staying in the projects in Magnolia. Then when we moved out of the projects around 84 I went to another elementary school, transferred to Wilson, Andrew Wilson. Then getting kept back fighting my way back because I ended up losing one of my sisters and became a class clown."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:04",
      "upperBoundTime": "00:11:07",
      "content": "Right around when you were 15?"
    },
    {
      "speaker": "Alvin",
      "time": "00:11:07",
      "upperBoundTime": "00:11:57",
      "content": "Yeah. That's when I hide around all the pain. So, when I went to Darren when I finally graduated from elementary school. Went to Darren, I was in these elite classes math and English and I never wanted to be the type of person that had a little smarts. Because it looked like during that time it looked like you were kind of weak and nerdy, so I didn't want that stigma."
    },
    {
      "speaker": "Alvin",
      "time": "00:11:07",
      "upperBoundTime": "00:11:57",
      "content": "So I kept, I hung with a different crowd that wasn't like that. But school was alright then I graduated from Darren and I went to Booker T, made it all the way up to the 12th grade where I caught this charge but a lot of."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:57",
      "upperBoundTime": "00:12:00",
      "content": "Right. So you caught this charge just shy of graduating."
    },
    {
      "speaker": "Alvin",
      "time": "00:12:00",
      "upperBoundTime": "00:12:03",
      "content": "Yeah. In my last year of high school."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:03",
      "upperBoundTime": "00:12:13",
      "content": "Yeah. You're talking about somebody that's just trying to figure out to hide some of the emotional pain of losing your sister."
    },
    {
      "speaker": "Alvin",
      "time": "00:12:13",
      "upperBoundTime": "00:12:15",
      "content": "Both of them."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:15",
      "upperBoundTime": "00:12:18",
      "content": "Both of them yes. Actually I didn't ask you how you lost your older one."
    },
    {
      "speaker": "Alvin",
      "time": "00:12:18",
      "upperBoundTime": "00:12:20",
      "content": "Car accident."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:20",
      "upperBoundTime": "00:12:27",
      "content": "Oh yeah car accident. So that's a lot for a teenager to absorb."
    },
    {
      "speaker": "Alvin",
      "time": "00:12:27",
      "upperBoundTime": "00:12:43",
      "content": "Yeah because I used to, me and my older sister, she used to bring me a lot of places with her. And her friends used to call me her little boyfriend. Because they'd say \"He's cute, he's handsome.\" I used to be like all right. I used to go with her all the time when she'd go by her friends."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:43",
      "upperBoundTime": "00:12:47",
      "content": "Yeah. And it was within a very short period of time between the two deaths?"
    },
    {
      "speaker": "Alvin",
      "time": "00:12:47",
      "upperBoundTime": "00:14:03",
      "content": "Yeah, it was like a couple of years apart. When it devastated my mama, that was like, it seemed like her pain was rubbing off on me. The pain of something she was going through dealing with those two deaths. Like my little sister I was so devastated with that I, you couldn't even tell though. Because I stayed the same, you could tell a little bit because I was quite a lot. But I was gradually, I guess I was growing up a little too fast."
    },
    {
      "speaker": "Alvin",
      "time": "00:12:47",
      "upperBoundTime": "00:14:03",
      "content": "Started growing up, a little too, taking on a role as a care giver. Because my sister that is under me she was right there when it happened. She had to go see a psychiatrist for a while. Then she just stopped going to school and it took a toll on me too. You know because I'm seeing her going downhill as well and that's like all the female side. My mama lost two of them and this one her going down."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:03",
      "upperBoundTime": "00:14:05",
      "content": "Yeah that's a lot of trauma."
    },
    {
      "speaker": "Alvin",
      "time": "00:14:05",
      "upperBoundTime": "00:14:07",
      "content": "So she, now she's acting out in a way as well hiding behind."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:07",
      "upperBoundTime": "00:14:12",
      "content": "Of course."
    },
    {
      "speaker": "Alvin",
      "time": "00:14:12",
      "upperBoundTime": "00:14:56",
      "content": "You know, since I've been incarcerated, she tried to take her life twice and it really bothered me. Me and her I think we have a closer relationship than me and my other two siblings. My two oldest brothers. So me and she have a better relationship. People used to think we was twins. Even though we have different colors, she was a shade lighter than me. But we was just I don't know man. Like one of a kind."
    },
    {
      "speaker": "Alvin",
      "time": "00:14:12",
      "upperBoundTime": "00:14:56",
      "content": "They dealt with me a lot, because I wasn't, I'm not out there to help or support her when she really needed me."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:56",
      "upperBoundTime": "00:14:58",
      "content": "How old was the boy who killed your 12 year old sister?"
    },
    {
      "speaker": "Alvin",
      "time": "00:14:58",
      "upperBoundTime": "00:15:00",
      "content": "15."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:00",
      "upperBoundTime": "00:15:01",
      "content": "Your age?"
    },
    {
      "speaker": "Alvin",
      "time": "00:15:01",
      "upperBoundTime": "00:15:03",
      "content": "I knew him."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:03",
      "upperBoundTime": "00:15:06",
      "content": "Did you ever feel the need to?"
    },
    {
      "speaker": "Alvin",
      "time": "00:15:06",
      "upperBoundTime": "00:15:07",
      "content": "Revenge?"
    },
    {
      "speaker": "Marcus",
      "time": "00:15:07",
      "upperBoundTime": "00:15:09",
      "content": "Yes."
    },
    {
      "speaker": "Alvin",
      "time": "00:15:09",
      "upperBoundTime": "00:15:54",
      "content": "Yeah, I did. At that time I'm glad I didn't at the time. Because I probably would have killed my mama if something, if it would had turned violent. I would have killed my mama at that time. Because she was still in the mourning state. So I know I would have killed her by me being the baby boy too. I know that for sure because when I caught this charge, I kind of killed her mentally, you know spiritually as well, also emotionally."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:54",
      "upperBoundTime": "00:16:01",
      "content": "No, I understand that. I mean actually just sitting here listening to this, I'm just thinking what an enormous amount of trauma your mother had to deal with."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:01",
      "upperBoundTime": "00:16:07",
      "content": "I always tell her I say, \"Ma you're stronger than what you think you are. You've been through a lot.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:16:07",
      "upperBoundTime": "00:16:08",
      "content": "Yeah, well you all have."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:08",
      "upperBoundTime": "00:18:26",
      "content": "Yeah, and another thing is that is that I didn't know growing up the full story of my daddy until I come here and met him. I met him, you know I met I knew him off the street before he came to jail. But I didn't know coming up, I think I was 4 years old when he came to jail. But coming up here, spending time with him and knowing the type of man that he is. Or he was because he passed now, about his past I didn't know he was abusive."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:08",
      "upperBoundTime": "00:18:26",
      "content": "Because one day when I called home, I was calling by his house to talk to him. The female that, my sister, I have 3 other sisters by him. She was telling my mama about it, that she had a black eye and that he beat her up. So my mama and you know I don't know if she knew I was still present on the phone and she said he used to do that to me."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:08",
      "upperBoundTime": "00:18:26",
      "content": "Now all that anger you know raised up out of me. I'm like, \"He did what?\" I told her I'm glad he's not up here with me no more. Because I don't know what would have happened knowing that he put his hands on you."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:08",
      "upperBoundTime": "00:18:26",
      "content": "I guess by losing both of my sisters and the way that I lost them, it was always in the hands by another man. One shot my sister and the other dude he was just driving the car drunk. It was nothing that they did. It was something someone else did and it caused them to lose their lives."
    },
    {
      "speaker": "Alvin",
      "time": "00:16:08",
      "upperBoundTime": "00:18:26",
      "content": "So I became very protective of Trisha. But I'm not out there to help. Then when I heard what happened with my mama dealing with my daddy situation, it really had my blood boiling. You know you try to rationalize, try to process all of that. It was really hard."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:26",
      "upperBoundTime": "00:18:34",
      "content": "Yeah. So tell me a little more about your two older brothers."
    },
    {
      "speaker": "Alvin",
      "time": "00:18:34",
      "upperBoundTime": "00:20:09",
      "content": "Tyron, that's the one right over me. He is a kicks dude. He's somebody you can hang out with him. But I think he battles everything, his dealing with everything was he fell into drugs at a young age."
    },
    {
      "speaker": "Alvin",
      "time": "00:18:34",
      "upperBoundTime": "00:20:09",
      "content": "Now my oldest brother Pete, I think he had to be a man before his time. Take on a father role as a young sibling. I mean to watch over us, to help my mama. Do all she can. His impulse, his addiction was gambling. He gambled everything. I remember one time we still had, we still had the house the apartment in the projects. Because we wasn't really, when my mama moved, got a good man, it wasn't, she still had the house in the projects. It wasn't always solid at the house at the time."
    },
    {
      "speaker": "Alvin",
      "time": "00:18:34",
      "upperBoundTime": "00:20:09",
      "content": "My brother lost her rent money shooting dice gambling. It just had its toll because everybody dealt with the situation and problem differently and that was his way of dealing with it. Gambling. He didn't do drinking, he didn't do drugs. He just liked to gamble."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:09",
      "upperBoundTime": "00:20:11",
      "content": "What is he doing now?"
    },
    {
      "speaker": "Alvin",
      "time": "00:20:11",
      "upperBoundTime": "00:20:52",
      "content": "He doesn't do nothing. He doesn't gamble anymore. He take dialysis 3 times a week now. He was just diagnosed with cancer. But they had, they cut it out just in time in he's lung. They got it just in time, so now he doesn't have to do radiation, he had to take no type of treatment."
    },
    {
      "speaker": "Alvin",
      "time": "00:20:11",
      "upperBoundTime": "00:20:52",
      "content": "So he's alright now. He has a son that is in jail doing 15 years for I think for armed robbing and carjack. So, when I see him, I tell him don't even worry about me man, focus on your son. I'm good."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:52",
      "upperBoundTime": "00:21:07",
      "content": "So, your mom had a few other men who came into her life. One of whom you moved, had a house you could move to out of the projects. Were there men that came into her like that came into your life that created conflict at all?"
    },
    {
      "speaker": "Alvin",
      "time": "00:21:07",
      "upperBoundTime": "00:22:49",
      "content": "No. Only one, like the one we moved in with and we became a steady family with, much later. He was more of like one of these Bill Cosby type dude. Have you ever seen the Cosby Show? Living with him was like that. Kicks, funny, it took a process for everyone to gel together, get the trust."
    },
    {
      "speaker": "Alvin",
      "time": "00:21:07",
      "upperBoundTime": "00:22:49",
      "content": "But he was very supportive of us. He wanted the best out of us. But he had his own issues too. He was a drunk, he drank a lot. But he made sure, he tried his best to make sure that we stayed on the straight and narrow. He was there for me since day one. He was always there man. He said, \"I can't believe you're in there.\" I said, \"I can't believe it neither.\" But he was very supportive I liked him."
    },
    {
      "speaker": "Alvin",
      "time": "00:21:07",
      "upperBoundTime": "00:22:49",
      "content": "I used to call him my second daddy. Even though I'm up here he used to come see me. I said, \"Where my mama at?\" \"She wasn't dressed in time. I told her I don't play. When it's time to come see you and she ain't ready, I'm gone.\" And he had grabbed one of nieces or nephew and he's on the road. I used to tell my Mama, say, I learned you'd better be ready here on time, trying to come up here with him."
    },
    {
      "speaker": "Alvin",
      "time": "00:21:07",
      "upperBoundTime": "00:22:49",
      "content": "It was the kicks. It was a nice, like I said every relationship have their problems. So they had their problems."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:49",
      "upperBoundTime": "00:23:00",
      "content": "Of course."
    },
    {
      "speaker": "Alvin",
      "time": "00:23:00",
      "upperBoundTime": "00:23:08",
      "content": "We had our problems as a family. It was, played out as the Cosby Show. But they did their best to try to raise us to the best of their ability."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:08",
      "upperBoundTime": "00:23:15",
      "content": "Sure. What about girls? Relationships with girls, girlfriends before you came here."
    },
    {
      "speaker": "Alvin",
      "time": "00:23:15",
      "upperBoundTime": "00:23:40",
      "content": "I had a few of them but one of them I really took, two of them I took real serious. It was the one I had been messing with since elementary school. Everybody thought we were going to be that couple that, that had a fairy tale that was going to live, and be together forever. Well we made plans man we was supposed to be married in '95. You know after graduating."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:40",
      "upperBoundTime": "00:23:42",
      "content": "What's her name?"
    },
    {
      "speaker": "Alvin",
      "time": "00:23:42",
      "upperBoundTime": "00:23:56",
      "content": "Tamika. Yeah we would've been married in '95. We had been planning our whole lives and everything. But '91 was a just a bad year for me. That's when I caught this charge. So that's detoured everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:56",
      "upperBoundTime": "00:24:00",
      "content": "'95. The idea that you would graduate from high school."
    },
    {
      "speaker": "Alvin",
      "time": "00:24:00",
      "upperBoundTime": "00:24:02",
      "content": "No I would have been…"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:02",
      "upperBoundTime": "00:24:04",
      "content": "To college."
    },
    {
      "speaker": "Alvin",
      "time": "00:24:04",
      "upperBoundTime": "00:24:06",
      "content": "…gone to college. I was going to college to be an accountant."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:06",
      "upperBoundTime": "00:24:11",
      "content": "Okay. It sounded like you were smart enough even if you were trying to hide that."
    },
    {
      "speaker": "Alvin",
      "time": "00:24:11",
      "upperBoundTime": "00:24:14",
      "content": "I was."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:14",
      "upperBoundTime": "00:24:17",
      "content": "Any children?"
    },
    {
      "speaker": "Alvin",
      "time": "00:24:17",
      "upperBoundTime": "00:24:20",
      "content": "No. She lost it. She lost the child."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:20",
      "upperBoundTime": "00:24:24",
      "content": "Okay. Alright. Do you have any kind of relationship with Tamika today?"
    },
    {
      "speaker": "Alvin",
      "time": "00:24:24",
      "upperBoundTime": "00:24:44",
      "content": "Used to, not too much, but I ask about her. But I don't call her anymore because of the relationship I'm in now. So I try to not keep unnecessary windows or opportunities open thinking we're going to get back together."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:44",
      "upperBoundTime": "00:24:46",
      "content": "I understand."
    },
    {
      "speaker": "Alvin",
      "time": "00:24:46",
      "upperBoundTime": "00:24:48",
      "content": "I just ask about her."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:48",
      "upperBoundTime": "00:24:48",
      "content": "Tell me about that relationship that you're in now"
    },
    {
      "speaker": "Alvin",
      "time": "00:24:48",
      "upperBoundTime": "00:25:15",
      "content": "Melanie, she's very sweet, compassionate. She a go getter she's just one hundred. She has sacrificed a lot so far for me, trying to help me get out of here. She always tells me that I have helped her a lot. Especially with dealing with the situation with her kids. It's beautiful."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:15",
      "upperBoundTime": "00:25:17",
      "content": "How'd you meet?"
    },
    {
      "speaker": "Alvin",
      "time": "00:25:17",
      "upperBoundTime": "00:26:44",
      "content": "I met her when I first came up here. Through a friend. Then her uncle and I were in the dorm together. So it was through a friend of hers that I went to school with. I had asked her uncle that he knew me and he told her I was in dorm so we started writing. Then she introduced me to Melanie."
    },
    {
      "speaker": "Alvin",
      "time": "00:25:17",
      "upperBoundTime": "00:26:44",
      "content": "So me and Melanie started writing but then things fell off because I was still fresh up. I had just come up here, I was still with Tamika. I was the type of person who doesn't try to play games with females, making people's feelings involved. So now we rekindled like a couple of years, 2 years ago I met her again at the rodeo. Her uncle was out there, and told her, you seen Alvin and she said, \"I thought he was home.\" He said, \"No he's out here.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:25:17",
      "upperBoundTime": "00:26:44",
      "content": "So, a friend of them would come out, looking for me, he said, \"Man there's a girls looking for you\" I said, \"A girl?\" I said, \"Where she at?\" He said, \"Back there by Ernie.\" And it dawned, I said, \"It must be Melanie.\" So when I went back and I saw her, she saw me, she started smiling, couldn't stop smiling. I'm trying to hold mine in, because I didn't want to show her that I was excited to see her too."
    },
    {
      "speaker": "Alvin",
      "time": "00:25:17",
      "upperBoundTime": "00:26:44",
      "content": "Then we started talking she said, \"I thought you've been home.\" I said, \"No I've been right here the whole time.\" I said, \"I'm trying to get there.\" That's when everything just took off, like we never missed a day. Like years, the years we hadn't been communicating, like it wasn't even much, no existence."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:44",
      "upperBoundTime": "00:27:01",
      "content": "Yeah that's great. So, I want to sort of want to go back to getting to this charge that got you in here. Do you remember the first time you were arrested?"
    },
    {
      "speaker": "Alvin",
      "time": "00:27:01",
      "upperBoundTime": "00:27:04",
      "content": "I can't, I don't know how old I was."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:04",
      "upperBoundTime": "00:27:05",
      "content": "What was it about?"
    },
    {
      "speaker": "Alvin",
      "time": "00:27:05",
      "upperBoundTime": "00:27:12",
      "content": "Shoplifting. The second time was for, don't laugh at me but spitting on the sidewalk."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:12",
      "upperBoundTime": "00:27:13",
      "content": "You got arrested?"
    },
    {
      "speaker": "Alvin",
      "time": "00:27:13",
      "upperBoundTime": "00:29:47",
      "content": "Yeah. I was in the car with some friends. We were going to buy groceries, I was going to buy my niece and my mama some Popeye's some chicken. Popeye's chicken. So I'm in the car with them, helping them with the groceries. So we were going to make the round. We went into the Calliope Projects, to go help him put the groceries up. Doubled back because my mama had to drop the chicken off to my niece to have something to eat."
    },
    {
      "speaker": "Alvin",
      "time": "00:27:13",
      "upperBoundTime": "00:29:47",
      "content": "We were just going to go hangout. The police pull us over right in front their house. They pull us over and said they're trying to figure out what's going on. We are straight. What y'all pulling us over for? So, I don't really want to say anything. So I let the driver talk so he said, \"All y'all get out the car.\" So we all get out the car, 4 of us in there. Me, V, Sleepy and Viole. So we get out the car."
    },
    {
      "speaker": "Alvin",
      "time": "00:27:13",
      "upperBoundTime": "00:29:47",
      "content": "We are all standing there so one of the cops looks at me and says, \"You got a problem?\" I said, \"No.\" I said, \"Should I have one?\" He didn't say nothing. So I spit on the ground. He wasn't looking directly at me when I did that. He must have seen me out of his peripheral. So when I did he turned around and said, \"You spit on that ground?\" I said, \"Yeah my mouth was dry.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:27:13",
      "upperBoundTime": "00:29:47",
      "content": "The other one come around and says, \"Who spit on the ground?\" He says, \"He did.\" He turned me around and put the handcuffs on me and put me in the car. The next thing you know, Sleepy is coming behind me. Now I don't know at the time they had Sleepy. I forgot what they were trying to say what they had Sleepy for. I forgot what they were locking him up for. But they just locked us up. So when I went to court and the judge called my name and read the thing what I was in there for. He looked at me and said, \"Man get out of here.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:27:13",
      "upperBoundTime": "00:29:47",
      "content": "He said, \"I can't believe they locked you up for something like that.\" I said, \"I couldn't believe it neither.\" I got out of jail that night like 2:00 something in the morning. I just walked home, I didn't even call anybody I just walked across the Breaux Bridge. And walked home."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:47",
      "upperBoundTime": "00:29:52",
      "content": "So, about as petty as it gets. Anything else serious prior to this?"
    },
    {
      "speaker": "Alvin",
      "time": "00:29:52",
      "upperBoundTime": "00:29:57",
      "content": "No, nothing serious, no."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:57",
      "upperBoundTime": "00:30:08",
      "content": "Well, you mentioned the role of drugs and alcohol at various points with various folks. Were drugs and alcohol apart of your life at all?"
    },
    {
      "speaker": "Alvin",
      "time": "00:30:08",
      "upperBoundTime": "00:30:44",
      "content": "No, not really. I didn't try it because like I said my brother he did drugs and I smoked a little weed. Just to try to see the effects of it. I probably didn't even know what I was doing. Because I never had no buzz no, nothing never happened to me. Man you're tripping, I don't feel nothing."
    },
    {
      "speaker": "Alvin",
      "time": "00:30:08",
      "upperBoundTime": "00:30:44",
      "content": "Occasionally they would let me, my mama would let me drink a beer at a family gathering, stuff like that you know? Nothing hard. You get your beer, and I drank that all the way because it was no good tiff."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:44",
      "upperBoundTime": "00:31:32",
      "content": "So, a lot of times when you see someone who ends up with a second degree murder charge, first degree murder charge, there's usually a path that this person's been on for a while."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:44",
      "upperBoundTime": "00:31:32",
      "content": "Eventually these things catch up to them, right? Then for you it's just something that sounds a little bit more out of the blue, right? A little trouble here, shoplifting, spitting on the ground."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:44",
      "upperBoundTime": "00:31:32",
      "content": "Then all of a sudden you're dealing with a very serious thing here. When you were arrested and you're in the Parish for a few months I assume while you're going through. Do you remember hearing the guilty verdict and the sentence?"
    },
    {
      "speaker": "Alvin",
      "time": "00:31:32",
      "upperBoundTime": "00:31:36",
      "content": "Yes. I still hear it like it's clear as day."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:36",
      "upperBoundTime": "00:31:40",
      "content": "Can you tell me about that?"
    },
    {
      "speaker": "Alvin",
      "time": "00:31:40",
      "upperBoundTime": "00:32:48",
      "content": "Yeah. When people came back from deliberation and said you are guilty. I was just like, I must have been looking crazy. I couldn't believe the words that came out of their mouth. You know say, \"Guilty.\" At the same time, I guess what bothers me is that when I had to stand up for the verdict, and it was being reading out, my mama had just walked through the door."
    },
    {
      "speaker": "Alvin",
      "time": "00:31:40",
      "upperBoundTime": "00:32:48",
      "content": "And they said guilty. And she just, I could heard the holler. I didn't even want to turn around. But I did and told her, everything's going to be alright, everything's going to be alright, and my sister was taken out of the courtroom. The victim's family were sitting in the back of the courtroom."
    },
    {
      "speaker": "Alvin",
      "time": "00:31:40",
      "upperBoundTime": "00:32:48",
      "content": "I was telling my mama everything going to be all right. I just really wanted them to get out of the courtroom. Because by seeing her breaking down was going to make me break down. And I did want to break down because I know where I'm about to go at I've got to keep up appearances."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:48",
      "upperBoundTime": "00:32:54",
      "content": "Yeah. My God. You're on the bus coming down to prison. What's going through your mind?"
    },
    {
      "speaker": "Alvin",
      "time": "00:32:54",
      "upperBoundTime": "00:33:46",
      "content": "What kind of place it's going to be. Because you hear so many stories and in my mind I'm saying I just got to be ready for whatever. I already know don't let anybody play with you. Don't let them ask you any questions, tense up real quick. Let them know that you ain't about to be played with, no type of way. You heard about all the games that been played, so you got a lot that you're trying to process."
    },
    {
      "speaker": "Alvin",
      "time": "00:32:54",
      "upperBoundTime": "00:33:46",
      "content": "Then I already knew my daddy was up there too. That's another thing now I'm trying to locate him. He knew I was coming because I was writing him to let him know he should be leaving soon to come that way. So he was on the lookout for me as well as I was going to be on the lookout for him. I fell in C block, he was right there in B block."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:46",
      "upperBoundTime": "00:33:48",
      "content": "Did he help you out a little bit?"
    },
    {
      "speaker": "Alvin",
      "time": "00:33:48",
      "upperBoundTime": "00:34:55",
      "content": "A little bit. I was already kind of educated. So the only thing I wanted to do was trying to figure out how to get out of here. Direction I needed to go to try to help myself get out of here."
    },
    {
      "speaker": "Alvin",
      "time": "00:33:48",
      "upperBoundTime": "00:34:55",
      "content": "He wasn't there academically wise. So I had to like, in that area I had to defend for myself. So I finished school got my GED, still dealing with the many personalities that I'm surrounded by. So I had to keep my defense up. Because you see things happening around you and you be like when is your turn?"
    },
    {
      "speaker": "Alvin",
      "time": "00:33:48",
      "upperBoundTime": "00:34:55",
      "content": "Your turn is going to come soon. Somebody is going to try to challenge you thinking, I don't know you could be out there with your chest poked out you going to get challenged. You could just be quiet you still going to be, you know somebody."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:55",
      "upperBoundTime": "00:34:56",
      "content": "Where was the first challenge?"
    },
    {
      "speaker": "Alvin",
      "time": "00:34:56",
      "upperBoundTime": "00:35:02",
      "content": "In the C Block."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:02",
      "upperBoundTime": "00:35:07",
      "content": "What was it? What happened?"
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "The guy wanted, he tried to get me involved in homosexuality. He liked me and I like told him I said, \"Man don't come at me like that no more.\" I said, \"Don't take my quietness as a weakness.\" And I left it at that. So as time passed right before, about 2 months before they let us out the block, me and the dude had become cool. You know he already in the lifestyle but we had become cool. He said, \"Man I like the way you carry yourself, I'm sorry for approaching you like that I'm not going to you know.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "What happened, he is telling me a lot of things about the life that's going around. What to look for when I make it to population and what not to look for because he said like, one of my celly he was one. He was saying everything that seems to be ain't. Because they had a guy he was, when I first come down he was grabbing on a ball with his chest poked out. Asked me where I was from."
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "I said, \"I'm from New Orleans.\" He said, \"What part.\" I said, \"3rd ward.\" He said, \"3rd ward?\" I said, \"Yes.\" He said, \"Alright.\" So my boy that I came up here with I said it might be going down in the morning. He said, \"What you talking about?\" He said the dude down there, I think cell 5 he looks like he's got something on his mind. He said, \"Alright we going to see in the morning\""
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "But, he was the most scary thing I ever met. Big as he was. I said, \"Man I can't believe that.\" My celly said, \"I told you.\" He said everything it look like sleep awesome, man. It was just, you just have to wrap your mind around that lifestyle of living up here."
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "Because you're transforming from a residential living of a loving family or whatever to a, what they say barbaric, barbarism. Whatever you want to call them. Cave men. It's just a different, whole lifestyle. You just got to keep your mind focused. It's hard to try to stay focused on your freedom because that's when all the problems come because they know you're focusing on your freedom that's when they'll try to attack."
    },
    {
      "speaker": "Alvin",
      "time": "00:35:07",
      "upperBoundTime": "00:37:40",
      "content": "I think I had just putting something in court and the guy comes messing with me. He was lucky I didn't you know. Because I probably would've had something I probably would've really hurt him real bad."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:40",
      "upperBoundTime": "00:37:45",
      "content": "Why do you think that is? That they start messing with you when you go to court."
    },
    {
      "speaker": "Alvin",
      "time": "00:37:45",
      "upperBoundTime": "00:38:01",
      "content": "I really don't understand that because I guess they feel like you ain't going to, because you want to go home so bad that you're not going to stand up for yourself. I'm like, my freedom is going to be put to the side because I'm leaving with my manhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:01",
      "upperBoundTime": "00:38:05",
      "content": "Yeah I see what you're saying. They think that you won't fight back because you don't want to get in trouble."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:05",
      "upperBoundTime": "00:38:10",
      "content": "Yeah get in any trouble, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:10",
      "upperBoundTime": "00:38:31",
      "content": "Yeah. 27 years. When you look back on that kid that who came in here do you get, I mean when you see some of the guys coming in now 18, 19 years old, do you see a little bit of yourself in them?"
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "Yeah, I do. Sometimes you be talking to them, but then I remember the time when I came, that I'm like because you have your defenses up so you don't really want to talk to these older guys. Because you think about nothing but game. You know, trying to get over on you."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "Like if I do get the opportunity, like they come in my circle, then I will try to educate them try to give them the prison life man. Focus on your case focus on getting out of here. Try to get into some of the programs start now. Don't wait like I did because I said I had a chip on my shoulder, and I wanted to go home as well. By me try to do a lot, I hid behind sports. I played basketball, football, baseball you know. And that was like my distraction."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "Then I was going to school going to the law library. It became very tiresome. I was in clubs you know participating in certain self-help clubs, like substance abuse, alcoholics anonymous you know things like that. The drama club, the Latin American club, I was just getting involved in things trying to just trying to I guess educate myself and just stay up there, knowledgeable."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "Try to be knowledgeable guy. I don't want to be like some of these dudes that had been down before I came up here, don't know nothing. Wasn't educated, couldn't help a person that's coming off the street if they wanted help they couldn't really help them out. So now I try to just keep myself abroad. When my sister had her kids, I used to always try to be there for them, be educative because they would always tell them Alvin's smart."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "They were like, \"Uncle Alvin my mama said you smart.\" I said, \"I ain't smart.\" I said, \"Don't let them tell you that.\" I said, \"They are smarter than me.\" They said, \"Why you say that?\" I said, \"Because they're out there and I'm in here.\" You know to play with them. I just want to try to keep them on the straight and narrow so they don't follow my path. I was trying to kill that because like my older brother's dad had been to prison. My daddy was in prison."
    },
    {
      "speaker": "Alvin",
      "time": "00:38:31",
      "upperBoundTime": "00:41:44",
      "content": "So by me coming to prison I want to kill the chain. I want it to stop here. But, everybody in their household besides my older sister and my baby sister because of their deaths probably stopped them, me and my other two brothers and my sister under and my mama have all been to prison. I think me and my mama had the two hardest charges. I'm facing life for second degree murder. I think my mama facing a manslaughter."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:44",
      "upperBoundTime": "00:41:46",
      "content": "Oh Okay. I didn't know that."
    },
    {
      "speaker": "Alvin",
      "time": "00:41:46",
      "upperBoundTime": "00:42:55",
      "content": "Yeah I didn't bring it up. A guy put his hand on my mama. And the guy that she was messing with at the time defended her and killed a dude in our house. My mama got shot, my mama was shot and a lady that the guy who was killed in our house, she was shot. The dude was shot and he died in the house."
    },
    {
      "speaker": "Alvin",
      "time": "00:41:46",
      "upperBoundTime": "00:42:55",
      "content": "So I think that was probably was the first killing that I ever witnessed. At a young age I didn't really process, I'd seen a lot standing in the projects. You come across a lot like during that time there I'm looking at the dude, bleeding in our kitchen, with the bullet holes in him. I'm just looking at him."
    },
    {
      "speaker": "Alvin",
      "time": "00:41:46",
      "upperBoundTime": "00:42:55",
      "content": "Until my mama came and I think it was my mama or my brother tried to put his hands over my eyes. I'm like, \"What's wrong with you?\" I said, \"I'm not scared.\" They just didn't want me to see it."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:55",
      "upperBoundTime": "00:42:58",
      "content": "Sure."
    },
    {
      "speaker": "Alvin",
      "time": "00:42:58",
      "upperBoundTime": "00:42:55",
      "content": "Or witness it."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:55",
      "upperBoundTime": "00:43:00",
      "content": "Yeah you can't unsee it."
    },
    {
      "speaker": "Alvin",
      "time": "00:43:00",
      "upperBoundTime": "00:43:46",
      "content": "Yeah. One time when I was out there playing football with me and my friend. Two guys just come running through, and ran right like we right here. Come running right here through us. The other guy was shooting at the other guy. I'm standing right there watching him."
    },
    {
      "speaker": "Alvin",
      "time": "00:43:00",
      "upperBoundTime": "00:43:46",
      "content": "Everybody is telling me to get out the way. But I don't hear them. I just hear the gunshots and watching this, I guess in amazement. I'm just stuck in a trance just watching them. Like it's something that's every day happens. That's how I was caught up like that. I just witness a lot in my life. I just never really probably just started saying something about it."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:46",
      "upperBoundTime": "00:43:51",
      "content": "Yeah. What's the worst thing you've seen here?"
    },
    {
      "speaker": "Alvin",
      "time": "00:43:51",
      "upperBoundTime": "00:44:35",
      "content": "Here? A guy get hit in the head with a pipe, with a not a pipe, there's a curl bar. When they come running around that corner and that dude slipped and when that man hit him in the head with that pipe I thought, all I heard that man say, \"Ooh!\" I thought he was dead. He didn't say nothing else. The dude hit him again and it like it pumped life right back in him. I said, \"What the hell?\""
    },
    {
      "speaker": "Alvin",
      "time": "00:43:51",
      "upperBoundTime": "00:44:35",
      "content": "So my daddy grabbed me and put his hands on my eyes. I said, \"Man what are you doing?\" I said, \"Man I'm a grown man. You think you don't want me to witness it?\" Come on, man. I said, \"I ain't going to say nothing.\" I'm a grown man."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:35",
      "upperBoundTime": "00:44:38",
      "content": "He was trying to protect you."
    },
    {
      "speaker": "Alvin",
      "time": "00:44:38",
      "upperBoundTime": "00:44:42",
      "content": "I was telling him I said, \"You don't know all the killing I've seen out there?\" I said, \"Come on Dad.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:44:42",
      "upperBoundTime": "00:44:49",
      "content": "So can you describe your typical day here now? What's your routine? Morning till evening."
    },
    {
      "speaker": "Alvin",
      "time": "00:44:49",
      "upperBoundTime": "00:45:26",
      "content": "I get up in the morning get ready to go to work. I'm a clerk, file maintenance. Go over there to work, see what's to be done. Where the orders I have to file. Orders for the different camps that I'm in control of. So I do I make out their orders."
    },
    {
      "speaker": "Alvin",
      "time": "00:44:49",
      "upperBoundTime": "00:45:26",
      "content": "Turn them to my boss, after he sign them I bring them to the head man where they bring them up front to get them processed. For the things that they need to keep each camp up and running. I come in and probably go spend all the time in the hobby shop. Building stuff for the rodeo."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:26",
      "upperBoundTime": "00:45:28",
      "content": "What do you make in the hobby shop?"
    },
    {
      "speaker": "Alvin",
      "time": "00:45:28",
      "upperBoundTime": "00:46:02",
      "content": "Like table sets, rocking chairs, swings, you know furniture. That will be like somewhere I'll probably go spend all the time doing a little weight lifting stuff. Get on the kiosk. Write her, let her know I'm all right. That's one of the things I do in the morning before I do go to work."
    },
    {
      "speaker": "Alvin",
      "time": "00:45:28",
      "upperBoundTime": "00:46:02",
      "content": "You know, tell her good morning, God bless you. He always make sure he's with you today. I write her then I go through my daily activities. Then when I come in from work I write her again. Then I write her again before I go to bed."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:02",
      "upperBoundTime": "00:46:03",
      "content": "Wow."
    },
    {
      "speaker": "Alvin",
      "time": "00:46:03",
      "upperBoundTime": "00:46:13",
      "content": "I just watch a little TV in between times. That is my typical and then I go to church on Mondays and Sundays. Sunday mornings."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:13",
      "upperBoundTime": "00:46:22",
      "content": "You told me you've been through quite a few of the programs, what other organizations have you been part of since you've been here? It's been awhile."
    },
    {
      "speaker": "Alvin",
      "time": "00:46:22",
      "upperBoundTime": "00:47:03",
      "content": "Yeah. It has been awhile because I ain't been really in a program since I left the main prison. I took up a thing for a change class with Francis. I had to redo something because the person that gave it wasn't qualified back then. I had two and a half years of Bible College. I graduated from carpenter school. I got like I think I got like 4 or 5 years of employment, before I got the clerk job. So I, other than that."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:03",
      "upperBoundTime": "00:47:05",
      "content": "So you can do some things?"
    },
    {
      "speaker": "Alvin",
      "time": "00:47:05",
      "upperBoundTime": "00:47:12",
      "content": "Yeah. I try. I just want to be fit for when I make it out there. I don't want to be asset I want to be a help when I make it out there."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:12",
      "upperBoundTime": "00:47:16",
      "content": "Why 2 and a half years at the Bible college?"
    },
    {
      "speaker": "Alvin",
      "time": "00:47:16",
      "upperBoundTime": "00:47:39",
      "content": "My mind, my mental capacity was shutting down. I was losing focus. I lost my stepdad and you know came up and then. It just bottled up a lot of stuff. I was shutting down again."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:39",
      "upperBoundTime": "00:47:58",
      "content": "Okay. So Alvin you said that the whole incident with the gun and everybody knew everybody. You know your old friends. So when you and then you described the trial that the victim's family the one in the back there, everybody knew everybody."
    },
    {
      "speaker": "Alvin",
      "time": "00:47:58",
      "upperBoundTime": "00:48:00",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:00",
      "upperBoundTime": "00:48:13",
      "content": "When you look back on what happened 27 years ago and as senseless as it may have been it's so much time that's passed. What is the, what do you feel about it now?"
    },
    {
      "speaker": "Alvin",
      "time": "00:48:13",
      "upperBoundTime": "00:49:25",
      "content": "I'm always feeling regret of it because I feel like that was a part of my life that I feel like should have never happened. It should've never got that far. I wish it would have never got that far. Hoped and prayed it never but it happened."
    },
    {
      "speaker": "Alvin",
      "time": "00:48:13",
      "upperBoundTime": "00:49:25",
      "content": "The same thing was running through my mind during that process I'm like, \"I'm not about to let somebody take another one of my mama's kids\" Let it enough let it be me, to be the one to go. I had really big dreams. I wanted to go to college, try to get this good accounting job. Try to get me a nice job. Where I could tell my mama one day you ain't got to work no more, I got you."
    },
    {
      "speaker": "Alvin",
      "time": "00:48:13",
      "upperBoundTime": "00:49:25",
      "content": "I just wanted a way out. But you know, still taking care of me. I wanted the tables to change where I could take care of her. I never really got that opportunity to do that. You know, like you said, all these years that have passed she's getting older, she's 70 now you know?"
    },
    {
      "speaker": "Marcus",
      "time": "00:49:25",
      "upperBoundTime": "00:49:50",
      "content": "Well you know, when something like this happens it's the victim's family that we tend to focus on but the other family that gets really destroyed is the family of the offender. In your family, who's been hardest on to watch you come up here?"
    },
    {
      "speaker": "Alvin",
      "time": "00:49:50",
      "upperBoundTime": "00:50:18",
      "content": "My mama and my sister. My brother you know he got the macho just tough kind of mentality but I think it's more my sister and my mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:18",
      "upperBoundTime": "00:50:22",
      "content": "Yeah. How do you how do you see that, when they come visit you? Is that when you've become aware of the fact that this is still very difficult for them?"
    },
    {
      "speaker": "Alvin",
      "time": "00:50:22",
      "upperBoundTime": "00:51:14",
      "content": "Not so much with my sister. But with my mama. Sometimes I don't really want her to come up here because I know that it's hard for her to leave. When she's here it's hard for her to leave. I'm like, \"Look the bus is here, why don't you go ahead.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:50:22",
      "upperBoundTime": "00:51:14",
      "content": "I don't mind spending time with my mama I love to see her, spend a little time with her, because I know the longer she stays the harder it is for her to leave me. I try to show her I'm straight I'm strong. I'm really am Ma. She's like, \"I know baby, I know baby\" I say, \"You need to be strong too though.\" She said, \"I am.\" I said, \"Alright because I'm not the only child still alive you still got Pete, Trish and Tyrone.\" I said then you got some lovely grandchildren."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:14",
      "upperBoundTime": "00:51:16",
      "content": "Sure."
    },
    {
      "speaker": "Alvin",
      "time": "00:51:16",
      "upperBoundTime": "00:51:33",
      "content": "I said, \"Come on Ma, stop focusing on me please.\" But it's hard for her I understand. It's hard for any mother or any parent. Or whoever raised you. It's hard for them to see their kid incarcerated, especially with a life sentence."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:33",
      "upperBoundTime": "00:51:35",
      "content": "Of course."
    },
    {
      "speaker": "Alvin",
      "time": "00:51:35",
      "upperBoundTime": "00:51:36",
      "content": "You just want them home."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:36",
      "upperBoundTime": "00:51:44",
      "content": "Sure. So for you have you applied for a relief from the pardon board?"
    },
    {
      "speaker": "Alvin",
      "time": "00:51:44",
      "upperBoundTime": "00:52:35",
      "content": "Yeah. They turned me down I was denied. I resubmit again in November this year. My 5 years will be up. They told me that it was insufficient time, not enough time and the nature of the crime. So when I wrote the board and I asked them I said, \"In your bylaws it says that you had to do at least 15 years.\" I said \"I've done over 20.\""
    },
    {
      "speaker": "Alvin",
      "time": "00:51:44",
      "upperBoundTime": "00:52:35",
      "content": "I said, \"I was understanding that you couldn't use the nature of the crime because it's never going to change to deny you another hearing.\" Just come back in 5 years. I said, \"Alright.\" Now I'm waiting until November. I go, I resubmit in November."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:35",
      "upperBoundTime": "00:52:47",
      "content": "I imagine that what, the bad things about prison change over time. As you get used to certain things. What's the worst part of being in prison now?"
    },
    {
      "speaker": "Alvin",
      "time": "00:52:47",
      "upperBoundTime": "00:53:09",
      "content": "Seeing and hearing the things that are going on. You see the good things about prison where people being released like the juvenile like people that didn't hope they got hope now they're leaving."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:09",
      "upperBoundTime": "00:53:11",
      "content": "Yes."
    },
    {
      "speaker": "Alvin",
      "time": "00:53:11",
      "upperBoundTime": "00:55:03",
      "content": "But the people who had the opportunity lost their lives that I've seen. Like a friend of mine named Mathew. I knew him off the street. He go by the nickname of Pado. I saw him die, nothing violent through cancer. It ate at me. Because he was almost there. I believe he would have gone through the court system."
    },
    {
      "speaker": "Alvin",
      "time": "00:53:11",
      "upperBoundTime": "00:55:03",
      "content": "Not just him there's a few you know a lot of guys that I see that got caught up in the system. Like 21, there's a charge that they call 21 means masturbating of free women stuff like, that the system got them mentally then they lost. So it's hard for them to come back to reality of things. A lot of them got transferred."
    },
    {
      "speaker": "Alvin",
      "time": "00:53:11",
      "upperBoundTime": "00:55:03",
      "content": "A lot of the guys that I came up here with me, that got the same amount of time that I have. Because of no hope at the time and transferred over drugs. With this mojo stuff epidemic that's going on up here is destroying a lot of them. Because a lot of them are hooked on it. Even though you could see a person and see the effects of it, and how dangerous it is, they still want to do it. It's not enough for them to pull back. So they're hooked. That's an addiction now. You really don't have nothing to stop it."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:03",
      "upperBoundTime": "00:55:12",
      "content": "Is it just from an addiction standpoint is it they just want something that's not this?"
    },
    {
      "speaker": "Alvin",
      "time": "00:55:12",
      "upperBoundTime": "00:55:17",
      "content": "Yeah. That's what it is. So in their mind they're like I don't care if it kills me or not it's…"
    },
    {
      "speaker": "Marcus",
      "time": "00:55:17",
      "upperBoundTime": "00:55:19",
      "content": "It's not this."
    },
    {
      "speaker": "Alvin",
      "time": "00:55:19",
      "upperBoundTime": "00:55:31",
      "content": "…it's not this. I don't have to do this life sentence. You're not going to get nothing off this, continuing to make money off of me. I guess that's how they're looking at it. Or I'm not going to work for you anymore I'd rather go about it this way."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:31",
      "upperBoundTime": "00:55:47",
      "content": "So watching other people lose hope, fall out, the folks that you came up with, that's been the hard part for you?"
    },
    {
      "speaker": "Alvin",
      "time": "00:55:47",
      "upperBoundTime": "00:55:50",
      "content": "Yeah. It hurts because you know we play sports together, you've been around, you've been in like a net like a little circle."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:50",
      "upperBoundTime": "00:55:54",
      "content": "Yeah, like a family."
    },
    {
      "speaker": "Alvin",
      "time": "00:55:54",
      "upperBoundTime": "00:57:02",
      "content": "Where everybody wants the best for each other. But when they all started falling off man we ain't never going home they doing that, they taking this, they taking that from us. What are they doing, they started putting you in a box and start closing things down on you. So you want to act out. Some kind of way you going to act out. So that's what they think. Some of them still play in the cell blocks you know, lockdowns. Don't want to come out. It's a hurting feeling to see that guys like that just lose out. I thought I'd never see it but or really be able to process it but man it's hard."
    },
    {
      "speaker": "Alvin",
      "time": "00:55:54",
      "upperBoundTime": "00:57:02",
      "content": "I used to tell my girlfriend when she coming, my fiancé when she'd come see me I told her about some of the things and she's like, \"Man you're serious?\" I'm like, \"Yeah\" I said, \"You'd be surprised.\" I said, \"I got some many stories but I don't want to share all that with you.\" I don't need to bother you with all that."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:02",
      "upperBoundTime": "00:57:14",
      "content": "Sure. The 21 you mentioned it's one of those things that derails somebodies disciplinary record? Is that, what you mean by that. Okay."
    },
    {
      "speaker": "Alvin",
      "time": "00:57:14",
      "upperBoundTime": "00:57:19",
      "content": "It's a sex offender charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:19",
      "upperBoundTime": "00:57:21",
      "content": "Is it very common?"
    },
    {
      "speaker": "Alvin",
      "time": "00:57:21",
      "upperBoundTime": "00:57:36",
      "content": "Not at first. But now it is. Put it like when the women first started coming up and that's when it became, it was already in the books, but when the women started working up here…"
    },
    {
      "speaker": "Marcus",
      "time": "00:57:36",
      "upperBoundTime": "00:57:38",
      "content": "In insecurity?"
    },
    {
      "speaker": "Alvin",
      "time": "00:57:38",
      "upperBoundTime": "00:57:58",
      "content": "…it started, yeah in security, it started picking up more and more. That's all you hear the people ride on the 21. It was masturbating off of a woman. I'm like, \"How can you masturbate off of a woman that's fully dressed?\" You don't see nothing. But their minds are looking at them totally naked."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:58",
      "upperBoundTime": "00:58:02",
      "content": "Yeah. Okay and of course once you start…"
    },
    {
      "speaker": "Alvin",
      "time": "00:58:02",
      "upperBoundTime": "00:58:03",
      "content": "It becomes a sickness."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:03",
      "upperBoundTime": "00:58:05",
      "content": "…right. Oh I see."
    },
    {
      "speaker": "Alvin",
      "time": "00:58:05",
      "upperBoundTime": "00:58:07",
      "content": "That what happens it becomes a sickness."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:07",
      "upperBoundTime": "00:58:10",
      "content": "Okay. So you think it becomes sort of like a mental illness thing where they start doing that."
    },
    {
      "speaker": "Alvin",
      "time": "00:58:10",
      "upperBoundTime": "00:58:14",
      "content": "Yeah because it's habit forming because every time they see a woman they want to pull on themselves."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:14",
      "upperBoundTime": "00:58:17",
      "content": "Oh I see."
    },
    {
      "speaker": "Alvin",
      "time": "00:58:17",
      "upperBoundTime": "00:58:16",
      "content": "That's what why know."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:16",
      "upperBoundTime": "00:58:45",
      "content": "And then they get written up. Of course having all that stuff in your jacket becomes stigmatizing and difficult to them, I understand. So I guess in the same, along the same theme, how do you manage, how do you cope with the possibility that you may not get out?"
    },
    {
      "speaker": "Alvin",
      "time": "00:58:45",
      "upperBoundTime": "00:59:11",
      "content": "I just put everything in God's hands. I let him try to, allow him to guide my path, my footsteps and see what he's saying. My mama always told me just put everything in God's hands. Keep on praying. That's what I'm continuing to do. I believe one day that he's going to open the door and if I still have breath in my body he's going to open the door and not just for me but for those that are coming behind me."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:11",
      "upperBoundTime": "00:59:14",
      "content": "So let me ask you this Alvin, I mean you're a smart guy okay?"
    },
    {
      "speaker": "Alvin",
      "time": "00:59:14",
      "upperBoundTime": "00:59:16",
      "content": "I try to be."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:16",
      "upperBoundTime": "00:59:42",
      "content": "I know. I can see it. So when you say that that you're putting it in God's hands, is that something you're saying because that's the only way you can cope with this? You know as a, or are you turning to this as a way of making sense of this absurd situation that you are in? Or is this something that you truly believe?"
    },
    {
      "speaker": "Alvin",
      "time": "00:59:42",
      "upperBoundTime": "00:59:43",
      "content": "No this is something that I truly believe."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:43",
      "upperBoundTime": "00:59:44",
      "content": "You understand my question?"
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "Yes. That's true with biblical studies as well because I had to, it wasn't like I just adapted it. It was a process I had to go through. My grandmother on my mama's side both my grandmothers were very religious women. So it's not like I didn't know anything about religion."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "I just never understood it. Coming here it was a process because it was a sign of weakness running to the church. So it was a sign of weakness because when you first come up to prison they think you're trying to hide behind the Bible. So I had to balance that out."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "Even though I prayed on my own during my quiet time but when I started going out to church I used to question God. Why'd you allow this to happen, so it wasn't nothing that I took total accustom to because I had a lot of questions to ask God. When he went to showing me a lot of answers I've come to accept it."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "So whether my day is going to come. I'm going to put this in your hands, but it still was a challenge. Even though I'm putting this in his hands it still was a challenge of acceptance and being patient. Because at one time, at a part of my life I was really eager to get out of here."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "But when things didn't go my way I was like then didn't work out through the court system, I would be angry. I wouldn't show it but I would be angry with him. Like I stopped going to church and everything."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "But then you know like my mama said it's just a process, because I would come to understand it's not your way it's not your will it's his way and his will. So if you're going to allow God to guide your steps and believe in him you got to do things his way."
    },
    {
      "speaker": "Alvin",
      "time": "00:59:44",
      "upperBoundTime": "01:02:15",
      "content": "So that's why I say I put everything in God because I have to be patient and I have to be 100 percent faithful to him. I believe that he's going to open the doors. So when they did the thing with the juveniles then a back door with this 40 to life or 20 to life whatever. I'm like alright one door is opening. So he is making his way. It's just not moving as fast as like I wanted it to move. But it's opening."
    },
    {
      "speaker": "Marcus",
      "time": "01:02:15",
      "upperBoundTime": "01:02:28",
      "content": "Okay. Let me ask you this. Of the various things that you've accomplished over the last quarter of a century, what are you proudest of?"
    },
    {
      "speaker": "Alvin",
      "time": "01:02:28",
      "upperBoundTime": "01:03:34",
      "content": "Anger management, I mean my anger management. The class that I recently took last year. That class it helps you out a lot. It helped me out to see things from a different perspective. I've see things, when I used to be sitting in the class going through these little scenarios."
    },
    {
      "speaker": "Alvin",
      "time": "01:02:28",
      "upperBoundTime": "01:03:34",
      "content": "I'm like man, \"Why couldn't we have these classes when I first came up here?\" Everybody was able to take the class then you know worked this way out. It had anger management ties in it. I think when prison was changing over that would have fit right in. When everything was changing over for the good. With inmates you know. So thinking for a change was really you know I'm like that's the best."
    },
    {
      "speaker": "Marcus",
      "time": "01:03:34",
      "upperBoundTime": "01:03:48",
      "content": "If you do get out of here and I'm going to work on the idea that that's going to happen, at some point. What's your vision? What's your plan? What do you see yourself doing?"
    },
    {
      "speaker": "Alvin",
      "time": "01:03:48",
      "upperBoundTime": "01:05:37",
      "content": "Working with her brother as a plumber. Marrying her. And helping her raise her two daughters and the grandkids that she already has. I just want to go out and live a quiet, peaceful life with her for the rest of our lives. That's something I always tell her and that's something I'm just trying to stay focused on. I can see myself spending time with my own family."
    },
    {
      "speaker": "Alvin",
      "time": "01:03:48",
      "upperBoundTime": "01:05:37",
      "content": "I want to go out and I want to take my mama out for, just me and her for dinner one day you know just me and her. Catch up on time just to have fun like we used to. Go to the house, play with her like I used to. I'm the only one I think that used to play with her. My mom used to say \"Boy stop playing with me\" It would go through one ear and come out of the other."
    },
    {
      "speaker": "Alvin",
      "time": "01:03:48",
      "upperBoundTime": "01:05:37",
      "content": "I'm the only one probably who could get away with playing with her. She'd get mad but then she'd start laughing. Because I'm the only one at the time that just used to get out of the, don't play with me zone because I'm a kid and she's you know grown."
    },
    {
      "speaker": "Alvin",
      "time": "01:03:48",
      "upperBoundTime": "01:05:37",
      "content": "I played with her and then I started playing with her mama. Her sisters now you know everybody used to say, \"That boy is crazy.\" It was just for kicks. That's the word they used but I was just someone that the family liked to have around. I would make everybody laugh."
    },
    {
      "speaker": "Alvin",
      "time": "01:03:48",
      "upperBoundTime": "01:05:37",
      "content": "Neighbors, friends in the neighborhood. Everybody was like when I caught this charge they were like he had to mess with that boy. That's what everybody was saying."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:37",
      "upperBoundTime": "01:05:53",
      "content": "Sure. Well I've really enjoyed chatting with you and learning about your life, is there something that I should have asked you that I didn't? Something you think would be important? As part of the story of your experience."
    },
    {
      "speaker": "Alvin",
      "time": "01:05:53",
      "upperBoundTime": "01:05:55",
      "content": "Not right at this moment."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:55",
      "upperBoundTime": "01:05:56",
      "content": "That's fine."
    },
    {
      "speaker": "Alvin",
      "time": "01:05:56",
      "upperBoundTime": "01:06:04",
      "content": "Because I'm so, I'm really amped about everything that's going on. Because I'm really enjoying this as well. I really can't come up with something."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:04",
      "upperBoundTime": "01:06:17",
      "content": "It's all good, I usually ask that question just because you know, if there is something important you want to talk about and I didn't give you a chance to do so. I want to give you that opportunity but it doesn't mean it has to be something to talk about."
    },
    {
      "speaker": "Alvin",
      "time": "01:06:17",
      "upperBoundTime": "01:06:20",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:20",
      "content": "It is a good place to start."
    }
  ]
}
