{"name":"","transcript":[{"content":"Anthony Hingle REDACTIONS FINAL"},{"speaker":"Anthony","time":"00:00:00-0","content":"My name is Anthony Hingle, convicted for 2nd degree murder. I was 18 at the time. So far I've been incarcerated 29 years and some months."},{"speaker":"Marcus","time":"00:00:17-9","content":"Okay, so I'm going to start by asking you a few questions about your childhood and coming up, up to the age of 18, then we'll switch gears in a little bit and talk about what brought you here and your time at Angola. First, can you just tell me a little bit about the folks who raised you, your family?"},{"speaker":"Anthony","time":"00:00:44-8","content":"My parents, my mother and my father, fortunately, I was blessed to have both of them in the same home, in fact, still to this day they still married living together. So my mother and my father raised me."},{"speaker":"Marcus","time":"00:00:57-1","content":"Okay, tell me a little bit more about them."},{"speaker":"Anthony","time":"00:01:00-6","content":"My mother, she worked mostly like in retirement homes, old folks homes. Guess it was something like healthcare. My father, he was a cook, he also worked as a cable installer, underground installer."},{"speaker":"Marcus","time":"00:01:23-1","content":"Where did you grow up?"},{"speaker":"Anthony","time":"00:01:21-8","content":"New Orleans, Louisiana."},{"speaker":"Marcus","time":"00:01:24-7","content":"Where?"},{"speaker":"Anthony","time":"00:01:27-7","content":"7th ward."},{"speaker":"Marcus","time":"00:01:29-7","content":"Okay, what street?"},{"speaker":"Anthony","time":"00:01:32-9","content":"Annette Street not too far from St. Augustine high school."},{"speaker":"Marcus","time":"00:01:35-5","content":"Okay, sure."},{"speaker":"Anthony","time":"00:01:31-6","content":"That area around."},{"speaker":"Marcus","time":"00:01:33-7","content":"What about siblings, you have siblings?"},{"speaker":"Anthony","time":"00:01:41-5","content":"I have a brother, one brother, a younger brother. He's 3 years younger than me."},{"speaker":"Marcus","time":"00:01:40-3","content":"Okay, what's he up to?"},{"speaker":"Anthony","time":"00:01:41-8","content":"Right now he's working construction and with a little bit plastering also."},{"speaker":"Marcus","time":"00:01:46-1","content":"Are you close?"},{"speaker":"Anthony","time":"00:01:44-8","content":"Yeah, real close coming up, still to this day. He actually lives with my parents now, being that they got up in age, he want to be right there close to them, or with them kind of overseeing them."},{"speaker":"Marcus","time":"00:02:10-3","content":"Who visits you up here, still?"},{"speaker":"Anthony","time":"00:02:15-9","content":"Because of my decision, the last couple of years going back and forth to court, I kind of slowed them up on visits, it's kind of hurting me to see my mother in age coming up here. And then my wife she still comes, my cousins, my brothers. They will come but I'm kind of like, I don't need no visit I'm tired of you all coming and visiting I'm trying to get there to you all."},{"speaker":"Anthony","time":"00:02:15-9","content":"You all see me when I come in court. I come to court like every month, they'll get to see me doing all right, and then I see that they're doing all right. But just sitting at the visiting table with my mama just looking at the age on her, I'm like, man my mama too old for this. So I'd rather just do without visits."},{"speaker":"Marcus","time":"00:03:03-5","content":"Sure, it can be more difficult."},{"speaker":"Anthony","time":"00:03:05-5","content":"But I mean at the drop of a dime I tell anyone I need them and they coming. And with family I'm blessed in that area, got a real supportive family."},{"speaker":"Marcus","time":"00:03:16-9","content":"Great, is it fair to say that coming up you felt loved and supported and nurtured and had adults who took an interest in you?"},{"speaker":"Anthony","time":"00:03:27-7","content":"Yes, in every way. I'm talking about not just my parents, my grandmothers both of them, my aunties, my uncles, my cousins. All the children and cousins kind of looked at me as the big brother they ain't never had because I was the oldest in the family. So all my little cousins kind of looked up to me. My aunties, my uncles, you'd probably hear them say I was the favorite, probably because I was the oldest."},{"speaker":"Marcus","time":"00:04:00-1","content":"Okay, yeah. Who did you get along with best with coming up? Is there somebody you can pick or is it just the whole family?"},{"speaker":"Anthony","time":"00:04:07-0","content":"It's kind of hard to pick, it's kind of hard to pick. Because like I said, with the family being so close. You'd spend days with this aunt and uncle, you'd spend days with that aunt and uncle. You'd spend time with these cousins, these cousins. It's kind of hard to pick one."},{"speaker":"Marcus","time":"00:04:28-6","content":"Yeah, that's fine. I'd have a tough time doing that too."},{"speaker":"Anthony","time":"00:04:32-7","content":"It's kind of hard."},{"speaker":"Marcus","time":"00:04:34-5","content":"So I think I'm fairly familiar with your neighborhood. Because it's now some time ago, 30 years ago. You and I are the same age, if we go back to your teens, say early 80s or so, and I'm at your house, looking out into the neighborhood, can you paint a picture for me? What's the daily sort of scene?"},{"speaker":"Anthony","time":"00:05:10-4","content":"On our block, you wouldn't really see extra drama or nothing like that. It was kind of quiet and peaceful at that time around there. In fact that was one reason why we moved to that neighborhood. It was pretty much calm and quiet around there, certainly you probably would go to, probably would be a rowdy or a little drama here a little drama there."},{"speaker":"Anthony","time":"00:05:10-4","content":"Say for instance, playing park ball in a hall, we could be in the park playing and feel like being in the park was almost like the safe zone, because nothing would really happen in the park. But while we in the park playing ball, you can see right through the fence, on the other side of the fence somebody might be getting beat with a hammer."},{"speaker":"Anthony","time":"00:05:10-4","content":"Somebody may be getting robbed at gunpoint, somebody might be getting shot. But it looked like it never happened in the park, so we would feel safe and just be going on with our sports, or whatever like nothing on the other side of the fence was even happening."},{"speaker":"Marcus","time":"00:06:18-7","content":"Sure. Were you near a housing project at that time?"},{"speaker":"Anthony","time":"00:06:24-7","content":"St. Bernard project was maybe a mile a mile and a half."},{"speaker":"Marcus","time":"00:06:32-1","content":"Okay, that's right. What about school, do you have any specific memories from school, did you like school?"},{"speaker":"Anthony","time":"00:06:38-5","content":"Yeah I did, I actually did. I actually did."},{"speaker":"Marcus","time":"00:06:42-8","content":"How did you do in school?"},{"speaker":"Anthony","time":"00:06:44-5","content":"Pretty fair till I started tripping I guess. Elementary was like a breeze, junior high was like a breeze, senior high. I had to go to summer school twice, actually I had to go to summer school to graduate. But, the thing when I went to summer school for my 10th grade year to go to 11th grade, it was going from junior high to senior high, I felt like I was in school with adults."},{"speaker":"Anthony","time":"00:06:44-5","content":"I remember going through orientation and it's like the guys that was juniors, and seniors, and the girls, they kind of like men and women. And I guess by me being small, I was really small, I was like kind of fearful or whatever about them and about what I was going to have to do to fit in, how I'm going to look older. So I couldn't look older, so I guess I thought I had to do things to make me seem older like I was their age."},{"speaker":"Marcus","time":"00:07:53-9","content":"Like what?"},{"speaker":"Anthony","time":"00:07:55-6","content":"Whatever I seen them doing. If I see those bringing headphones and a little Walkman to school, I'd bring that to school. Actually got put out of school for bringing one. Headphones and a Walkman, something just that simple. I'd seen an older kid doing it and you know, so."},{"speaker":"Anthony","time":"00:07:55-6","content":"My senior year, I had to go to summer school again, because I actually had before classes, my senior year. And my 4th period was my last class, was English. Some kind of way I just adapted to good, to a point where I wouldn't have to go through the whole week, I could just show up on test day and pass the test."},{"speaker":"Anthony","time":"00:07:55-6","content":"But the teachers are like no that's not happening, you got to come every day. If you're not going to come every day I'm going to fail you. So I stopped going. So it turned in to me just having 3 classes, after 3rd period I was gone. Started working part time, and she actually failed me. I had to go to summer school to graduate."},{"speaker":"Marcus","time":"00:09:02-2","content":"Okay. What kind of part time work were you doing?"},{"speaker":"Anthony","time":"00:09:05-1","content":"Restaurant, Cocky Ks on Canal and Carrollton. When they closed I started doing valet parking at hotel intercontinental on St. Charles and Poydras."},{"speaker":"Marcus","time":"00:09:21-2","content":"Sure. Any other jobs you had in high school?"},{"speaker":"Anthony","time":"00:09:25-5","content":"One of the very first jobs I had was like about 14, I had programs, summer jobs, at a daycare center. I was actually chose to be a teacher assistant. Though I was only 14, I just had to help with the younger kids. Helping them do them paintings and stuff like that. That was like my very first job."},{"speaker":"Marcus","time":"00:09:52-4","content":"Okay. So what were you doing for fun? You mentioned being the park, sports and various things. As a teenager, what did you do in your down time? What was fun for you?"},{"speaker":"Anthony","time":"00:10:10-0","content":"I would say messing with the little girls. It's like when I kind of got to high school, started getting girlfriends, seeing them. And I guess when I watched my dad with my mom it kind of was like, I wanted to do that. I wanted to have my little girlfriends, be with my little girlfriend almost every day, all day."},{"speaker":"Anthony","time":"00:10:10-0","content":"And being able to buy her stuff, and just keeping her happy. I wanted her to be my girlfriend. That's how it was when I first started. But once I started working, I guess I wanted to start partying, going here going out."},{"speaker":"Marcus","time":"00:10:59-3","content":"Had a little money."},{"speaker":"Anthony","time":"00:11:01-6","content":"Had a little money from working, and kind of feeling like I'm pretty all right. Had my own little car. Working full time now, because I had graduated. But it looked like that's what men was doing, they were working. Once work was over, it was time to play. And they played by going to parties and going to the club. That's what I eventually the kind of got into."},{"speaker":"Marcus","time":"00:11:27-2","content":"All right. Any special girlfriends that come to mind?"},{"speaker":"Anthony","time":"00:11:32-1","content":"No, not right now. I'm married, been married since 2000."},{"speaker":"Marcus","time":"00:11:36-6","content":"Okay, well let's change gear here a little bit. Tell me about that, how did you meet your wife?"},{"speaker":"Anthony","time":"00:11:42-2","content":"I actually knew my wife before I was incarcerated. She was the sister of one of my friends. And that's how we knew each other. I kind of used to look at her like a sister, being that she was my partner sister. But once I got incarcerated, he had got in touch and started to come visit me; and she wanted to come visit me too. So she started coming to visit, but after a while he had wind up getting killed."},{"speaker":"Anthony","time":"00:11:42-2","content":"And it seemed like after he wind up getting killed, she kind of withdrew from a lot of stuff. She kind of isolated herself."},{"speaker":"Anthony","time":"00:11:42-2","content":"So she disappeared for some years. Then around '98, she wind up getting back in touch with me and we started getting involved. Because when she was coming the first times she was just coming as like a little sister. We started getting involved, fell in love with each other and wound up getting married in 2000."},{"speaker":"Marcus","time":"00:12:37-3","content":"Wow."},{"speaker":"Anthony","time":"00:12:39-5","content":"Yeah."},{"speaker":"Marcus","time":"00:12:42-1","content":"Yeah you've been married for a while now."},{"speaker":"Anthony","time":"00:12:44-6","content":"18 years, it ain't easy bro."},{"speaker":"Marcus","time":"00:12:43-7","content":"So she comes up here fairly regularly I guess, and you said you kind of wanted them to stop."},{"speaker":"Anthony","time":"00:12:52-2","content":"Yeah."},{"speaker":"Marcus","time":"00:12:55-1","content":"Yeah but still, 18 years is a fair about of time to deal with this particular challenge. Any kids?"},{"speaker":"Anthony","time":"00:13:03-2","content":"Situation it is. Together we have 4 kids, I have 1, and she has 3."},{"speaker":"Marcus","time":"00:13:09-3","content":"So you had one before you came here. Tell me about that kid, is it a boy or a girl?"},{"speaker":"Anthony","time":"00:13:15-4","content":"He, my son. He's actually a Dillard graduate in psychology. Him and his wife, both of them psychology majors, graduates. They're both doing the social work right now. They're in New Orleans, living not too far from Dillard, raising their son."},{"speaker":"Marcus","time":"00:13:32-5","content":"What's our relationship like with him?"},{"speaker":"Anthony","time":"00:13:35-1","content":"We're pretty good, pretty good. It's amazing the relationship we got, you know. When I got incarcerated he was 6 months old."},{"speaker":"Marcus","time":"00:13:43-6","content":"Do you have any kind of relationship with his mother?"},{"speaker":"Anthony","time":"00:13:47-5","content":"Not necessarily, I mean we can talk but, we don't need to talk. He's a grown man."},{"speaker":"Marcus","time":"00:13:55-1","content":"So I'm going to get you to explain the circumstances that got you into this particular situation but prior to that, sounds like you're leading a fairly conventional life. Were you getting in trouble with the law at all?"},{"speaker":"Anthony","time":"00:14:16-4","content":"I think at the age of 15, I got arrested for stealing from Maison Blanche. Me and a friend of mine, just left school at went to Maison Blanche, grabbed the bag form behind the counter, went and put clothes in there and tried to walk out. We went to jail for that. And me and the same guy, I went with him to cash a check that he found in the park, and got arrested again. About the only those two times I've been in trouble."},{"speaker":"Marcus","time":"00:14:47-9","content":"So just those two things, but no prior arrests and convictions for other things?"},{"speaker":"Anthony","time":"00:14:56-1","content":"As an adult no, this is my first offense. It was two juvenile charges."},{"speaker":"Marcus","time":"00:15:01-3","content":"If you had to identify a main reason that this happened, what would it be? I'll tell you why I ask that. Some people I think get into a lifestyle, and if it wasn't this, it would be something else, or some people its drug addiction and they get into a particular pattern. Was it anything like that? Or how do you look back on it and make sense of it now?"},{"speaker":"Anthony","time":"00:15:31-8","content":"I actually was set to go to the military, that's what I wanted to do, I wanted to go to the marines. But when I started working, having my own car, I thought I was straight. Then my son mama was pregnant at the time, she was going to have my son."},{"speaker":"Anthony","time":"00:15:31-8","content":""},{"speaker":"Anthony","time":"00:15:31-8","content":"Because he was 6 months old when I got incarcerated. But even through her pregnancy, I was working, I was thinking I was straight. So I ain't got to go to the military. I can get involved around school, because I used to cut in the neighborhood."},{"speaker":"Anthony","time":"00:15:31-8","content":"So I'm thinking that's the route I was going to take. But at the same time too I'm still trying to do manly things, what I'm seeing in the neighborhood, what I'm seeing from my dad and with my mom. They got this little relationship, they married, and that's a good thing. That's what I want."},{"speaker":"Anthony","time":"00:15:31-8","content":"At the same time too when I see guys in the street carrying guns thinking that's what make them the man. I'm also doing that as well. So I'm mixing the two things, the good and the negative. And me just buying a gun, having a gun, I think that was my downfall."},{"speaker":"Marcus","time":"00:16:38-8","content":"Yeah?"},{"speaker":"Anthony","time":"00:16:40-8","content":"Yeah. If I wouldn't had the gun, or if I wouldn't had the misconception about what it takes to be a man, I wouldn't have never bought the gun. So I think my misconception about what it takes to be a man."},{"speaker":"Marcus","time":"00:16:55-8","content":"Yeah, that makes perfect sense. So what about drugs and alcohol, do they play a role in any of this?"},{"speaker":"Anthony","time":"00:17:03-0","content":"I never got loaded or drunk in my life."},{"speaker":"Marcus","time":"00:17:05-6","content":"Wow."},{"speaker":"Anthony","time":"00:17:07-4","content":"Never. It's crazy because a lot of people said you're the only person I know that's never got drunk or loaded. I just never had a thing for it. Once I started messing with them little girls I felt like that was my time right there. That's what made me feel good."},{"speaker":"Marcus","time":"00:17:26-2","content":"Sure. Let me ask you this, you had some ideas about maybe the military, got some other things going on. Let's say this hadn't happened. Let's say you never invited to that party that night. How do you anticipate the rest of your life would've gone? I'm sure you've spent a lot of time thinking about what if."},{"speaker":"Anthony","time":"00:17:48-3","content":"I think it was a strong possibility I could've wound up at a barber shop, but then at the same time too, I know a lot of guys that came up in my area, or came up in our neighborhood that's dead, you know. And not so much that they was really deep off into the streets, but I kind of ventured in some of the same places they did when I thought it was time to party. So I don't know how that would've played out."},{"speaker":"Anthony","time":"00:17:48-3","content":"But on a positive tip, I think I probably would have made it through barber school and open my own business, my own barber shop. Because I even till today I still have a love to do that. That's what I do up here. I volunteer. I'm not assigned to the barbershop, and I volunteer, on top of my reentry. I use that as an opportunity kind of to get at some of them individually."},{"speaker":"Anthony","time":"00:17:48-3","content":""},{"speaker":"Anthony","time":"00:17:48-3","content":"I can really get their time and their attention, you ain't going to get out my chair until I finish cutting your hair, so whatever I want to say to you, you're going to hear, whether you want to hear it or not. I kind of use that as an opportunity to share my testimony with them."},{"speaker":"Marcus","time":"00:19:11-5","content":"One last question about the firearm. You said that you felt like you were pretty small than some of the other guys your age. That you thought that particularly as you were coming up in high school, looking at the upperclassmen and women. Do you think that was also part of the reason why you had a firearm?"},{"speaker":"Anthony","time":"00:19:35-3","content":"It could be, because I said, just from being in the park, you'll see things happening on the outside of the park. But I can remember a time in elementary school, I'd seen a dude punch a little girl probably was about 6th grade. So she had to be about 12, 13."},{"speaker":"Anthony","time":"00:19:35-3","content":"But when he punched her, he almost killed her, I mean that's what the paramedics said. Because she was stuck, she couldn't even move, she was just standing there. Her nose is running with blood, like flowing. He could've pushed her nose in a killed her. That was once incident that I remember that kind of stuck with me."},{"speaker":"Anthony","time":"00:19:35-3","content":"And in senior high, I remember seeing maybe 6 or 7 guys jump the fence of our school and come in there, and beat 2 guys. I'm talking about real bad, to the point when they couldn't get up. Paramedics had to come and get them. So it could have been a mixture of that too, that could've been in the back of my head. Not so much just thinking, but that's what men did. It could've been there too in the back of my head."},{"speaker":"Marcus","time":"00:20:45-7","content":"Sure. I meant to ask you, what was the name of your high school?"},{"speaker":"Anthony","time":"00:20:49-8","content":"Senior high. That was the senior high, in junior high I went to Claude, on St. Claude. Elementary, obviously Cowan in the 7th ward."},{"speaker":"Marcus","time":"00:20:59-8","content":"Okay. So, I want to switch gears a little bit and talk about what happened since when you turned yourself in. But is there something I should have asked you about your experience in childhood that I did not ask you? Just too sort of capture your experience and who you are."},{"speaker":"Anthony","time":"00:21:32-2","content":"Alright I want to say this, even with everything I experienced so far, even with me being an inmate offender, being convicted of a violent charge. I was never a bad person. I just made the wrong decision. I was never a bad person. I was the big brother of the family, the whole family."},{"speaker":"Anthony","time":"00:21:32-2","content":"Everybody looked up to me. I was always caring, I looked after my little brothers, my little cousins. All my aunties, they'd be like we need you to come baby sit, come sit with the children, this and that. I was never a bad person."},{"speaker":"Marcus","time":"00:22:11-9","content":"Yeah and it sounds like that because you have this very big supportive family that is by your side 30 years later. So they must have recognized that in you as well. So, did the reality of a life without parole sentence set in?"},{"speaker":"Anthony","time":"00:22:31-8","content":"Oh yeah. A long time ago."},{"speaker":"Marcus","time":"00:22:34-8","content":"Okay, how did that set in? I imagine you did a little bit of time in the parish."},{"speaker":"Anthony","time":"00:22:41-8","content":"Maybe 2 years in the parish before I come up here."},{"speaker":"Marcus","time":"00:22:45-8","content":"Okay, going through all this. So then you get convicted and sentenced. When they sentenced you to life without parole. Did you understand what that meant?"},{"speaker":"Anthony","time":"00:22:53-8","content":"I'm not sure. But I knew getting found guilty, I was weak in my knees, just hearing the man say guilty. I was actually, I think I probably even buckled a little bit. But I couldn't have thought life meant life. Because I never felt like I was going to be here the rest of my life."},{"speaker":"Anthony","time":"00:22:53-8","content":"I always felt like I'm not going to die in a penitentiary. Mostly I'm going to do 5-10 years something like that, and go back. And I think that's what helped me in the very beginning, but I think after being here a while, started associating with other inmates and older guys. I went to hearing that from them, that life meant life. And they even the first time I heard it from one of them I didn't believe it. Until I hear one of them saying how long they had been incarcerated."},{"speaker":"Anthony","time":"00:22:53-8","content":"I've been here 35 years and I still feel it in his voice. I think that's when I kind of woke up and realized man, they meant life. They actually meant life."},{"speaker":"Marcus","time":"00:24:12-1","content":"So this is one of the things that I'm trying to really get to the bottom of, is how does one cope with that?"},{"speaker":"Anthony","time":"00:24:22-4","content":"I want to say, not just for myself, but I believe I used my family. Because like I said they come regularly, they was coming regularly, until I actually stopped them and slowed them down. But I also wanted to be presentable when they come, I don't want them coming up here trying to look, and see I kind of gave up or something."},{"speaker":"Anthony","time":"00:24:22-4","content":"So I'm taking care of myself, and I'm working out, trying to watch what I eat, to make sure I'm staying healthy, waking up every morning. Because even though you got a few people going home, now you got people dying up here too."},{"speaker":"Anthony","time":"00:24:22-4","content":"And I tell people all the time, in my opinion that's the only 2 group of people that have any significance to it. The ones that go home and the ones that dying. Anything else in between doesn't matter."},{"speaker":"Marcus","time":"00:25:16-4","content":"Can you explain that a little bit more?"},{"speaker":"Anthony","time":"00:25:19-8","content":"You have so many distractions up here, you know, you got this, you got sports, you got the clubs, you got all kinds of other recreation going on to the point where people lose focus. Now some of them ain't thinking about going home."},{"speaker":"Anthony","time":"00:25:19-8","content":"So an example, actually I was playing football up here, organized football, and my first court order was in '93. And I went to practice that day, but I wasn't going to practice, I was just going out there to look at a few guys practice, let them know I'm not practicing today, because I got a court order tomorrow, my first court trip."},{"speaker":"Anthony","time":"00:25:19-8","content":"And when I told that to some of them, like court order, they were like what you mean, what that is? Some of them didn't even know what that mean. And that kind of really messed me up, like where you at man? You out here playing football but you ain't got nothing going in court. And a lot of them was like that. And that's what I mean by, regardless of what you get off in between. Man, if you ain't trying to go home or going home, you know you'll die in here."},{"speaker":"Marcus","time":"00:26:36-6","content":"Yeah, makes sense to me. So what was your time in the parish like? Because to this day, people will say it's one of the worst places you could possibly be on earth."},{"speaker":"Anthony","time":"","content":"00:27:01-4"},{"speaker":"Marcus","time":"00:27:07-2","content":"Calvin was telling me a little bit about his time in there. To me it's just crazy. And everything I hear about it today is pretty much the same. But this place has changed while that place has not, that's what the thing is. How was it for you?"},{"speaker":"Anthony","time":"00:27:23-3","content":"I guess you would say, the living conditions is real poor. You might have mold everywhere. How you're eating, the foods been delivered to you from somewhere it's being cooked. But it don't look like it was handled properly, or something like that, but you got to eat to survive. I ain't have no problems in the parish."},{"speaker":"Marcus","time":"00:27:45-7","content":"Okay, what about violence?"},{"speaker":"Anthony","time":"00:27:47-4","content":"You see a lot of it in the parish, you see a lot of it. I guess everybody tensed up, stressed out, fighting charges or whatever."},{"speaker":"Marcus","time":"00:27:59-8","content":"So you spend 2 years there, you're 20 or so, then you come up to Angola for life. Do you remember that bus ride?"},{"speaker":"Anthony","time":"00:28:10-6","content":"Yeah. Ain't nothing like it is when you travelling at night. When I come up here it was a dirt road full of potholes. When the bus driver went over potholes it looked like we were about to go over a ditch. I was real scared, like man where they taking me, in the middle of nowhere."},{"speaker":"Marcus","time":"00:28:10-6","content":"What's going through your head?"},{"speaker":"Anthony","time":"00:28:36-9","content":"I guess you're nervous, and I guess fearful in some ways, you don't know what to expect, you don't know where you going. And coming down this road here don't make it no better."},{"speaker":"Marcus","time":"00:28:50-5","content":"What were you first few weeks and months like here?"},{"speaker":"Anthony","time":"00:28:56-5","content":"When I first got here, I was still a small guy, when I was in the parish- when I got arrested I was like 105, I think by the time I come up here I maybe was 121. So I'm still small, still short in height. So, I think they put me in a one man cell in extended lockdown, because I looked so young. So I think I stayed back there maybe a month."},{"speaker":"Marcus","time":"00:29:22-5","content":"Was it a working cell?"},{"speaker":"Anthony","time":"00:29:29-1","content":"No you just in that cell all day 24 hours a day- 23 hours a day."},{"speaker":"Marcus","time":"00:29:36-6","content":"And presumably for your own safety."},{"speaker":"Anthony","time":"00:29:40-0","content":"I assume that's what it was, because I had never got in trouble in the parish for them to put me on extended lockdown."},{"speaker":"Marcus","time":"00:29:45-9","content":"Were you relieved to be by yourself there or did you see it as punishment?"},{"speaker":"Anthony","time":"00:29:51-0","content":"Yes, I believe so. I believe so. Just being back there for a second, and I'd say, more than once, you're seeing different things. That was at Camp J, you got all kinds of stuff going on back there. You can't get to each other really fist fights, so you got guys in there throwing waste on each other, urine on each other, you know. I'm like dang, where I'm at man. All I could do is stay in my cell, try to sleep in my cell, there were too many people. I didn't do too much talking, I wasn't trying to be making no friends, wasn't looking for no friends."},{"speaker":"Marcus","time":"00:30:31-8","content":"That was for a month?"},{"speaker":"Anthony","time":"00:30:35-6","content":"Maybe a month I think I stayed back there."},{"speaker":"Marcus","time":"00:30:38-2","content":"Then where'd you go?"},{"speaker":"Anthony","time":"00:30:40-3","content":"Up here to this cell block, CBC."},{"speaker":"Marcus","time":"00:30:44-1","content":"Okay."},{"speaker":"Anthony","time":"00:30:45-2","content":"Working cell block."},{"speaker":"Marcus","time":"00:30:44-4","content":"Okay, that's a two man cell?"},{"speaker":"Anthony","time":"00:30:46-3","content":"Yeah."},{"speaker":"Marcus","time":"00:30:48-1","content":"You remember your first cellmate?"},{"speaker":"Anthony","time":"00:30:49-6","content":"Yeah, a guy named Paul Robinson. I don't know if he actually went home or if he just went into cell. But he had numbers for a robbery charge. So he might be gone home. He was a pretty cool guy, had been here some years before me. Say maybe 10, 12 years."},{"speaker":"Marcus","time":"00:31:08-3","content":"Were you in the field? Working in the field?"},{"speaker":"Anthony","time":"00:31:12-9","content":"Yeah. Back then thought when you first come up here, first time you're in the field they'll give you half off, then they expect you to work that whole every day. They'll give you the second half off, that's just for a couple of days, after that you out there all day. That was kind of crazy."},{"speaker":"Marcus","time":"00:31:29-3","content":"Every day, all year long."},{"speaker":"Anthony","time":"00:31:33-2","content":"Yeah, Monday through Friday. And if you got some kind of write up, you might go to disciplinary court and get extra dues that means you're working on the weekends too. They only days you might be off is holidays or it's raining."},{"speaker":"Marcus","time":"00:31:33-2","content":"So, at this time, is it sinking into you that it's possible that you, this is it? Or are you still thinking oh I've got another 5, 10 years maybe."},{"speaker":"Anthony","time":"00:32:02-4","content":"I would like to think I'm going home this year sometime. And I'm trying to always be optimistic, you know, you have to always be hopeful."},{"speaker":"Marcus","time":"00:32:12-3","content":"I understand that. I mean at that time. Are you thinking, oh I'll be out of here soon, or are you actually trying to confront the idea of how am I going to live the rest of my life here."},{"speaker":"Anthony","time":"00:32:26-6","content":"No, it still wasn't setting in on me then, it still wasn't setting in on me. I was up here, when I first got here, I wasn't talking to a lot of people. So I had to be here for a little while before I actually started talking and associating with people. That's when a couple of older guys would come to you and be like you know life means life. That's when it started hitting, and I guess from then I still wasn't trying to accept it."},{"speaker":"Anthony","time":"00:32:26-6","content":"My thing that kept me going was my family, them coming to see me every other week or so. It kept me going to the point where I wasn't seeing no life sentence. And that's how it be a lot of times, you be distracted with other things to the point where years ago are passing by. 10 years then pass, 20 years then pass and you ain't even realize it."},{"speaker":"Marcus","time":"00:33:15-3","content":"And it sounds to me, from what you've said. That you spent quite a bit of that time actually fighting your case and following it through the courts. So, when you're engaged in that practice, you think you're doing this to get home. It's less likely if you're hopeless maybe."},{"speaker":"Anthony","time":"00:33:30-0","content":"Yeah."},{"speaker":"Marcus","time":"00:33:31-7","content":"Do you see a lot of people just give up?"},{"speaker":"Anthony","time":"00:33:35-4","content":"It's crazy. Even now, in today's time, a lot of people been going home, more than ever. When I first got here you might see one person make a parole board every 2 years. Now they actually going home, but it's been that way for so long, where nobody was going home. People gave up so long ago, till now, you got life at the end of the tunnel. They don't even see the lights, like they're closing their eyes. Because they gave that hope up so long ago, it's like they don't want to start being hopeful again, and getting rejected."},{"speaker":"Anthony","time":"00:33:35-4","content":"So they'd rather just stay in their non-optimistic mood. I'm not going home. Just to try to keep you at bay, keep you from or going crazy. I know I ain't going home. You actually hear stuff like that."},{"speaker":"Anthony","time":"00:33:35-4","content":"You actually hear people saying that I did my will, just to make sure I'm not buried up here, I get buried somewhere else. Or you might hear I did my will to make sure my people don't spend no money on the funeral, just let them bury me up here. I can't even start thinking about something like that. I can't see it."},{"speaker":"Marcus","time":"00:34:59-3","content":"Yeah, there has to be some effect of seeing people every month getting buried out at Point Lookout. That's got to have an effect on folks out here, you know?"},{"speaker":"Anthony","time":"00:35:11-9","content":"I actually have a job, matter of fact yesterday, my job, we cut grass and that's one of the spots we cut grass around Point Lookout. And seeing all of them burials, before a little while, since I been up here, I was working at the hospital. I was I guess a [00:35:32] then and then they changed the label to healthcare [00:35:32]."},{"speaker":"Anthony","time":"00:35:11-9","content":"And I was working for the medical patients in the dormitory, but being on wards, I've seen so many people dying up here. It's crazy you know, because especially in the ward, it like when one dies, two more follow. You know, within that week you might three or four people die and the next week you might have three or four funerals. It's crazy you know."},{"speaker":"Anthony","time":"00:35:11-9","content":"In fact, I can remember the first person died when I was working over there. You know, Harley was training me and the guy was dying from cirrhosis of the liver and he had kept vomiting and throwing his liver up, we'll clean it up. Ten minutes later, vomit again everywhere we'd clean up. One of the last times he vomited, the nurses was like he was out, he was gone, that was it."},{"speaker":"Anthony","time":"00:35:11-9","content":"So she told me and a guy to go get the gurney, you know, put him on a gurney and put him in the freezer. But the Olly who was training me, he didn't hear the woman say that."},{"speaker":"Anthony","time":"00:35:11-9","content":"So when we come back with the gurney, he wiping the dude down, trying to cool him off with a cool rag. I'm like, \"What you doing?\" He's like \"I'm trying to cool him off.\" I'm like, \"The dude died before we went and got the gurney.\""},{"speaker":"Anthony","time":"00:35:11-9","content":"That was the first dude died while I was working down there. It kind of messed me up. Kind of messed me up. And I think now I see where you at, I think that kind of hit me to the point well if I don't go home, that's my reality, growing old and dying in there."},{"speaker":"Marcus","time":"00:37:05-1","content":"Yeah, you know. One of the things that I've found when I've talked to a lot of guys who work hospice, it's similar to being a healthcare volunteer, that you're confronted on a daily basis with this. It's while you're doing this great service, it must be very difficult to do."},{"speaker":"Marcus","time":"00:37:05-1","content":"So, obviously you've spent almost 30 years here and you're clearly a different person than you were. We are all different after 30 years. Can you describe what your typical day is like now? From when you get up in the morning to when you go to bed at night, what fills your day?"},{"speaker":"Anthony","time":"00:37:05-1","content":"Right now, I'm assigned to a Trustee phone line called 15-8. We ride a yellow bus, a dirty yellow bus where we eat, and then we drive from this area, and cut this grass, to that area and cut that grass, that's for maybe 7:00 to maybe 3:00. But let me rewind a little bit."},{"speaker":"Anthony","time":"00:37:05-1","content":"I wake up every morning at 4:30 to get to the restroom before a lot of other people. Get to a clean sink to brush up, clean up. I go to breakfast at 5:40, soon as shift change. Straight from breakfast, I'm going to the gym. I might get my 45 minute workout 6:00 to about 7:00."},{"speaker":"Anthony","time":"00:37:05-1","content":"We go to work about 7:15. I want to try to stay healthy so I'm able to keep waking up every morning and I don't want to die in there. But once I'm up for work at 3:00, I might take me a shower, lay down, I might go to the library or come upstairs and get involved in some kind of educational stuff, trying to keep my mind occupied with some positive, something like that."},{"speaker":"Anthony","time":"00:37:05-1","content":"I might cut some hair, I might catch up with some patients in the medical dorm, wants to get groomed up you know. I kind of feel like the patients, you know, some of them are bitter, some of them are grouchy because they have a medical condition and they are locked up with a life sentence or whatever so if I'm able to groom them up, you know, that kind of lifts their spirits sometimes and kind of feel good doing that."},{"speaker":"Anthony","time":"00:37:05-1","content":"I might catch a re-entry mentee you know, cut his hair for a second where I can kind of get on him and share my testimony with him, just say a few words to him to kind of see where I can help at. I mean, I don't want to be forced to do my part, like I don't want to be assigned to re-entry."},{"speaker":"Anthony","time":"00:37:05-1","content":"I don't want to be assigned to working on the wards, but I'm able to volunteer, I feel like that's where my blessings coming at. I feel like God gave me that compassion to help people. That's what I'm doing."},{"speaker":"Anthony","time":"00:37:05-1","content":"I actually had a program I started where I was picking 10 re-entry mentees every Saturday, every other Saturday. I bring them on the ward, the hospital ward. I was calling the program \"The Reality of a Life Sentence\" because they pretty much coming up here still, getting an education, go back home, be productive, but in the midst of that, they not really seeing the real life sentence."},{"speaker":"Anthony","time":"00:37:05-1","content":"Don't get me wrong, they're being mentored by guys that got life sentence, but you might see a guy that's mentoring you groomed up, taking care of his-self, eating good and you don't really see the life sentence, so you're missing it. You just thinking I go you know, sometimes your mind not changing. You go out there, make better decisions."},{"speaker":"Anthony","time":"00:37:05-1","content":"And so I was bringing them on the wards and I'm like if I take them in the ward, I might tell them you all going to see some guys that's laying in their beds, balled up with diapers on, you know they are kind of deteriorated to the point where they can't get up and take they bathroom business so they got to lie there in their own stink until somebody can come along and clean it."},{"speaker":"Anthony","time":"00:37:05-1","content":"So don't look at them in a shameful way, look at them what it is. That's the reality of a life sentence. This is what the state wants from you. And they want you to grow, lose your health, and sit in one of these beds, till they put you in hospice, one of the rooms that you die by yourself with a guy that's in hospice."},{"speaker":"Anthony","time":"00:37:05-1","content":"And it was, I got some positive feedback from it. I mean, some guys that you thought in re-entry that you kind of see, look like they were not changing, they were actually feeling and seeing it because I'm showing them guys, this guy have been locked up for 40 years, this guy has been locked up for 50 years, 53 years, and the people still not wanting them to go home."},{"speaker":"Anthony","time":"00:37:05-1","content":"He bound in the bed, what can he do? How can he be a threat to society in any kind of form or fashion? But I'm like \"This is what the state wants for you too. They send you up in this program that you get your job, your trade, you go back out there, but they hoping you do mess back up again, and you mess up in a worse way, this is where you're at bro. So it's on you to go out and make the right decisions to stay out there with your family. Don't take that re-entry program for granted. Don't take life, freedom, your health, or your family for granted.\""},{"speaker":"Anthony","time":"00:37:05-1","content":"And I actually had a couple of the guys, they're crying looking at some of these guys because you actually got a guy over there that's paralyzed. He got a life sentence and he's paralyzed from the neck down. He got paralyzed playing football up here."},{"speaker":"Anthony","time":"00:37:05-1","content":"I did him, share a few words with him and his words to them, \"My decisions I made landed me up here. I'm not only reaping the punishment, but my family also."},{"speaker":"Anthony","time":"00:37:05-1","content":"My mom got to come up here and see me, not only with a life sentence, but I'm paralyzed. I can't even scratch my own nose.\""},{"speaker":"Anthony","time":"00:37:05-1","content":"Guys was in there crying. They shut the program down because they changed wardens, but since they shut it down, a couple of guys from re-entry that I took over there was coming to me, like, \"Man, I got some people you need to bring to that ward that need to see that. It opened my eyes and I need you to open these guys' eyes.\""},{"speaker":"Marcus","time":"00:43:47-9","content":"Sort of like your version of scared straight, you can say you know, well this is. What other organizations at Angola have you been a part of? I know you've explained a few. I noticed that you are wearing a Rodeo worker's shirt. Do you get involved with the rodeo?"},{"speaker":"Anthony","time":"00:44:07-0","content":"I actually have what we call the Rodeo Ministry me and 5 guys. You have Big Strike, which is non-trustees. They can go out there and sell to the crowd but they're encaged, like they can't move around. So they can order food, for a lot of them can't pay for some food."},{"speaker":"Anthony","time":"00:44:07-0","content":"We the ministry of the service that brings the food from the concessions to the Big Strike guys. That's the crew I head. We go around early that morning, get their name, get their little boot number, find out what club they order from, then we go to the club, get their food, come back, and deliver it to them."},{"speaker":"Marcus","time":"00:44:45-8","content":"Okay, what do you think about the rodeo?"},{"speaker":"Anthony","time":"00:44:51-8","content":"It's so many different areas you could say about the rodeo, you know? Some people might look at it with they call exploitation, that's the proper word, something like that. Sometimes I walk out there passing out the food, and I might see the inmate behind the fence that can't move around. They actually live like animals in the cage."},{"speaker":"Anthony","time":"00:44:51-8","content":"That thought comes to mind a lot. But some people, or a lot of people that's locked up and incarcerated actually need the rodeo for some finances. Some of us don't have family. I have family. So they need that kind of income to kind of help them survive in here or to get a lawyer, and to get on out of here or get an investigator and get some help so it I guess has it's pros and cons. Pluses and negatives."},{"speaker":"Marcus","time":"00:46:17-1","content":"Yeah I think it's a complicated reaction that one has to the rodeo. So in your own case, when you look back on the 30 years of surviving in prison for what happened that one night, when you think about the victim and the victim's family, especially the way this all rolled out that night, what do you think? What are your feelings about it now?"},{"speaker":"Anthony","time":"00:46:43-1","content":"I know my actions hurt a lot of people. Probably not just the family but the family, but probably people in the neighborhood as well, you know, my family was affected by it, but I do know from reading my paperwork and from court hearings. Kenny, that's the victim, Kenny Dickinson, he had two brothers and I'm thinking about how my brother was affected by my being incarcerated."},{"speaker":"Anthony","time":"00:46:43-1","content":""},{"speaker":"Anthony","time":"00:46:43-1","content":"So I know they had to be affected maybe ten times more than what my brother is. It hurts my brother to see my locked up. He didn't even want to go to court. It hurt him to even see me in shackles. So I know what they going through. I can't say I imagine, but I mean, I know that they experience a lot of hurt. Brother, the parents, the cousins, the aunts, the uncles."},{"speaker":"Marcus","time":"00:47:21-3","content":"Sure, when you look at your own family. I think you made this very accurate observation that you know, you can imagine what it felt for the victim's family because you've watched your own family go through the pain and suffering of watching you."},{"speaker":"Marcus","time":"00:47:21-3","content":"I think that's part of what gets forgotten in this whole thing is that there are two families, two communities that are affected by these things. Who in your family do you think has been most affected by your coming here?"},{"speaker":"Anthony","time":"00:48:01-0","content":"My brother. It took a real toll on him. Messed him up I mean, he can't come up here and sit down in front of me without crying. Call him and talk to him on the phone, can hear it in his voice. He can't talk to me too long without crying and he never got any trouble though. He maintained, he working you know, he saying he has to work to take care of our parents, you know."},{"speaker":"Anthony","time":"00:48:01-0","content":"But it messed him up real bad."},{"speaker":"Marcus","time":"00:48:46-0","content":"But you're still his big brother."},{"speaker":"Anthony","time":"00:48:48-2","content":"His only brother. My son, he's affected from not ever having me. He was 6 months old when I got locked up. Me, and him can communicate. I can talk to him. He ain't going to cry, but he did express some things to me, you know, some stuff he went through without me being there. But he actually turned out pretty good too, since I wasn't there."},{"speaker":"Marcus","time":"00:49:25-3","content":"Your daily life in prison, what continues to be the worst part of your experience for you?"},{"speaker":"Anthony","time":"00:49:30-3","content":"I would say, I don't know if I'm pronouncing the word right but, the dehumanization that you got to go through I seen something on CNN dealing with people appearing in Germany. And I wanted to say that the director or the warden was more or less stressing that they employees couldn't just come off the street."},{"speaker":"Anthony","time":"00:49:30-3","content":"They had to take some kind of two year course whether it was communications or counseling or psychology, but you had to know how to deal with people, to know how to relate to people and treat them as humans rather than putting up on them like you're trying to oppress."},{"speaker":"Anthony","time":"00:49:30-3","content":"Like you they oppressor or something like that and it was more or less like he was, if you treat them like animals, then they going to respond like animals. You treat them like human beings, they going to respond like human beings. And after a while up here, you keep trying to tear a person down, they will reach a breaking point where- what they say \"press their pipes.\" You don't know what to expect then."},{"speaker":"Marcus","time":"00:50:46-2","content":"Of all the things that you've accomplished let's say over the last 30 years, which is really a lifetime, what are you most proud of?"},{"speaker":"Anthony","time":"00:51:00-8","content":"I would say my marriage. Getting married, 2016. Or 2000, June 16th 2000, the day I got married. I mean, it turned out like it was, if you was to see some pictures from the wedding, you wouldn't think it was in prison, and the way it turned out the way it did, my wife and the family was ecstatic, but that was a real good accomplishment."},{"speaker":"Anthony","time":"00:51:00-8","content":"And they have, while I was working at the hospital, they had had a patient named Charlie Fenant, he had to be the oldest inmate in the prison. He was '89, making 90 and I kind of took care of him, almost made him like my patient, my personal patient. He was kind of grouchy, so a lot of people wouldn't deal with him. Security, Nurses, healthcare, all this."},{"speaker":"Anthony","time":"00:51:00-8","content":"But some kind of way I had to approach when I was able to deal with him was no demanding like, \"Come on, get off that bed man, time to deal with that and get in the shower.\" \"How are you doing Fen, you rest good at night?\" \"No not too much.\""},{"speaker":"Anthony","time":"00:51:00-8","content":"I said \"Well, you know, we got to get you in that shower today man, whenever you ready.\" \"Give me a few minutes.\" After 5 or ten minutes be like \"I'm ready.\" But anybody else put up banging on the bed, kicking the bed, waking him like, \"Come on time to go get in the shower!\" \"I'm 90 years old telling me when to get in the shower!\""},{"speaker":"Anthony","time":"00:51:00-8","content":"Anyway, February, no March, 2016, 26 was his birthday and I had the warden who approved for me and my wife to take him to church with us for his birthday, it was a Saturday. We took him to church, a new chapel right there and then we brought him to visit shed to have a visit with us. We bought him 2-3 cakes and we had church brothers up there who go to church with us. And all us was up there singing happy birthday to him."},{"speaker":"Anthony","time":"00:51:00-8","content":"And I really, I really enjoyed that man, that was like a real accomplishment for me, seeing this guy really, putting that smile on his face. Most of his family was in California so he don't get no visits to talk to nobody. Like I said, nobody want to deal with him on hospital ward. So for me to be able to get that done, that was a huge accomplishment, something I'm real proud of."},{"speaker":"Marcus","time":"00:53:45-6","content":"Is he still with us?"},{"speaker":"Anthony","time":"00:53:48-5","content":"Unfortunately he died February 10th, this year. And was scheduled to go on a parole, medical parole board March 1st, 91 years old when he died."},{"speaker":"Marcus","time":"00:53:59-3","content":"Is he at Point Lookout?"},{"speaker":"Anthony","time":"00:53:58-6","content":"No, his family came and got him. Yeah. I think they buried him in Baton Rouge. My wife went to the funeral. She sent me one of the obituaries, the programs."},{"speaker":"Marcus","time":"00:54:19-3","content":"So, let me ask you about something that you've probably been planning for a long time. Let's say things go your way, and you're released, what's your plan?"},{"speaker":"Anthony","time":"00:54:28-8","content":"I'd like to go back to go to barbering school, get my barber license. You know, my wife, she don't do hair, but she's a licensed stylist, and one of her daughters is also. So I was actually considering a family barber salon shop either just my own thing depending on what my wife or my daughter want to do."},{"speaker":"Anthony","time":"00:54:28-8","content":"But, I really want to do the barbering thing because like same way I work it up here, with the re-entry mentees, I see it as an opportunity sharing my story with them and with youths. You ain't going to pay me 20-25 dollars for a haircut and get out my chair before I finish, because I'm sharing my testimony. You're going to wait till I'm finished."},{"speaker":"Marcus","time":"00:55:16-0","content":"you know captive audience."},{"speaker":"Anthony","time":"00:55:19-4","content":"Yeah, share my little story with them and hope some kind of I'm able to touch them with the choice words, with the right words, or the proper words, it's about decisions. It's about making your choices man."},{"speaker":"Marcus","time":"00:55:35-5","content":"And the barber's chair is just a good place as any. Well, I've really enjoyed this time talking with you. Is there anything else that I should, that we should be talking about? I'm trying to get people to really understand the human aspect of the experience of life without parole and your story, your life. Is there something else that we should talk about that I didn't give you a chance to talk about?"},{"speaker":"Anthony","time":"00:56:07-5","content":"I remember when I went on the pardon board, one of the questions they ask me was did I feel that I served enough time on the life sentence. And my answer to them was I can't put no number or years on a life sentence that involves a person losing a life. And I told them, I understand that I hurt a lot of people. My actions hurt a lot of people. I took a family member from a family. So, I can't say 20 years is enough, but what I can say is I'm not the person I was."},{"speaker":"Anthony","time":"00:56:07-5","content":"That was being misled on misconceptions of what a man was, what a man was supposed to do to be a man, you know, which I really feel like what led me to being in prison."},{"speaker":"Anthony","time":"00:56:07-5","content":"So a life sentence on a second degree murder, I can't put no numbers on it, but I do feel like some people deserve a second chance. I do feel like some people deserve a second chance. They come to prison, they mature and grow in the right areas whereas, they can be not just productive to themselves, but productive to the community, or to the city, or to any environment they land in if granted release, than they should be considered for some kind of release."},{"speaker":"Marcus","time":"00:58:08-1","content":"Fair enough. That's a good place to stop I think."}]}