{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Anthony Bascle Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:19",
      "content": "It takes a lot to come and sit and talk about your whole life here. I'd like if you could start to set the record by stating your name, the crime that you were convicted, how old you were at the time, how much time you got served."
    },
    {
      "speaker": "Anthony",
      "time": "00:00:19",
      "upperBoundTime": "00:00:36",
      "content": "My name is Anthony Bascle I am serving a life sentence without parole for the crime of first-degree murder that happened when I was 21. I had just turned 21 years of age. My fall partner, co-defendant he was a juvenile at the time. He was two weeks shy of turning eighteen."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:36",
      "upperBoundTime": "00:00:41",
      "content": "How much time have you served?"
    },
    {
      "speaker": "Anthony",
      "time": "00:00:41",
      "upperBoundTime": "00:00:45",
      "content": "Twenty-three years. This crime happened in 1995."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:45",
      "upperBoundTime": "00:01:09",
      "content": "So, thank you. I'm going to start by asking you some questions about your childhood and the years that led up to this and then we'll, you know, briefly summarize that charge and then move onto your life here at Angola. The purpose of this is, in the simplest way, is just for me to learn who you are, learn more about you and your story."
    },
    {
      "speaker": "Anthony",
      "time": "00:01:09",
      "upperBoundTime": "00:01:12",
      "content": "Okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:12",
      "upperBoundTime": "00:01:15",
      "content": "So, then let's start with your family, tell me about the folks who raised you."
    },
    {
      "speaker": "Anthony",
      "time": "00:01:15",
      "upperBoundTime": "00:02:36",
      "content": "My mom was my best friend basically, I have a younger sister, different daddies, I didn't know that initially. Long story short, mom kind of gave up on men because she just didn't, they were abusive, a lot of failed relationships, it was more of friendships that she had because couldn't ever so she caught a stage. She was an exotic dancer, gentlemen clubs, whatever stripper."
    },
    {
      "speaker": "Anthony",
      "time": "00:01:15",
      "upperBoundTime": "00:02:36",
      "content": "So I grew up in that type of environment, as a child I grew up around a lot of females who were in that particular line of work, their boyfriends were bikers and whatnot and stuff like that. I thought it was all normal then, obviously, because I didn't know any better."
    },
    {
      "speaker": "Anthony",
      "time": "00:01:15",
      "upperBoundTime": "00:02:36",
      "content": "Looking back, I have a lot of good memories, it wasn't evil like a lot of people would think. It was abnormal probably, but it was just us, it was us against the world and that's what it boiled down to. Me and my sister, my mother were basically known as the Holy Trinity of the family because it was just us. We made sure that we cared for one another and that was it."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:36",
      "upperBoundTime": "00:02:36",
      "content": "Your mother ran the business?"
    },
    {
      "speaker": "Anthony",
      "time": "00:02:36",
      "upperBoundTime": "00:03:02",
      "content": "No she was just a regular stripper. She was very friendly with the owners of the clubs that were in there. I think it was called Fat City where she danced at she couldn't really, she made decent money but she wasn't doing a lot of like the stereotypes that come with stripping. She wasn't pulling in tricks and bringing guys to, so she made enough to make sure that she didn't have to depend on a man to not pay a bill."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:02",
      "upperBoundTime": "00:03:04",
      "content": "Right, supporting you guys."
    },
    {
      "speaker": "Anthony",
      "time": "00:03:04",
      "upperBoundTime": "00:03:07",
      "content": "Right, she did it herself."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:07",
      "upperBoundTime": "00:03:19",
      "content": "You may have mentioned this a little bit but were there men that came into your mother's life who you then came into contact with? Did any of those lead to conflict?"
    },
    {
      "speaker": "Anthony",
      "time": "00:03:19",
      "upperBoundTime": "00:03:46",
      "content": "Yeah, there was this one particular, he was a drunk we he seemed like he was larger than life initially ex-military, he seemed like was man you know? But he was a drunk, a whiskey drunk and as time probably first six months were great, there after he just whipped. He was very abusive in that physically."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:46",
      "upperBoundTime": "00:03:49",
      "content": "How old were you?"
    },
    {
      "speaker": "Anthony",
      "time": "00:03:49",
      "upperBoundTime": "00:04:12",
      "content": "Eight years when he pulled up. When he first, when she first got involved with him I was about eight years old maybe nine. I took it from around 11 or 12 and then I just ran away again fight or flight I wasn't strong enough to fight him so I took off because he was mean, he was very mean."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:12",
      "upperBoundTime": "00:04:15",
      "content": "Was your sister also targeted?"
    },
    {
      "speaker": "Anthony",
      "time": "00:04:15",
      "upperBoundTime": "00:05:01",
      "content": "Yes but I found that out since I've been in here you know? I got a much more how would you say, mature relationships with people now. So me and my sister discuss things. I was selfish about my feelings and I didn't really consider the fact that when I did run away he turned his energy toward her and she went through her own."
    },
    {
      "speaker": "Anthony",
      "time": "00:04:15",
      "upperBoundTime": "00:05:01",
      "content": "She thankfully made better choices she ended up joining the Air Force and she went and served and so she's doing great right now. But my mother realized it when it he concentrated on her, she got rid of him. I came back around maybe 13 years old, well I moved back in 14 years old but now I have a."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:01",
      "upperBoundTime": "00:05:02",
      "content": "Where did you run away to?"
    },
    {
      "speaker": "Anthony",
      "time": "00:05:02",
      "upperBoundTime": "00:05:32",
      "content": "Friends house, neighborhoods, every neighborhood has a crew an apartment that they go too. And they knew, it wasn't against mom I'm sure she was nervous. But we called her along the way and friends would say look we are straight and why aren't you coming home?"
    },
    {
      "speaker": "Anthony",
      "time": "00:05:02",
      "upperBoundTime": "00:05:32",
      "content": "She knew I was okay, she didn't know what I was doing. So I'm sure as a mother she worried a lot she didn't really want to accept the fact until he concentrated on Crystal. His way of looking at things and when I found out that he was gone for good I came back home."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:32",
      "upperBoundTime": "00:05:39",
      "content": "Did he stay gone for good?"
    },
    {
      "speaker": "Anthony",
      "time": "00:05:39",
      "upperBoundTime": "00:06:07",
      "content": "Yeah, well he showed up one time maybe six months after I moved back, he knocked on the door and I had the chain on the door, I remember opening the door and looking at him and he seen an earring in my ear. He was like I said very strange, \"That's gay stuff that you can't have earrings.\""
    },
    {
      "speaker": "Anthony",
      "time": "00:05:39",
      "upperBoundTime": "00:06:07",
      "content": "Wasn't very into the times I guess he started freaking out so I got the cordless phone picked it up and called the police on him. He took off running down the street, never seen him again."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:07",
      "upperBoundTime": "00:06:33",
      "content": "Yeah so other than this person who really was a negative presence and actually then brought abuse into the home. Did you also witness abuse against your mother?"
    },
    {
      "speaker": "Anthony",
      "time": "00:06:33",
      "upperBoundTime": "00:07:32",
      "content": "Yes, I didn't know it then, looking back I know it. I mean there was times when I seen him grab her by the hair and threw her in the room. We knew that they were having sex in there but he was raping her. At then I just think oh there having sex let's leave well go into the backyard and play. But knowing know what happened he didn't, like I said it was I mean it sounds horrific and it was a small segment of time, she grew from it."
    },
    {
      "speaker": "Anthony",
      "time": "00:06:33",
      "upperBoundTime": "00:07:32",
      "content": "It introduced us to, I don't know how you say it brought me, Crystal, and my mother. Crystal is my sister. It brought us closer, but I was so much more reluctant to trust anything outside of us. If a guy came along and it was because it was Crystals boyfriend or liked mom or something I was a problem then, and it was hard for her to maintain a relationship there after because I'm right there watching and made the decision there was never going to be another Tom coming into our family."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:32",
      "upperBoundTime": "00:08:10",
      "content": "Yeah and you know what we know more and more about is that witnessing violence against family member is as traumatic and sometimes more traumatic than being the recipient of the violence."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:32",
      "upperBoundTime": "00:08:10",
      "content": "So aside from this, unpleasant fellow is it safe to say that you grew up knowing that there were adults who cared for you and loved you or did you feel like you kind of had to make it on your own."
    },
    {
      "speaker": "Anthony",
      "time": "00:08:10",
      "upperBoundTime": "00:09:37",
      "content": "Then I felt like I had to make it on my own, looking back yeah I think there were people there that were common. There were guys that I trusted but they were like guys that were messing with my aunt, biker types and things like that and I remember one time that was actually before Tom there was a guy named Spider he was a biker but he put me in his lap and he took his bike and he's riding around the neighborhood and it was a Harley and it was loud."
    },
    {
      "speaker": "Anthony",
      "time": "00:08:10",
      "upperBoundTime": "00:09:37",
      "content": "But I remember the reaction of all the neighbors and looking back now it was probably disgust like \"Oh my God.\" He's long hair, you're typical looking but he was a little fella but he had this big monster bike and I remember thinking they fear him, they respect him, he's a tough guy. So people like that kind of influenced me a little bit but because what one would think of as normal society looked down upon them."
    },
    {
      "speaker": "Anthony",
      "time": "00:08:10",
      "upperBoundTime": "00:09:37",
      "content": "And that's the only thing that me was guys would bring us presents because mom couldn't afford them they brought us to the mall, buy shoes. So they were my buddies looking. So I'm not going to say it might not be great that they did what they did but I felt like that was my family, that was my crew, and that was the crew, and they weren't involved with my mom because they were involved with my aunt and they took care of all the kids. So they were like these are good guys and everyone else was bad guys."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:37",
      "upperBoundTime": "00:09:37",
      "content": "What does you Aunt do for a living?"
    },
    {
      "speaker": "Anthony",
      "time": "00:09:37",
      "upperBoundTime": "00:09:42",
      "content": "A stripper."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:42",
      "upperBoundTime": "00:09:41",
      "content": "Same. So what does your mother do now?"
    },
    {
      "speaker": "Anthony",
      "time": "00:09:41",
      "upperBoundTime": "00:10:16",
      "content": "She died a couple years ago. She got out of it. She ended up marrying a hillbilly kind of country guy from Alabama, that's probably downplaying it. He actually worked for a very large company called Fort Daniels building these big turbines, had a lot of money. But he loved her, and he let her be the mean little spitfire she was and he understood where she came from and how she came up. He took care of her, so she died in Alabama"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:16",
      "upperBoundTime": "00:10:19",
      "content": "What's your mother's name?"
    },
    {
      "speaker": "Anthony",
      "time": "00:10:19",
      "upperBoundTime": "00:10:23",
      "content": "Sharon."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:23",
      "upperBoundTime": "00:10:34",
      "content": "Tell a little bit about school, how was school for you? Was school a refugee or just something that you were forced to do?"
    },
    {
      "speaker": "Anthony",
      "time": "00:10:34",
      "upperBoundTime": "00:10:49",
      "content": "I liked school, I liked the, I mean I guess it was just as normal as everybody else up until high school. I loved middle school, elementary school was mellow I guess."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:49",
      "upperBoundTime": "00:10:51",
      "content": "Where were you in school?"
    },
    {
      "speaker": "Anthony",
      "time": "00:10:51",
      "upperBoundTime": "00:13:06",
      "content": "J.C. Ellis was the elementary school, Plaucheville was the middle and then I went to Grace King at ninth grade and that was no good. I mean there was a teacher named Ms. Dorn probably the best one in middle she let us start like clubs and we called it total insanity. We'd do these Constaello comedy skits. But she was real encouraging and building up."
    },
    {
      "speaker": "Anthony",
      "time": "00:10:51",
      "upperBoundTime": "00:13:06",
      "content": "And her friend was Ms. Charles who happened to be our math teacher. Her thing was she put these, she'd go a grade higher and put these math equations like on the board and she'd say if you could follow if you know them because shed tell you what was going to happened next year. If you could solve these problems you didn't need the homework that night. Because if you could do this than you'd have to know that, it was just her."
    },
    {
      "speaker": "Anthony",
      "time": "00:10:51",
      "upperBoundTime": "00:13:06",
      "content": "So I remember going through these things and I was real involved with it learning was fun. Then I get to high school, Mr. Ringbaum I remember his name was the math teacher and I'm sitting there and he's got a couple equations on the board and he's talking to us and I raise my hand thinking I know this game. I said, \"Your equation is wrong.\" he hasn't even gotten to that yet. And he says, \"Excuse me.\" Kids are all know and he says, \"Why don't you come fix.\" So I went up and fixed it."
    },
    {
      "speaker": "Anthony",
      "time": "00:10:51",
      "upperBoundTime": "00:13:06",
      "content": "He made me stay after class and sent me to counselors office and said I was being disruptive I remember that specially and then I go and they made the phone call to mom and I got a referral I think it was called back then. I think it was a referral and they gave me a work detention that was a Saturday you had to go."
    },
    {
      "speaker": "Anthony",
      "time": "00:10:51",
      "upperBoundTime": "00:13:06",
      "content": "So I go Saturday to the first work detention and we had sand on this side of the field shoved it here, and wheel barrowed it here. I was thinking to myself for the right answer. Loaded up my wheelbarrow, brought it over there, dumped it, hopped the fence didn't go back to Grace King. Ended up getting my GED little bit thereafter."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:06",
      "upperBoundTime": "00:13:08",
      "content": "So ninth grade was the highest grade of formal school"
    },
    {
      "speaker": "Anthony",
      "time": "00:13:08",
      "upperBoundTime": "00:13:12",
      "content": "I pretty much gave up on it after that."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:12",
      "upperBoundTime": "00:13:17",
      "content": "Yeah it sounds like an opportunity for a teacher, I would've loved that."
    },
    {
      "speaker": "Anthony",
      "time": "00:13:17",
      "upperBoundTime": "00:13:35",
      "content": "It was a different mindset they were there for not they weren't like nurturing us as I guess the younger schools were. They were like this is the school these are your rules real. The right way, I was supposed to sit down shut up and listen to them and I jumped the gun"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:35",
      "upperBoundTime": "00:13:48",
      "content": "I understand but you can channel that into good ways, not bad ways. It led to you leaving. I think I'm somewhat familiar with that city. So, it's a little bit suburban but it's still you know New Orleans. I mean Metairie I guess it is."
    },
    {
      "speaker": "Anthony",
      "time": "00:13:48",
      "upperBoundTime": "00:13:52",
      "content": "It's Metairie, is where it's at, it's Jefferson parish"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:52",
      "upperBoundTime": "00:14:07",
      "content": "So what's your, can you describe your neighborhood, if the two of us were walking through the neighborhood when you were about 20. That's a little late, so when your about 18 let's say, so were you still living at home?"
    },
    {
      "speaker": "Anthony",
      "time": "00:14:07",
      "upperBoundTime": "00:14:15",
      "content": "18, no I was living with my wife. We had our own apartment, Posada Del Rey Apartments the way apartments near Rumel."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:15",
      "upperBoundTime": "00:14:18",
      "content": "Oh okay, alright. So, can you describe that neighborhood then?"
    },
    {
      "speaker": "Anthony",
      "time": "00:14:18",
      "upperBoundTime": "00:16:31",
      "content": "At that age I guess like any neighborhood, I mean I wasn't living like a typical criminal lifestyle or anything like that on the streets. So I mean I had a group of friends from the childhood. But I'd get up, I'd go to work, I'd come back I mean it wasn't, I didn't have to carry a gun down the street or anything. But we did because of again, if you got to backtrack to when we were 13, 14, 15 you know we got these little crews and gangs started kind of coming up."
    },
    {
      "speaker": "Anthony",
      "time": "00:14:18",
      "upperBoundTime": "00:16:31",
      "content": "We basically started out as a little nerd crew. We protected ourselves I mean I was a runaway like I said I went to these certain friends that I used to know and we were all from broken families, and you had gangs that's started springing up around Metairie, Metairie bloods and the dark side and you had the slums, Shoesberry, the black guys."
    },
    {
      "speaker": "Anthony",
      "time": "00:14:18",
      "upperBoundTime": "00:16:31",
      "content": "So I mean they're all really into this gang mentality. We just all trying to fit in and get along but we're all broke you know we're not middle class by far. So we did our own little, we kind of, we had this little place called Jacks dag it was this little pink daiquiri shop, the parking lots behind it."
    },
    {
      "speaker": "Anthony",
      "time": "00:14:18",
      "upperBoundTime": "00:16:31",
      "content": "So we all, all the guys that got beat up a lot and couldn't go to the cool places you know well we started hanging out there well the problem was these bully crews were going after all the weaklings so much that the weaklings got stronger and I don't want to say it was revenge of the nerds because I don't want to downplay but we were punk, but our numbers now were stronger than any of theirs."
    },
    {
      "speaker": "Anthony",
      "time": "00:14:18",
      "upperBoundTime": "00:16:31",
      "content": "I got pulled up and his and his little lady, his girlfriend she had a, he had a black eye with blood coming out and her nose was busted and it was just, what did they call themselves? 301 posy or something. They beat him up, we were doing to the lake, he was trying to do a little date with his girlfriend and he got jumped for being not part of their crew. So we followed the weaker side and we got together and we beat up 301 for beating up all of us."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:31",
      "upperBoundTime": "00:16:32",
      "content": "What were you guys called?"
    },
    {
      "speaker": "Anthony",
      "time": "00:16:32",
      "upperBoundTime": "00:17:14",
      "content": "We got called the family and it was because of the police really gave us our nickname. We called ourselves 39 street posy is what we were and right there by where a high school called the Rumble it's a private school. And there's this, it's on the west of Canal and he's dead in the streets and it's a decent neighborhood, but it's all white."
    },
    {
      "speaker": "Anthony",
      "time": "00:16:32",
      "upperBoundTime": "00:17:14",
      "content": "We used to all hang on this one particular street because like five of us all lived on that one street. We used to have all these little block parties and then the police would pull up and say, \"Look y'all got to keep it down.\" \"Our thing was well we just yeah y'all family we know you are all family.\" So the family just kind of stuck. They called us the family from that point forward."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:14",
      "upperBoundTime": "00:17:20",
      "content": "So when you're 18 and you jumped ahead there, you're married and you're working ok so how did that, let's talk about that."
    },
    {
      "speaker": "Anthony",
      "time": "00:17:20",
      "upperBoundTime": "00:17:58",
      "content": "I just started growing up, I mean we're talking about a bunch of high school kids, we are the family, I mean all the schools know us, we beat up the 301 posy so you're kind of, you jumped into this, you're not popular but you're known."
    },
    {
      "speaker": "Anthony",
      "time": "00:17:20",
      "upperBoundTime": "00:17:58",
      "content": "So it's like people started getting their girlfriends pregnant, they started marrying, they started getting paying jobs, you know they wanted to get their own apartment. So that don't- you would imagine I mean, you're not knocking off 7-11's and stuff, that's not the way your average guy just falls, you know? It's, we're not, we just started growing up."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:58",
      "upperBoundTime": "00:18:00",
      "content": "Right, so where did you meet your wife?"
    },
    {
      "speaker": "Anthony",
      "time": "00:18:00",
      "upperBoundTime": "00:18:46",
      "content": "At my ex-girlfriend's house. I got dumped and when I went to go try to go make it right with her, Bridget was there and she just took my side I guess in the argument and she's like, she thought Anne was crazy for getting rid of me and she kind of stalked me a little bit."
    },
    {
      "speaker": "Anthony",
      "time": "00:18:00",
      "upperBoundTime": "00:18:46",
      "content": "I started dating her, a couple of dates and we ended up having sex, probably on the fourth or fifth date and she ended up getting pregnant and by me not having a real pops and going through what I went through I be like, \"No I'm not going to leave someone without a dad.\" So I asked her to marry me and got married at a little justice of peace. And just pretty simple I mean nothing over-dramatic."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:46",
      "upperBoundTime": "00:18:51",
      "content": "Okay so you're married at 18 and where are you working?"
    },
    {
      "speaker": "Anthony",
      "time": "00:18:51",
      "upperBoundTime": "00:18:58",
      "content": "Dave Fro's Landscape Contractors. He ended up hooking up with my mom."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:58",
      "upperBoundTime": "00:19:02",
      "content": "Your boss?"
    },
    {
      "speaker": "Anthony",
      "time": "00:19:02",
      "upperBoundTime": "00:19:34",
      "content": "Yeah, they ended up marrying and that kind of failed our relationship. I was on the fast track, he was letting me help price job, he was giving me certain jobs under a certain price that he wouldn't take, he threw it to me. I was doing a lot of refurbishment side jobs from the company and when he got with my mom, again, it was great at first and but know, I'm looking at him totally different."
    },
    {
      "speaker": "Anthony",
      "time": "00:19:02",
      "upperBoundTime": "00:19:34",
      "content": "I mean I guess me and my mom didn't have a parental relationship we had a friendship relationship so it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:34",
      "upperBoundTime": "00:19:36",
      "content": "So it was probably bringing up a whole bunch of issues for you."
    },
    {
      "speaker": "Anthony",
      "time": "00:19:36",
      "upperBoundTime": "00:21:18",
      "content": "Right, right. I didn't know how to sort through that just then so now I got issues with him. Because now you're invested in the family, my sister, my mom, that's no. I guess I just had a messed-up way of thinking back then as far as I'm concerned just leave him alone you know? I'll, if they need anything, I'll give it to them."
    },
    {
      "speaker": "Anthony",
      "time": "00:19:36",
      "upperBoundTime": "00:21:18",
      "content": "My mom stopped dancing of course and that was a good thing. But their relationship was, actually he was a coward because when I got locked up for this charge he actually a month later, I think my mom came back from visiting me in the Parish Jail and when she walked in the house, the house was empty, he had shut the lights off, and he left a note on the door with a lawyer's number. He just left her, left her cold."
    },
    {
      "speaker": "Anthony",
      "time": "00:19:36",
      "upperBoundTime": "00:21:18",
      "content": "She actually ended taking the stage again. Well, she didn't dance she worked the bar because she was familiar with that particular line of work in Metairie and all that. They weren't your dirty clubs but they weren't the best high end clubs because she got a little age now so she catch the bar, she works the bar for the girls and so, and then she met the hillbilly. But what it was is mom, all these guys mom met, she met in the club."
    },
    {
      "speaker": "Anthony",
      "time": "00:19:36",
      "upperBoundTime": "00:21:18",
      "content": "She didn't meet Robert in the club, Robert just got to see Sharron. These other guys got to see Cheyanne, the dancer first. So I think they changed their fantasy and that and because she's in there all the time, sleeps all day, works all night, you got to be a good guy, you know because you're not like the rest of them but your motive, you're in the club, you know, so that's she just never really grasped that."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:18",
      "upperBoundTime": "00:21:21",
      "content": "Yeah, I get that. So, are you still married to Bridget?"
    },
    {
      "speaker": "Anthony",
      "time": "00:21:21",
      "upperBoundTime": "00:21:25",
      "content": "No, not no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:25",
      "upperBoundTime": "00:21:27",
      "content": "But you have children with her?"
    },
    {
      "speaker": "Anthony",
      "time": "00:21:27",
      "upperBoundTime": "00:21:30",
      "content": "Yes, I got a daughter also."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:30",
      "upperBoundTime": "00:21:32",
      "content": "Tell me about your children."
    },
    {
      "speaker": "Anthony",
      "time": "00:21:32",
      "upperBoundTime": "00:22:56",
      "content": "Tony, I didn't want a Jr. So I changed his middle name. I'm Anthony David Bascle My son is Anthony Gage Bascle. I want his son to be Anthony David Bascle II, so you can't call him junior because they got that little break."
    },
    {
      "speaker": "Anthony",
      "time": "00:21:32",
      "upperBoundTime": "00:22:56",
      "content": "I got Alexis. Alexis came a little right before no she didn't come right before, she was conceived right before I got arrested. I wanted, Lexi was planned she was a planned baby, wanted a girl with Bridget. Wanted a girl, gave her name before we even laid that night, we actually got, as corny as it sounds we actually prayed to God for a little girl. I said this is what her name is going to be, Alexis Paige Bascle and we were going to make it right and the plan was we were going to move to Florida because I had lived in Key West for a little while around age 19, 20."
    },
    {
      "speaker": "Anthony",
      "time": "00:21:32",
      "upperBoundTime": "00:22:56",
      "content": "I went to Key West, Florida and it was beautiful down there. It was so different from the city. It was like the city but with no violence. And you got the ocean right there and golfing and it was just incredible. So we were going to move and Lexi's going to be born down there in Florida, Day County and that never happened, obviously, Lexi did happen, so."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:56",
      "upperBoundTime": "00:23:00",
      "content": "Lexi happened after you were in the Parish?"
    },
    {
      "speaker": "Anthony",
      "time": "00:23:00",
      "upperBoundTime": "00:23:10",
      "content": "Yeah, she was born while I was in the Parish facing trail of these charges. But they're great. I have a relationship with them now."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:10",
      "upperBoundTime": "00:23:16",
      "content": "They're 24, 20, in their 20's?"
    },
    {
      "speaker": "Anthony",
      "time": "00:23:16",
      "upperBoundTime": "00:23:19",
      "content": "Tony was 2 when I got locked up and Lexi was."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:19",
      "upperBoundTime": "00:23:22",
      "content": "So, 25, 23?"
    },
    {
      "speaker": "Anthony",
      "time": "00:23:22",
      "upperBoundTime": "00:23:27",
      "content": "Lexi just turned 21."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:27",
      "upperBoundTime": "00:23:29",
      "content": "Tell me, what are they like?"
    },
    {
      "speaker": "Anthony",
      "time": "00:23:29",
      "upperBoundTime": "00:25:03",
      "content": "I see more of how I used to think in Lexi than I do in my son. My son's kind of, he's smart but he's sure, I mean insecure. He knows who he is but, he just refuses to a spread his wings and fly. When I got locked up, I'm sure it was traumatic for him looking back now, being 2 years old or whatever. But she kept visiting with him."
    },
    {
      "speaker": "Anthony",
      "time": "00:23:29",
      "upperBoundTime": "00:25:03",
      "content": "As time goes on, she started not visiting with him as much, because she's trying to live her own life right, you know I'm facing life, right. Long story short, the psychiatrist that she would bring him to and the school counselors either you make the father be a permanent part of his life in some way and you adjust to that or you make the kid just think he's gone."
    },
    {
      "speaker": "Anthony",
      "time": "00:23:29",
      "upperBoundTime": "00:25:03",
      "content": "What was happening was when he would do something bad in school or just as a kid, you know, would act up, we'll go see your father? So, we're going to go see your father and your father's going to get on you. Well naturally, I'm not going to be hard on them because I haven't seen them now in a couple of months. I think the child figured out, well if I act up we're going to go see dad and that's what he would do."
    },
    {
      "speaker": "Anthony",
      "time": "00:23:29",
      "upperBoundTime": "00:25:03",
      "content": "She stopped bringing them all together, he started acting up, there's a popular drug they give kids for that ADHD and all that stuff. She kind of doped him up a lot, you know to try to keep him calmed down. I think it affected him in the long run. So he's an introvert now, he likes he's videogames, he's smart but he's simple."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:03",
      "upperBoundTime": "00:25:06",
      "content": "What does he do for a living?"
    },
    {
      "speaker": "Anthony",
      "time": "00:25:06",
      "upperBoundTime": "00:25:11",
      "content": "I think he's like a manager at a subway or something. I mean I'm glad he's working."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:11",
      "upperBoundTime": "00:25:15",
      "content": "Do you have an ongoing relationship with him at this point?"
    },
    {
      "speaker": "Anthony",
      "time": "00:25:15",
      "upperBoundTime": "00:25:50",
      "content": "Yes and no. I talk to him I have a closer relationship with Lexi which is weird because I have no history with Lexi other than being incarcerated. My ex made them, \"Your father's evil, he's in prison, he's in prison for murder.\" She never really gave them the particulars of the case. But, as they got older, their questions started asking more."
    },
    {
      "speaker": "Anthony",
      "time": "00:25:15",
      "upperBoundTime": "00:25:50",
      "content": "So now they're asking their aunts and people that knew me and my mother when she was still alive. And then when they reached out to me, what I did was I took the entirety of the case file that I had and just sent it to them and said, \"Here reach your own conclusion.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:25:50",
      "upperBoundTime": "00:25:53",
      "content": "Sounds like she's smart."
    },
    {
      "speaker": "Anthony",
      "time": "00:25:53",
      "upperBoundTime": "00:25:54",
      "content": "Oh yeah. She's very, she's quick she's a."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:54",
      "upperBoundTime": "00:26:01",
      "content": "It was smart of you to do that, to let her come to her own conclusion."
    },
    {
      "speaker": "Anthony",
      "time": "00:26:01",
      "upperBoundTime": "00:26:38",
      "content": "It was probably the best thing I could have done because I didn't naturally she's automatically going to have her guard up when she's talking to me. You're everybody pleads, like you're this poor little victim you. And I'm not a victim. So, but thankfully when she went through it, she started asking me questions and I gave her honest answers and I'm her father regardless of whether she likes it or not."
    },
    {
      "speaker": "Anthony",
      "time": "00:26:01",
      "upperBoundTime": "00:26:38",
      "content": "So I didn't have nothing to lose in that matter. I got life without parole so it's like, I haven't seen you for this many years but now we have a, I'll get the father's day email and the little kiosks and stuff. She talks to me and she asks me advice about her boys."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:38",
      "upperBoundTime": "00:26:40",
      "content": "Who visits you up here?"
    },
    {
      "speaker": "Anthony",
      "time": "00:26:40",
      "upperBoundTime": "00:27:46",
      "content": "I have friends, now, that I've met while incarcerated through the rodeo whenever. Melissa is probably and she'll bring Lexi and Tony when Lexi and Tony are my son and daughter. They'd come more I really don't like them to because it's a hassle for them, I know it's costly for them to take off work, come up here, the visiting shed isn't as, it's not like it used to be once upon a time. They're kind of, it's just not a happy place you know."
    },
    {
      "speaker": "Anthony",
      "time": "00:26:40",
      "upperBoundTime": "00:27:46",
      "content": "So they come to the rodeo events and they'll see me in that you know it's more festive, it's more happy, it takes some of the pressure off from just sitting across from somebody because they have to leave you. So they'll come here and it's like, \"Oh man I missed you, I haven't seen you.\" But after a 4 or 5 hour visit they know that you know, when we both do it. I'll do it and they'll look at the clock and they know that the goodbye is coming up again and we don't know when we're going to come again."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:46",
      "upperBoundTime": "00:27:45",
      "content": "Yeah, it's hard..."
    },
    {
      "speaker": "Anthony",
      "time": "00:27:45",
      "upperBoundTime": "00:27:47",
      "content": "It's depressing."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:47",
      "upperBoundTime": "00:27:46",
      "content": "...on everybody."
    },
    {
      "speaker": "Anthony",
      "time": "00:27:46",
      "upperBoundTime": "00:27:49",
      "content": "Yes, yes it is."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:49",
      "upperBoundTime": "00:27:50",
      "content": "I can only imagine that."
    },
    {
      "speaker": "Anthony",
      "time": "00:27:50",
      "upperBoundTime": "00:27:58",
      "content": "So, yeah it's just more pleasant when we talk on the kiosks and the telephone and I don't inconvenience their life and they don't, well they can't inconvenience mine but I love to see them."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:58",
      "upperBoundTime": "00:27:58",
      "content": "What do you do at the rodeo, do you sing?"
    },
    {
      "speaker": "Anthony",
      "time": "00:27:58",
      "upperBoundTime": "00:28:01",
      "content": "Paint, oil painting, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:01",
      "upperBoundTime": "00:28:07",
      "content": "Were drugs and alcohol a part of your life, in terms of your lifestyle?"
    },
    {
      "speaker": "Anthony",
      "time": "00:28:07",
      "upperBoundTime": "00:28:47",
      "content": "Yes and no. I was never a doper. I drank, I wouldn't by definition be an alcoholic or a drug addict. I smoked the marijuana here and there, I mean I've tried cocaine, did not like it. It was, it was a pill ecstasy, we tried that one time, no that wasn't me neither. I didn't like that outta control feeling. So I kind of stuck mostly on drinking, but it was more of a social I didn't sit at home and drink."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:47",
      "upperBoundTime": "00:28:49",
      "content": "So I guess what I'm trying to say is was there something that started to create problems for you?"
    },
    {
      "speaker": "Anthony",
      "time": "00:28:49",
      "upperBoundTime": "00:28:52",
      "content": "No, it was not."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:52",
      "upperBoundTime": "00:29:18",
      "content": "Let me ask you a what if, it's sort of unfair because there isn't an actual way to know if but I imagine you've spent some time thinking, you know what if you didn't get out of bed that day, if that didn't happen, a lot of the people I speak with say it would be the next day or the next day. A lot of the say they'd be dead."
    },
    {
      "speaker": "Anthony",
      "time": "00:29:18",
      "upperBoundTime": "00:29:23",
      "content": "They figured that would be the quick answer, \"Oh I'd be dead.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:29:23",
      "upperBoundTime": "00:29:43",
      "content": "Right, for some but I don't think that's the case for everybody and I think others will say, well I was just about to land this great job and things would have been great. So, in your case, had this not happened, how do you think, you know you were trying to go to Florida, how would the rest, how would your life of treaded out, had this not happened?"
    },
    {
      "speaker": "Anthony",
      "time": "00:29:43",
      "upperBoundTime": "00:30:58",
      "content": "I don't know. I can see this I think I would have been a prick. I think if I didn't get in trouble and end up in prison I'd been a lonely person right now. Because of the way, and this is me talking now, looking back at who I was then. I didn't trust people, I was inconsiderate of people, if I was your friend, great, but then even those friendships weren't even based on like unconditional love that you would want from a true friend. It was always give a little, take a little, you know."
    },
    {
      "speaker": "Anthony",
      "time": "00:29:43",
      "upperBoundTime": "00:30:58",
      "content": "I mean, I had the typical dream, I'm going to open up a restaurant, or I want to open up this, you know I want to, but I needed prison. I needed to come to prison, my attitude, and if I didn't it's because I was lucky, but I should have come to prison, not for murder. I'm not a murderer, I mean I am a murderer, I'm convicted of murder. What I'm saying is that I would, I probably would have got my mind right with a little five year sentence but that's neither here or there right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:58",
      "upperBoundTime": "00:31:02",
      "content": "So, in some ways then, prison hasn't been all bad for you?"
    },
    {
      "speaker": "Anthony",
      "time": "00:31:02",
      "upperBoundTime": "00:31:04",
      "content": "Not at all."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:04",
      "upperBoundTime": "00:31:18",
      "content": "So can you explain that a little bit, because I think that's a little, on the surface that may be difficult, but I understand exactly what you mean? Can you explain that a little bit more? In what ways has it been good for you?"
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "I didn't realize my potential, I didn't know I was smart, I didn't know how to be considerate, I didn't know how to act in social settings and here you're forced to get along with people. You're forced to have to deal with people who don't think like you, who have different opinions than you. If you want something you have to set a goal and you have to reach it or you don't get it in here."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "I mean it's, what's the word, how do they say it, I mean we're in a controlled environment and it's unforgiving. You don't have a second chances, from a security standpoint, and understandably. If they see something, a simple argument that could go very bad, very quickly in this type of environment because you're dealing with criminals and convicted felons."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "So they have to nip it in the butt and you're going to the dungeon. And security, whether I like it or not, don't care who started it, who d-didn't start it, what but you both end up in the dungeon with a write up for fighting from a simple argument. Because they have to make sure it doesn't escalate into something else."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "So, that write up will hurt you in your long run and we all catch them, it's impossible not to So what you do is you learn to avoid, well I'm thinking, well if I can avoid something this simple in this type of setting on the street why could why did I have to entertain when a guy cut me off you know, or why did I have to entertain when a guy looking at my woman you know I'm the one that made her dress hot."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "So but you want to fight and you want to, so in this environment here I'm just like, I hit by brakes and you stop and you think about things and because of the amount of time that you have to think about things uh you learn lessons that I guess most people on the street would never even realized they've learned. Good upbringings, I'm sure, I can't speak for everybody."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "I know I didn't want to keep living around the riff raff that was here, the ones that are constantly trying to get in trouble, they think because you're naïve when you get here, I'm naïve, I'm arrogant, I think I know everything, don't know nothing, typically youth in prison you've got this idea of what prison's about. I was fortunate when I got here because I landed at jade base."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "I guess the classification here was ok their doing their jobs, they realize, okay you're not a predator. You don't look like a predator, you don't look weak where you need to be locked up in a cell for protection. But you don't look like your average person, you don't talk like them. I'm a first offender, I don't know if I've said that earlier, I've never been arrested before this, first time with handcuffs on me is when I got arrested for this charge."
    },
    {
      "speaker": "Anthony",
      "time": "00:31:18",
      "upperBoundTime": "00:34:42",
      "content": "So, they put me at base dormitory which ended up helping. I think that helped your journey, made me very cocky when I got here I mean it was, but the bad guys were in the cells because it's an extended lockdown unit and I was in the spot where I was a general orderly where I fed these guys and worked the yards and things like that, so I was able to sit in a place to where I can look at prison from."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:42",
      "upperBoundTime": "00:34:45",
      "content": "A little bit more objectively."
    },
    {
      "speaker": "Anthony",
      "time": "00:34:45",
      "upperBoundTime": "00:35:32",
      "content": "Right, I could see who the good guys, and then you meet the guys- you know, you're back here cause a free man didn't like you, you're back here because you're an idiot, you're back here cause you're violent. And you know, so you meet these people, but the cells are right there so when I am protected basically from the more violent predator types. I'm also in the position that I should help those that I feel should be helped."
    },
    {
      "speaker": "Anthony",
      "time": "00:34:45",
      "upperBoundTime": "00:35:32",
      "content": "Again, I'm talking 20 years ago so it's easy to, right then I didn't realize what it was, I mean after being in the parish jail, where you fight almost every day and then you come up here, I'm like ugh and you get to go outside and you get to move around and you go on this ain't nothing like I thought. I thought I was going to be walking down the corridor with my clothes butt naked in my hand just and people throwing toilet paper and whistling from these tiers, Angola was nothing of that sort in no kind of way shape or form."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:32",
      "upperBoundTime": "00:35:37",
      "content": "I imagine the parish was quite a bit worse."
    },
    {
      "speaker": "Anthony",
      "time": "00:35:37",
      "upperBoundTime": "00:36:42",
      "content": "Oh yeah, very much so. Because you don't care I'm a dog, I'm a show everybody I'm a dog, and that's the mentality and so you're fighting at the drop of a hat, especially when you're facing charges like I was facing. Who are you, what's the word, and bang on the chest, I'm a white guy. I'm a typical white guy, I'm not a racist but I've tasted more racism probably since I've been locked up than before on the streets. On the streets it was real check your boy mentality where everybody was just cool."
    },
    {
      "speaker": "Anthony",
      "time": "00:35:37",
      "upperBoundTime": "00:36:42",
      "content": "At prison all of a sudden big separation took place. I didn't understand it because I'm friends with a lot of, I don't know if you paid attention earlier. Everybody that has come here, came and shook my hand. I'm friends with these guys and I demand you to be a man, be respectful. If you got these issues, if you put yourself in a little box and it's me against the world then go fight your own battle. Life is bigger than that."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:42",
      "upperBoundTime": "00:36:53",
      "content": "Sometimes it just takes I don't know, just getting a bit older to figure that out."
    },
    {
      "speaker": "Anthony",
      "time": "00:36:53",
      "upperBoundTime": "00:37:15",
      "content": "Almost like living in a farm, I guess prison is a farm. People that run the place have a slave owner's mentality. Maybe because this place was a slave plantation at one time and the same generations of people you can actually, they're still here in an administrative form. I'm not being mean when I say that but they've got a backward way of thinking that."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:15",
      "upperBoundTime": "00:37:18",
      "content": "Just say it the way it is."
    },
    {
      "speaker": "Anthony",
      "time": "00:37:18",
      "upperBoundTime": "00:38:31",
      "content": "Right. They don't see me as a white guy. I don't get no doses because I'm a white person. If anything you probably get more hardships because they've got to prove, I'm not racist so I'm going to be hard on this white guy as opposed to this guy right here."
    },
    {
      "speaker": "Anthony",
      "time": "00:37:18",
      "upperBoundTime": "00:38:31",
      "content": "I make the joke a lot that I'm a good worker. I'm a good friend. I'm a good offender, convict, I'm a bad slave, and that's been a small part of my problem when I first got to the prison. I was not going to be a slave."
    },
    {
      "speaker": "Anthony",
      "time": "00:37:18",
      "upperBoundTime": "00:38:31",
      "content": "I mean thank God they quit picking cotton because I would have never picked a piece of cotton, so I could easily ended up in the cells and things like that. Because I wasn't going to do it. Because of the history of this place I had an attitude with that. Like I said I was pretty fortunate maybe fate, whatever good aura. I mean if you project positive energy you get positive energy. I was lucky enough to meet one guy when I got here who gave me advice. I listen to some didn't listen to some. When I listen to someone."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:31",
      "upperBoundTime": "00:38:36",
      "content": "What was the advice?"
    },
    {
      "speaker": "Anthony",
      "time": "00:38:36",
      "upperBoundTime": "00:38:51",
      "content": "First was about my fall partner. He told me the fall partner is the only family I really got here. So, we've got to get along. Because nobody else knows me from the streets."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:51",
      "upperBoundTime": "00:38:56",
      "content": "I see."
    },
    {
      "speaker": "Anthony",
      "time": "00:38:56",
      "upperBoundTime": "00:39:27",
      "content": "In prison you can be whatever you want to be because nobody knows you. I did this, I did that. I was this I was that. They do this to impress. He basically said quit trying to impress people. What do you care what they think about you, figure out who you are, who you want to be, where you want to go in this place."
    },
    {
      "speaker": "Anthony",
      "time": "00:38:56",
      "upperBoundTime": "00:39:27",
      "content": "I understood what he was talking about but he wasn't a mentor. Even though he was my mentor in my mind the way I looked at it. I cared about what he said and what he thought, but he was telling me at the same time, don't care what I think."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:27",
      "upperBoundTime": "00:39:31",
      "content": "Was he an older white guy?"
    },
    {
      "speaker": "Anthony",
      "time": "00:39:31",
      "upperBoundTime": "00:39:41",
      "content": "He was Spanish maybe. I don't know if you're familiar with some of the older, Buddy Gracias, he's no longer in prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:41",
      "upperBoundTime": "00:39:42",
      "content": "Okay."
    },
    {
      "speaker": "Anthony",
      "time": "00:39:42",
      "upperBoundTime": "00:40:37",
      "content": "He a bad reputation here, good reputation as far as the convict sense. He was back when it was actually a prison code. He stood for something and this and that. That's absolute right now, the penitentiary has evolved since then."
    },
    {
      "speaker": "Anthony",
      "time": "00:39:42",
      "upperBoundTime": "00:40:37",
      "content": "Some of the bad parts of this prison is people what to be like what it was. Some inmates want to be what it was. They is a code you don't do this, you don't do that. People have gone since then. What happens in Angola you've got all this lifers and this people? You've got a club here called the lifers. They actually had to stop having called outs. Got to play if you had 20 years or more in here."
    },
    {
      "speaker": "Anthony",
      "time": "00:39:42",
      "upperBoundTime": "00:40:37",
      "content": "You had to go and they feed you, you had a little time on the TV. Because when you've been here 20 years you don't have a family no more. You can't really go by the way you might have mom's or an aunt, someone says you're here 20 years now."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:37",
      "upperBoundTime": "00:40:44",
      "content": "In terms of family."
    },
    {
      "speaker": "Anthony",
      "time": "00:40:44",
      "upperBoundTime": "00:41:30",
      "content": "So, they took care. When people hit 20 years locked up well that jumped to 25, even at 25 you've got so many people here with 25 years' incarceration. You can't put that many of them, so you just had to eliminate the call outs all together."
    },
    {
      "speaker": "Anthony",
      "time": "00:40:44",
      "upperBoundTime": "00:41:30",
      "content": "We've all grown. The ones that are still getting in trouble at this time it's because they've given up. I hate to say this, they still have choices, they just don't care, they quit caring. I'm mentally strong enough maybe, maybe I surround myself with more positive people. I enjoy learning new things. So, I've kept myself busy throughout prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:30",
      "upperBoundTime": "00:41:48",
      "content": "I think what I'm hearing you saying is that if you're faced with possibility of a life sentence and you keep getting reminded that that's the reality. Some people can just give up."
    },
    {
      "speaker": "Anthony",
      "time": "00:41:48",
      "upperBoundTime": "00:41:57",
      "content": "Yes they do and they accept it. This is what it is so I can do positive things or I can go backwards"
    },
    {
      "speaker": "Marcus",
      "time": "00:41:57",
      "upperBoundTime": "00:42:26",
      "content": "Yeah so let me ask you about that because it kind of gets to the core of what we are trying to explore here. Some folks when confronted with a life sentence you just give up and others somehow find some hope. How do you, once the reality of a life sentence really set in for you, how have you been coping?"
    },
    {
      "speaker": "Anthony",
      "time": "00:42:26",
      "upperBoundTime": "00:43:52",
      "content": "I try to make a difference. I come up with ideas that I think might help my environment, I do what Buddy did for me, I find people that I think are at a crossroad in their state when they first get here and I guess you never really accept it. You know, you always think that somebody, a group like yourself you know or a- there's always somebody, 60 minutes the other day showed Oprah on their talking about the SHU down at Pelican Bay and their going with solitary confinement."
    },
    {
      "speaker": "Anthony",
      "time": "00:42:26",
      "upperBoundTime": "00:43:52",
      "content": "It's become money, prison industrial complex is a money thing, it's modern day slavery, and you can concentrate on all the negative stuff that's going on but the fact is, I'm here I'm doing this, how do I cope with this, I do it by doing things that matter, that's going to make a difference in the long run, I've come up with a level program."
    },
    {
      "speaker": "Anthony",
      "time": "00:42:26",
      "upperBoundTime": "00:43:52",
      "content": "I need to propose to somebody saying that if you're actually trying rehabilitate people in prison this is probably your best bet, it's called the Incentive Behavioral Modification incentive program, you want to be good, show u. This institution is beautifully designed for- because of the separations and then camps and the schooling you have here and the movement."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:52",
      "upperBoundTime": "00:43:57",
      "content": "Have you talked to folks about that program?"
    },
    {
      "speaker": "Anthony",
      "time": "00:43:57",
      "upperBoundTime": "00:44:01",
      "content": "Yes and no, I've talked some low level."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:01",
      "upperBoundTime": "00:44:08",
      "content": "You've mentioned earlier that you don't want to come across as something threating or that you know better or something?"
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I'm confident in at a point in my incarceration I was able to work for a place, when I got my trustee status, for prison enterprise it's called Flat Operations, we're basically running birds, raising game birds. Seems simple enough, and again I thought it was just a layout drop in the prison."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I ended up running a business, it was under Warden Cain at the time whose still here and it was kind of his pet project as I understood it, but for that five year time span I wasn't in prison, I was in prison, I lived in prison at camp at trustee camp in the, but it was a failing industry when I got there. My first year there with this particular free man that we brought from losing money to 50,000, from 50,000 to 72,000, 72 to 90, we ended up our best year being $118,000."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "But the free man didn't act like a police prison guard, he worked pretty, he was lead out the prison enterprise, his way of thinking was, you're a trustee, they trust you then I trust you, I'm a treat you like an employee. And I was his floor man and I did something I thought I could never possibly do, you know, even in normal life, I could have won something, I seen something, I studied it, I understood it, the dynamics of managing, the crew that we had working, running schedules."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "It got to the point where I was even leaving the farm on a regular basis to go deliver these game birds to preserves and all of that. Well I reached a point to where I'm like in prison I'm showing that I could function in the regular world. Well we're not getting into it there was a change in security and the way people think, whatever, and it just, I ended up leaving that particular operation, the next year after, I'm gone and this free man was gone."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "It went 90,000 in the hole and it ultimately was shut down without us there. Which I'm kind of smug about, I thought it was kind of cool, but as I'm thinking about it I'm like, when I came back to this environment I felt like I was coming back to prison but I never left prison."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I realized that if you do this, if you systematically some kind of way structuralize this prison to where you're working your way to certain parts what I had out there was basically like a pre-released work. And in a controlled environment while you're watching me, you're able to see what I could and could not do, you're letting me leave the farm. I mean I had fishing privileges where I was in a boat fishing in the lake for the catfish for certain functions that Mr. Cane would have with the crew that was already assigned to that particular job."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I was living and I was doing things I never did on the street you know I learned to ride horses up here, work cattle up here, you know, I mean there's just things that I'm like wait what, you know a four wheeler, a boat, never been in a boat before I got to prison."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I've learned to live more while being locked up than I was, it was weird but I realized all of those privileges and those things I was allowed if you would, when you first get here there is something to work for. You want that? Because I know I would sit back and feel right and I would watch trustees do this and that. I don't want to do that. I fought for it."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "I'm saying you can even sweeten the deal better if you would do it. Don't mandate it, you can't mandate it, it's illegal. I mean I do that, excuse me I've done studies in the law library while I'm down there. You can't mandate, you've got to do this to get to this level. It becomes a constitutional issue and they made rulings on that. But you've got a trustee system that's something I asked for. Do the same thing for a lot of the program and you go from one level to the next level and ultimately what you're doing is you're telling myself."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "So, when I do go before a board, you move high scores. I want to institute something in here that is good. It doesn't matter what this guards say. When I walk in there and you look at my jacket and you say I see that in this particular organizations, you've reached platinum status. I'm not saying that I'm educated that I've picked up two certified traits. I've done this, I've got the anger management, I've got the 100 dollars. I'm doing it myself now, but nobody knows it."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "So, when I go in front of the board like if you don't know me. There's a difference between the guy in the cell block and a trustee. You can see it because he's a trustee. So, somebody tells you he's a trustee, imagine if you don't know me so who is coming in, he's a platinum status, how long as he been here? 25 years he's bronze status, so that means he's refusing to get he's GED. He's refusing to do this and do that."
    },
    {
      "speaker": "Anthony",
      "time": "00:44:08",
      "upperBoundTime": "00:50:10",
      "content": "Just label me initially coming into prison as a certain status. If I voluntarily take this course then I'm trying to propose this program, really it is what it is. I'm reaching platinum, I've been here 20 years, I haven't had write up in 5 years, no major write up in this many years. I've taken this, this and that."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:10",
      "upperBoundTime": "00:50:11",
      "content": "Sure."
    },
    {
      "speaker": "Anthony",
      "time": "00:50:11",
      "upperBoundTime": "00:50:15",
      "content": "You know who I am just by look at what status I'm presenting myself towards you."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:15",
      "upperBoundTime": "00:50:28",
      "content": "Can you just summarize the certifications because you've done a lot? Can you give me a list of what you've up and the organizations you've been part of."
    },
    {
      "speaker": "Resp 1",
      "time": "00:50:28",
      "upperBoundTime": "00:52:51",
      "content": "I've been in organizations. I've been involved the toastmasters but not CMA certified, I'm not toastmaster. I have taken a life skill class or anything like that. I've taken a CPR class because it's practical. Somebody falls out. Taking typical church classes, I have resigned Bible College for a while. Actually I was one year away from graduating Bible College and I resigned from it. I was going to be a preacher and I realized that I was in it for the wrong reasons. So it was a personal dilemma. It looks good, if I could tell you that I'm a college graduate, theologian."
    },
    {
      "speaker": "Resp 1",
      "time": "00:50:28",
      "upperBoundTime": "00:52:51",
      "content": "New Orleans Baptist theology seminary came here to make preachers or convicts to spread the Gospel of Jesus Christ. And when I swallowed that pill, I'm like no, I'm not here to minister the Gospel of Jesus Christ. So I left. People say I'm stupid for it. Maybe they're right, maybe they're wrong I don't want to answer to God. I can fool you. If I get the St. Peter, I got to there, I don't answer to that particular question. Why did you play this because I wasn't there for the right reasons?"
    },
    {
      "speaker": "Resp 1",
      "time": "00:50:28",
      "upperBoundTime": "00:52:51",
      "content": "And I got out. I'm an award winner oil painter. I concentrate most of my attentions on sober group, alcoholic anonymous. That's where I concentrate a lot of my attention, towards that program. I believe in it, it works, it's positive and it ain't going to be perfect. People fall in this environment. And I know for a fact, you're doing, these guys come, and you're doing great. You're doing great and you get caught. You know that fling mouth with the guards, you go a new skin, you smoke the joint. Your girlfriend dumped you."
    },
    {
      "speaker": "Resp 1",
      "time": "00:50:28",
      "upperBoundTime": "00:52:51",
      "content": "I know that you're going to through these things with the life sentence now. So you've a got a guy that's fresh in here, and he sees 20years, 25 years veterans fighting to get out of prison. So this guy has been in the joining 6 months. I know his mind is like, I don't even know y'all go now. How the hell. So I concentrate on that and AA is a perfect venue for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:51",
      "upperBoundTime": "00:52:56",
      "content": "I guess the drugs are pretty easier in here."
    },
    {
      "speaker": "Anthony",
      "time": "00:52:56",
      "upperBoundTime": "00:53:16",
      "content": "Yeah I guess, but not like gigantic, they make their booze in prison. I've been here for so long I really wouldn't."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:16",
      "upperBoundTime": "00:53:51",
      "content": "Let me switch gears here a little bit, and one of the things I mean it's certainly part of this story, the narrative of redemption that people like even though I think it's a little more complicated, there is that story line and when you look back on what happened over 20 years ago. When you look back on what happened that night I'm sure you can have your in hindsight, you get the perspective of what you were doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:16",
      "upperBoundTime": "00:53:51",
      "content": "But this is a little bit different so now with that hindsight how do you make sense of what happened that night and the victim and the victim's family and the kind of ripple effect of that?"
    },
    {
      "speaker": "Anthony",
      "time": "00:53:51",
      "upperBoundTime": "00:56:12",
      "content": "You think about it every day. You do. There might be a day, which would probably be considered a good day, when it doesn't really hit you, but there's always something around here that's going to remind you you're in prison. Might not be personal, it might just be on the side bar. Like right now I might look out the window and see security tackling somebody, right, and the razor wire and you remember you're in prison, and when you think about prison you think about yourself for a second."
    },
    {
      "speaker": "Anthony",
      "time": "00:53:51",
      "upperBoundTime": "00:56:12",
      "content": "At this stage I go back to like that night and if you back to that night you think of the victim. Initially a selfish but then you start realizing you can't change what happened, the victim's gone, he's dead so now what happens is you start thinking his family and what they must've went through and you kind of deserve what you see around here, oh I mean, this messed, but I put myself in this position."
    },
    {
      "speaker": "Anthony",
      "time": "00:53:51",
      "upperBoundTime": "00:56:12",
      "content": "And if there, what it sounds to me is I think too much thought goes on their emotions when it comes to the chance of us being released again, because I know that I would hate you if you hurt my family. I'd want you dead, I'd want to kill you. I understand that those are just emotions now because I'm in this type of environment, or a charged environment and the emotions here are that much more than what most people would think in the street."
    },
    {
      "speaker": "Anthony",
      "time": "00:53:51",
      "upperBoundTime": "00:56:12",
      "content": "But I wonder I try I don't try to live life repress them or impress the board, I try to live life to make sure that I don't never have to put anybody through that type of situation. I don't believe I should die in prison, not be heard. I don't live to impress the victims. I try to make sure that just something like that never happens again, even if it's the people I try to reach."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:12",
      "upperBoundTime": "00:56:30",
      "content": "So tell me a little about the several other victims that get overlooked very often and that is your family, the people that have to watch you go through this, who has it been the hardest for?"
    },
    {
      "speaker": "Anthony",
      "time": "00:56:30",
      "upperBoundTime": "00:57:50",
      "content": "I want to say my children probably because your supposed to concentrate on the youth, I guess, and make sure they don't walk in the same ways you did, make the mistakes you made, you don't want to see it happen with them, but they don't really know me. If I want to be honest about it, and try to give a textbook answer, my mom probably was the hardest because I know she blamed herself. If she wouldn't have met this guy if she wouldn't have me."
    },
    {
      "speaker": "Anthony",
      "time": "00:56:30",
      "upperBoundTime": "00:57:50",
      "content": "She's gone now you know but ah she always believed that I'd be out, that the system worked. After the fifteen-year mark and she realized that there was no first offenders' pardon that Tony don't home after fifteen years she drank a lot more. She was lonely, her friends got broke. So this crime in a roundabout way almost killed her too. She probably would've lived a little bit longer if she didn't take the alcohol and things like that."
    },
    {
      "speaker": "Anthony",
      "time": "00:56:30",
      "upperBoundTime": "00:57:50",
      "content": "She tried to find happiness with Robert who put up a lot with her. She shut, her liver was gone, kidneys were gone, she was just what's the breathing thing, where you got to have a tube because she's a chain-smoker."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:50",
      "upperBoundTime": "00:57:53",
      "content": "So self-destructive behavior."
    },
    {
      "speaker": "Anthony",
      "time": "00:57:53",
      "upperBoundTime": "00:58:31",
      "content": "Yeah, she blamed herself because her baby, and the way she allowed me to be brought up, and the things I went through as a child, and her choices affected me and put me in prison. And I've spent a lot of time in prison, I mean I sent her pictures like I said when I was doing the horses and fishing."
    },
    {
      "speaker": "Anthony",
      "time": "00:57:53",
      "upperBoundTime": "00:58:31",
      "content": "I sent her pictures of every certificate I took, and look I'm going be something your proud of mom, it ain't your fault I'm in prison. But yeah, it was hard on them and I can imagine that like with the victim, so I mean, you're torn. I messed up a lot of people's lives with one simple decision to rob a house."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:31",
      "upperBoundTime": "00:58:40",
      "content": "Yeah and no it's amazing how that event changes the whole trajectory of your life."
    },
    {
      "speaker": "Anthony",
      "time": "00:58:40",
      "upperBoundTime": "00:58:58",
      "content": "Other people, it teaches you I guess more so than not be considerate of others. Everything you say, which you do, your actions it affects. I mean somebody might hear me say something out of my mouth, and if it's mean and derogatory I might affect this person. So, your conscience of what your do know because it does affect other people."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:58",
      "upperBoundTime": "00:59:13",
      "content": "You've said that prisons' been in some ways a constructive experience."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:13",
      "upperBoundTime": "00:59:17",
      "content": "It's because of the lessons you learn."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:17",
      "upperBoundTime": "00:59:24",
      "content": "Yeah, what's the worst part of prison for you now?"
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "My go to answer would be the system. It's hateful. They are not professional. You want me to be this way this way, your basically my step parents. When you get locked up, you're reborn as a convict, this is a whole new life. I've always had a thing like, keeping a prison locked up longer than he was at the age in which he first got locked up. I'm 21 years old when I get locked up."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "After 21 years of incarnation what more is there to teach? You in essence re-raised me. From birth to 21 I messed up, apparently someone didn't do something right so we are going to start over. So you call yourself the Department of Corrections, correct me. So I'm 21 years in now; my entire life up to that point, I don't have a memory past this, but I've been locked up now 23 years why don't you come and talk to me, to find out, did you do your job? Did you do your job, am I corrected?"
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "Am I the same person I was that committed this crime? And you should know more than anything. You have classifications, you have million upon millions of dollars getting dumped into the department of corrections, who are you correcting."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "I mean I'm in dormitory that's considered an honors dorm, Ash 1, nothing but trustees. And you got guys here that make me with 23 years seem like I'm a freshmen because they've been here 21, 25 a quarter of a century, half of a century, that's serious time."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "The worst part of this place is that it's just not professional. You have 18-year-old little women, working on the wall, who is younger than my daughter and there just screaming and talking to me in a kind of way, and your saying it's ok because \"Well he's a convicted felon\". Am I a convicted felon? I'm not the guy who walked into the prison who committed a crime yesterday."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "There's been more, I mean, the mass shooting that you hear about on a regular basis. I mean, this is all, I got locked up at a time where this wasn't even a popular thing. There and these guys are getting out of prison, Charles Manson used to say all the time. You can get a parole hearing, you're going to go before someone and say, who are we dealing with? I don't talk to nobody."
    },
    {
      "speaker": "Anthony",
      "time": "00:59:24",
      "upperBoundTime": "01:02:27",
      "content": "I'm waiting right now and they say after two years you can apply for your pardon without a write up. I'm waiting three years just to show them because I caught a very funny write up. In this prison things are okay till it's not okay. You have rules and these say these are the rules but as long there's so a 30 W, general prohibited behavior, what is that?"
    },
    {
      "speaker": "Marcus",
      "time": "01:02:27",
      "upperBoundTime": "01:02:30",
      "content": "Could be anything."
    },
    {
      "speaker": "Anthony",
      "time": "01:02:30",
      "upperBoundTime": "01:02:33",
      "content": "Right!"
    },
    {
      "speaker": "Marcus",
      "time": "01:02:33",
      "upperBoundTime": "01:02:42",
      "content": "You've accomplished a lot while you've been here, what s do you have for the next 10 or 20 years?"
    },
    {
      "speaker": "Anthony",
      "time": "01:02:42",
      "upperBoundTime": "01:02:45",
      "content": "If I got to stay in prison you mean?"
    },
    {
      "speaker": "Marcus",
      "time": "01:02:45",
      "upperBoundTime": "01:02:49",
      "content": "Either way."
    },
    {
      "speaker": "Anthony",
      "time": "01:02:49",
      "upperBoundTime": "01:03:38",
      "content": "I'd like to institute the level program. There's two things, if I got to stay in Angola, I'd like to start a level program, I'd like to start something that actually assists a board. I want to there's people like yourself, there's groups that come up here that are doing a lot to change the laws. I think that we should do something as inmates inside of this institution to assist them, because if it does work for them."
    },
    {
      "speaker": "Anthony",
      "time": "01:02:49",
      "upperBoundTime": "01:03:38",
      "content": "We need to ready to help them, to assist them, oh we got you the law is changed, but you've got guys that been here all this time and you're still an idiot, you're an idiot, you know, that doesn't help us because now the naysayers have and they're going to take that one worst case and they are going to overlook all this little. So I've got here 20 years, I want to go the police barracks and just because."
    },
    {
      "speaker": "Marcus",
      "time": "01:03:38",
      "upperBoundTime": "01:03:40",
      "content": "I hear it's better over there?"
    },
    {
      "speaker": "Anthony",
      "time": "01:03:40",
      "upperBoundTime": "01:05:01",
      "content": "For retirement, I accept that I have a life sentence I'm primly not going to leave a controlled environment, a prison style environment, but I'm not a 20 year old convict no more, I'm just a guy doing time and waiting for somebody to give me a second chance. I think that would be a good place to go. I don't have the foolishness no more. I don't care about the cellphones, all the stuff a typical youngster would do, to me the police barracks would be like a retirement."
    },
    {
      "speaker": "Anthony",
      "time": "01:03:40",
      "upperBoundTime": "01:05:01",
      "content": "Look I still got work in this I got a strong back. I'd like to see something where I could go to Parish and I could give back to the community take good inmates, that have worked, that established themselves being rehabilitated themselves, acknowledge their rehabilitated and send them to Parish prisons and give them a cellphone, make it a reward, here you go, anytime you can go and look at what you're doing with it because they have them anyway, you haven't stopped, I mean, it's here so if you make it available to a person, you can control it."
    },
    {
      "speaker": "Anthony",
      "time": "01:03:40",
      "upperBoundTime": "01:05:01",
      "content": "You start a black market and then it blows up, and they can't keep, and again their stuff in their 50's, their mentality, they can't keep up with technology and you have, what's the word? Millenniums? I guess they call them"
    },
    {
      "speaker": "Marcus",
      "time": "01:05:01",
      "upperBoundTime": "01:05:05",
      "content": "Millennial's."
    },
    {
      "speaker": "Anthony",
      "time": "01:05:05",
      "upperBoundTime": "01:05:28",
      "content": "Yeah, we got 17, 18-year-old kids coming in with fresh life sentences and they know more, I mean, you're still dealing with like a Windows 95 or some of these computers that we work on and these kids are like what, it's like what the hell. They are running laps around the administration and they can't keep up so do what you have to adapt, they're not doing so."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:28",
      "upperBoundTime": "01:05:33",
      "content": "What about if you get out? Do you have some specific things that you want to do?"
    },
    {
      "speaker": "Anthony",
      "time": "01:05:33",
      "upperBoundTime": "01:06:01",
      "content": "I'm sure I'd be involved in politics I guess, lobbying, I want to, I'm never going to go too far from corrections I don't think. I mean you go to school for 20 years to be a doctor, I'm sure you're going to be a doctor when you graduate school, well this is my school, this school of hard knock, I know that, I've been doing it for this many years I think I can assist."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:01",
      "upperBoundTime": "01:06:05",
      "content": "You have some expertise."
    },
    {
      "speaker": "Anthony",
      "time": "01:06:05",
      "upperBoundTime": "01:06:55",
      "content": "If Louisiana itself don't want to hear these ideas I'm sure, there has to be other places who would like to hear it, they got to have prisons that are violent out there, our count time."
    },
    {
      "speaker": "Anthony",
      "time": "01:06:05",
      "upperBoundTime": "01:06:55",
      "content": "And other than that I'd like to go back to my original, I'd like to open up a restaurant just sit back and- I want a very simple life, it's going to be no different than yours cause it's no different now, I get up in the morning, I go to my little work area, make myself a pot of coffee, drink my coffee, and I go to work, end of the day I clock out, I sit down, do a little hobby craft, watch a little TV, see what's on the news, see who got kicked off of Big Brother, go to sleep, start again in the morning."
    },
    {
      "speaker": "Anthony",
      "time": "01:06:05",
      "upperBoundTime": "01:06:55",
      "content": "I mean it's really no different, I know everybody thinks it is because they don't understand prison but my life would be the same now as yours was this morning."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:55",
      "upperBoundTime": "01:07:09",
      "content": "I get that. Is there something I should have asked in my quest to learn more about you? That we should have talked about, that I didn't give you an opportunity to talk about?"
    },
    {
      "speaker": "Anthony",
      "time": "01:07:09",
      "upperBoundTime": "01:07:10",
      "content": "What's that?"
    },
    {
      "speaker": "Marcus",
      "time": "01:07:10",
      "upperBoundTime": "01:07:14",
      "content": "Is there something that I should be asking you but I didn't?"
    },
    {
      "speaker": "Anthony",
      "time": "01:07:14",
      "upperBoundTime": "01:07:31",
      "content": "No, if you want to end with that question because if there was something on your mind as we went through here but we didn't get to usually I think we get to cover quite a bit of material."
    },
    {
      "speaker": "Anthony",
      "time": "01:07:31",
      "upperBoundTime": "01:07:31",
      "content": "I'm here to assist you all. I'm here to try to assist you guys, if you want to ask questions with some of the guys, ask them, what would you do to change, to better the place, what would you do to help, to encourage these people to make available? Nobody's asking to be let out, we're saying, hear me at least, review whether or not I belong here. That's all it boils down to."
    },
    {
      "speaker": "Anthony",
      "time": "01:07:31",
      "upperBoundTime": "01:07:31",
      "content": "If I don't belong in prison, I could do a lot more better at a halfway house even, I mean if you trust me enough to let me get a gate pass to leave the farm to do prison enterprise work at another institution on the street somewhere. I mean society thinks they got these gun guards with us the whole time. I mean I'm just like you."
    },
    {
      "speaker": "Anthony",
      "time": "01:07:31",
      "upperBoundTime": "01:07:31",
      "content": "When I took trips on the streets the first two or three times I was tense, I mean I would sweat a lot and I would stop at like a little Timesaver or something to use the restroom or maybe get a cola drink. And I realized after like the third time that nobody in this Timesaver, including the clerk, knows that I'm locked, the only person that knows I'm locked up is me."
    },
    {
      "speaker": "Anthony",
      "time": "01:07:31",
      "upperBoundTime": "01:07:31",
      "content": "They absolutely had no idea that I was an incarcerated inmate serving a life sentence and I'm like, until somebody says that, I want people to like, you meet me in prison. So if you meet me on the street to do this interview and we just talk and you're like were you an ex-felon or are a felon. I mean, are you incarcerated or are you, if you don't know but it makes a difference, the minute you hear it, all these stigmas and stereotypes come up."
    },
    {
      "speaker": "Marcus",
      "time": "01:07:31",
      "upperBoundTime": "01:09:13",
      "content": "Honestly, I mean I don't think it would change the way I talk to you but I totally understand what you're saying. No, I totally get it, it's a label and it has stigma."
    },
    {
      "speaker": "Anthony",
      "time": "01:09:13",
      "upperBoundTime": "01:09:46",
      "content": "I mean they're talking and they're laughing and the clerk will smile at you but if somebody says, that's an ex, I mean, that person is incarcerated prisoner at Angola. Really? So now everything, I turn from, my confidence turns to arrogance, my sternness turns to aggression it's like no, it's no different."
    },
    {
      "speaker": "Marcus",
      "time": "01:09:46",
      "content": "well I'm really grateful to have had the opportunity to talk to you, and I wish you all the best honestly. That's a good place to stop."
    }
  ]
}
