{"name":"","transcript":[{"content":"Archie Tyner Transcription REDACTIONS FINAL"},{"content":""},{"speaker":"Marcus","time":"00:00:00-3","content":"Why don't we start by, if I can get you to state your name I know the information but I'd like it to be on the record, your date of birth, the crime you were convicted of, and how many years you've served, and then I'll start asking you some questions."},{"speaker":"Marcus","time":"00:00:00-3","content":""},{"speaker":"Archie","time":"00:00:20-8","content":"Okay, my name is Archie Tyner, I was born on July 30, 1966 and I'm serving a life sentence for first degree murder. Been here for thirty one years."},{"speaker":"Archie","time":"00:00:20-8","content":""},{"speaker":"Marcus","time":"00:00:33-5","content":"Where did you grow up?"},{"speaker":"Marcus","time":"00:00:33-5","content":""},{"speaker":"Archie","time":"00:00:35-7","content":"Well the first nineteen years of my life I grew up in Longview Texas, and then the rest of the time has been here."},{"speaker":"Archie","time":"00:00:35-7","content":""},{"speaker":"Marcus","time":"00:00:42-9","content":"And what brought you to Louisiana?"},{"speaker":"Marcus","time":"00:00:42-9","content":""},{"speaker":"Archie","time":"00:00:46-2","content":"My codefendant. He sought me out from, he was living over in Louisiana in a little town called Minden. And came and sought me out in Longview, told me he had a job that he needed me to help him with, and that turned out to be a lie. But by me having three small babies and no job at the time I figured that it was a good idea for me to come to work and get cash money for the weekend and then go back home and then start my new job the following Tuesday."},{"speaker":"Archie","time":"00:00:46-2","content":"But the job with my codefendant never happened, and a man lost his life because I took part in a crime. And when my codefendant told me what he really wanted to have done I told him I didn't want anything to do with it and he told me if I didn't that he would kill my wife and kids."},{"speaker":"Archie","time":"00:00:46-2","content":"So, being on drugs at the time I thought it was the lesser of two evils to help him do what he was going to do to save my wife and kids. And then I went back home, started my new job that following Tuesday, and was in jail the next night, and haven't been home since."},{"speaker":"Archie","time":"00:00:46-2","content":""},{"speaker":"Marcus","time":"00:02:25-1","content":"Is your codefendant serving a life sentence?"},{"speaker":"Marcus","time":"00:02:25-1","content":""},{"speaker":"Archie","time":"00:02:27-4","content":"Yes he is. And he's, right now he's housed in David Wade Correctional Center on missionary."},{"speaker":"Archie","time":"00:02:27-4","content":""},{"speaker":"Marcus","time":"00:02:37-5","content":"Have you made peace with him?"},{"speaker":"Marcus","time":"00:02:37-5","content":""},{"speaker":"Archie","time":"00:02:40-6","content":"As far as being civil to him, yes. But I was taught at a young age you keep your friends close and you keep your enemies closer. So, I mean I let him know that we will never be friends but I'm not his enemy. I don't wish any harm to him but uh that God will do what he's got to do and he's going to have to suffer the consequences of his actions. But other than that, I wish him no harm."},{"speaker":"Archie","time":"00:02:40-6","content":""},{"speaker":"Marcus","time":"00:03:18-1","content":"Yeah, it's a strange thing to be serving a life sentence for first degree murder and also be somebody who has never killed anybody."},{"speaker":"Marcus","time":"00:03:18-1","content":""},{"speaker":"Archie","time":"00:03:30-7","content":"Right."},{"speaker":"Archie","time":"00:03:30-7","content":""},{"speaker":"Marcus","time":"00:03:33-6","content":"Can you tell me a little bit, so let's go back to Texas? Can you tell me a little bit about your family the folks who raised you?"},{"speaker":"Marcus","time":"00:03:33-6","content":""},{"speaker":"Archie","time":"00:03:42-3","content":"I was raised by my parents and have three older sisters and we had a…a good life but not a rich life. I mean dad was always working to make sure we had food on the table and a roof over our head but we didn't want for anything, and everything we needed we always had. And even had money every now and then for vacation, for summer break or something. I mean there was no abuse, or nothing like that. My dad drank a little bit but that was it. No violence."},{"speaker":"Archie","time":"00:03:42-3","content":""},{"speaker":"Marcus","time":"00:04:29-8","content":"Did your mother work outside the home?"},{"speaker":"Marcus","time":"00:04:29-8","content":""},{"speaker":"Archie","time":"00:04:32-1","content":"She did to an extent, but she was paralyzed from the waist down since before 1960 when my two oldest sisters were born. And she really couldn't do much but she would go and work with my dad cause he had his own business doing, I don't know if you remember them or not but they had gas lights with the mantels and stuff that you had to change."},{"speaker":"Archie","time":"00:04:32-1","content":"Well my dad had his own business and would take care of that kind of stuff and mom would go with him and work. He had a floor business where he would strip floors and re-wax them and stuff and she would go and do what little she could help him with which really wasn't much but she was there supporting him and giving him help."},{"speaker":"Archie","time":"00:04:32-1","content":""},{"speaker":"Archie","time":"00:04:32-1","content":""},{"speaker":"Marcus","time":"00:05:24-0","content":"Yeah and I expect that you all, part of your childhood was taking care of the physical needs of your mother."},{"speaker":"Marcus","time":"00:05:24-0","content":""},{"speaker":"Archie","time":"00:05:31-3","content":"Right, and I learned at a very early age how to cook for myself because it was difficult for mom to go in the kitchen and cook. Started doing housework around the house when my sisters didn't want to do what they were supposed to and taking care of mom was like a job for me."},{"speaker":"Marcus","time":"00:05:57-4","content":"The relationship between your mom and dad was good?"},{"speaker":"Marcus","time":"00:05:57-4","content":""},{"speaker":"Archie","time":"00:06:00-6","content":"Yes, even though after I was conceived they never slept in the same bed together, after that. My mom says \"No more\" I was the last one. But other than that, everything was fine."},{"speaker":"Archie","time":"00:06:00-6","content":""},{"speaker":"Marcus","time":"00:06:14-9","content":"Okay, what about close friends outside the home, do you have a couple of people that come to mind that were particularly close with you?"},{"speaker":"Marcus","time":"00:06:14-9","content":""},{"speaker":"Archie","time":"00:06:25-5","content":"I had a few that I can still to this day call my friends, even though I haven't heard from them in over thirty years. But a friend of mine named Lesley, guy I pretty much grew up with and went to school with but he quit school in the seventh grade, went to work with his dad. But we stayed real close and uh, we got married around the same time and our kids were raised together."},{"speaker":"Archie","time":"00:06:25-5","content":"But then there was a female friend and she moved from California to Longview in the early eighties, and we became real good friends. And used to try to keep me on the right track but I was always rebellious in that area I didn't care who it was, you know, trying to keep me on the right track. I wanted to get high and that's all I cared about."},{"speaker":"Archie","time":"00:06:25-5","content":""},{"speaker":"Marcus","time":"00:07:33-9","content":"Let's talk about when did that start?"},{"speaker":"Marcus","time":"00:07:33-9","content":""},{"speaker":"Archie","time":"00:07:36-2","content":"Getting high? When I was eight, and it steadily progressed after that. I started smoking weed and drinking the little pony bottles of beer when I was eight and by the time I was thirteen, looking back now, I was an alcoholic. I could probably drink mixed drinks with the best of them at thirteen. I shot my first drugs when I was thirteen and it just kept on getting worse."},{"speaker":"Archie","time":"00:07:36-2","content":"And then I end up getting my girlfriend pregnant and we got married, I was seventeen years old. And that's when my life started to change for the better at that point and because I knew that I had to slow down, I had responsibilities. But I didn't give everything up like I should have and you see the results."},{"speaker":"Archie","time":"00:07:36-2","content":""},{"speaker":"Marcus","time":"00:08:42-6","content":"Why do you think you started using alcohol and weed at such an early age?"},{"speaker":"Marcus","time":"00:08:42-6","content":""},{"speaker":"Archie","time":"00:08:49-5","content":"At first it was just curiosity and then once I found out how it made me feel then it was just because I enjoyed the way it made me feel."},{"speaker":"Archie","time":"00:08:49-5","content":""},{"speaker":"Marcus","time":"00:09:02-3","content":"Did your older sisters, did they also have a history of that?"},{"speaker":"Marcus","time":"00:09:02-3","content":""},{"speaker":"Archie","time":"00:09:06-0","content":"One of my older sisters, my two older sisters are twins, and one of them used to smoke weed, joints, and the other one didn't. My younger sister, the one that is between me and my older ones, yeah we used to party together all the time. I mean, she and I were real close, and we still are to this day. If there was anyone in my life that was actually my best friend, it was my little sister. See you always call her my little sister because she is my youngest sister."},{"speaker":"Archie","time":"00:09:06-0","content":""},{"speaker":"Marcus","time":"00:09:50-0","content":"What's her name?"},{"speaker":"Marcus","time":"00:09:50-0","content":""},{"speaker":"Archie","time":"00:09:50-8","content":"Melissa."},{"speaker":"Archie","time":"00:09:50-8","content":""},{"speaker":"Marcus","time":"00:09:52-6","content":"Does Melissa come and see you?"},{"speaker":"Marcus","time":"00:09:52-6","content":""},{"speaker":"Archie","time":"00:09:54-2","content":"Whenever she can save the money and come. Because she lives up about Dallas and it's a good little drive for her to come down here. And most of the time she comes once a year to see me and that's usually around my birthday and it's not going to happen this year but uh she's been having some financial problems and stuff. I told her, I said don't worry about me, said, you take care of yourself, I'm going to be okay."},{"speaker":"Archie","time":"00:09:54-2","content":""},{"speaker":"Marcus","time":"00:10:26-3","content":"What about the other two, the twins?"},{"speaker":"Marcus","time":"00:10:26-3","content":""},{"speaker":"Archie","time":"00:10:28-3","content":"One lives right outside Longview and the other one now in Pensacola and if they can find somebody to pay for the trip here to come see me then they come see me but they don't have the money to do it on their own."},{"speaker":"Archie","time":"00:10:28-3","content":""},{"speaker":"Marcus","time":"00:10:48-7","content":"So I'm assuming that you didn't finish high school, if you were busy getting married and having babies."},{"speaker":"Marcus","time":"00:10:48-7","content":""},{"speaker":"Archie","time":"00:10:54-2","content":"No, I quit in the tenth, well I quit in the eleventh grade. I finished the tenth grade and failed my first trip through eleventh grade and then in '83 I started my second trip through the eleventh grade and uh my dad died and when he went in the hospital I quit school after he went in the hospital because somebody had to be there to make money and bring it in the house."},{"speaker":"Archie","time":"00:10:54-2","content":"And when he died I took that real hard because I had an opportunity to go see him while he was in the hospital but I chose not to because, \"Hey dads going to be home in a week or so I'm not going to go see him in the hospital I'm going to wait until he comes home,\" I regret that. When my uncle come and told us, he pulls up in the yard and I was happy to see him so I come running out of the house and he tells me he says \"Boy, there ain't but one way to tell you this, your dad is dead,\""},{"speaker":"Archie","time":"00:10:54-2","content":"I did an about face run back in the house and put holes all in the wall with my feet and my hands and locked my door, stuck my knife in the door jam, so they couldn't open it, went out the window, and stayed gone for two weeks and nobody knew where I was at. Two days later when they had the funeral I showed up at the funeral and sat beside my mom, never spoke a word."},{"speaker":"Archie","time":"00:10:54-2","content":"When the funeral was over with I left, stayed gone, stayed loaded. And then I came to my senses, come back home told mom I apologize and then I find out that my girlfriends pregnant so another burden…turned out to be the best thing that ever happened."},{"speaker":"Archie","time":"00:10:54-2","content":""},{"speaker":"Marcus","time":"00:12:58-6","content":"You have three children?"},{"speaker":"Marcus","time":"00:12:58-6","content":""},{"speaker":"Archie","time":"00:12:58-6","content":"Three beautiful children."},{"speaker":"Archie","time":"00:12:58-6","content":""},{"speaker":"Marcus","time":"00:13:01-8","content":"Tell me about them."},{"speaker":"Marcus","time":"00:13:01-8","content":""},{"speaker":"Archie","time":"00:13:05-1","content":"That part is difficult. My daughter was born first, May 7th, 1984 and my twin sons were born the following June. When I got locked up my twins were eight months old and that was the last time I saw then since. Except in pictures and only a few over the years. I tried to stay in touch with them, I wrote those letters like every week for the first twenty years I was here. And by this time now they're all adults so I figured it's time for me to stop trying it's their choice."},{"speaker":"Archie","time":"00:13:05-1","content":""},{"speaker":"Marcus","time":"00:14:10-3","content":"Do you think they got the letters?"},{"speaker":"Marcus","time":"00:14:10-3","content":""},{"speaker":"Archie","time":"00:14:11-5","content":"Oh yeah, I know they did. But it's their choice."},{"speaker":"Archie","time":"00:14:11-5","content":""},{"speaker":"Marcus","time":"00:14:15-8","content":"Did they write you back?"},{"speaker":"Marcus","time":"00:14:15-8","content":""},{"speaker":"Archie","time":"00:14:17-0","content":"Nope, never. But, I mean, I don't hold it against them because I wasn't there and they feel like I abandoned them. I understand that but I mean it's just that's the most difficult part."},{"speaker":"Archie","time":"00:14:17-0","content":""},{"speaker":"Marcus","time":"00:14:35-4","content":"Oh yeah, I'm sorry."},{"speaker":"Marcus","time":"00:14:35-4","content":""},{"speaker":"Archie","time":"00:14:37-4","content":"No that's fine. I mean with me being incarcerated, that to me is the hardest part of it, being away from my kids."},{"speaker":"Archie","time":"00:14:37-4","content":""},{"speaker":"Marcus","time":"00:14:54-4","content":"Did you ever get kicked out of school before you quit?"},{"speaker":"Marcus","time":"00:14:54-4","content":""},{"speaker":"Archie","time":"00:14:57-0","content":"Got suspended a few times for fighting."},{"speaker":"Archie","time":"00:14:57-0","content":""},{"speaker":"Marcus","time":"00:14:59-6","content":"For fighting?"},{"speaker":"Marcus","time":"00:14:59-6","content":""},{"speaker":"Archie","time":"00:15:00-4","content":"Yeah, but most of the time that was just so we could get kicked out of school and have a few days off, go partying. But other than that, no."},{"speaker":"Archie","time":"00:15:00-4","content":""},{"speaker":"Marcus","time":"00:15:12-7","content":"Was there anything about school that you liked?"},{"speaker":"Marcus","time":"00:15:12-7","content":""},{"speaker":"Archie","time":"00:15:16-4","content":"I actually liked school. I wasn't very good because I was always getting loaded but I liked being in school, liked trying to learn. And it wasn't until later that I realized that I have what I call a retention problem. I can learn stuff but if I push it to the side and get away from it, it's gone my brain won't retain it. And I think that's because of my drug uses and other substances to get high on and I think it burned out part of my brain that does that but I still try."},{"speaker":"Archie","time":"00:15:16-4","content":"And after being clean now for a little over 20 years cause the first 11 years here I was an idiot. I'm starting to be able to keep stuff that I learn."},{"speaker":"Archie","time":"00:15:16-4","content":""},{"speaker":"Marcus","time":"00:16:20-3","content":"When you say getting loaded, what was your drug of choice."},{"speaker":"Marcus","time":"00:16:20-3","content":""},{"speaker":"Archie","time":"00:16:26-9","content":"Well that would be between crystal meth and LSD. But just about anything that I could get my hands on. Other than the only time I ever did heroine was smoked on a joint and didn't like it and did not like cocaine because if I'm going to spend money on something to get high on, it's going to last. Twenty minutes and have to buy more? No. So I never got into cocaine. But crystal meth, LSD, and good weed? Yes."},{"speaker":"Archie","time":"00:16:26-9","content":""},{"speaker":"Marcus","time":"00:17:07-1","content":"All of which were pretty easy to get here when you got here?"},{"speaker":"Marcus","time":"00:17:07-1","content":""},{"speaker":"Archie","time":"00:17:09-8","content":"Oh yeah. Still is, if you want it, but yeah."},{"speaker":"Archie","time":"00:17:09-8","content":""},{"speaker":"Marcus","time":"00:17:21-4","content":"Do you remember the first time you got arrested?"},{"speaker":"Marcus","time":"00:17:21-4","content":""},{"speaker":"Archie","time":"00:17:24-0","content":"Yes I do. I was thirteen-years-old."},{"speaker":"Archie","time":"00:17:24-0","content":""},{"speaker":"Marcus","time":"00:17:26-3","content":"And what was that about?"},{"speaker":"Marcus","time":"00:17:26-3","content":""},{"speaker":"Archie","time":"00:17:29-1","content":"I had just rolled up on my bicycle to my girlfriend's house and there was a guy that was fifteen-years-old that was trying to rape her. And I chased him out of the house and was running behind him, he got on his bicycle, and I pulled my knife and stabbed the tire, his back tire."},{"speaker":"Archie","time":"00:17:29-1","content":"And he ended up falling off the bicycle and I beat him up and he took off running and I destroyed his bicycle from where I was at to the back of a Winn-Dixie dumpster and I destroyed the bicycle and threw it in the dumpster."},{"speaker":"Archie","time":"00:17:29-1","content":"And about fifteen minutes later the police come and got me and charged me with aggravated assault. I was never formally charged but that's what they picked me up on and I ended up having to pay for the kids bicycle and that was it."},{"speaker":"Archie","time":"00:17:29-1","content":""},{"speaker":"Marcus","time":"00:18:29-9","content":"And then?"},{"speaker":"Marcus","time":"00:18:29-9","content":""},{"speaker":"Archie","time":"00:18:31-6","content":"And then when I was fifteen-years-old, in December, early January, December of '81, well no December of '80, January of '81, I went to Ohio with my current codefendant and we got in trouble for breaking into a pharmacy, and a motel room, and somebody's trailer house stealing stuff."},{"speaker":"Archie","time":"00:18:31-6","content":"But the motel we just broke in because we were on our way back to Longview and it was cold, it was winter time, snow was about two-and-a-half-foot deep and we needed a place to stay and didn't want to pay for the motel so we broke in."},{"speaker":"Archie","time":"00:18:31-6","content":"Woke up about two o'clock in the morning with a gun to my head and a whole room full of detectives arresting us. And thought I was going to die because I had an axe handle I was carrying up on the bed on top of the covers with a blue jean jacket with an axe handle, I was curled up around it. And the cop with the gun at my head says, \"Get up out of the bed and hold your hands up\""},{"speaker":"Archie","time":"00:18:31-6","content":"So when I get out, I raise my hands and the axe handle falls to the floor and all you hear is the hammers cocking back on them guns and I just knew I was going to die. I said \"Hold it, hold it, hold it! Its just a stick.\" And then they started laughing. I had a big old bag of weed in my pocket, detective comes over there and gets it, looks at it and stuck it down the front of his pants and I'm thinking to myself, well I just lost that, he wanted it more than I did. But, that was my second time. And then the third time, I was nineteen and it was again right at Christmas time."},{"speaker":"Archie","time":"00:18:31-6","content":"I got arrested for public intoxication and burglary of an apartment. But they dropped the charges on the burglary because I was actually living at the apartment and somebody that wasn't living there tried to press charges. But my little sister made them drop it because they were doing illegal stuff my sister told them \"If my little isn't out by Christmas y'all will be right there in the cell with them.\""},{"speaker":"Archie","time":"00:18:31-6","content":"So they dropped the charges. But I did three days for the public intoxication and that still didn't teach me a lesson."},{"speaker":"Archie","time":"00:18:31-6","content":""},{"speaker":"Marcus","time":"00:21:16-4","content":"How did you meet your codefendant?"},{"speaker":"Marcus","time":"00:21:16-4","content":""},{"speaker":"Archie","time":"00:21:19-8","content":"Well that's a good one. I was thirteen and he was dating a friend of mines mother and me and my friend was always getting high out behind the house. And my codefendant, he's a few years older than me like probably seven or eight years older than me and he smelled us smoking weed one day, so he comes out, looks and he says, \"You got any more of that?\" Maybe."},{"speaker":"Archie","time":"00:21:19-8","content":"So then we started our conversation and then I started getting weed for him because he didn't know anybody at the time who could get him weed on a regular basis. So, when I started getting the weed for him and everything we started getting closer and just riding around and getting high together and stuff."},{"speaker":"Archie","time":"00:21:19-8","content":"That was a very big mistake but I mean, didn't know at the time, and didn't care at the time. Because when he would give me money I would take the money, I would go and get the weed, take some of his weed out for myself, and then bring his weed back to him. So I got free weed."},{"speaker":"Archie","time":"00:21:19-8","content":""},{"speaker":"Marcus","time":"00:22:15-0","content":"You're thirteen."},{"speaker":"Marcus","time":"00:22:15-0","content":""},{"speaker":"Archie","time":"00:22:15-3","content":"Oh yeah."},{"speaker":"Archie","time":"00:22:15-3","content":""},{"speaker":"Marcus","time":"00:22:19-2","content":"Well I want to talk about, I want to leave that part and I want to talk about the vast majority of your life which has been since then."},{"speaker":"Marcus","time":"00:22:19-2","content":""},{"speaker":"Archie","time":"00:22:32-3","content":"In here."},{"speaker":"Archie","time":"00:22:32-3","content":""},{"speaker":"Marcus","time":"00:22:33-4","content":"Yeah. So I'm sure you spent a bit of time in the parish prison somewhere while you were on trial."},{"speaker":"Marcus","time":"00:22:33-4","content":""},{"speaker":"Archie","time":"00:22:40-3","content":"Little over three months. March 6, 1986 is when I got arrested, July 7, '86 I was sitting here. Convicted and sentenced."},{"speaker":"Archie","time":"00:22:40-3","content":""},{"speaker":"Marcus","time":"00:22:53-9","content":"That was quick."},{"speaker":"Marcus","time":"00:22:53-9","content":""},{"speaker":"Archie","time":"00:22:55-5","content":"Because I pled guilty."},{"speaker":"Archie","time":"00:22:55-5","content":""},{"speaker":"Marcus","time":"00:22:59-2","content":"I guess one more question about that, did your codefendant plead guilty too?"},{"speaker":"Marcus","time":"00:22:59-2","content":""},{"speaker":"Archie","time":"00:23:04-5","content":"Right beside me."},{"speaker":"Archie","time":"00:23:04-5","content":""},{"speaker":"Marcus","time":"00:23:05-4","content":"Okay, both of you. So one of the reasons that we wanted to talk with you is because you've been identified by other inmates, security, as being a thoroughly trusted, rehabilitated member of the community. As you know we're trying to shine a light on that and perhaps when we shine a light on folks like yourself it begs the question: does it make sense to keep this guy here until he dies?"},{"speaker":"Marcus","time":"00:23:05-4","content":"And that's a part of the project. In thirty years everyone's going to change. Some people change for the better, and some don't. How have you changed? How would you explain the changes that you've gone through to say a parole board or a pardon board."},{"speaker":"Marcus","time":"00:23:05-4","content":""},{"speaker":"Archie","time":"00:24:03-2","content":"Before I could do that I would have to try to explain how I used to be when I first came here. And when I first got here, I'm nineteen-years-old, I look like I'm fifteen and might weigh 140 pounds. So pretty much everybody here is bigger than I am and of course I'm scared, but I don't want anybody else to know so I've got an attitude I've got a chip on my shoulder which was more like a block. And I just would I guess you would say I would blow up at people, for no reason."},{"speaker":"Archie","time":"00:24:03-2","content":"The second day I was here I got in a fight because I guy had stolen a bar of soap, and then he comes and tells me about it. And I already knew what was taking place, he was wanting to see if somebody else made me do that. To see how I was going to react. If I was going to fight, if I could fight, because that way they would know what they was getting up against if they presented itself to me themselves."},{"speaker":"Archie","time":"00:24:03-2","content":"So I mean when they found out that yes I can and will fight then for two years I didn't have any problems. And then somebody else tried the same thing and I got in another fight but after they found out that they was messing with the wrong person for the wrong reasons, then my troubles kind of stopped in that area."},{"speaker":"Archie","time":"00:24:03-2","content":"But with security I had an attitude with security, because I felt like they were always singling me out to cause me problems and I would have, however they would talk to me then that's how I would talk to them and so I got a bunch of disrespect write-ups and defiance and stuff like that. And was always getting high, never got busted with drugs. And then in '91, you know what the disciplinary camp is? Camp J."},{"speaker":"Archie","time":"00:24:03-2","content":"Well I went to work over there in the dormitory, I was living in the dormitory working on the tiers and had been over there for four or five days and ordered some hobby craft materials and when they came in I go to the kitchen to eat and as I'm leaving out the doors the security officer says, \"come here let me shake you down\" and all he did was stuck his finger in my pocket and he came out with a joint. And he said \"What's this?\""},{"speaker":"Archie","time":"00:24:03-2","content":"I have no idea I said, \"You're the one who stuck your finger in my pocket\" But the guy, I was on his hobby shop box he set me up with the joint so he could keep all my hobby craft stuff and I'd get moved. So that's the only drug charge I've had since I've been here but I mean I probably should've had several because of all the times I was getting high and stuff. But in 1995 my mother died, and I took that extremely hard but I internalized it, I didn't let it show."},{"speaker":"Archie","time":"00:24:03-2","content":"And for I guess four or five months nobody even knew because they didn't go through the proper channels through the chaplains department to let me know. The guard came to the door, handed me a piece of paper with my sisters phone number on it and said, \"Look you need to call your sister\" And that's how I found out my mother died."},{"speaker":"Archie","time":"00:24:03-2","content":"And so nobody else knew and then they have a, I guess you call it a religious group that comes up here called cot ropes and that's where a bunch of different religions get together and they send people up here to show God's love and I was chosen to go through one of their weekends which was from Thursday evening to Sunday evening."},{"speaker":"Archie","time":"00:24:03-2","content":"And during that weekend is when the positive change happened in my life. And I got to thinking, I'm just wasting my life here when I could do something that's not only beneficial to me but other people and if I keep on being a knucklehead then I'm no good to anybody. So that is what helped me to start getting my life on track."},{"speaker":"Archie","time":"00:24:03-2","content":""},{"speaker":"Marcus","time":"00:28:41-6","content":"Right around the time that your mother died."},{"speaker":"Marcus","time":"00:28:41-6","content":""},{"speaker":"Archie","time":"00:28:43-1","content":"Yes, and the conversation I had with her the week before, I used to call her every Sunday morning about 6:30 every Sunday morning. And the week before she died we had a real good conversation and I told her I said \"Mom, I just want you to know that I'm not here because you failed, you know, I'm here because of me I made these choices, and I just want you to know that you were the best mother ever,\" and she said \"I really appreciate that\"."},{"speaker":"Archie","time":"00:28:43-1","content":""},{"speaker":"Marcus","time":"00:29:23-7","content":"It's great that you had a chance to tell her."},{"speaker":"Marcus","time":"00:29:23-7","content":""},{"speaker":"Archie","time":"00:29:26-0","content":"Yeah and I think, now, looking back, that that's what she was waiting on. Because I mean my mother was forty-four when I was born and so she was sixty-eight when she died. Fixing to be sixty-nine and I mean she was tired, and she couldn't hold on any longer but she was trying you know, hoping that I would be able to get out before she passed. But, I mean it's that I was able to help her just go on her way."},{"speaker":"Archie","time":"00:29:26-0","content":""},{"speaker":"Marcus","time":"00:30:13-8","content":"So what's a typical day like for you now? What's your routine?"},{"speaker":"Marcus","time":"00:30:13-8","content":""},{"speaker":"Archie","time":"00:30:18-3","content":"I get up in the morning at usually between 4:30-5 and whenever they call shower and breakfast I go to breakfast and then I go walk the road from the main prison \"Abuilding\" To the front gate and back. And spend most of my day either laying in bed reading or watching TV and doing the best I can to stay out of trouble."},{"speaker":"Archie","time":"00:30:18-3","content":""},{"speaker":"Marcus","time":"00:30:44-2","content":"You do that walk just for the sake of walking?"},{"speaker":"Marcus","time":"00:30:44-2","content":""},{"speaker":"Archie","time":"00:30:47-4","content":"Well I go up through there picking up trash but yes, for me? Yes I go for the walk for exercise and peace of mind."},{"speaker":"Archie","time":"00:30:47-4","content":""},{"speaker":"Marcus","time":"00:30:57-0","content":"What do you like to read?"},{"speaker":"Marcus","time":"00:30:57-0","content":""},{"speaker":"Archie","time":"00:31:00-4","content":"Pretty much anything non-fiction I mean fiction. I don't like non-fiction because I can't stay focused on it and cause to me it's like reading school stuff and I, it brings back memories of not being able to keep what I learned and so I just stay away from the nonfiction."},{"speaker":"Marcus","time":"00:31:20-6","content":"What are you reading now?"},{"speaker":"Marcus","time":"00:31:20-6","content":""},{"speaker":"Archie","time":"00:31:25-3","content":"It's a book about a serial killer from John Canalda called, \"Dead Everything.\" The guy that's doing the stuff is really sick, but it keeps me occupied."},{"speaker":"Archie","time":"00:31:25-3","content":""},{"speaker":"Marcus","time":"00:31:51-3","content":"Allows you to escape somewhere else."},{"speaker":"Marcus","time":"00:31:51-3","content":""},{"speaker":"Archie","time":"00:31:52-8","content":"Right, and I mean it's hard to stay occupied with stuff that's positive and while reading a serial killer book may not be positive but it still helps me stay out of trouble. And I'm to myself, not bothering anybody, nobody's coming to bother me and that's generally my whole day. Get on the little kiosk every now and then and send emails to my family"},{"speaker":"Archie","time":"00:31:52-8","content":""},{"speaker":"Marcus","time":"00:32:25-4","content":"Do you have any relationship at all with your wife?"},{"speaker":"Marcus","time":"00:32:25-4","content":""},{"speaker":"Archie","time":"00:32:30-0","content":"My ex-wife. The last time I talked to her or had any form of correspondence from her was in 2011 when they had a group of us left from here to go to a facility up in north Louisiana at Fort Wade and uh we went up there to build a chapel. And once again it was winter time, January, and we stepped out of the van and its thirteen degrees and I'm in a t-shirt and I look up like this. And I was at home, because I was seventy-five miles from my house."},{"speaker":"Archie","time":"00:32:30-0","content":"I had visits every weekend for three months, so yeah I was happy then. But I had it planned out for my ex-wife, her current husband and my kids to come visit me while I was there because I was so close. The warden up there said he didn't think that it was a good idea for me to visit with my ex-wife and her husband with my kids. I said, \"You do understand that that's the only way I'm going to be able to see my kids, and I haven't seen them since 1986.\" \"Well I don't care, it's my decision.\""},{"speaker":"Archie","time":"00:32:30-0","content":"I said, \"Well excuse me but my warden is over you, because he's the warden over all the wardens so I think that his word goes a lot further than yours\" But I still didn't get to see my ex-wife of kids or anything, other than my sisters and my niece."},{"speaker":"Archie","time":"00:32:30-0","content":""},{"speaker":"Marcus","time":"00:34:18-0","content":"What over thirty years, I know you said you've wasted some of that time."},{"speaker":"Marcus","time":"00:34:18-0","content":""},{"speaker":"Archie","time":"00:34:18-0","content":"Oh yeah."},{"speaker":"Archie","time":"00:34:18-0","content":""},{"speaker":"Marcus","time":"00:34:26-4","content":"What skills and trades have you developed what organizations have you been a part of?"},{"speaker":"Marcus","time":"00:34:26-4","content":""},{"speaker":"Archie","time":"00:34:33-2","content":"Well in '88 I got my GED and then in '92 I started with the Northwest Missouri Community College computer course and then President Clinton took away the Pell grants so I got kicked out of the class. And then in '99 I started in the automotive voteck on the compound and graduated that in 2002."},{"speaker":"Archie","time":"00:34:33-2","content":""},{"speaker":"Marcus","time":"00:35:06-9","content":"Is that John Sheehan?"},{"speaker":"Marcus","time":"00:35:06-9","content":""},{"speaker":"Archie","time":"00:35:08-8","content":"That was before John, but that's the same group and we had an actual instructor, free world instructor teaching us. But uh, after that, that was my last adventure into vocation or education and I'd had enough of school. And my ulterior motive for auto mechanic's was to one day go to the police barracks because I figured if I'm going to be locked up I might as well be able to live a more comfortable while I'm incarcerated."},{"speaker":"Archie","time":"00:35:08-8","content":"It's a lot better environment over there than it is here but it didn't happen so then I've been a part of three different inmate organizations. One was at Camp D called 'social orientation club', and for I think three years I was a dorm rep for the club."},{"speaker":"Archie","time":"00:35:08-8","content":""},{"speaker":"Marcus","time":"00:36:18-2","content":"What did they do?"},{"speaker":"Marcus","time":"00:36:18-2","content":""},{"speaker":"Archie","time":"00:36:20-2","content":"They just generated money to buy sports equipment and stuff and to buy like donuts and popcorn and stuff for the population of the camp. And had different substance abuse classes and stuff like that. And then, when I came to main prison in '92 I joined the sober group AA. And I've been a member ever since and concession worker for them, cooking barbeque for them at the, and taking pictures for them at the rodeo. And that was an experience."},{"speaker":"Archie","time":"00:36:20-2","content":"That's where I started talking to the youngsters. Their parents and stuff would see me and they'd think that I'm an employee instead of a prisoner. And when they find out I'm a prisoner, \"Really?!\" They look at me like I'm crazy. And I'm like yeah, \"well you sure don't act like one, you don't talk like one. Would you be willing to talk to my son or my daughter?\""},{"speaker":"Archie","time":"00:36:20-2","content":"\"Sure! Here you take this camera and I'll go stand over here and talk,\" And since then several of the youngsters I talk to actually come back a few years later and thank be for helping them get their life back on track. And says nobody's ever talked to them like that before or since and they took heed of what I told them?"},{"speaker":"Marcus","time":"00:38:04-2","content":"What did you tell them?"},{"speaker":"Marcus","time":"00:38:04-2","content":""},{"speaker":"Archie","time":"00:38:05-5","content":"That they need to, whatever they do, stay away from drugs of any kind. Unless the doctor gives it to you, don't take it. And if the doctor does give it to you, take it as prescribed. Because if you don't, then this is where you're going to end up. Regardless of how you feel or what you think, this is the end result. And I said, no matter what your parents as long as it's not detrimental to your health then you need to do it because they're right."},{"speaker":"Archie","time":"00:38:05-5","content":"I said, if I had listened to mine, I wouldn't be here. And I said, education is what you need because that's what's going to help you in your future life. And I said, several of them, I haven't met many, but several have come back and told me that I helped them out."},{"speaker":"Archie","time":"00:38:05-5","content":""},{"speaker":"Marcus","time":"00:39:02-3","content":"Yeah, it carries quite a bit of weight coming from you."},{"speaker":"Marcus","time":"00:39:02-3","content":""},{"speaker":"Archie","time":"00:39:05-6","content":"That helps make me know that I'm doing something within myself."},{"speaker":"Archie","time":"00:39:05-6","content":""},{"speaker":"Marcus","time":"00:39:12-2","content":"Yeah sure. You know this is prison, it's considered to be a privilege to be sent to a prison in the police barracks, is that generally what it's understood as?"},{"speaker":"Marcus","time":"00:39:12-2","content":""},{"speaker":"Archie","time":"00:39:35-5","content":"Yes."},{"speaker":"Archie","time":"00:39:35-5","content":""},{"speaker":"Marcus","time":"00:39:37-7","content":"What is the worst thing, you've been here thirty years you've seen just about everything I imagine. What is the worst thing for you now about being in prison?"},{"speaker":"Marcus","time":"00:39:37-7","content":""},{"speaker":"Archie","time":"00:39:58-6","content":"Overall I guess it would have to be watching my family die and not being out there with them. I mean it's been quite a few of my family members that have passed since I've been locked up. And it never gets easy, no matter how close we were or not, that's your family, you know. But other than that it's seeing the young people come here and they haven't got a clue as to what this place is really about, you know being locked up in prison, especially with a life sentence."},{"speaker":"Archie","time":"00:39:58-6","content":"They just go about their everyday routine like it means nothing to them. All they care about is how much money their family is going to send them and when they're coming back to visit so they can get more stuff. And that's something I have never been able to understand, you know, they care about nothing."},{"speaker":"Archie","time":"00:39:58-6","content":""},{"speaker":"Marcus","time":"00:41:11-8","content":"Do you think it's changed over time? Like the young guys who are coming in on a life sentence are they considerably different now than they were when you were nineteen?"},{"speaker":"Marcus","time":"00:41:11-8","content":""},{"speaker":"Archie","time":"00:41:24-0","content":"Most of them are pretty much the same way I was, an idiot. But it's a lot worse now because of the type of stuff they have now to get high on it's a lot worse than the stuff that I grew up getting high on. And I mean, so their brains are, most of them totally wiped out. And until they can get off and get clean for a long time they're going to have mental issues."},{"speaker":"Archie","time":"00:41:24-0","content":"But they, I don't know they just come up here, like I said, and act like this is the place to be, because almost everybody they know is here. And they haven't figured out why that is. And until they figure that out, the place is going to continue to get worse."},{"speaker":"Archie","time":"00:41:24-0","content":""},{"speaker":"Marcus","time":"00:42:33-1","content":"Are you hopeful that one day you will be released?"},{"speaker":"Marcus","time":"00:42:33-1","content":""},{"speaker":"Archie","time":"00:42:36-3","content":"I've always had hope. And as long as I have breath in my body I'm always going to have hope. And even though there's no guarantee, even if I get a recommendation on the pardon board which right now, short of me finding something miraculous to put back in court, that's going to be my only alternative. And I know that there's no guarantee in that but I'm not going to let that keep me from progressing myself."},{"speaker":"Archie","time":"00:42:36-3","content":""},{"speaker":"Marcus","time":"00:43:10-9","content":"Do you see people lose hope? Just kind of finally just accept it."},{"speaker":"Marcus","time":"00:43:10-9","content":""},{"speaker":"Archie","time":"00:43:16-2","content":"Everyday. And you just look around, and people be walking with their heads down. And then their health will start going down, and then when they end up in the hospital;, and their over there on the ward and being told that they have cancer, then it's a very short time later, they're gone. Because they have no reason to keep on going because they're essentially dead already."},{"speaker":"Archie","time":"00:43:16-2","content":""},{"speaker":"Marcus","time":"00:43:46-3","content":"So when people lose hope you see their health decline?"},{"speaker":"Marcus","time":"00:43:46-3","content":""},{"speaker":"Archie","time":"00:43:50-5","content":"All the time."},{"speaker":"Archie","time":"00:43:50-5","content":""},{"speaker":"Marcus","time":"00:43:55-4","content":"Have you ever been involved with the hospice program?"},{"speaker":"Marcus","time":"00:43:55-4","content":""},{"speaker":"Archie","time":"00:43:59-7","content":"Not in itself, but I did have a very close friend of mine that developed dementia from, they said was from his job, which was welding. And all the fumes and stuff over the years that he was breathing in. And he ended up on the ward and I ended up going over there, taking care of him and everything."},{"speaker":"Archie","time":"00:43:59-7","content":"And then he got so bad that they, he had two life sentences and like three hundred years for different charges and they gave him parole and paroled him out to a nursing home place in Jackson, Louisiana."},{"speaker":"Archie","time":"00:43:59-7","content":"And when he left, that was the last time that I had anything to do with it because I can't take it. Because if it's somebody that I'm close to, I don't want to be there, over there taking care of them and their dying, and there's nothing I can do. And I don't know, I just can't handle it."},{"speaker":"Archie","time":"00:43:59-7","content":""},{"speaker":"Marcus","time":"00:45:07-4","content":"It's a very difficult thing to do, it takes a special kind of person I think to work over there."},{"speaker":"Marcus","time":"00:45:07-4","content":""},{"speaker":"Archie","time":"00:45:13-4","content":"Right, it sure does."},{"speaker":"Archie","time":"00:45:13-4","content":""},{"speaker":"Marcus","time":"00:45:18-0","content":"Is there something the prison administration, security, could do to, that would help people turn their lives around more quickly like the young guys coming in. Or are there certain things they do that make that harder for people to turn their lives around."},{"speaker":"Marcus","time":"00:45:18-0","content":""},{"speaker":"Archie","time":"00:45:37-6","content":"Well one thing they could do to make it easier for that transformation would be to actually listen and try to help them get their lives straight. Instead of just being security or an employee. But, I mean, I don't know if they realize that they have that ability."},{"speaker":"Archie","time":"00:45:37-6","content":"Because I mean if they actually talked to somebody like they're a human instead of a number than that would make a big difference, you know if they actually cared. And I know over the thirty years I've been here, I know a lot of the employees here whether they're security or administration or working at the hospital or whatever, a lot of them actually do care but their hands are tied because if they talk to you like you're a human and listen to what you're actually saying then they might get caught up in an unprofessional relationship and they can't afford to lose their job so most people don't try."},{"speaker":"Archie","time":"00:45:37-6","content":"And that's the bad part of being an employee here. You know, if you do care about fellow humans you're going to want to show it, and want to help, but if you're hindered by laws or rules that can be misconstrued with your actions then, I mean, they don't even want to try."},{"speaker":"Archie","time":"00:45:37-6","content":""},{"speaker":"Marcus","time":"00:45:37-6","content":"They're trying to find that line between being professional and following the rules, and caring just because you're another human being. It's maybe, that's a difficult line for them sometimes."},{"speaker":"Marcus","time":"00:45:37-6","content":""},{"speaker":"Archie","time":"00:47:35-9","content":"Yep, and it's also a difficult line for the prisoners."},{"speaker":"Archie","time":"00:47:35-9","content":""},{"speaker":"Marcus","time":"00:47:35-9","content":"What do you think if you had to find something, what's the best thing about Angola?"},{"speaker":"Marcus","time":"00:47:35-9","content":""},{"speaker":"Archie","time":"00:47:52-7","content":"The best thing now is all of the opportunities available to better yourself. But you have to want to better yourself before you're able."},{"speaker":"Archie","time":"00:47:52-7","content":""},{"speaker":"Marcus","time":"00:48:06-4","content":"Yeah, you're a good example of that."},{"speaker":"Marcus","time":"00:48:06-4","content":""},{"speaker":"Archie","time":"00:48:09-6","content":"I do the best I can. I mean I'm not perfect but I mean."},{"speaker":"Archie","time":"00:48:09-6","content":""},{"speaker":"Marcus","time":"00:48:14-2","content":"You've taken advantage of a lot of things."},{"speaker":"Marcus","time":"00:48:14-2","content":""},{"speaker":"Archie","time":"00:48:16-0","content":"I've tried and I'm not going to stop, you know, but I mean as far as my education stuff goes, I know I'm at my limit. So I mean it's not much more can fit up in there but, I'm not going to let it stop me from being the person I am now."},{"speaker":"Archie","time":"00:48:16-0","content":""},{"speaker":"Marcus","time":"00:48:46-9","content":"What are you most proud of?"},{"speaker":"Marcus","time":"00:48:46-9","content":""},{"speaker":"Archie","time":"00:48:50-8","content":"The changes that's been made in my life. And not, I can't say that I made the changes, but the changes that have been made in my life. Because if I hadn't come to prison and hadn't spent this much time here, I wouldn't be the person I am now. Matter of fact, I would be dead. I would've been dead before I turned twenty-one. But you know the higher powers saw fit to give me another chance. Regardless of whether it's in here or outside, I am what I am now."},{"speaker":"Archie","time":"00:48:50-8","content":""},{"speaker":"Marcus","time":"00:49:35-2","content":"What are your goals? I know you've said you've reached your education limit. What are your goals for the next ten years?"},{"speaker":"Marcus","time":"00:49:35-2","content":""},{"speaker":" Archie","time":"00:49:42-1","content":"To continue to reach out to the at risk youth. My niece back home works for the district attorney's office and the district attorney's office has an at risk youth program and her boss has already told her that I'm on the list to be a part of that program because he needs people like me and so that is going to be my main focus when I do go home. But like I said, if I don't go home, I sell hobby craft at the rodeo. And I'm not behind a fence, I'm right there."},{"speaker":" Archie","time":"00:49:42-1","content":"People can come up and talk to me and I can spend all my day right there talking to somebody trying to help them get their life straight. And when I go out there to sell hobby craft, I don't care if I sell anything or not. You know, if I have the opportunity to talk to somebody and maybe help them out and get their life back on track that's what I'm going to do. I mean if I sell something, I sell something if I don't I don't. I make eight dollars a week walking the road picking up trash so."},{"speaker":" Archie","time":"00:49:42-1","content":""},{"speaker":"Marcus","time":"00:50:59-5","content":"What do you make and sell at the hobby craft show?"},{"speaker":"Marcus","time":"00:50:59-5","content":""},{"speaker":"Archie","time":"00:51:03-1","content":"Well I used to do beaded necklaces with hematite and other little rocks and stuff. But now I'm trying my hand at painting and I'm really new at painting so I'm not really good. I can't draw stick people with a ruler, but I'm trying."},{"speaker":"Archie","time":"00:51:03-1","content":""},{"speaker":"Marcus","time":"00:51:30-7","content":"Is there something about the prison experience that I haven't asked you about that you think is important to talk about? Is there something about you that I didn't ask you that I didn't give you an opportunity to talk about?"},{"speaker":"Marcus","time":"00:51:30-7","content":""},{"speaker":"Archie","time":"00:51:50-9","content":"Not that I can think of."},{"speaker":"Archie","time":"00:51:50-9","content":""},{"speaker":"Marcus","time":"00:51:53-2","content":"Well I have to say that for somebody who said you're nervous talking about things, you didn't seem a tiny bit nervous."},{"speaker":"Marcus","time":"00:51:53-2","content":""},{"speaker":"Archie","time":"00:52:01-3","content":"Believe me, I am. And I don't think I've stopped shaking since I sat down."},{"speaker":"Archie","time":"00:52:01-3","content":""},{"speaker":"Marcus","time":"00:52:06-1","content":"You did a fantastic job and I'm very grateful. And you never even looked at the piece of paper. Thank you very much Archie, I appreciate it."}]}