{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:11",
      "content": "Arthur Carter Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Arthur",
      "time": "00:00:11",
      "upperBoundTime": "00:00:25",
      "content": "My name is Arthur Carter my date of birth is 10th October 1963 I was convicted of second degree murder in 1988 and I've served 30 years in Angola."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:25",
      "upperBoundTime": "00:00:34",
      "content": "Wow, so you were 24 years old. I'm going to start I'm going to ask you a few questions about your time before coming here."
    },
    {
      "speaker": "Arthur",
      "time": "00:00:34",
      "upperBoundTime": "00:00:36",
      "content": "I was 24 years old when I was convicted."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:36",
      "upperBoundTime": "00:00:38",
      "content": "So I'm going to ask you a few questions about before that."
    },
    {
      "speaker": "Arthur",
      "time": "00:00:38",
      "upperBoundTime": "00:00:39",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:39",
      "upperBoundTime": "00:00:46",
      "content": "And then obviously you've gone through all kind of changes in 30 years we want to try to capture a little bit of that too."
    },
    {
      "speaker": "Arthur",
      "time": "00:00:46",
      "upperBoundTime": "00:00:48",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:48",
      "upperBoundTime": "00:00:56",
      "content": "So can you tell me a little bit about where you grew up who your family was and who took care of you? Who raised you?"
    },
    {
      "speaker": "Arthur",
      "time": "00:00:56",
      "upperBoundTime": "00:01:31",
      "content": "I grew up in New Orleans from an area of New Orleans called the 9th Ward. Mom and Dad raised me I was raised practically the first 17 years of my life with a little sister 4 years younger than me. Mom is in the house my dad was in the house. My dad worked as a paint contractor, my mom was like a stay-at-home mom and after about like 17 years old my dad and my mom became pregnant with my little brother. So I have a little brother that's like 17 years younger than I am and a sister that's 3 years younger than me."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:31",
      "upperBoundTime": "00:01:42",
      "content": "Okay and would it be accurate to say that you were raised in a nurturing caring environment?"
    },
    {
      "speaker": "Arthur",
      "time": "00:01:42",
      "upperBoundTime": "00:02:24",
      "content": "Yes sir I would say that I would say that 100% I would say that the circumstances of my life are so much different than a lot of guys that I'm doing time. Talk about all these broken childhoods and stuff my dad like I said he was a painting contractor he always stayed at work we wouldn't see him till like 4 or 5 in the evening. My mom was there I would come home from school she'd be there with lunch or whatever we would just go in front of the TV watch cartoons."
    },
    {
      "speaker": "Arthur",
      "time": "00:01:42",
      "upperBoundTime": "00:02:24",
      "content": "At some point be outside playing until my dad come home, once he takes his bath and stuff she'd call us and from outside and we'd all have dinner together. Yeah I came from a very nurturing loving family."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:24",
      "upperBoundTime": "00:02:27",
      "content": "Was the relationship between your parents good?"
    },
    {
      "speaker": "Arthur",
      "time": "00:02:27",
      "upperBoundTime": "00:02:52",
      "content": "Excellent my mom would like always being a part of our lives she was really the go to everyday. Dad was like, that the dad you go to him when you really really need something mom tell you go tell your dad. When he came home from work he greeted us hugged us he showed us love by always giving us the thing that he thought we wanted to have and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:52",
      "upperBoundTime": "00:02:57",
      "content": "So what about outside the home was there a lot of fighting in your growing up?"
    },
    {
      "speaker": "Arthur",
      "time": "00:02:57",
      "upperBoundTime": "00:03:04",
      "content": "Not necessarily we uh we didn't stay in the projects I know the 9th Ward is kind of like a hard area but we stayed I lived on Independence and Galvez."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:04",
      "upperBoundTime": "00:03:06",
      "content": "I remember that."
    },
    {
      "speaker": "Arthur",
      "time": "00:03:06",
      "upperBoundTime": "00:03:34",
      "content": "But there was no fighting periodically might fight over football or basketball game there was no gang fighting or anything my friends stayed around the corner on Congress and Galvez I was on the independence and Galvez. We just kind of like went from one street to the next playing and that's it. I mean it wasn't no like robberies or gang violence my life nothing I thought I remember this was back in the seventies too."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:34",
      "upperBoundTime": "00:03:37",
      "content": "Yeah I know exactly where you're talking about."
    },
    {
      "speaker": "Arthur",
      "time": "00:03:37",
      "upperBoundTime": "00:03:40",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:40",
      "upperBoundTime": "00:03:43",
      "content": "What about friends did you have some best friends that you stayed?"
    },
    {
      "speaker": "Arthur",
      "time": "00:03:43",
      "upperBoundTime": "00:04:28",
      "content": "Yeah my first cousin Steven Hutchins that was like he was like a brother and a friend who is like my closest friend I had other friends right there the down the street from me on Independence Jeronicus that was his name. He had a brother named Willie, the friends I had around the corner Williams his brother Jimmy we just all grew up together Dwayne we just grew up together."
    },
    {
      "speaker": "Arthur",
      "time": "00:03:43",
      "upperBoundTime": "00:04:28",
      "content": "But me and Steve we kind of had a special bond he was like a brother more he was my first cousin he was like the brother that I didn't have and eventually I graduated from Francis T Nicholls. He graduated from John Mack we ended up going into the United States Marines together in 82 so we did that together and then we came out."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:28",
      "upperBoundTime": "00:04:29",
      "content": "How many years were you in the marines?"
    },
    {
      "speaker": "Arthur",
      "time": "00:04:29",
      "upperBoundTime": "00:04:33",
      "content": "3 years honorably discharged from out the Marines."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:33",
      "upperBoundTime": "00:04:36",
      "content": "Are you still in touch with any of those guys?"
    },
    {
      "speaker": "Arthur",
      "time": "00:04:36",
      "upperBoundTime": "00:05:10",
      "content": "Yes sir I'm definitely will my cousin Steve I'm definitely in touch with him he's in Texas my friend Jeronicus and his brother Jeronicus is not living but his brother has some kind of disability had as a result of a stroke."
    },
    {
      "speaker": "Arthur",
      "time": "00:04:36",
      "upperBoundTime": "00:05:10",
      "content": "So I'm not in contact with him but I do have the phone number to his sister but I don't really call it too much. Just my cousin my cousin and my sister and my brother are kind of like the only people I'm in contact with my mom and dad both passed away in the 30 years I've been incarcerated."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:10",
      "upperBoundTime": "00:05:13",
      "content": "Do you have regular visits?"
    },
    {
      "speaker": "Arthur",
      "time": "00:05:13",
      "upperBoundTime": "00:05:39",
      "content": "Yeah. A friend of mine who comes and visit me regular like I said my sister she's going through something with cancer so she's suffering with that, my brother he comes every now and then not regularly. He just doesn't like the visiting shed up at Angola but that's about the extent. My friend really comes regularly about twice a month."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:39",
      "upperBoundTime": "00:05:43",
      "content": "Do you have a specific memory of school?"
    },
    {
      "speaker": "Arthur",
      "time": "00:05:43",
      "upperBoundTime": "00:06:49",
      "content": "I think the best year that I had in high school at FT Nicholls I think not since I've been incarcerated the name changed to Ben Franklin no excuse me Frederick Douglass it was right there on St. Claude but I think the greatest year I had was in 1980 and I've really been trying to get my friends to get me the yearbook because I don't even have a picture of it."
    },
    {
      "speaker": "Arthur",
      "time": "00:05:43",
      "upperBoundTime": "00:06:49",
      "content": "I won best dressed that year I was in a program my junior year of high school called distributive education. I had a job at Shoe Town right next to the Saenger Theater during that particular time and I was able to wear suits and ties and just go to school like that and go to 3 classes and then catch the St. Claude bus go to my job. Eventually my daddy got me a moped so I was bringing that to school."
    },
    {
      "speaker": "Arthur",
      "time": "00:05:43",
      "upperBoundTime": "00:06:49",
      "content": "I was following this trend they had with it GQ they had all these cars driving mopeds around so I got one of them and that's what I was doing. That's like the greatest year I think I had in school. Eventually next year in 81 I graduated from Francis T Nicholls."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:49",
      "upperBoundTime": "00:06:54",
      "content": "Right. And then the Marine Corps so did you have a new brushes with the law before this?"
    },
    {
      "speaker": "Arthur",
      "time": "00:06:54",
      "upperBoundTime": "00:07:12",
      "content": "Man none. I think the only time that I ever ever had a problem with the law was my daddy got me an ST 70 Honda motorcycle and I was way in East New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:12",
      "upperBoundTime": "00:07:13",
      "content": "That's a dirt bike isn't it?"
    },
    {
      "speaker": "Arthur",
      "time": "00:07:13",
      "upperBoundTime": "00:07:18",
      "content": "It's a dirt bike, but it has the blinkers and the, you can ride it on the street."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:18",
      "upperBoundTime": "00:07:18",
      "content": "Yeah it's street legal."
    },
    {
      "speaker": "Arthur",
      "time": "00:07:18",
      "upperBoundTime": "00:07:53",
      "content": "So I'm like 13 years old and I'm way in the East of New Orleans and we got the bikes parked out there and the police pass and they're like asking us where we from. I told him that I was way from Independence and Galvez no driver's license or anything they didn't put me to jail or anything but they put me in the back of the car and brought me to my house where I probably got the worst whipping I'd probably ever received."
    },
    {
      "speaker": "Arthur",
      "time": "00:07:18",
      "upperBoundTime": "00:07:53",
      "content": "My dad got the truck and went to pick up the bike and brought it back, but that's the only time I ever had a problem with the police my whole childhood life."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:53",
      "upperBoundTime": "00:08:01",
      "content": "Yeah so this one event in your life has now come to define the rest of your life."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "Well, not the one event cause I would like to say this here what happened in my life was nothing growing up my mom and dad did an excellent job with that I really feel bad that I let them down, but after I got out of the service I worked for my father who was a paint contractor was painting the Mirabeau apartments and he was painting the East River apartments in Michaud and around 86, 87."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "This is the greatest defining part of my life. I was coming out of the Calliope Projects I was driving a 1984 Camaro. I was coming out of the Calliope Projects and right there in Tulane and Broad I'm talking about I just seen the most beautiful chick you ever wanted to see. She's like just sitting there. I pull over and she gets in the car and we're talking and she introduces me to crack."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "That really just took my life to one point to a whole another level and this had to be like 86 I fell in 88 so like 86 I get her in the car we drive to the Superdome Motel right there on Tulane Avenue and I'm drinking, I'm drinking a beer and I've never used cocaine heroin I've never even seen it before. I've seen marijuana but I've never seen cocaine or heroin earlier than 86."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "And once she was telling me about what cocaine does and how great it makes you perform in the bed I tried it. And man I tried that never try and any other drugs before, that drug was like I don't know how you can just grab something that's like meant for you something you just couldn't get away from."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "Because the first time I smoked it that night I smoked it a couple times that night with her we had sex. And the next morning I went to work with my dad and I was climbing up the ladder and I'll never forget this feeling never ever using a drug before I just couldn't wait for an opportunity to find her again to just get some more. And from there my life just went upside down."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "That was the defining point of my life. Because at that point my dad was paying me he was paying me nice money probably like $60 a day. I'm making $300 a day I mean $300 a week and if I work the weekend 420 and I'm talking about some points it just got to a point where I got paid on Friday I probably wouldn't even wake up Saturday with any money."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "That's what's like the most defining point in my life. It brought me into an environment that I have never been a part of; it took me back to the projects where I never was raised at, and then my whole life just changed. Just surviving just for the purpose of just using crack."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "And it lasted for like 24 months of just going downhill I mean to a point where by me knowing who I was and knowing how I'm living."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "I'm not I'm really speaking to the point where my mom and my dad they know that my life has changed; the responsibility they had given me they took that back."
    },
    {
      "speaker": "Arthur",
      "time": "00:08:01",
      "upperBoundTime": "00:11:28",
      "content": "My dad's truck no way in the world he let me get behind this truck and bring it anywhere where before my addiction."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:28",
      "upperBoundTime": "00:11:29",
      "content": "They knew what was going on."
    },
    {
      "speaker": "Arthur",
      "time": "00:11:29",
      "upperBoundTime": "00:12:10",
      "content": "Yeah they knew it was gone yeah I can remember one time going over The St Claude overpass I just felt like jumping off because I just felt like I mean I couldn't stop. At one point my mom brought me to the vet rehab center to try and get control but that's from those the turning point in my life I just wanted to say that because like I said a lot of times."
    },
    {
      "speaker": "Arthur",
      "time": "00:11:29",
      "upperBoundTime": "00:12:10",
      "content": "Right now I'm involved in a lot of rehabilitation efforts and I hear guys they tell me about the problems I had home the problems they didn't have a mom didn't have a dad and it kind of makes me feel bad I had all of that. But that's what changed my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:10",
      "upperBoundTime": "00:12:13",
      "content": "Sure yeah you describe that very well."
    },
    {
      "speaker": "Arthur",
      "time": "00:12:13",
      "upperBoundTime": "00:12:15",
      "content": "Thank you."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:15",
      "upperBoundTime": "00:12:16",
      "content": "Do you have children?"
    },
    {
      "speaker": "Arthur",
      "time": "00:12:16",
      "upperBoundTime": "00:13:08",
      "content": "Yeah I have a daughter. I left my daughter at 2 years old in fact I got married, my baby mama and she is my wife but I married her in the effort to try to slow down with the crack use. I just thought maybe if I just had some kind of level of responsibility maybe I would stop doing it for that because she was pregnant for me and she had the baby but after my life became unmanageable and out of control I just was trying to search for some kind of way."
    },
    {
      "speaker": "Arthur",
      "time": "00:12:16",
      "upperBoundTime": "00:13:08",
      "content": "Just to hold on and I tried that. I married her and we moved into an apartment and it was there that I committed the second degree murder. It was over drugs that's all that's the downfall. Right there."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:08",
      "upperBoundTime": "00:13:33",
      "content": "So obviously one of the reasons that we are talking with you is that you've been identified as this person who's a model inmate. You've turned your life around like you said it's not the typical story of all these terrible things and then coming to Angola, but certainly you had reached a low point in your life with respect to drugs."
    },
    {
      "speaker": "Arthur",
      "time": "00:13:33",
      "upperBoundTime": "00:13:35",
      "content": "All the way to the ground."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:35",
      "upperBoundTime": "00:13:52",
      "content": "You are now, 30 years later obviously a very different person, so when you think back on the person that was brought here how would you describe that man?"
    },
    {
      "speaker": "Arthur",
      "time": "00:13:52",
      "upperBoundTime": "00:15:57",
      "content": "When I first came into the system, prison, not taking responsibility, it was everybody fault except mine. Systematically I was being pointed out because I was black I was being given this life sentence because I was black I was it was everybody's fault never taking responsibility never realized that the reason that I'm here a hundred percent based on just me and me alone. So as the first couple years I was here the negativity just came in."
    },
    {
      "speaker": "Arthur",
      "time": "00:13:52",
      "upperBoundTime": "00:15:57",
      "content": "I had thought everything the correctional officers to even certain inmates were working with the system it all part of this conspiracy. I was really negative I was out the 9th ward in greater than ever before from being in that geographical area I wanted to demonstrate that I was from out the 9th Ward and I just was like that type of person real negative, real destructive and it just continued it on and it continued on and continued on my mom is coming to see me all the time my dad's coming to see me all the time here to bring my daughter."
    },
    {
      "speaker": "Arthur",
      "time": "00:13:52",
      "upperBoundTime": "00:15:57",
      "content": "I just continued down that path until one day my dad, my dad wound up dying. And my dad was a breadwinner. Like I said my mom really didn't work so that just turned everything around the economic aspect and everything even I remember one time my dad had died my mom was telling me she had to cut off the insurance that would have automatically pay for the house to try to manage some type of money to help my dad so after hearing those things it kind of brought a level of identifying me as the person that was responsible for these circumstances."
    },
    {
      "speaker": "Arthur",
      "time": "00:13:52",
      "upperBoundTime": "00:15:57",
      "content": "It wasn't nobody else it was me it was me that was unavailable for my daddy what I'm saying it was me."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:57",
      "upperBoundTime": "00:16:08",
      "content": "I think that's one of the hardest parts about serving such a long sentence is that all this stuff happening that you can't do anything about outside."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:08",
      "upperBoundTime": "00:16:10",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:10",
      "upperBoundTime": "00:16:35",
      "content": "With your family especially I think. So, some people can point to a specific event, might have been the death of your father or a specific interaction with a person who teaches them something or some kind of light bulbs that goes on and they just switch, turn their lives around. Was it kind of like that for you or was it more gradual?"
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "I think it was kind of like that with me because like I'm saying all before my negativity was sort of being there I spent a lot of time visiting my mom behind the screen. Well now because my dad no longer there I wanted to be at the table with her I wanted to be able to hold her so I spent less time being negative and more time being positive. Kind of change with the flow of people I hung with I got more caught up."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "I'm inmate counsel now I caught a more caught up with guys that were more interested in reading case law I got into the paralegal course that existed up here in Angola. And then I kind of like just kept on going and I just never stopped. And now it's like I understand life so much better while I'm 53 is supposed to then I was 24 but today I just learned I know life so much better it's like knowing who I was and the things that I was involved with the 2 years that fall to crack cocaine the beginning part of my incarcerated."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "It's like you kind of understand certain activities you don't want to be a part of because it effects of it the results of it or not going to be favorable for you. And I think my dad passing kind of made me want to be that for my mom and be the type of man I should have always wanted to be. At that point I was just thinking about her."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "You coming up here I want to be at the table with you want to be able to hold and I want to do everything right and then in wanting to do that got involved with more positive things that started just bringing things to my attention."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "And believe it or not even that I was in the Marines and I travel all around the world I've been to Korea, Okinawa, just being in prison and understanding life critical thinking in different little situations learning how the law works and how things you do how people I mean just certain things that you just have to do."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "You want it like right now in prison I have a life sentence you want to keep yourself in position just on the narrow possibility that you might go home you want to prepare yourself through skills that could give you the opportunity to work once you do get home. You want to be thinking about what you eating because you don't want to do anything to cause you to get sick what I'm saying."
    },
    {
      "speaker": "Arthur",
      "time": "00:16:35",
      "upperBoundTime": "00:19:13",
      "content": "Under no circumstances do you want to be controlled by a substance again. I mean that's like terrifying just to think at one point that's the way I was. I mean it just that life I would never ever pursue that again."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:13",
      "upperBoundTime": "00:19:19",
      "content": "How far into your sentence did this change happen with your dad dying?"
    },
    {
      "speaker": "Arthur",
      "time": "00:19:19",
      "upperBoundTime": "00:19:41",
      "content": "Well I came to jail in 88 and my Dad died in 94. And it this that the 94 to at least like 2000, I just was on my grind just learning things just after learning one thing I wanted to learn other things and other things I learned."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:41",
      "upperBoundTime": "00:19:53",
      "content": "So yeah that was pretty, sometimes it takes folks a little longer than 6 years or so into your sentence to get you the point where you're like I've got to do something different"
    },
    {
      "speaker": "Arthur",
      "time": "00:19:53",
      "upperBoundTime": "00:20:05",
      "content": "Right. I guess yeah I think it was maybe the love I had for my dad and the love definitely I had for my mom and like I said just wanting to be there"
    },
    {
      "speaker": "Marcus",
      "time": "00:20:05",
      "upperBoundTime": "00:20:25",
      "content": "Yeah and I think the passing of a parent is a profound experience when you're incarcerated I'm sure. Is that reflected in your conduct record do? Can you did you see like bad conduct up to 94 and then phew smooth sailing."
    },
    {
      "speaker": "Arthur",
      "time": "00:20:25",
      "upperBoundTime": "00:21:14",
      "content": "If you looked at my conduct jacket I think in the last 15 years I might have 3 write-ups maybe 3 or 4 maybe for the most but a my first six years I probably had every bit of 35 write ups. I mean there were days when I would just lay in the bed and I wouldn't hell I wouldn't even go to work just nothing mattered everything was just another thought."
    },
    {
      "speaker": "Arthur",
      "time": "00:20:25",
      "upperBoundTime": "00:21:14",
      "content": "Then like I said there were so many times my mom came up here I was either in a Cell Block visiting behind screens or long ago used to be able to go to the visiting shed but to have to wear dungeon attire It would be all wrinkled never your size but that's the way I spent my time visiting."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:14",
      "upperBoundTime": "00:21:19",
      "content": "So part of it was also to get a good conduct record so that you could visit your mom."
    },
    {
      "speaker": "Arthur",
      "time": "00:21:19",
      "upperBoundTime": "00:22:10",
      "content": "Well actually to stay out of the dungeon to not be locked up because once you if I did anything right here in population the first thing they do is carry me to the administrative segregation part put me in a cell and if this weekend and had come and somebody came to visit me if they take me out of the cell and bring me behind the screen to go visit."
    },
    {
      "speaker": "Arthur",
      "time": "00:21:19",
      "upperBoundTime": "00:22:10",
      "content": "And she was like she never did show me that that really concerned her before but after my dad passed when I wish I had to sit there behind the screen one time I seen her crying I couldn't even hold her."
    },
    {
      "speaker": "Arthur",
      "time": "00:21:19",
      "upperBoundTime": "00:22:10",
      "content": "So I kind of like well when I know you're coming I'm just not going to never be in the dungeon and then it just became, I'm just going to stop being the dungeon all together. Then once I start getting involved in other activities I had no need of going into the dungeon."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:10",
      "upperBoundTime": "00:22:17",
      "content": "So tell me a little bit about what you're daily life is like and what organizations you're with, what's your life like in Angola now?"
    },
    {
      "speaker": "Arthur",
      "time": "00:22:17",
      "upperBoundTime": "00:24:02",
      "content": "Right now I'm a disciplinary counsel. So what I ensure is that everybody that get wrote up that they get a fair due process hearing. That's my responsibility I kind of like base that on the decision that I don't try to judge or anything like that I just make sure that they get a fair hearing. After DB Court I'm kinda involved with teaching other guys an understanding of law trying to give them that head up that I got."
    },
    {
      "speaker": "Arthur",
      "time": "00:22:17",
      "upperBoundTime": "00:24:02",
      "content": "This is the way the law work this is the way our circumstances work if you ever hope to go home you have to understand this. I mean there's no doubt you go back for an evidentiary hearing you don't want to be that same person sitting in the courtroom where everybody's talking over your head."
    },
    {
      "speaker": "Arthur",
      "time": "00:22:17",
      "upperBoundTime": "00:24:02",
      "content": "Everything's a procedure's or a regulated practice and if you just kind of, you're never be a lawyer but if you just kind of understand you can make better decisions. If you the type of person that has a crime like I have where I had confessed without a doubt that I committed the offense there's nothing in the court that's going to come about."
    },
    {
      "speaker": "Arthur",
      "time": "00:22:17",
      "upperBoundTime": "00:24:02",
      "content": "So you actually the only thing you could possibly live for is the possibility of making pardon. The possibility of a law passing. That brings me to another point that I do I try to organize different efforts where guys come together and focus groups to kind of understand that even that are circumstances that present, they tell us never going home I will never stop us with networking with our family members in an effort to try to pass legislation that will help us get parole eligibility and stuff and my whole day is just based on that and that alone that's what I do every day."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:02",
      "upperBoundTime": "00:24:07",
      "content": "Okay so you must have learned quite a bit from Calvin Duncan over the years."
    },
    {
      "speaker": "Arthur",
      "time": "00:24:07",
      "upperBoundTime": "00:25:12",
      "content": "100% Calvin Duncan definitely changed the landscape of prison litigation because at one point when I first started reading law and applying law we had no concept about procedures and regulations all we just new is our constitutional right may have been violated this way and we just push it right to the court."
    },
    {
      "speaker": "Arthur",
      "time": "00:24:07",
      "upperBoundTime": "00:25:12",
      "content": "But Calvin try to put us in point where look the state legislation on the federal Congress is actually implementing regulations to kind of like what everything in the time in the prospective certain vehicles that you could put certain issues on and it really helped us."
    },
    {
      "speaker": "Arthur",
      "time": "00:24:07",
      "upperBoundTime": "00:25:12",
      "content": "Because now we're getting answers on a merits instead of getting all these numbers like 9.30 9.29 we're actually getting the merits of our claim addressed. And that's the philosophy that we continue on through the prison population is trying to get guys look. If you're going to get denied get denied on your merit not because you're too late not because you're not correct just on the merits of your claim."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:12",
      "upperBoundTime": "00:25:18",
      "content": "He's taught me so much I mean I just I feel lucky to know him."
    },
    {
      "speaker": "Arthur",
      "time": "00:25:18",
      "upperBoundTime": "00:25:27",
      "content": "Yeah I have definitely he had an impact on my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:27",
      "upperBoundTime": "00:26:14",
      "content": "He'll be here on Thursdays by the way for the next foreseeable month or two so one of the things that were trying to do and you've just said something about this to the idea that you keep hope alive, you educate yourself so that should there be a way that you can contribute to the conversation on parole eligibility for lifers that maybe that day will come then you'll be ready to go."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:27",
      "upperBoundTime": "00:26:14",
      "content": "In the meantime there, I have trouble understanding how so many people cope in the face of a life without parole sentence. How do you cope with it?"
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "Well I cope with it with the hope and the possibility like you said of knowing guys like Calvin Duncan, Norris. Since my incarceration they've always been like leaders and vanguards of my life and I've seen them go home, Reetos, Chico Yancys. And I feel certain that at some point that I have a chance to go home but like you said I mean it's two sides of every story, just like you see me before you saying that I know that we have to change laws."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "I know that it's a possibility we live in a democratic government that we could model our laws even after the England and the British laws that provide opportunity and change like most of the states in the nation there are guys that feel that despair that live with that every day I represent them every day and DB Court they don't care if the sun come up or whatever happens they feel like their life is over. But I'm not one of them. I used to be one of them."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "I'm just hoping that things like what we're doing here and possibility of guys like yourself of making things happen and hopefully I have the opportunity that one chance to go in front of that board to show them that I'm worthy of being given that second chance. Just hoping, that's what I'm living for. And even in the meantime all that's going on I think I'm doing my civic duty to educate as many guys that's coming in the system at how this government and our laws really work."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "How to continue this fight not to stop. Because I could die tomorrow. We still need guys in here who understand law because we're not rich we're not going to go buy lawyers or nothing like that. You got to kind of understand some things by yourself. I mean like for instance you're not even granted a right to an attorney on collateral review so you got to know how to put together a post-conviction somewhat."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "And knowing that 15, 574.4 says right now the only way I'll be able to go in front of the parole board is if my sentence gets commuted to a fixed term of years that provision has to change. It has to. We had a warden that was here Warden Cane and he made his speech he said 85% of the guys that's in Angola are going to die here."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "And after he made that speech, heroin lifers were given parole, juvenile non-violent lifers were given parole, Miller came about act 401 just recently act 469 just came into effect with the 15 308 and it's like all those guys just going out and the day we go to the rodeo's like a big old family reunion that guys that have been here for years and years are coming through the gates and they're doing positive things out there and I'm just hoping just for my chance to get outside."
    },
    {
      "speaker": "Arthur",
      "time": "00:26:14",
      "upperBoundTime": "00:29:42",
      "content": "We all was in the farm line together at one point even on the compound on the east yard all the different camps. And these guys are free for real. With life sentences. The same sentence I have. And they're not violating they're not causing any harm to the world they're just doing the things they're supposed to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:42",
      "upperBoundTime": "00:30:11",
      "content": "So on the other side of this this is what everybody tells me is the victims. So then when you look back you've served 30 years of your life. When you look back on the victim and what brought you here I mean is it possible to even feel remorse after being punished for 30 years for something like that?"
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "Well let me say this from understanding that I have now. A lot of time you find judges that abused their discretion and me taking somebody's life really gave me I really abused my discretion really I mean I have no right to decide who lives who dies and I mean like I said early on you kind of justified while this guy is this type of person but now none of that matters I made a decision that took somebody son off the Earth somebody's father maybe off the Earth and that's a decision that only God should be able to make not me."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "So of course just thinking like that I know I really messed up. I know it's serious and I know whether people real close to him will ever probably forgive me I don't know. I just like to tell them I'm sorry. I'd like to tell his family I'm sorry and I mean I didn't have a right to do that I understand the victim's perspective and I guess there are victims in Louisiana there are victims in other states and in other states and other countries have parole eligibility."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "They got a kind of like I mean I don't know I'm a victim in a circumstance because I have family members that were killed in New Orleans and these guys are right here around me now. It doesn't matter if I forgive them or not it's just the fact that they're doing what they need to do and they're trying to go home and I wouldn't stand in their way. What I'm saying."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "I would hope that this family member understands that I'm sorry and I will when I been in time in jail I've been doing my best to make a better person and if I'm ever released back in society I'll be that person that will try to slow down or curb other people from making the same mistakes that I made. The same thing I do here."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "No different I mean it's like from being a marine to being a person that my parents raised, made me understand that the only thing that we all need to do in life is try to better our situation."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "Not personally but the whole community thing just whatever I can do to make these circumstances better. It'd be the same mindset if I was ever released into society I wouldn't lay down I would do the same thing to make my community better try to cause younger people from not making the same wrong decisions that I made if I could give it any kind of help be in any kind of position help guys up here to possibly seek their freedom I mean something, I just don't think that life exists to not try to make things better. You shouldn't just be relying on government officials, judges."
    },
    {
      "speaker": "Arthur",
      "time": "00:30:11",
      "upperBoundTime": "00:33:31",
      "content": "Each person should have a role that they're doing just like in here I'm not waiting on the mental health section of the prison or the wardens or the security guards. I have a class myself that I have 30 or 40 people in it and I'm telling them these are the better things to be doing with your life right now. I'm not waiting on anybody. I know what's best. I know what freedom is foremost in your mind these are the things that you have to be doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:31",
      "upperBoundTime": "00:33:40",
      "content": "Yeah. What about the logic of the Supreme Court for juveniles? They recommend 25 years for parole eligibility no matter what you did."
    },
    {
      "speaker": "Arthur",
      "time": "00:33:40",
      "upperBoundTime": "00:36:02",
      "content": "Man, sir something I'm 53 so at some point I can't remember, but I know it was in the 70s we actually sat there and watch it on 60 Minutes different states started sentencing kids to life sentences I mean I sit there and watch a segment on 60 Minutes when they did that but after they made the decision to try a kid and give him an adult type sentence there's too many other things in place that never change; they never stop denying the kid the opportunity to go to the liquor store and let him buy alcohol; they knew they couldn't let a 15 or 16 year old go vote."
    },
    {
      "speaker": "Arthur",
      "time": "00:33:40",
      "upperBoundTime": "00:36:02",
      "content": "The woman the girl she couldn't just give her consent to have sexual relationships or get married and I wonder if you still had those things in place based on the level of maturity and experience that you felt like the kid was lacking why would you not consider even when they commit a crime not understand that they still on that level of immaturity."
    },
    {
      "speaker": "Arthur",
      "time": "00:33:40",
      "upperBoundTime": "00:36:02",
      "content": "So as I read Miller and I'm looking at the Atkins versus Virginia thing and I'm like ok you understand that this kid could never appreciate the seriousness of his offense that his brain is still developing I'm like wow and you think still 25 years I mean it's great that a lot of people have the chance for parole but I think it should be so much less than that."
    },
    {
      "speaker": "Arthur",
      "time": "00:33:40",
      "upperBoundTime": "00:36:02",
      "content": "Really I mean if a child 16 years 15 years 17 committed a crime I think that the time served maybe should be based on the system of parole or something but way less than 25 years I mean you're looking at something that if you feel like the crime has been committed was due to immaturity and I thank God for all the people that were involved with that."
    },
    {
      "speaker": "Arthur",
      "time": "00:33:40",
      "upperBoundTime": "00:36:02",
      "content": "Because I've seen movements going to the UN discussing this issue I think a way last time than that 25 years is really an adult punishment I mean you're not even giving him the thought yet you committed the crime years was a kid. That's a real severe punishment."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:02",
      "upperBoundTime": "00:36:13",
      "content": "Yeah but and also 18 is kind of arbitrary to cut that off I mean 25 is when they say brain development is complete."
    },
    {
      "speaker": "Arthur",
      "time": "00:36:13",
      "upperBoundTime": "00:36:55",
      "content": "And something you're right and we got guys they just cut it off at 18 and they have guys that's 18, 19 when they came to jail and still acting just as immature and as young as someone that's 15 or 16 years old. I see that all the time and I looked at the computer we try to find a way we could possibly we could relitigate that some kind of way but the Louisiana jurisprudence lock solid if a person over the age of 18 a life sentence is not unconstitutional."
    },
    {
      "speaker": "Arthur",
      "time": "00:36:13",
      "upperBoundTime": "00:36:55",
      "content": "And they giving it to them. And these guys are just right at the door I mean just in numbers some of them are in like a month away they might have committed the crime like a month after just turning 18."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:55",
      "upperBoundTime": "00:36:59",
      "content": "Yeah I'm going to be talking to folks on either side of that 18th birthday."
    },
    {
      "speaker": "Arthur",
      "time": "00:36:59",
      "upperBoundTime": "00:37:47",
      "content": "Man I couldn't imagine you just cut em off like that like once you made 18 this at 24 honorably discharged out the Marines I can't really say knowing who I am right now today that I was totally mature. I mean a mature person don't just pick up a girl and make a life change and stuff like that in they life."
    },
    {
      "speaker": "Arthur",
      "time": "00:36:59",
      "upperBoundTime": "00:37:47",
      "content": "A mature person did a lot of things that I did and I was 24 I was a grown man with a child and honorably discharged out of the Marines but I feel like I was lacking a whole lot. So I could imagine a person a couple of days after 18 I know you had to be lacking a whole bunch. And I'm here with him I'm looking at him."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:47",
      "upperBoundTime": "00:38:15",
      "content": "So for parole board if you were to become eligible for parole and you come before the parole board there is a tendency for the parole board that the things that they have the information they have is everything about your life before you came and including the crime for which you were convicted and then they don't know anything. What would you want a parole board to know about you?"
    },
    {
      "speaker": "Arthur",
      "time": "00:38:15",
      "upperBoundTime": "00:39:22",
      "content": "I would want the parole board to know first that I'm very sorry for the crime I committed and that I recognize the seriousness of the crime I committed. And I would want them to know that I am today a person that's making way better decisions. I could be productive in society that I would do everything that I could to try to stop others from committing crime as well as finding me a lady that I could just make happy and just live the rest of my life."
    },
    {
      "speaker": "Arthur",
      "time": "00:38:15",
      "upperBoundTime": "00:39:22",
      "content": "With no problem at all to the state as far as law enforcement or committing another offense or anything I just want to be that type of tax paying citizen that contributes to the to Louisiana and just find me one woman to make happy for the rest of my life. And first and foremost that I'm very sorry for the crime I committed because I know that's like it's Louisiana I mean you're sorry I know everybody that I've ever talked to his sorry for the crime they committed and I just want to keep saying that because that's so important."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:22",
      "upperBoundTime": "00:39:23",
      "content": "Yeah."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "We not talking about nothing more than letting people just be categorically looked at that's all. No doesn't mean everybody's just going to open the front gate and all this going to pour out of it just I mean this is my case 2 years out of my life I mean I've committed a crime and all before my life no police record all after my life no police record just those two years led to this offense."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "What makes it so unfair is that second degree murder the same offence carry such a big old net and it's so wrong to just come to that type of decision I mean second degree murder you could take a hammer and hit somebody on the toe and if he dies second degree murder say okay you fulfilled the second degree murder element because you had a specific intent to inflict great bodily harm because you had the hammer on his toe."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "I've met guys that's right here that's incarcerated for the rest of their lives for just having a fist fight. How many of us as men never been involved in fist fights? There's second degree murder you could have no intent at all to commit a homicide you can actually go into a crime enumerated offense that's listed on the A2 and as you and another person could be fleeing the scene your codefendant gets killed and that's a murder charge."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "I've talked to a guy that just recently came out of Baton Rouge where him and his girl were just getting loaded in the house and at the time of them getting loaded this girl died. That's second degree murder. I mean it just I mean how out of all the different circumstances all the different situations nothing that not even account for here's one guy that maybe grew up in foster homes and with bad type of person and he commits the crime here's another person that come out of Yale or Harvard and he falls in Louisiana commits the crime."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "Here's another type of person that get sent you really outta all these different circumstances you just come to the mindset that once I give you that mandatory life I'm not gone never reexamine you again? I don't even care I don't care about nothing happened and then it's a possibility that your lawyer just not being effective."
    },
    {
      "speaker": "Arthur",
      "time": "00:39:23",
      "upperBoundTime": "00:42:29",
      "content": "Maybe the reason why you got the second degree murder because he failed to demonstrate before the jury that the crime occurred behind a mitigational reason, a provocation, or sudden passion, because he didn't convey his point across. I mean it just no reason to not examine them and just have thousands and thousands of people serving so much time forever."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:29",
      "upperBoundTime": "00:42:30",
      "content": "Yeah."
    },
    {
      "speaker": "Arthur",
      "time": "00:42:30",
      "upperBoundTime": "00:43:14",
      "content": "It just almost like I don't know what you can even compare it to because nothing in the world is perfect. We still every now and then give our conviction back based on Brady. Every now and then there's that one person that deserve an opportunity to be released."
    },
    {
      "speaker": "Arthur",
      "time": "00:42:30",
      "upperBoundTime": "00:43:14",
      "content": "Every now and then something happens to show that it just can't be locked in a cell like that. So it is I mean it's just I don't know it's ridiculous almost. And you spending that much money it's like I don't know 12% of the prison population has the life sentences. And you commit I mean and you just not wanting to look at every one of them. I mean got to."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:14",
      "upperBoundTime": "00:43:26",
      "content": "Yeah I mean so there are 2 things that confound me that that it's great to hear your thoughts about. Its uh one is what you just said is the breadth of things for which people are serving life."
    },
    {
      "speaker": "Arthur",
      "time": "00:43:26",
      "upperBoundTime": "00:43:27",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:27",
      "upperBoundTime": "00:43:31",
      "content": "You gave me some great examples, driving a car to a robbery that goes wrong."
    },
    {
      "speaker": "Arthur",
      "time": "00:43:31",
      "upperBoundTime": "00:43:36",
      "content": "That's it."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:36",
      "upperBoundTime": "00:43:49",
      "content": "But the other thing is this promise to a person as young as 18. They will never we will never look at you again."
    },
    {
      "speaker": "Arthur",
      "time": "00:43:49",
      "upperBoundTime": "00:44:22",
      "content": "Never look at you again. You just living here forever. Like for 30 years I've been here actually I mean actually I spent more time in prison than I even spent on the streets."
    },
    {
      "speaker": "Arthur",
      "time": "00:43:49",
      "upperBoundTime": "00:44:22",
      "content": "So if you just looked at me just from the prison perspective should be a determination of whether or not you ever let me go or not. Because I didn't just I mean I didn't live twice as long in here than I lived on the I lived 24 street 24 years on the street I lived a whole 30 years up in here."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:22",
      "upperBoundTime": "00:44:34",
      "content": "So you've shared some great information and I actually really I understand those legal references that you're making and it's very important also to have somebody talk about that nobody else has so thank you for that."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:34",
      "upperBoundTime": "00:44:34",
      "content": "I appreciate just being a part of this here."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:34",
      "upperBoundTime": "00:44:45",
      "content": "Yeah I want to ask you my last question which is I think you have a sense of what we're trying to do."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:45",
      "upperBoundTime": "00:44:49",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:49",
      "upperBoundTime": "00:44:49",
      "content": "To also get people to think about is this a wise thing to be doing to consider so many people so thoroughly irredeemable that we will never look at them we will sentence them to die in prison. What else should I have asked you or what else could I ask you that you might want me to ask you something else you want to share about this?"
    },
    {
      "speaker": "Arthur",
      "time": "00:44:49",
      "upperBoundTime": "00:47:11",
      "content": "Man from the bottom of my heart what would I want to do? I want to say that maybe there's maybe no other question that you asked me I want to say I appreciate you and your staff from the bottom of my heart. If I have to die here I appreciate this opportunity to be able to let my voice be heard where this level of inconsideration could really just be looked at."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:49",
      "upperBoundTime": "00:47:11",
      "content": "And that's what it is this is not being considered it's something is totally being overlooked there's not a whole lot of bad people here there's guys here that mentor younger guys to go back into society you got to know these guys change."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:49",
      "upperBoundTime": "00:47:11",
      "content": "There's guys here that Minister churches here. You got another you guys change. There's guys that's teaching guys trade on the compound. You got to know these guys change. There's guys that Is not a part of none of these things they just work all day. Even on tractors or whatever they do they do it because that's what they've become these guys have changed."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:49",
      "upperBoundTime": "00:47:11",
      "content": "It's just the opportunity to say thank you somebody in this whole world cares about us that legislatively has been kind of overlooked because they have no law to say look back at these guys look in the prisons and see these guys are worthy for a second chance. I mean a lot of us really emphasize what the world out there with the victims."
    },
    {
      "speaker": "Arthur",
      "time": "00:44:49",
      "upperBoundTime": "00:47:11",
      "content": "I mean we not we just feel like we just did that we really sorry we made a decision that should have never been made and that all these years past I just appreciate people like you that just give us this our chance I just appreciate that because I leave out the room I just feel like something's been accomplished I did something what I'm saying I appreciate you for the opportunity."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:11",
      "content": "I appreciate that. I don't have any power. But to the tiny little nudge this project might have, that's good. So I thank you for sharing all those thoughts it was really very valuable interview for me thank you."
    }
  ]
}
