{"name":"","transcript":[{"content":"Charles Amos Transcription REDACTIONS FINAL"},{"speaker":"Charles","time":"00:00:10-1","content":"My name is Charles Robert Amos the III, I don't tell many people that. In 1994 I was convicted, but in 1995 I was arrested in 1994 for second degree murder I was convicted in 1995. I was 20 years old when I was convicted. I had just come off of a conviction for armed robbery. I was 16 years old when I was convicted, but I was charged as an adult for armed robbery."},{"speaker":"Charles","time":"00:00:10-1","content":"So sometimes I think that being in an adult facility at such a young age it may have further influenced my life of crime, because I met more people who were just as messed up as I was at the time, and didn't want to do anything positive so I was around those people at 17 years old, 18 years old and I believe some of that it messed with me too. But that's not where it all begins with me."},{"speaker":"Marcus","time":"00:01:16-7","content":"Okay so how much time have you served?"},{"speaker":"Charles","time":"00:01:15-8","content":"I've served."},{"speaker":"Marcus","time":"00:01:17-6","content":"For this particular offense."},{"speaker":"Charles","time":"00:01:20-0","content":"On this particular offense I've served 23 years and about 6 months, 7 months somewhere around there."},{"speaker":"Marcus","time":"00:01:29-4","content":"Before that you served a stint in a juvenile facility?"},{"speaker":"Charles","time":"00:01:33-7","content":"No."},{"speaker":"Marcus","time":"00:01:31-1","content":"In an adult."},{"speaker":"Charles","time":"00:01:34-2","content":"In an adult facility I was a juvenile at the time, so I don't fit under the juvenile bill at the time because I went home at 19, and come back at 20. I stayed a year and 4 months in society then I was right back you know. So I did 23 years."},{"speaker":"Marcus","time":"00:01:50-8","content":"Where did you grow up?"},{"speaker":"Charles","time":"00:01:52-0","content":"In New Orleans."},{"speaker":"Marcus","time":"00:01:54-0","content":"Where?"},{"speaker":"Charles","time":"00:01:54-9","content":"Initially uptown, then my mom started making more money she moved in the east but I didn't stay with her long, because this is where I think it all started with me falling to crime."},{"speaker":"Charles","time":"00:01:54-9","content":"When I was 10 years old my dad's mom my grandmother I used to go by her house for my birthday and so she told me one day that this on my 10th birthday that my great grandmother wanted to see me in Chicago. So instantly I told her my momma not going to let me go out there she say well let's call her and see. And so I called her and she said yeah you can go. And so my grandmother said, \"Well look school is almost out.\""},{"speaker":"Charles","time":"00:01:54-9","content":"My birthday is in May. May '73, May 17. She said, \"School is almost out you finished all your texts right?\" I said, \"Yeah.\" She said, \"Well look go home pack a bag and come back. And we going to send you out there today.\" So I was excited. So she said, \"Oh they going to spoil you. You'll be the only boy, they love your daddy they'll probably get you a dirt bike all type.\" So I was really excited."},{"speaker":"Charles","time":"00:01:54-9","content":"And so when I made it home my mom told me that I wasn't going and I was like, \"Why?\" She said, well El, which was her boyfriend then which later became her husband said that I can't go. I said, \"But why that's not my dad.\" she said, \"Well we just going to listen to what he says.\" And it sent me in a downward spiral tremendously."},{"speaker":"Charles","time":"00:01:54-9","content":"I got arrested that year for shoplifting. Eventually I stopped going to school they started punishing me I couldn't go outside anymore I couldn't, they wouldn't get me anything for Christmas when they went places. Like let's just say they went to a picnic or on a lake or to a party I couldn't go I had to be inside. I couldn't leave my room unless I wanted some water or to use the bathroom."},{"speaker":"Charles","time":"00:01:54-9","content":"And so I think back now I might get emotional now too. But I think back now and I think it conditioned me for prison at such a young age, because I couldn't go anywhere, I couldn't do anything. And so I remember kids asking me what you got for Christmas and I would lie to them and say, \"Oh I got this and I got that.\" But in actuality I didn't get anything."},{"speaker":"Charles","time":"00:01:54-9","content":"So I eventually started running away. I started just you know I shut down. And I see it now I didn't see it then I didn't understand it then but I see it now and sitting back in jail so many years thinking about where I went wrong, and what caused it, I'd focus my answer on when I was 10. Because it was at that time that everything just went south for me."},{"speaker":"Marcus","time":"00:05:13-2","content":"Just that crushing sort of disappointment at thinking you're going on this great trip, and then sort of for no reason that made sense to you, that's all just taken away"},{"speaker":"Charles","time":"00:05:28-3","content":"Yeah and to this day I still because to me they just didn't like me. I don't know if it was because of my dad when I was probably 30, I'm 44 now so probably when I was 30 two things that I found out from my childhood, one that my dad used to beat my mom I didn't know that that was one the reasons why my oldest brother didn't stay with us by the way. My mom had five kids, two boys, me three boys and two girls. I have a brother and a sister older than me, then me and then I have a brother and sister younger than me so that's five of us."},{"speaker":"Charles","time":"00:05:28-3","content":"At one time I thought I was the middle child all the way around that's why I said two boys two girls because I'm the middle child for my mom, and at one point I thought I was the middle child all the way around but I wasn't for my dad. I thought it was my sister then me then my brother."},{"speaker":"Charles","time":"00:05:28-3","content":"But when I was in my 30s I found out also that my dad is not my sisters dad and that was heartbreaking to me because she had been saying it, I'm not your own, your daddy is not my daddy, and I'd say girl shut up you don't know what you talking about but all the while she was feeling something."},{"speaker":"Charles","time":"00:05:28-3","content":"So my mom didn't, and she still hasn't' told me. In fact my grandmother the one who wanted to send me to Chicago for the summer told me that I asked her I said mama is my daddy Judy daddy. She said no but we love Judy just like she's ours. I said but all these years I thought that was my dad's daughter. She said no she's not. She was 2 years old when your mom met your dad and I'm like wow."},{"speaker":"Charles","time":"00:05:28-3","content":"So it's been secrets and lies the whole while, for one point I thought that her boyfriend which later became her husband was my dad, until my oldest brother told me that's not your dad. I'm like wow, why are they doing that?"},{"speaker":"Marcus","time":"00:07:41-0","content":"How old were you when your stepdad came into your life?"},{"speaker":"Charles","time":"00:07:53-6","content":"I don't recall the time but I know my mom said I probably was around 4 or 5 somewhere around there."},{"speaker":"Marcus","time":"00:08:01-0","content":"Was he, was there physical violence?"},{"speaker":"Charles","time":"00:08:09-4","content":"Yes he did. I can recall he did hit me and often, I recall once but my mom never intervened. My oldest sister was, her name is Judie, one time he was hitting me and Judy intervened no you ain't gone keep hitting on him, you ain't gone do that and she's two years older than me. So I may have been 12, 13, she was probably about 15, 14, 15 years old. But my mom never did. She never did stand up for me. Not once. That I can ever recall."},{"speaker":"Marcus","time":"00:08:48-6","content":"Was there physical violence between your stepdad and your mom?"},{"speaker":"Charles","time":"00:09:00-7","content":"I don't know. I don't know. And it wasn't, it was to me I was most hated and I don't know why. Because I wasn't a bad kid. I wasn't getting into a lot of trouble until that time started. So before then I was always mild mannered if you told me to go to the store I would have no problem with it. All of that so it never did make sense to me why it happened."},{"speaker":"Marcus","time":"00:09:22-6","content":"You were targeted."},{"speaker":"Charles","time":"00:09:28-2","content":"Yes it never made sense. I don't know if I started looking like my dad or sounding like him or acting like him, I don't know what triggered it. Now I know he used to drink a lot my stepdad which its even hard for me to even say anything about him, but which he was my stepdad but I knew that he used to drink, and I don't know if that would've triggered it or."},{"speaker":"Marcus","time":"00:09:57-5","content":"Sure. Are you still in touch with your family?"},{"speaker":"Charles","time":"00:10:03-3","content":"Yes. Just recently I called my mom, which I don't call her often. I'm still in touch with everybody in fact I called her this Saturday. I said I was going to start doing it more, I don't call to them talking about, in fact I called someone else my mom. I call her Mama dear because she fulfilled her mother role in my life."},{"speaker":"Charles","time":"00:10:03-3","content":"Which my sister Judy is the one that fulfilled that role in my life. She filled so many roles in my life because she's always been there. She's always been there to protect me. So she has been a huge support system for me here financially, coming to see me here whatever the case may be. If I ever need anything you know I can call my sister Judy and she's going to take care of that for me, and I really appreciate it."},{"speaker":"Marcus","time":"00:10:57-9","content":"Yeah it's great to have somebody like that a source of support."},{"speaker":"Charles","time":"00:11:04-5","content":"But my stepdad he's dead and right before he died I called I think I was calling my niece, my youngest sister that is her dad. So I was calling my youngest sister daughter Tujan, and it just so happened that she was by my momma house, and she said maw maw here and she put her on the phone and she said, \"Man L,\" which is her husband my stepdad has been asking about you. He want to talk to you. He had throat cancer."},{"speaker":"Charles","time":"00:11:04-5","content":"So I felt the urge just to pray for him, and to tell him that I forgive him. I'm not you know I didn't like what happened but I'm not holding it against him. I'm not going to stay bitter behind the situation, and so I just we prayed and he told me he's sorry, for given which the throat cancer took away a lot of his voice, and I was kind of understanding most of it, and so a couple of days later he died. So that had been about three years ago, 2014 I think that he died."},{"speaker":"Marcus","time":"00:12:17-8","content":"So I guess it's not accurate then for me to assume that you grew up in a household that you felt loved and nurtured and cared for."},{"speaker":"Charles","time":"00:12:32-6","content":"Not in that household."},{"speaker":"Marcus","time":"00:12:34-8","content":"By your parents."},{"speaker":"Charles","time":"00:12:35-7","content":"Not by my parents. My aunt my mom's sister one of her younger sisters when I kept running away, she told my mom to send me over there by her. And when I tell you things changed for me, it was one of the best times in my life you know because she could she really cared for me I could sense and feel the love from her. And I always say that she's one of my favorite aunties, because she just genuinely loved me, and she did a lot for me."},{"speaker":"Marcus","time":"00:13:15-4","content":"Did you go live with her?"},{"speaker":"Charles","time":"00:13:17-0","content":"Yes I did for about it was short lived for probably about 2 years, maybe 3 years. And the whole while I never got in trouble. I was going to school and everything else which I wasn't very bright out there."},{"speaker":"Charles","time":"00:13:17-0","content":"And that's another thing that my mom did. I hope I'm not going off course but my dad was an alcoholic, which I soon became one too, and she used to tell me all the time. You're not going to be nothing you're just going to be an alcoholic like your dad, and unbeknownst to me or unknownst to me I became an alcoholic, and I wasn't conscious of it then but I took it to another level and became a drug addict."},{"speaker":"Charles","time":"00:13:17-0","content":"And sometimes when I used to be drinking with guys they would be like man you can drink. I didn't know it then, but my dad was an alcoholic. So maybe I got his genes to consume so much alcohol and it wouldn't have me as drunk as it would have some of them but I started doing cocaine and heroin and weed and pills it was almost as if you couldn't miss me."},{"speaker":"Charles","time":"00:13:17-0","content":"But so she placed those, that I'd never graduate I remember and I still remember this she told me, \"Oh you won't graduate.\" And so I told her, \"I'm going to graduate even if I have to dig you up out the grave and sit you in a chair I'm going to graduate and you gone know about it.\""},{"speaker":"Marcus","time":"00:14:55-4","content":"Yes it's not a very good way to increase your child's self-esteem."},{"speaker":"Charles","time":"00:14:59-1","content":"No I think I was I was set up to fail. I was set up to fail."},{"speaker":"Marcus","time":"00:15:06-9","content":"What led you to the first arrest?"},{"speaker":"Charles","time":"00:15:10-3","content":"I was frustrated with them. After she, after they refused me to go. Because it was going to be for a summer, I just stopped listening to them. I just stopped listening nothing mattered anymore. I just wanted to get away from them, and I guess, I don't know I just started listening to other people in the neighborhood. \"Come one let's go do this and let's go do this.\" And I was listening to them and before I wasn't. I didn't really pay attention to my peers then until after they said what they said."},{"speaker":"Marcus","time":"00:15:53-1","content":"What was your, you have good memories living with your aunt. Can you kind of put me in the place there? I'm 48, but we're more or less the same age so was it around when you were 15 or so you were with your aunt 14, 15?"},{"speaker":"Charles","time":"00:16:19-6","content":"It was right after I got robbed. I know I got I robbed. I got robbed as a, I got someone pistol whipped me out of some tennis shoes. And so that was around '87 which they put me in a concussion I had a mild concussion. Think that had something to, because I think of so many things that may have played a role in me being in prison right now. Because they really tried to hurt me behind some tennis, Michael Jordan's. That's why I became a strong opposer against Mike I didn't like mike because it was the reason why I got robbed out of my tennis shoes, and placed in the hospital and all that type of stuff."},{"speaker":"Charles","time":"00:16:19-6","content":"So that happened, and there's a year of my life I can't remember from right after I got robbed and my memory picks back up in May of '88. So from April of '87 to May of '88 I can't retrieve any memories. I try hard and hard and hard but I can't retrieve any memories. But I know that it was right after I got robbed, my aunt told me to come live with her."},{"speaker":"Marcus","time":"00:17:47-9","content":"So let me let me, put me in the picture here. Let's say you and I were sitting on your aunt's front stoop. It was uptown as well?"},{"speaker":"Charles","time":"00:18:00-7","content":"Uptown."},{"speaker":"Marcus","time":"00:18:01-6","content":"Ok so what am I seeing. I live uptown now what would I be seeing?"},{"speaker":"Charles","time":"00:18:06-7","content":"Okay so."},{"speaker":"Marcus","time":"00:18:05-6","content":"If you and I were fifteen sitting there, what would I be smelling, hearing looking at?"},{"speaker":"Charles","time":"00:18:11-9","content":"It was a nice neighborhood for me. It was not too far from, I'm on 2nd and Johnson really I'm like 2 houses off of corner of 2nd and Johnson, and I used to love sitting on the porch so I'm glad you're saying that. And it varies because some days my aunt her friends would be sitting on the porch and they'd be talking and I'd be sitting."},{"speaker":"Charles","time":"00:18:11-9","content":"They'd be sitting on the steps but I'd be sitting in a chair just listening to them just laughing and clowning and whatnot. And I'd be watching people pass up and down the street and then sometimes my girlfriend would be there Kinchella which we are no longer together. She'll be there, and I can recall one of my uncles saying, \"You going to have some strong legs with that girl sitting on your lap all day like that.\""},{"speaker":"Charles","time":"00:18:11-9","content":"So it was just, it wasn't stressful. I didn't have to worry about hearing the fussing, the attitude of my stepdad L. He just had an attitude that was, he was all negative. Even some of his family members say that he was negative he was always grouchy and moody."},{"speaker":"Charles","time":"00:18:11-9","content":"So I didn't have that with my aunt. She used to like going shopping which made me have the patience to be with women shopping, because you know what they say about women they take all day but I enjoyed just spending time with her. She just had a good demeanor. A positive attitude about things, which made me feel good."},{"speaker":"Marcus","time":"00:19:51-4","content":"Are you still in touch with her?"},{"speaker":"Charles","time":"00:19:56-0","content":"Not as much as I used to be. Now with the cell phones and the number from here a lot of people think its bill collector numbers. So when I call they don't answer it they be thinking, \"Oh that's a bill collector I'm not gone answer that.\" So I would have to send words to her that, hey this is the number."},{"speaker":"Marcus","time":"00:20:19-0","content":"Yeah what about school do you have specific memory from school?"},{"speaker":"Charles","time":"00:20:24-1","content":"I used to get, I started getting put out of school a lot. I remember this though when I made it to Booker T, and you're from New Orleans so you should be familiar with this. I made it to the 9th grade but I really didn't make it to the 9th grade let me tell you what I mean by that. In New Orleans when I was going to school if you be in a certain grade for so long, they'll skip you because of your age. Well I had went to jail for all of that for something when I got out they told me I was no longer in Dunham, but in Booker T."},{"speaker":"Charles","time":"00:20:24-1","content":"And so this is how I made it to the 9th grade, but I really didn't have the mental capacity to be in the 9th grade. But I remember a teacher I had there I believe her name was Ms. Penny, when I was in elementary I used to play the trumpet and I keep trying to remember notes but can't."},{"speaker":"Charles","time":"00:20:24-1","content":"And when I went to Booker T, they wanted me to play the trumpet I was often too much stuff. I'm smoking and drinking and doing drugs and running the streets and all that, there's no way in the world I'm slow down to play an instrument, but Ms. Penny I was in her class, and it was about photography. I can't remember the name of the class but I know it's about photography."},{"speaker":"Charles","time":"00:20:24-1","content":"I remember her trying to grab hold of me try to talk some sense into me, but I think I was too far out of her reach. Then you know a little while later I went to jail for the armed robbery, and when I came out almost 3 years later, she remembered my name. I was passing by Booker T and she said, \"Charles Amos?\" And I'm like, \"Wow. You know me.\" And I said, \"I remember you too Ms. Penny.\" She said, \"I remember you.\" and we had a brief conversation and that was it."},{"speaker":"Charles","time":"00:20:24-1","content":"But at school by the time I made it in the 7th grade, it was no longer school for me. It was just trouble you know I was fighting and getting put out and going to different schools, because I went to Liberty, I went to Cowan, than I went to Durham. It wasn't about school for me anymore not then."},{"speaker":"Marcus","time":"00:23:03-6","content":"What about your friends do you remember having a couple really close friends or a best friend?"},{"speaker":"Charles","time":"00:23:11-2","content":"Yeah Neil was one of my best friends. I really looked up to him because one time when my mom put me out, he said man I was sitting in another friends. I had called everybody nobody wanted to take me in I guess my behavior they thought, which was probably right."},{"speaker":"Charles","time":"00:23:11-2","content":"But I was sitting in the yard looking all melancholy, all gloomy and Neil came around the corner and he said, \"What's wrong.\" I said, \"I don't have anywhere to go. I don't have anywhere to live.\" He said, \"You're going to come live with me.\" I said, \"Man your daddy not gone have any of that.\" He said, \"Man I got this. You gone come live with me.\""},{"speaker":"Charles","time":"00:23:11-2","content":"So when we went there his dad welcomed me with open arms. And it was a huge relief for me because I know when I used to run away, I used to find abandoned cars and sleep in them or abandoned houses or I'll ride the bus line. I used to ride the broad bus from uptown to the east, and by the time I made it to the east, I'd wake up and like, \"Oh man I missed my stop!\" And he just, \"Okay where your stop was?\" And I'd just give him, esplanade or whatever."},{"speaker":"Charles","time":"00:23:11-2","content":"And he'll bring me to esplanade and wake me up and send me on my way which but I was lying to him it was just means of having something to do in the middle of the night, and sometimes I was scared, maybe a lot of times. So I knew I was going to be faced with that again, because I didn't have anywhere to go."},{"speaker":"Charles","time":"00:23:11-2","content":"So when Neil said that and he proved that, I had pledged my highest loyalty to him. He didn't know that, and I wouldn't let anything happen to him. Nothing. And so I considered him my best friend but it taught me something. That just because you make people your friends doesn't mean that they've made you theirs. And these are all life lessons I've learned since I've been incarcerated."},{"speaker":"Marcus","time":"00:25:32-4","content":"So let me ask you this without going into the details was the charge that brought you here that you're currently serving time for was that related to drugs and alcohol?"},{"speaker":"Charles","time":"00:25:51-5","content":"No it was related to Neil. You know I said I wouldn't let nobody do him anything."},{"speaker":"Marcus","time":"00:25:58-6","content":"Okay"},{"speaker":"Charles","time":"00:26:01-0","content":"But in the broader sense of it all, drugs always had something to do with my life, because with me running away early I was around older guys who was outside drinking and doing drugs, and smoking cigarettes. I was always the cool guy you know everybody could always talk to me, and so they would always give me something to drink, or some weed, or whatever the case may be."},{"speaker":"Marcus","time":"00:26:35-8","content":"So let's go back quite a few years 23 years, and do you remember your first day arriving at Angola?"},{"speaker":"Charles","time":"00:26:46-0","content":"Yes I do. I do."},{"speaker":"Marcus","time":"00:26:48-7","content":"Tell me about that."},{"speaker":"Charles","time":"00:26:51-2","content":"I had a cousin up here at the time. And he was telling me all about Angola, about try to get a job. So when I came here I was telling the administration that I want to go on Cypress side, because I knew that's where my cousin was he was in Cypress, which was the kitchen dorm at the time. And they said, \"Well you need a job to go over there.\" And I said, \"Well give me a job.\" They said, \"Okay farm line,\" whatever."},{"speaker":"Charles","time":"00:26:51-2","content":"So when I came down to go to where I'm going to be living, it's in a cell block and it's a farm line I'm working in the field. And I'm like this is not what I was expecting. I wasn't expecting to be in the cell blocks. But when I got here I'm like man I'm in Angola. I don't believe this."},{"speaker":"Charles","time":"00:26:51-2","content":"So instantly because of all of the rumors I've heard about Angola, I was conditioning my mind to be ready to die, because I don't know what to expect here. I don't know how people going to perceive me. So I was conditioning myself for the worst of the worst. And so it wasn't what I expected."},{"speaker":"Charles","time":"00:26:51-2","content":"And so I may have stayed in the cell blocks around four months and they sent me to population. and then being in population instantly I realized that I need to start educating myself. I need to start doing something that will help me get out this prison because I begin, my cousin painted a good picture for me, but it was the bad it was the wrong picture. \"Oh man Angola is good man, they have banquets you visit they have this and you have that and they doing this.\" All of the good things."},{"speaker":"Charles","time":"00:26:51-2","content":"But he didn't tell me that there were men who were model prisoners that were dying here. He didn't tell me any of that, that is hard getting out of Angola, because he was on court ordered. The court had called for him to come back to further litigate his case. And so he was telling me all the good things at Angola about, \"Oh you can get some clothes and you can do this and you can do that.\" But he wasn't telling me that its extremely hard to get out of Angola."},{"speaker":"Charles","time":"00:26:51-2","content":"That there are people who are very educated and very good people that are not leaving Angola. And so when I saw that, I'm like, \"Wow this is not where I need to be or even want to be.\" And so I was on a mad quest to educate myself, to litigate my case. And that was my focal point for everything. So I began to fill out job requests to get in school which took me about probably about a year, before I got in literacy school, and from there I met Miss Barley, and she had a saying that she used to say that, 'school is not from 1:00 to 3:00' because at the time I was going to school from one o'clock in the evening until 3 o'clock."},{"speaker":"Charles","time":"00:26:51-2","content":"So she used to say school is not a 1:00 to 3:00 thing it's a dormitory thing and if you really want to learn, then you have to take this to the dormitory and learn. And so it stuck with me and every day I was getting it. I wasn't watching TV. I wasn't playing any games or anything I just was studying. I thought I was on a mad quest and then I started meeting people of like minds. Norris Henderson, Kelvin Duncan, the chicos Leo Jacksons, the Alfred Carters these are people who took hold of me, and begin to show me that, man you can learn, because my mom had already brainwashed me that I wasn't going to be anything, that I couldn't learn."},{"speaker":"Charles","time":"00:26:51-2","content":"So when I started reading Kerry Brown, was another one KB, when I started reading how good it was to learn something, to have the ability to learn. I was like wow I should've been doing this. This is what I should've been doing and I was enjoying just reading and learning information and I was consuming so much of it because it was all new to me. And it felt so good to learn various things."},{"speaker":"Charles","time":"00:26:51-2","content":"So that's what started me on my quest I just had a strong desire once I got around Norris and all them Kelvin to just learn and it was fun and enjoyable. It was taking me places that I hadn't known and then I started thinking. What if I'd done this when I was in society where could I have been?"},{"speaker":"Marcus","time":"00:32:37-3","content":"I think Kelvin asks himself that question too."},{"speaker":"Charles","time":"00:32:47-7","content":"Because I think about all that I've learned. I can play the drums now. I'm in, and I'm not saying I'm the baddest drummer in the land, but I can play the drums. I can do a little keyboard. I write poetry. I mean there are so many things that, I've learned I cook now."},{"speaker":"Charles","time":"00:32:47-7","content":"There is, Angola has really been good to me and I know that's crazy to say but Angola taught me how to be a man. To be responsible to honestly look at myself, and see who I am, to really know myself. There is something that I do with my current girlfriend her name is Monique. I ask or in every email we do this."},{"speaker":"Charles","time":"00:32:47-7","content":"If you knew me you would know what, let me give you an example."},{"speaker":"Charles","time":"00:32:47-7","content":"If you knew me you would know I have high blood pressure you didn't know that I know that. So what I'm doing is I'm giving her a firsthand view of me and at the same token, its giving me a firsthand view of me as well because now I have to search myself for, if you knew me what do I know about me that I can tell her. And so I'm always searching my mind to know me, and it has allowed me to see myself crystal clear, my fears, my hates, those things I love. So it has opened me up to me and it has given her a clearer picture of me as well."},{"speaker":"Marcus","time":"00:34:56-8","content":"Yeah I didn't ask you this, do you have children?"},{"speaker":"Charles","time":"00:34:59-9","content":"No and I regret that. Because me not knowing that my mom didn't want my dad in my life, I just thought that he didn't want to be there. But my mom didn't want him in our lives. And because he wasn't there I said that I wouldn't bring a child into this world. And not be a part of his or her life. And so I didn't want kids then, but at the same time I didn't think that I would be in jail this long."},{"speaker":"Marcus","time":"00:35:39-1","content":"Well actually let me ask you a little bit about that. We talked a little briefly about life without parole earlier on. I have difficulty trying to imagine how a person comes to terms with such a thing. How do you cope with that? How to you cope with the knowledge of your sentence in Louisiana when life means life."},{"speaker":"Charles","time":"00:36:13-8","content":"Initially it didn't dawn on me about my sentence. I heard it, but it didn't register to me. In fact my mom told me, she was under the impression that I would do 20 years on life, and I would be home. And I was telling her no."},{"speaker":"Charles","time":"00:36:13-8","content":"In fact I was working at the warehouse here and a trucker came and we was talking and he said, \"Man how much time you have?\" I said, \"I have life.\" He said, \"well how long you been now?\" I said, \"About 5 years.\" He said, \"Oh you about to go home in 2 years.\" I said, \"Huh? He said, \"You about to go home in two years you said you got life?\" I said, \"Yeah.\" He said, \"That's 7 years.\" I said, \"No in Angola life means life.\" He said \"Come on man.\" I said, \"Yeah it means till you die\" \"No!\" I said, \"Yeah.\""},{"speaker":"Charles","time":"00:36:13-8","content":"But it didn't hit me initially. But when I came here and started seeing people dying here, it started hitting me. But I've never accepted the fact that I'm going to die here. I think if I ever place my mind around that I'll give up. I'll stop doing what I'm doing because I'm not doing what I'm doing because the thought of the doors opening. I mean I don't want to think about dying in prison. I keep saying that I'm get out of here."},{"speaker":"Charles","time":"00:36:13-8","content":"But a lot of stuff that I'm doing is not based upon me getting out of here. I'm doing it because I want to change me. And in the process I believe if I change me, the doors will open for me. In fact one of my poems I made mention of that. But I don't ever wrap my mind around me dying in prison."},{"speaker":"Charles","time":"00:36:13-8","content":"I don't ever because it's too much of a wait because I've experienced both sides. I've experienced being someone with a short amount of time when nothing really matters and someone with a lot of time where now, wait hold up. I remember answering the phone it was such a sweet thing to do. And so now having so much time allows you to focus, because you'll never know again when you answer the phone, or when you open the door and say, \"how you doing,\" or to hear a doorbell. Those things are not there anymore with life without parole. So you begin to think about those just small things and you focus now, because so many little things are huge now."},{"speaker":"Marcus","time":"00:39:19-7","content":"I guess it makes perfect sense to me that life without parole is unbearable to think about for too long."},{"speaker":"Charles","time":"00:39:19-7","content":"It is because the weight of it of not going home ever again, and you know you've changed now. You're not who you were when you came to prison is when you really think about it, it's like, man, they'll never let me out. And there's so much now that you want to, there's a scripture in the Bible, \"the more you know the more it hurts.\" And so the more I've educated myself the more it hurts and it's just not about the education, I'm saying educated but the more life has changed for me. And I can begin to see it from a different perspective the more it hurts. The more I realize that I let my nieces down I let my family down."},{"speaker":"Charles","time":"00:39:19-7","content":"There's so many things that I could've done better and now that I see it how much better life could be had I gone down the right road. It hurts now seeing that I can be such a blessing or benefit in the lives of so many people. But the system don't want to give me that opportunity."},{"speaker":"Charles","time":"00:39:19-7","content":"In fact my sister or rather my oldest brother who just turned 50 on Sunday, he told me some time ago that he saw the victim's dad and the victim's dad said how Charles doing? He all right. He said man tell him I believe in a second chance that if he go to any board I'll speak for him. But I don't know if the system would allow that to happen, because in Louisiana life means life."},{"speaker":"Charles","time":"00:39:19-7","content":"And so there's no means for me to say well look man he want to, you know because I can't even contact him he just so happened to see my brother. So I can't go on a mad hunt to say, well could you come say that? I can't do that according, that's breaking the rules of the prison system, of the penal system. So life means life in Angola."},{"speaker":"Marcus","time":"00:41:55-6","content":"But that must have meant a lot to you that."},{"speaker":"Charles","time":"00:42:10-0","content":"It did because I pray and asked God to allow people to forgive me. At one time when I first came up here, I probably, when I started learning things educating myself coming to terms with who I was. I started writing letters to people telling them to forgive me for not being or not fulfilling. How did I used to say it?"},{"speaker":"Charles","time":"00:42:10-0","content":"Forgive me for not bringing out the best in you. Because everybody we meet we ought to bring out something in them. We ought to either we're going to give them something or they going to give me something and I know that everything that I gave everybody before I come to prison was negative. So I wrote letters apologizing to them for not being what I was supposed to be in their lives. Because I was supposed to be a positive influence in their lives, I'm that now, but I can't be with them on the same terms I can now as I could've then."},{"speaker":"Charles","time":"00:42:10-0","content":"But then I was supposed to make a positive impact in their lives, and I didn't. And so I wrote letters apologizing to them, and I've asked God to let forgiveness be extended to me as I forgive people, because I know I need it."},{"speaker":"Marcus","time":"00:43:35-5","content":"Yeah let me ask you. It is so, so long ago but when you look back on the crime, the victim, the victim's family and so forth. After being punished for so long what are your thoughts now about that?"},{"speaker":"Charles","time":"00:43:57-5","content":"I do understand that I committed a crime. I do understand that but I was, I mean even committing the crime I never thought that I would be in prison so long, but I do know that rehabilitation takes place in a person life, because I see it here. I'm seeing how I've I'm rehabilitated. So I just want to have an opportunity to prove to everybody that, \"Hey man I can be a successful person. I can pay a bill because I've never paid a bill. I can you know be responsible, maintain a job where I can climb up the corporate, the career ladder, the workforce.\""},{"speaker":"Charles","time":"00:43:57-5","content":"I really think that everybody should get that opportunity because I know being here people have changed. I'm a living witness of people have changed. So I know that people can change and I want to be given an opportunity to show myself first, and foremost that I can change, and also society. And so I think that everyone should be given an opportunity to show the world."},{"speaker":"Charles","time":"00:43:57-5","content":"If you haven't changed there are guidelines and parameters in place to say that, 'okay you're still the same, you stay in prison,' because I would be crazy to think that everybody deserves to go home. And I'm coming from the standpoint of coming from the streets, and I know some people here, they don't deserve to be here."},{"speaker":"Charles","time":"00:43:57-5","content":"Now maybe 20 more years they can probably coming together or 5 more years or next year who knows, because I contribute a lot of my change to, is my belief in God. Now I became saved, and that changed my form of thinking. So I do believe that everybody should be given an opportunity. It's like Warden Cain used to say, even Charles Manson get an opportunity for parole. So if we're giving that opportunity, not saying that everybody would make it but just to have an opportunity."},{"speaker":"Charles","time":"00:43:57-5","content":"Then maybe I can use my victim dad to show that hey man the people don't hate me and let the record show that. I've accomplished a lot of things. I have a bachelor's degree in Christian ministry. I have a culinary certificate. I've accomplished so many other things since I've been here, that shows that I won't be a threat to society anymore."},{"speaker":"Marcus","time":"00:46:55-7","content":"So let's say you do get an opportunity to go before a parole board a pardon board they're going to have is everything that got you here. And they in my experience there's been a lot of time lost into that."},{"speaker":"Charles","time":"00:47:15-5","content":"Yes. And I'm the worst of the worst according to their records because I'm a two time violent offender, armed robbery and murder so."},{"speaker":"Marcus","time":"00:47:22-1","content":"Right. So you're going to have, you'll have a short period of time to tell them who you are. What would you say to them?"},{"speaker":"Charles","time":"00:47:29-8","content":"That I'm no longer the same. And I know that there have been many men who have come through the system, and manipulated the system to get the system to think and believe they are one way, but in actuality they're something else. But I'm not one of those people. To honestly know me you'll know that I'm loyal, and to honestly know me, you'll know that I am a man of God, and God has honestly took control of my life."},{"speaker":"Charles","time":"00:47:29-8","content":"The things that I used to do and used to think I no longer think that way and let me give you an example, this a good example. Recently I went to film Kelvin in New Orleans, and I don't know if you're familiar with the form that was documentary some years ago with Ashanti, and he said look at me I'm free. There's no security around me. There's none of that. I can just walk off but I'm not. Because it's bigger than that."},{"speaker":"Charles","time":"00:47:29-8","content":"Well recently or rather then in 1998 I said man they couldn't give me that opportunity, I'm out of here. Tuesday I was in the heart of New Orleans where I grew up. There's nowhere in New Orleans I can go and be lost, but today I'm here in Angola. I said I rationalized it, I said man Ashanti is crazy. I understand he is from Chicago, and been in a city where he didn't grow up, but I'm in New Orleans."},{"speaker":"Charles","time":"00:47:29-8","content":"Two blocks away from my sister house. I pass my grandmother house, 3 blocks away from my other grandmother house. If I'd left, no way in the world they've caught me. But God, if it don't be for God I wouldn't be talking to you right now. So am I changed? Oh yes indeed. I know that it's bigger than constantly getting myself in trouble. I realize now that the rules are there for a reason."},{"speaker":"Marcus","time":"00:49:50-3","content":"Well the other thing about that example that you just gave me which is a very powerful one actually, is that the people who know you the best are here."},{"speaker":"Charles","time":"00:50:01-6","content":"Yes."},{"speaker":"Marcus","time":"00:50:04-4","content":"And according to them you're so trustworthy that they're willing to send you off to New Orleans with a camera."},{"speaker":"Charles","time":"00:50:12-4","content":"I'm just walking around."},{"speaker":"Marcus","time":"00:50:12-4","content":"They know you're going to come back"},{"speaker":"Charles","time":"00:50:29-2","content":"Of course I am. Because they know that I'm not about that they know that I'm not going to do anything crazy and I know that I'm not going to do anything crazy."},{"speaker":"Marcus","time":"00:50:32-5","content":"Right. I want you to talk a little bit about you know you accomplished a lot since you've been here and you've told me a few of those things can you kind of outline some of the organizations that you're involved with?"},{"speaker":"Charles","time":"00:50:41-9","content":"Right now I'm involved with Angola special civic project which is an organization designed to help get parole eligibility for lifers. I've been in that club since 1997, this is how I met Chico and Norris Henderson or Chico, one you want to say, Leo Jackson. I've met a lot of men who have groomed my mind, who have allowed me to see certain things."},{"speaker":"Charles","time":"00:50:41-9","content":"I've been a part of JCE Toastmasters, with speak up classes and whatever the case which was briefly with toastmasters and JCE. I've been a part of some good organizations. I've been a part of the lifers' organization at one time another organization in reference to penal reform, and a lot of my clubs I've been in have been centered around just positive things educating yourself, so on, and so forth."},{"speaker":"Marcus","time":"00:52:02-0","content":"Yeah. So I think maybe in terms of the turning point for you it sounds to me like it was- I need to get out of here. And in order to do that I need to educate myself, and once that started you just kind of went on, but is it also true that you were mentored?"},{"speaker":"Charles","time":"00:52:15-7","content":"Yes indeed."},{"speaker":"Marcus","time":"00:52:21-1","content":"Can you tell me a little bit about that?"},{"speaker":"Charles","time":"00:52:23-1","content":"Let's just take Norris for instance. Norris he showed me that life is bigger than just running around the prison doing nothing. Outside of becoming a better you in this prison, it doesn't matter. So don't get caught up with the homosexual games, or the drug games, or the constantly going to the cell block with the foolishness, don't get caught up in any of that, that doesn't matter what matters is becoming a better you."},{"speaker":"Charles","time":"00:52:23-1","content":"And so when I begin to see that. They was pulling me into JCE and being around them and Kelvin Duncan was showing me the law because there were law classes going up here and Kelvin was one of those them that was doing that. Kelvin and Leo Jackson I don't know if you know Leo Jackson"},{"speaker":"Marcus","time":"00:53:26-2","content":"I have not met Leo Jackson."},{"speaker":"Charles","time":"00:53:31-3","content":"Alfred Carter all these guys were showing me law and so they were getting me to read the right things because If I don't read the right things then I be in the wrong set of people, and so being around the right group of people who were thinking positively."},{"speaker":"Charles","time":"00:53:31-3","content":"When we went to go film that documentary in New Orleans last week, one guy said this, that it's hard trying to find likeminded people, people who thinking like you. So if you hang around and be around positive people then positive things will happen. So I got around positive people here, Norris Henderson and Wilbur Lee, not too much Wilbur but Chico and all of them. They let me see that it's bigger than just the craziness that goes on in this prison."},{"speaker":"Marcus","time":"00:54:23-7","content":"Sure. You earlier said that Angola's been good to me. I can clearly see why you'd say that, but today what do you consider the worst part about being here? And it might seems like a crazy question?"},{"speaker":"Charles","time":"00:54:44-3","content":"No because the worst part of being here is not having the ability to go home. When you finish this you going to wrap up and leave. The worst part of being here is just knowing that there's so much you want to do, because you see life so different now but you can't. When my girlfriend leaves I be wanting to leave with her but you can't. And its nerve wracking sometimes because you know that I'd never come back to prison never."},{"speaker":"Charles","time":"00:54:44-3","content":"That's something that I never said before, but I'm saying it now loud and clear I'll never come back to prison. Because my eyes are open I honestly see even from me doing drugs I look at it and I say you know what, I wasted my time and money doing drugs because I'm basically just fighting my sleep. Because most drugs I was doing were downers which basically just putting me to sleep, and all that I was doing was fight my sleep. Why did I do it?"},{"speaker":"Charles","time":"00:54:44-3","content":"So the worst part of here is not having the ability to leave here. I want to leave. I don't know when that's going to come, but I want to leave."},{"speaker":"Marcus","time":"00:56:05-1","content":"Fair enough yeah. Do you think there's something that prison administrators, security people who are actually reform minded, is there something that they could be doing better that would encourage more transformations such as your own?"},{"speaker":"Charles","time":"00:56:25-7","content":"Not in Angola because Angola the doors are open for a lot of opportunities. If you really want to do something or be something Angola is the place that it can happen. I mean you have educational, vocational, post-secondary. There are so many opportunities there are self-help clubs, there's so much that can take place even athletically."},{"speaker":"Charles","time":"00:56:25-7","content":"There are baseball teams, and now a soccer team. I mean there is so much to do here to where, if you're not careful you'll forget about going home, because there's so much to do and many don't want to ever think that they not going home, and they're doing a good job with providing services for you here. There are church services almost daily, so there are a lot of activities. I would say they keep up the good job, don't shut it down."},{"speaker":"Marcus","time":"00:57:30-0","content":"Can you describe your typical day your routine now? I know you're involved with lots of different things but what is what's a typical day for you a day in the life of Charles Amos at Angola."},{"speaker":"Charles","time":"00:57:44-9","content":"It varies so much because just yesterday we went to Baton Rouge to film Carey Miles. And so it varies. I mean I'm an early bird and so I get up and after I pray and read my Bible, I get on the email, and I send a devotion every morning to my girlfriend Monique. Every morning I send her, the day before I will pick a scripture and I write her I write it and then that morning I send it to her for the word for the day."},{"speaker":"Charles","time":"00:57:44-9","content":"So from there I probably would go to the TV station and see if I have to edit something or something of that nature. Now that we have our little jp5 players I'm playing video games on it sometimes. I'm reading. I'm working out, playing basketball."},{"speaker":"Charles","time":"00:57:44-9","content":"So it varies on time-wise because sometimes I go, I'm an inmate minister so I go to TU to minister there. So my days I can't pinpoint one what I'm do every day because every day changes. Every day is different for me based upon my job duties because I still work in the library and I go to the cell block and deliver books to them so my days they vary."},{"speaker":"Marcus","time":"00:59:07-7","content":"It seems to me that's because you have that's the way you've designed your life here. There are others for whom one day is indistinguishable from the next"},{"speaker":"Charles","time":"00:59:19-5","content":"No not my days."},{"speaker":"Charles","time":"00:59:19-5","content":"Intvr #00:59:13-6#Not for you."},{"speaker":"Charles","time":"00:59:15-6","content":"No."},{"speaker":"Marcus","time":"00:59:20-5","content":"That's good. Of all of the things that you've accomplished what are you most proud of?"},{"speaker":"Charles","time":"00:59:30-9","content":"That I'm saved. I'm proud of the fact that I mean I'm saved because if I don't get saved none of this could happen. The same mindset of, woe is me being bitter, upset about life, upset I'm in prison, it would still be here and I would never open my mind up to receive all that I've received over the years. So my biggest accomplishment was getting saved because it opened up a new world for me. It allowed me to receive education, and everything else that came with it."},{"speaker":"Charles","time":"00:59:30-9","content":"It's not about the degrees or the cooking skills, and I love eating the Bible and I love cooking but more than anything I love my relationship with God and is it perfect? No, it's not perfect at all. But that was the major turning point in my life when I got saved. It was that because it brought so much more meaning, it made me understand things so much better."},{"speaker":"Marcus","time":"01:00:43-7","content":"Do you spend some time I think you must uh envisioning what your life would be were you to be granted a second chance? Do you have a vision of what you'd be doing where you'd be doing, what you going to, I mean how you'd be doing it?"},{"speaker":"Charles","time":"01:01:11-5","content":"I want to cook when I go home and even if I don't get a cooking job, I still want to I want to help kids in my neighborhood. I want to bake things for them you know cookies for them. I want to cut old people grass. I want to do that. I want to wash their cars. I want to do some things for people. I really want to touch people lives that's what I really want to do. I really want to do that for people who can't do for themselves. Most importantly I want to give the younger generation life through my eyes how I see it how they can be who they want to be."},{"speaker":"Charles","time":"01:01:11-5","content":"I really want to motivate kids to get them to see, \"Man this is not what you should be doing,\" especially if they're veering off. \"No man this is what you need to be doing in life. You can be this. My mom told me I wouldn't be this and I believed it but you don't have to believe what I believe. You can be better than your mom and your dad. You can be better than anything. You can be who you want to be.\""},{"speaker":"Charles","time":"01:01:11-5","content":"And I want to impact kids because like I love kids and when my nieces and cousins and nephews come to see me they really enjoy their time with me, and I really have a connection with kids, I've always had that and I want to give them a better opportunity than what I had."},{"speaker":"Marcus","time":"01:02:39-6","content":"Do you have an opportunity to talk to some of these guys in reentry?"},{"speaker":"Charles","time":"01:02:43-2","content":"Yes I do and I talk to them. I mean they call me famous Amos. Get your head right, famous Amos and all type of stuff. I don't talk to all of them, no and it's all about that connection and I talk to some of them I do"},{"speaker":"Marcus","time":"01:03:01-3","content":"Yeah some of them would benefit from hearing that too."},{"speaker":"Charles","time":"01:03:04-9","content":"Yeah and I let them know."},{"speaker":"Marcus","time":"01:03:08-6","content":"So is there a question that I didn't ask you that I should have asked you?"},{"speaker":"Charles","time":"01:03:13-6","content":"No."},{"speaker":"Marcus","time":"01:03:25-3","content":"Given you an opportunity to talk about?"},{"speaker":"Charles","time":"01:03:28-1","content":"I didn't cry I felt a few tears but no I think we've covered it and its time for me to go anyway its 3:20, I have to get on another call."},{"speaker":"Marcus","time":"01:03:28-5","content":"Okay, that's okay we're ready."}]}