{"name":"","transcript":[{"content":"Chris Montague REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"So Chris, just to get us started. Can you start by telling me your name, the crime that you were convicted of, your age at the time of the offense, and the amount of time you've already served."},{"speaker":"Chris","time":"00:00:17-3","content":"Chris Aaron Montague, charged with 2nd degree murder, and what else?"},{"speaker":"Marcus","time":"00:00:26-7","content":"How old were you?"},{"speaker":"Chris","time":"00:00:27-8","content":"Just making 24."},{"speaker":"Marcus","time":"00:00:29-8","content":"24?"},{"speaker":"Chris","time":"00:00:31-3","content":"Yeah."},{"speaker":"Marcus","time":"00:00:32-5","content":"Okay. And how much time have you served?"},{"speaker":"Chris","time":"00:00:35-4","content":"I've served 23 years right now."},{"speaker":"Marcus","time":"00:00:37-3","content":"Okay. I'm going to start by asking a few questions about your life before you came here. And then we'll switch gears a little bit and talk about your time since the last 23 years or so. So you've got about approximately half your life before and half your life after at this point. So, where were you raised?"},{"speaker":"Chris","time":"00:00:57-5","content":"Scotlandville, Louisiana, Baton Rouge."},{"speaker":"Marcus","time":"00:01:00-1","content":"Okay, sure, not far from here?"},{"speaker":"Chris","time":"00:01:02-1","content":"Yeah."},{"speaker":"Marcus","time":"00:01:03-3","content":"So, tell me a little bit about the folks who raised you."},{"speaker":"Chris","time":"00:01:05-9","content":"Mama was a hard working person, single mama. I grew up, I was the oldest. She had 3 girls, I got 3 sisters, and I was the only boy. And that's about it."},{"speaker":"Marcus","time":"00:01:19-7","content":"What was your home life like?"},{"speaker":"Chris","time":"00:01:24-5","content":"It was good. She tried because I just fell off on the wrong path in the neighborhood."},{"speaker":"Marcus","time":"00:01:36-6","content":"Sure, that's fine. So were there men in your mother's life who came into your life over the course of growing up?"},{"speaker":"Chris","time":"00:01:43-4","content":"Not really. Really I ain't had too much to do with her. My stepfather, none of them. Really they ain't never tell me nothing like that."},{"speaker":"Marcus","time":"00:01:56-8","content":"So you didn't really have a father figure who wasn't your father. I got you. So is it accurate to say that for the most part coming up that you felt there were adults who cared about you and loved you or did you feel like you were kind of left to your own devices?"},{"speaker":"Chris","time":"00:02:13-6","content":"My mama loved me, my god mama loved me, aunties and them. I was straight with them."},{"speaker":"Marcus","time":"00:02:26-7","content":"Okay, are you still in touch with the family?"},{"speaker":"Chris","time":"00:02:29-5","content":"Yeah, my mama died in 2001, my god mama still come, my aunties, that's all I got really."},{"speaker":"Marcus","time":"00:02:35-4","content":"Sure, what about your sisters?"},{"speaker":"Chris","time":"00:02:38-0","content":"Yeah they come. One of them dead, she passed last year, the baby. The rest of them still come. So that's all you know family."},{"speaker":"Marcus","time":"00:02:45-2","content":"Sure, do they come to the rodeo? Do you do the rodeo?"},{"speaker":"Chris","time":"00:02:51-0","content":"Yeah I do the rodeo. Some of them come, like my cousin. But the rest of them I just have them on a visit."},{"speaker":"Marcus","time":"00:03:01-1","content":"Sure. Tell me a little bit about school. How was school for you?"},{"speaker":"Chris","time":"00:03:04-6","content":"School was nice. I was in 11th grade till I got kicked out. Then went to adult education left that."},{"speaker":"Marcus","time":"00:03:14-9","content":"Why'd you get kicked out?"},{"speaker":"Chris","time":"00:03:18-6","content":"Bramwell high school, what I did, fighting, or something like that. Neighborhood stuff, like Scotlandville fighting, Greensville City, and all of that."},{"speaker":"Marcus","time":"00:03:28-8","content":"Yeah, so you were part of a group, kind of with rivals with other people in Greenville city, in the same school."},{"speaker":"Chris","time":"00:03:38-1","content":"Right. Everybody that was Scotlandville."},{"speaker":"Marcus","time":"00:03:41-5","content":"Okay. What about close friends, have you stayed in contact with any friends from back then?"},{"speaker":"Chris","time":"00:03:50-3","content":"No at all, because I felt like the wrong friends, like a true friend ain't going to tell you nothing wrong. I ain't never had a true real friend to say well look don't do that. I always had friends that were like we're going to do this do that. I just left all that alone."},{"speaker":"Marcus","time":"00:04:16-9","content":"I see. Can you, I've driven through Scotlandville coming up here all the time. But I'm not very familiar with it. Is it's kind of country and kind of can you paint a picture for me? Like let's go back to your mom's house when you grew up, if I'm standing in front of your door, looking out into the neighborhood, what is it like? Can you describe it for me?"},{"speaker":"Chris","time":"00:04:43-0","content":"Yeah, there was a store across the street, a club, washing trier, houses, metro road to connect interstate you know a whole bunch of houses. Just like a regular neighborhood."},{"speaker":"Marcus","time":"00:04:43-0","content":"Okay, so kind of suburban."},{"speaker":"Chris","time":"00:04:43-0","content":"It's not that far from metro airport."},{"speaker":"Marcus","time":"00:05:06-4","content":"Okay."},{"speaker":"Chris","time":"00:05:09-0","content":"Perry Prison, metro airport, and the surrounding area."},{"speaker":"Marcus","time":"00:05:17-5","content":"Okay I think I get a sense of it. What did you do for a living, how did you support yourself?"},{"speaker":"Chris","time":"00:05:25-7","content":"Sometimes I was getting lucky. I'm not going to lie, I was getting blessed out there with certain jobs. I was getting good jobs. Then messing around, acting crazy and stopped going to the work and all that."},{"speaker":"Marcus","time":"00:05:43-3","content":"Well what kind of job, tell me?"},{"speaker":"Chris","time":"00:05:44-9","content":"School kids, what is it I was doing? Oh man I forgot the mattress place of Chippewa, Frankman bedding."},{"speaker":"Marcus","time":"00:05:44-9","content":"What about drugs and alcohol, were drugs and alcohol a part of your life?"},{"speaker":"Chris","time":"00:06:05-9","content":"Alcohol, I was drinking though. Drugs, I could see how drugs had for everybody else, I couldn't do it. Couldn't function like that."},{"speaker":"Marcus","time":"00:06:10-8","content":"I understand. So there was fighting in school, fighting in the neighborhood, did you find yourself getting involved with that quite a bit?"},{"speaker":"Chris","time":"00:06:21-0","content":"Yeah, this what happened. Growing up, growing up okay a duded would bully me, you heard me. Growing up, kicking me, and sending me home, black guys, because I'm the only boy. When I got bigger and stronger, I start hitting all the ones who bullied me. So that's how all the fighting started."},{"speaker":"Marcus","time":"00:06:59-9","content":"I got you. The charge that you ended up being in here for, is that somehow related to that?"},{"speaker":"Chris","time":"00:07:07-8","content":"No that's just something, my fall partner just got trigger happy or whatever or got spooked or something, and the gun went off shot like that."},{"speaker":"Marcus","time":"00:07:18-5","content":"Okay, can you give me a brief summary of what happened there? And we don't need to get into too much detail."},{"speaker":"Chris","time":"00:07:26-3","content":"All right. Me and my fall partner went in the neighborhood, we were trying to he wanted to jack somebody, you know, take they dope and all that. Okay and as the person was leaning in the car, he got nervous, somebody else shot in the neighborhood, he got spooked he shot, you know what I'm saying. And then drove off, got rid of the car. Then around a year later got caught."},{"speaker":"Marcus","time":"00:07:26-3","content":"I see, whole year later."},{"speaker":"Chris","time":"00:08:00-2","content":"Yeah, no around like 9 months something like that."},{"speaker":"Marcus","time":"00:08:04-2","content":"And how did you get implicated?"},{"speaker":"Chris","time":"00:08:07-5","content":"She told on me, my fall partner."},{"speaker":"Marcus","time":"00:08:10-0","content":"Okay is he up here?"},{"speaker":"Chris","time":"00:08:10-5","content":"No, is was a she, she got what 31 years something like that."},{"speaker":"Marcus","time":"00:08:21-4","content":"So she got 31 years and you got a life sentence?"},{"speaker":"Chris","time":"00:08:24-1","content":"I was trying to get the same time but you know I went to trial."},{"speaker":"Marcus","time":"00:08:29-5","content":"Oh she took a plea deal."},{"speaker":"Chris","time":"00:08:32-4","content":"Yes."},{"speaker":"Marcus","time":"00:08:34-1","content":"What's her name?"},{"speaker":"Chris","time":"00:08:39-1","content":"Melissa Hamilton."},{"speaker":"Marcus","time":"00:08:40-7","content":"Do you still have any contact with her?"},{"speaker":"Chris","time":"00:08:41-6","content":"No."},{"speaker":"Marcus","time":"00:08:43-6","content":"So she took a deal for 31 years, is she out?"},{"speaker":"Chris","time":"00:08:46-3","content":"I believe so but I'm not sure. I had people looking out for her, I believe she out through."},{"speaker":"Marcus","time":"00:08:46-3","content":"She's out and you're still here on the principal charge."},{"speaker":"Chris","time":"00:08:58-3","content":"Yes."},{"speaker":"Marcus","time":"00:09:01-2","content":"How do you make sense of that?"},{"speaker":"Chris","time":"00:09:05-2","content":"It can't make sense. Just hoping that something happen, law change or discover new evidence or something. But I've never really focus on that, I can't get mad about that, you know because I was there. I can't get mad for what happened with her. I got to be mad at myself, because I put myself in that situation like that, that's how I look at it."},{"speaker":"Marcus","time":"00:09:39-8","content":"Sure, no I understand that. I respect that. Was she your girlfriend?"},{"speaker":"Chris","time":"00:09:44-9","content":"Yeah."},{"speaker":"Marcus","time":"00:09:46-4","content":"Okay, any other girlfriends that stand out in your mind from before you got locked up?"},{"speaker":"Chris","time":"00:09:52-5","content":"My son's mama."},{"speaker":"Marcus","time":"00:09:57-6","content":"Okay. Tell me about your son."},{"speaker":"Chris","time":"00:09:59-6","content":"Alright. Well he in the feds right now yeah his name Chris, he what, 29."},{"speaker":"Marcus","time":"00:10:06-2","content":"He's in the federal system?"},{"speaker":"Chris","time":"00:10:07-4","content":"Yes."},{"speaker":"Marcus","time":"00:10:12-4","content":"For a drug related charge?"},{"speaker":"Chris","time":"00:10:13-5","content":"Yeah, drug trafficking. He all right, I keep in contact with him. He's straight."},{"speaker":"Marcus","time":"00:10:23-7","content":"Good, any other children?"},{"speaker":"Chris","time":"00:10:24-5","content":"No that's my one. Then my grandchildren he got."},{"speaker":"Marcus","time":"00:10:24-5","content":"Tell me about them."},{"speaker":"Chris","time":"00:10:26-2","content":"Oh you know they're bad, they love their grandpa though."},{"speaker":"Marcus","time":"00:10:35-1","content":"Yeah, they come visit you?"},{"speaker":"Chris","time":"00:10:36-5","content":"Yeah, my auntie bring them."},{"speaker":"Marcus","time":"00:10:39-7","content":"What are their names?"},{"speaker":"Chris","time":"00:10:41-1","content":"One named Desiree, Yolanda, and Akyla."},{"speaker":"Marcus","time":"00:10:46-4","content":"Oh wow. So how's being a grandfather?"},{"speaker":"Chris","time":"00:10:53-1","content":"It's good because I ain't never have the chance to spend with him like I spend with them. That's what makes it, and that's what I try to teach him. I say, you know, I say I left a bad example for him because he did the same thing I did, I wasn't there, he left them."},{"speaker":"Marcus","time":"00:10:53-1","content":"Yeah and now you have a chance to kind of correct that."},{"speaker":"Chris","time":"00:11:22-0","content":"That's what I'm trying to get to now."},{"speaker":"Marcus","time":"00:11:26-0","content":"When's your next visit with them?"},{"speaker":"Chris","time":"00:11:30-7","content":"They be popping up every now and then, but my god mama auntie, they come like every 2 Sundays."},{"speaker":"Marcus","time":"00:11:43-3","content":"And they're just coming from Scotlandville, right?"},{"speaker":"Chris","time":"00:11:47-0","content":"No one coming from Allison, that's right by Scotlandville. The other come from Atlanta."},{"speaker":"Marcus","time":"00:11:52-8","content":"Oh man that's a long way. They come every 2 Sundays?"},{"speaker":"Chris","time":"00:11:56-9","content":"Yeah she catch a plane from Atlanta, come down here, and stay with her other sister, that's my god mom. Then they come."},{"speaker":"Marcus","time":"00:12:07-0","content":"Man, that's dedication."},{"speaker":"Chris","time":"00:12:12-1","content":"Yeah they're doing that for their sister they say, \"We have to do for our sister.\" We're doing it like that."},{"speaker":"Marcus","time":"00:12:22-5","content":"Yeah, that's remarkable. I mean there are a whole bunch of people who don't have any visits, let alone visits from Atlanta. So what about other run-ins with the law? I'm trying to get a sense of like, you're going along, you're in 11th grade, and you get kicked out of school. What's going on, what's your storyline? I mean do you start getting involved with trouble right after school?"},{"speaker":"Chris","time":"00:12:48-9","content":"No, I got in trouble earlier. I was a juvenile, yeah a juvenile, running the streets, breaking in houses, breaking in stores. Following the wrong crowd. Every time I followed the wrong crowd."},{"speaker":"Marcus","time":"00:13:12-0","content":"So if you had to identify one variable, one factor that got you down this wrong path as it were. I think you meant you went down the wrong path. What would that be? In hindsight you've had so much time to look back on it."},{"speaker":"Chris","time":"00:13:30-2","content":"Okay, which things?"},{"speaker":"Marcus","time":"00:13:33-3","content":"What's the reason?"},{"speaker":"Chris","time":"00:13:36-0","content":"Turned me bad?"},{"speaker":"Marcus","time":"00:13:38-6","content":"Yeah, I don't think you're bad."},{"speaker":"Chris","time":"00:13:40-0","content":"Ah I'm just saying. What turned me? I already know that. When the 3 dudes bullied me, kept bullying me, that's what did it."},{"speaker":"Marcus","time":"00:13:48-5","content":"Okay, and you wanting to fight back?"},{"speaker":"Chris","time":"00:13:53-5","content":"Yeah I ain't had no brothers like everybody else, I had sisters, and I was the only boy. I be thinking about that now, boy those dudes they never messed with me. Just left me alone out, I'd been straight."},{"speaker":"Marcus","time":"00:14:07-3","content":"Was that one of the reasons you felt the need to have a firearm?"},{"speaker":"Chris","time":"00:14:11-1","content":"Yeah, a firearm, because everybody else had one."},{"speaker":"Marcus","time":"00:14:15-8","content":"Yeah, especially getting bullied."},{"speaker":"Chris","time":"00:14:18-2","content":"Okay no dude had no gun. Especially that's the only, like dudes fighting, back then everybody was fighting. If I beat you up, then you're going to go get a gun. That's how that goes. Dude shoot at you, they say, think I got to go get me a gun and shoot back."},{"speaker":"Marcus","time":"00:14:41-4","content":"Yeah, so the first time you were arrested that was well before this. It was for breaking into places."},{"speaker":"Chris","time":"00:14:50-4","content":"A grocery store."},{"speaker":"Marcus","time":"00:14:53-2","content":"A grocery store, okay. And what juvenile facility were you in?"},{"speaker":"Chris","time":"00:14:57-5","content":"I didn't go to juvenile, dealing with the court, they just dismissed it because we didn't take nothing."},{"speaker":"Marcus","time":"00:15:07-5","content":"You didn't do any time for breaking in there."},{"speaker":"Chris","time":"00:15:09-1","content":"Yeah I didn't do no juvenile time."},{"speaker":"Marcus","time":"00:15:12-1","content":"Okay sure. Okay so let me ask you this, so you get the accessory charge, you do time in the parish, you're finished with that. You get out and you get this shot. When you honestly think about what your life would've been like if you had not gotten this last particular charge. Can you tell me, what do you think would've happened to you?"},{"speaker":"Chris","time":"00:15:37-2","content":"I wouldn't be here. I wouldn't be here. I'd have been dead."},{"speaker":"Marcus","time":"00:15:45-7","content":"You would've been dead."},{"speaker":"Chris","time":"00:15:47-6","content":"Yep, probably by 25, 26."},{"speaker":"Marcus","time":"00:15:54-0","content":"Yeah it's interesting how many folks say that. Just because you're in a lifestyle that's dangerous, people getting killed around you."},{"speaker":"Marcus","time":"00:15:54-0","content":""},{"speaker":"Chris","time":"00:16:02-9","content":"Yeah, yep."},{"speaker":"Marcus","time":"00:16:06-3","content":"So is it a little bit strange to think of Angola of all places as a place that possibly saved your life?"},{"speaker":"Chris","time":"00:16:11-0","content":"Yeah, I'm not going to lie, I be telling my people that, I say, Bro this place really saved me, made me think, get me mature, think about what I want out of life."},{"speaker":"Marcus","time":"00:16:25-3","content":"Okay so let's talk a little bit about that. Before we move on, is there something else about your life that's really important to who you are today, a childhood experience or something we should know about you?"},{"speaker":"Chris","time":"00:16:42-0","content":"Something you should know about me, how I was back then?"},{"speaker":"Marcus","time":"00:16:46-8","content":"Yeah, how you were coming up."},{"speaker":"Chris","time":"00:16:49-6","content":"Oh I was a good little kid, yeah good little kid, just as an adolescent so hard-headed, want to follow the streets and lived in Scotlandville, that all I know."},{"speaker":"Marcus","time":"00:17:04-8","content":"Sure okay and it sounds like wrong crowd. All right so you get this last charge, you're back in the parish jail while the whole trial goes through, you went to trial. And then you're sentenced and you end up here. You remember that bus ride up here?"},{"speaker":"Chris","time":"00:17:24-9","content":"Yeah."},{"speaker":"Marcus","time":"00:17:26-7","content":"Tell me about that."},{"speaker":"Chris","time":"00:17:29-0","content":"On that bus ride up here, I just said, \"Boy what have I got myself into. I said what is cold blooded.\" Life just went just like that, that's all I was thinking. And then you know, I had a couple of dudes up here telling me about Angola. I said oh man."},{"speaker":"Marcus","time":"00:17:47-2","content":"What had you heard?"},{"speaker":"Chris","time":"00:17:48-5","content":"Dudes raping dudes, all that. I said man well I got to get me something to work with. Then you know come up here, they put me in B block, cell block. One day, I had then seen a couple of dudes get cut in the head in the field with a Disc Blade. I said man."},{"speaker":"Marcus","time":"00:18:13-7","content":"What kind of blade?"},{"speaker":"Chris","time":"00:18:14-8","content":"Disc ban blade, the thing when you're working in the field."},{"speaker":"Marcus","time":"00:18:17-1","content":"By accident."},{"speaker":"Chris","time":"00:18:19-5","content":"No. It was early in the morning, I said man look at this stuff here. And then as time went on, seeing a couple of dudes get bullied and that, I said man. Then dude said you better get yourself something to work with. But I was just blessed I never had to do none of that."},{"speaker":"Marcus","time":"00:18:38-2","content":"Yeah you know it's one of these things where if you do something to protect yourself you get in trouble."},{"speaker":"Chris","time":"00:18:54-0","content":"Yeah, but you know I ain't never had that problem. I thank God for that though."},{"speaker":"Marcus","time":"00:19:01-4","content":"Yeah sure. How would you describe that person that came here, the 24, 25 year old?"},{"speaker":"Chris","time":"00:19:05-8","content":"All right. I was hard-headed, didn't listen to nobody then, when I first came up here. Didn't want no job, just stay in the field and do this and all that stuff especially when dudes would try to bully people that would tick me off. I'm more helpful now to people, you know like dudes in wheelchairs. I get along with everybody now. At first I wasn't worried about no dudes in wheelchairs, just overlooked everybody. Now I do that now, I'm more considerate."},{"speaker":"Marcus","time":"00:19:57-6","content":"Yeah, what's your typical day like here? What's your routine, what's your job, what do you do?"},{"speaker":"Chris","time":"00:20:04-8","content":"I work at the canteen warehouse. When I get off from there, I go to the gym, workout. Go to church. Come back to the dorm, read my Bible and go to bed."},{"speaker":"Marcus","time":"00:20:20-1","content":"Okay, that's every day."},{"speaker":"Chris","time":"00:20:22-0","content":"Yeah, don't sit there and play with my football no more. They killed all that."},{"speaker":"Marcus","time":"00:20:27-5","content":"Yeah why did they do away with that?"},{"speaker":"Chris","time":"00:20:30-3","content":"I don't know why, they just started playing flag football again, when flag stop, they're doing soccer now."},{"speaker":"Marcus","time":"00:20:40-7","content":"You like that job?"},{"speaker":"Chris","time":"00:20:42-0","content":"Yeah, I've been there for 5 years now. I've been in the kitchen 18."},{"speaker":"Marcus","time":"00:20:42-0","content":"So well that's another job then."},{"speaker":"Chris","time":"00:20:51-6","content":"No that's the first job I had. Kitchen, I've been there 18 years."},{"speaker":"Marcus","time":"00:20:55-5","content":"Do you like the kitchen job more than the canteen job?"},{"speaker":"Chris","time":"00:20:58-0","content":"At first I liked the kitchen where I could get my eat and all that. But then the warden asked me, did I want to go to the canteen warehouse. I said, I'll try it out, and I've been there ever since. They said they ain't going to get rid of me till I go home."},{"speaker":"Marcus","time":"00:21:21-2","content":"So they like you over there. So just a minute ago you said you just came in, you're angry, you didn't really listen to anybody or didn't care about anybody. So I mean 20 odd years, that's a long time. What explains the change?"},{"speaker":"Chris","time":"00:21:46-0","content":"2001."},{"speaker":"Marcus","time":"00:21:47-7","content":"Tell me about that."},{"speaker":"Chris","time":"00:21:48-8","content":"My mama died. I said you know, living for the world, doing it my way, everything looked like it was going wrong, every time I tried to do stuff my way, everything goes wrong. Then I said well, mama always used tell me, trust in God. And then I said, I still didn't want to trust, you heard me. Then went to the funeral coming back, went to church, I said yeah this it here, I've been there ever since."},{"speaker":"Marcus","time":"00:22:23-7","content":"So do you think you've gone through some kind of a spiritual awakening of sorts?"},{"speaker":"Chris","time":"00:22:29-5","content":"I'm just giving what she said a try."},{"speaker":"Chris","time":"00:22:29-5","content":""},{"speaker":"Marcus","time":"00:22:38-7","content":"Okay I like that, that's different, so you just want to honor your mother."},{"speaker":"Chris","time":"00:22:42-6","content":"Yeah, try her way, because every time I tried my way then you're going to fail."},{"speaker":"Marcus","time":"00:22:43-2","content":"Yeah. Do you remember your last interaction with your mom?"},{"speaker":"Chris","time":"00:22:53-9","content":"Yeah."},{"speaker":"Marcus","time":"00:22:55-6","content":"Tell me about that."},{"speaker":"Chris","time":"00:22:58-2","content":"When I got locked up and the police came to the house."},{"speaker":"Marcus","time":"00:23:01-4","content":"Okay. But did she visit you up here?"},{"speaker":"Chris","time":"00:23:06-9","content":"Yeah."},{"speaker":"Marcus","time":"00:23:08-9","content":"Do you remember your last visit with her?"},{"speaker":"Chris","time":"00:23:12-3","content":"Yeah, one thing she said, \"Look I ain't going to be here long.\" I said, \"What you talking about.\" I said, \"No I want to leave you first. I said, \"You going to bury me.\" She said, \"Look no I got to go.\" I said, \"Man are you serious? She said, \"Yeah.\" I said damn. She said, \"Look after them girls.\" I said, \"All right.\""},{"speaker":"Marcus","time":"00:23:33-0","content":"Was she sick?"},{"speaker":"Chris","time":"00:23:37-3","content":"Yeah she was sick but she didn't want to tell me. They always keep stuff. She knew she had a bad heart."},{"speaker":"Marcus","time":"00:23:42-6","content":"I see."},{"speaker":"Chris","time":"00:23:45-5","content":"Because she didn't want to see me worried up here."},{"speaker":"Marcus","time":"00:23:50-1","content":"Of course, because she must've been young."},{"speaker":"Chris","time":"00:23:55-9","content":"She died when she was around 56."},{"speaker":"Marcus","time":"00:23:59-2","content":"Yeah that's very young. So can you tell me a little bit about some of the organizations, some of the clubs, or any of the trades or GED? Like what have you been doing- the reason I ask you this is that very often when you go before a parole or pardon board they want to see what you've done, what does your list look like?"},{"speaker":"Chris","time":"00:24:21-5","content":"Okay, I did 100 Hours, substance abuse, all the kitchen, I've been in the kitchen I know everything about the kitchen. I go to Full Gospel. Chase the God and Christ. I do the funnel cake mix for the rodeo for Brother's Keeper, that's my mix there, but I do that every rodeo. All that stuff, you know like the canteen. I learnt a lot at the canteen, outdated stuff, and rearranged stuff. All the new stuff in the inventory I learnt a lot."},{"speaker":"Marcus","time":"00:25:16-5","content":"Sure, have you gotten any certificates, trades? Culinary arts?"},{"speaker":"Chris","time":"00:25:18-6","content":"I got certificates in churches, you know 100 hours, substance abuse all of that. Driver's license, driving the trucks too."},{"speaker":"Marcus","time":"00:25:32-0","content":"Okay, you got, you drive trucks?"},{"speaker":"Chris","time":"00:25:34-6","content":"Yeah for the canteen."},{"speaker":"Marcus","time":"00:25:30-4","content":"Okay got it. Before that, before you got your driver's license to drive trucks here. What was the last car you drove on the streets? Was it the 89?"},{"speaker":"Chris","time":"00:25:47-3","content":"Yeah blazer."},{"speaker":"Marcus","time":"00:25:53-7","content":"So let me ask you this, after all these years and all the changes that you've been through, when you look back on the crime that got you here to Angola, and the victims and just the whole circumstances, how do you feel about it now after all this time? Do you still think about I'm trying to get a sense of where is it in your mind?"},{"speaker":"Chris","time":"00:26:21-7","content":"I still think about it, I play it over and over. I think about which way I could've went, how to avoid this. Something you had to do, you know. And then you know I feel sorry for the victim because he ain't get the chance to live his life. Like that. Only thing I can do as I think about it is pray on it, I can't do nothing else."},{"speaker":"Marcus","time":"00:26:21-7","content":"Yeah I mean you can't undo it."},{"speaker":"Chris","time":"00:27:00-8","content":"Yeah, just try. That's all I be thinking about you know."},{"speaker":"Marcus","time":"00:27:03-1","content":"Sure. Can you tell me a little bit about the impact that that has had on your family? I mean I know that clearly there's loss on that side, but there's also loss on your side. You watched your mom have to deal with watching you go to prison, your siblings, your aunties and god mother."},{"speaker":"Chris","time":"00:27:43-1","content":"Yeah it's hard on them. Riding up here, my god mama, she old, she be still trying to come. I'll be like don't ride by yourself on that road. She still will come. But the affect it's had on my family, I believe it really affected my son, because the only thing he was just talking about was, dad I got to get you out. That made him go try to mess with drugs. I said, \"Don't worry about your dad, try and stay out for them little girls.\" I believe that took a big turn for him. And my sister too. It's hard on them too. Hard on me too."},{"speaker":"Marcus","time":"00:28:15-4","content":"Yeah, of course. Can you tell me, what is the hardest part for you about this whole thing?"},{"speaker":"Chris","time":"00:28:22-4","content":"The hardest part was waking up in this place every day is the hardest part."},{"speaker":"Marcus","time":"00:28:31-6","content":"Sounds like you didn't get involved with a whole bunch of fighting and violence and stuff when you got here, that's not been the problem."},{"speaker":"Chris","time":"00:28:43-4","content":"Yeah see I been learned from all that. That's what got me in here. Following the wrong things, telling me, oh we will just do this. I always try to hang around positive people. Look man we're going to church tonight. We're going to do this, we're going to do this. I'm not with nobody that's like look us going to smoke some mojo. Come one, none of that."},{"speaker":"Marcus","time":"00:29:09-3","content":"Yeah that's I don't very much about mojo. But from everybody's description it doesn't sound like fun."},{"speaker":"Chris","time":"00:29:20-0","content":"People be going crazy right here. Flopping around, thinking they're fish and all of that. You think I want to do something like that, no."},{"speaker":"Marcus","time":"00:29:30-3","content":"There must be something in it otherwise people."},{"speaker":"Chris","time":"00:29:32-3","content":"I don't know what it is."},{"speaker":"Marcus","time":"00:29:38-1","content":"So 2001 was the changing thing for you with your mom. So if a parole board, I kind of asked you a little bit about this already- but a parole board wants to know, or a pardon board in this case. They want to know, okay why should we give you a second chance, I've heard them ask people this exact question. This is what you did, you didn't give these people a second chance. Why should we give you a second chance? What would you tell them?"},{"speaker":"Chris","time":"00:30:17-1","content":"You could look at my life story, see where I came from and what I am now. Look at the jobs I hold, in the kitchen for 18 years, and then 5 years at the warehouse. I know I could go out there and be a conductive citizen. Plus I ain't going to be in Scotlandville no more anyway, I'll be in Houma."},{"speaker":"Chris","time":"00:30:17-1","content":"I believe I can hold 2 jobs and try to be a better person, a better man because Life is to short now. I got grandchildren. I want to spend time with them. Barely see my son, because last time I saw him he was 7. He is 29 now. I want to be able to see him. To live a fruitful life."},{"speaker":"Marcus","time":"00:31:14-1","content":"What's in Houma?"},{"speaker":"Chris","time":"00:31:16-4","content":"My sister, the one next to me."},{"speaker":"Marcus","time":"00:31:21-9","content":"How much more time does your son have to serve?"},{"speaker":"Chris","time":"00:31:23-1","content":"He's got, 21."},{"speaker":"Marcus","time":"00:31:26-0","content":"He's got 21 years."},{"speaker":"Chris","time":"00:31:21-9","content":"No he's got 21 years. He did 8 so far."},{"speaker":"Marcus","time":"00:31:33-0","content":"Okay so another few more years."},{"speaker":"Chris","time":"00:31:35-0","content":"Yeah."},{"speaker":"Marcus","time":"00:31:31-9","content":"Is it his plan to come back to Louisiana? Is he in Louisiana?"},{"speaker":"Chris","time":"00:31:39-7","content":"Yeah he's in Port Lock."},{"speaker":"Marcus","time":"00:31:39-7","content":"Okay got it. Is his family in Houma as well?"},{"speaker":"Chris","time":"00:31:39-7","content":"No she stayed in Scotlandville."},{"speaker":"Marcus","time":"00:32:01-0","content":"Okay, I'm getting the sense from you that Angola has not been all bad for you, from everything you said."},{"speaker":"Chris","time":"00:32:01-9","content":"No, Angola taught me a lot."},{"speaker":"Marcus","time":"00:32:04-8","content":"Tell me a little bit about what's good about Angola."},{"speaker":"Chris","time":"00:32:05-7","content":"The people you know we got some bad apples. But what taught me really unity up here when we was playing Raider football, we won the championship. Everybody want to beat the Raiders, everybody was against them. But we always, what we won 9 chips, 9 crunch bowls."},{"speaker":"Chris","time":"00:32:05-7","content":"You know it just depends on what you want to do. If you want to hang out with this crowd, you can go with that crowd. You want to be a, what you call that Uncle Tom something, go that way. But they going to talk about you anyway. Because what I learned, okay you can have too many visits, they going to talk about you. You go to the store too many times they going to talk about you, same people. Okay if you don't talk to that person, the other person going to talk about you."},{"speaker":"Chris","time":"00:32:05-7","content":"They're going to talk about you no matter what you do, but nobody going to come to your face and talk to you about yourself. That's why I ain't never chose the bad side. I already did that already, that ain't got me nowhere. I'd rather be here than over there. See what I'm saying."},{"speaker":"Marcus","time":"00:33:36-4","content":"Yeah. Of the various things that you've done, turned your life around and just the man you've become, what are you most proud of?"},{"speaker":"Chris","time":"00:33:51-9","content":"What am I most proud of? That I can see myself now. At first I couldn't see it at 25, you know. I can see myself being with my grandchildren, trying to enjoy life now, like everybody else. Take a little vacation or something. Angola's taught me how to be a real man, be responsible."},{"speaker":"Chris","time":"00:33:51-9","content":"How to save your money don't spend it all up, how to take care of books and whatever. Angola's taught me a lot, I don't have nothing bad against it. Like a lot of people say oh Angola. Angola's ain't do yo anything, it's what you do at Angola."},{"speaker":"Marcus","time":"00:34:39-1","content":"So let me ask you this, I think you've spent a little bit of time thinking about this. So let's say you get released, you go up for a pardon hearing and are like yeah okay its time."},{"speaker":"Marcus","time":"00:34:39-1","content":"Let's say I don't know within the next 10 years. You go before a pardon hearing and they say yeah we're going to give you a parole date and you get paroled out. How do you imagine your future? What do you see yourself doing? I think you got Houma in there, you got something to do with cooking, and grandkids but specifically what do you think you'll end up doing? What are your goals for the future?"},{"speaker":"Chris","time":"00:35:16-3","content":"What I will end up doing? Try to save up enough money to try to get a house, a nice 3 bedroom or a 2 bedroom house. Before I die or whatever. Just try to enjoy life, that's all I want to do. Pay bills and be a productive citizen, that's all. I'll be straight with that."},{"speaker":"Marcus","time":"00:35:47-4","content":"Sure is there something else I should've asked you about? One of the things that I'm interested in in this project is exploring how people cope with life without parole. I haven't really talked to you about this. When you confront the idea that you could die here, and you see people get buried. Its not I know it's something you don't want to think about, but it is a readily. How do you cope with that, how do you make sense of that when you're being real about it?"},{"speaker":"Chris","time":"00:36:26-9","content":"Yeah but just like I said, I seen a lot of people die up here, some friends I know, slept next to me at Point Lookout. I know dudes who I have known for 15 years there at Point Lookout, but I look at life like this, when your number comes, there's nothing you can do about it."},{"speaker":"Chris","time":"00:36:26-9","content":"I just try to maintain focus on that, because I know life is short. Some of them be wishing, I know a lot of them wish they could've seen this day here. A lot of them don't even get the chance that all these people going home. Angola- when I come here, people wasn't going home, now at least they got a little hope now. That's a good thing."},{"speaker":"Marcus","time":"00:37:27-5","content":"Yeah, it is."},{"speaker":"Chris","time":"00:37:33-6","content":"It is. It's a wakeup call, but I see. I appreciate Angola, I ain't going to lie. I tell everybody that. Angola saved me."},{"speaker":"Marcus","time":"00:37:46-3","content":"Yeah no I understand that. And obviously everybody wants to get out, but it sounds to me that you're am I right in assuming, what I'm getting from you is well, I'm here I've got to make the best of it, I can't control everything."},{"speaker":"Chris","time":"00:38:12-9","content":"You can't. You know, I got a nice little job you know."},{"speaker":"Marcus","time":"00:38:18-9","content":"Have you created a family here?"},{"speaker":"Chris","time":"00:38:21-8","content":"Yeah. Are you talking about social, yeah."},{"speaker":"Marcus","time":"00:38:26-1","content":"I mean like you know because you don't have your family outside, but you create almost your closest friends and family."},{"speaker":"Chris","time":"00:38:33-0","content":"Yeah I got some dudes in the dorm with me. At work that's a nice atmosphere, that keep me off the wall. Because I work outside by the gate, by the rodeo grounds, there's a piece of land right there."},{"speaker":"Marcus","time":"00:38:59-8","content":"All right, well I've really enjoyed talking to you. I appreciate you waiting all this time and being part of the project."},{"speaker":"Chris","time":"00:39:14-7","content":"Ain't no worries about that."}]}