{"name":"","transcript":[{"content":"Chris Phillips REDACTIONS FINAL"},{"speaker":"Chris","time":"00:00:00-0","content":"My name is Chris Phillips, I was convicted of 2nd degree murder in Baton Rouge, Louisiana. Now served 26 years."},{"speaker":"Marcus","time":"00:00:09-8","content":"How old were you at the time?"},{"speaker":"Chris","time":"00:00:11-9","content":"I was 18 at the time."},{"speaker":"Marcus","time":"00:00:13-8","content":"Okay. So I'd like to learn a little bit more about you starting with your childhood. So could you tell me a little bit about the folks who raised you?"},{"speaker":"Chris","time":"00:00:22-8","content":"I was raised by my auntie, and 2 other brothers that was there with us. Because my mom had too many kids, and she couldn't afford to take care of all of us. So 3 of us lived with my auntie and her husband."},{"speaker":"Marcus","time":"00:00:41-0","content":"This is your auntie on your mother's side?"},{"speaker":"Chris","time":"00:00:43-9","content":"Yes sir."},{"speaker":"Marcus","time":"00:00:45-3","content":"What's her name?"},{"speaker":"Chris","time":"00:00:45-9","content":"Cinderella Danbor yes sir."},{"speaker":"Marcus","time":"00:00:48-3","content":"How was that? How was that home?"},{"speaker":"Chris","time":"00:00:51-8","content":"It was good. It was good. She was big on schooling and stuff like that. She worked to support us."},{"speaker":"Marcus","time":"00:01:10-3","content":"Okay, was it a safe place?"},{"speaker":"Chris","time":"00:01:13-6","content":"It was a safe place, at times it became dysfunctional. Between my aunt and my uncle, they fought a lot. Alcohol played a role in it, because he drunk a lot."},{"speaker":"Marcus","time":"00:01:27-1","content":"Sure. And would those fights become physical?"},{"speaker":"Chris","time":"00:01:30-4","content":"Yes sir they would become physical. Sometimes it would result in she would leave, she would take me with her. Came a point in time where 2 of my brothers, they left. And actually one of my brothers ended up shooting my auntie on accident."},{"speaker":"Marcus","time":"00:01:48-9","content":"In the context of one of these fights?"},{"speaker":"Chris","time":"00:01:51-7","content":"No sir, in a different situation but the same house."},{"speaker":"Marcus","time":"00:01:57-5","content":"That was by accident you said?"},{"speaker":"Chris","time":"00:01:59-5","content":"Yes sir it was by accident."},{"speaker":"Marcus","time":"00:02:04-3","content":"I'm assuming your auntie survived?"},{"speaker":"Chris","time":"00:02:05-7","content":"She survived yes sir. She was shot in the arm."},{"speaker":"Marcus","time":"00:02:09-4","content":"Now did some of that fighting trickle down to the kids, to you and your brothers?"},{"speaker":"Chris","time":"00:02:13-4","content":"Yeah. It trickled down. I think just growing up in that setting like that, it's going to affect you mentally, emotionally, having to go through that on a weekly basis. It was constantly."},{"speaker":"Marcus","time":"00:02:34-3","content":"I see, sure. And where are you in the birth order of your brothers?"},{"speaker":"Chris","time":"00:02:38-9","content":"I'm third."},{"speaker":"Marcus","time":"00:02:42-7","content":"Oh so you're the baby in that."},{"speaker":"Chris","time":"00:02:43-7","content":"12 brothers and 1 sister."},{"speaker":"Marcus","time":"00:02:46-5","content":"My goodness. So tell me about your relationships with your siblings now."},{"speaker":"Chris","time":"00:02:50-9","content":"My relationship with my siblings now, not too good. Half of my brothers are deceased right now. My sister is incarcerated. My mom's passed, my aunt's passed, my dad's passed, so."},{"speaker":"Marcus","time":"00:03:11-2","content":"Okay. Now your siblings, your brothers who passed away, what was the context of that. Because they're still young."},{"speaker":"Chris","time":"00:03:21-6","content":"They was actually, they was murdered. 2 was murdered, 1 lost his life over overdose, and another died to HIV."},{"speaker":"Marcus","time":"00:03:34-3","content":"Okay. That's a lot of tragedy to absorb in one family. Where you here, incarcerated when a lot of that happened?"},{"speaker":"Chris","time":"00:03:45-3","content":"Yes sir, most all of it."},{"speaker":"Marcus","time":"00:03:49-6","content":"Which I imagine is a mixed bag, because I expect it'd be very difficult to deal with emotional toll in prison, but yet at the same time you're kind of protected from some of it. Is that correct?"},{"speaker":"Chris","time":"00:04:04-6","content":"Yes sir. It was very emotional to deal with all that under the circumstances of this."},{"speaker":"Marcus","time":"00:04:12-3","content":"Sure, under any circumstances right. But particularly here. So, I'm going to assume that while you had a roof over your head, you kind of felt like you had to make it on your own in terms of having a whole bunch of adults taking interest in you, and care for you, and make sure everything's okay. Is that correct?"},{"speaker":"Chris","time":"00:04:36-0","content":"Yes sir. It got to a point where my aunt, she loved us. She did everything she could for us. It just, going through the experience in the fights, the violence, the alcohol and all these types of things here, versus the pressure of friends, and the community and the neighborhood, school and all that. I guess a lot of that played a role in me wanting to branch out on my own. Because my aunt was really strict, she was in-house before the streetlights come on type of lady, rules. She was very strict and all that."},{"speaker":"Marcus","time":"00:05:25-7","content":"And did you all follow those rules while you were in that house?"},{"speaker":"Chris","time":"00:05:29-2","content":"For a while yeah I did but gradually I would break a rule here and there and that didn't settle too good with her. So the more I wanted to break rules, the more she wouldn't tolerate it. And it eventually led me to going to live with my mother. And that was a big turning point in my life."},{"speaker":"Marcus","time":"00:05:50-8","content":"Okay, and how old were you then?"},{"speaker":"Chris","time":"00:05:53-1","content":"Probably about 14."},{"speaker":"Marcus","time":"00:05:55-0","content":"Okay so tell me about those years."},{"speaker":"Chris","time":"00:05:58-2","content":"Well, when I went to go live with my mother, my mother was living with my stepdad, my stepdad had 6 kids of his own. She had her kids, they had been together for a long period of time. This was a very dysfunctional family, very chaotic. Lots of alcohol, lots of illegal activities, things like that."},{"speaker":"Chris","time":"00:05:58-2","content":"So, I guess for me, the problem was a fit because I was breaking the rules and I wanted to do what I wanted to do. So I kind of like, I fell right in, because now it's open, I can do what I want to do. And you know I'm young, I really don't know what I'm doing, so like that."},{"speaker":"Marcus","time":"00:06:50-1","content":"So tell me a little bit about school, how was school for you through all this?"},{"speaker":"Chris","time":"00:06:54-8","content":"School. I go back to my aunt before I left and went to live with my mom. She was heavy on school. And I actually was an A student in school, because she took the time out to help me with homework and make sure that I was straight in school. And I actually liked the school. When I got with my mom, that's when I kind of like shifted, grades went down, got suspended out of school."},{"speaker":"Marcus","time":"00:07:29-9","content":"What were you getting suspended for?"},{"speaker":"Chris","time":"00:07:32-6","content":"I got suspended for fighting."},{"speaker":"Marcus","time":"00:07:34-7","content":"Sure. All right so until you caught this charge, from the age of 14, you're living under your mother's roof, is that correct?"},{"speaker":"Chris","time":"00:07:42-0","content":"Yes sir."},{"speaker":"Marcus","time":"00:07:44-6","content":"Can you describe this, I'd like to get a mental picture of your neighborhood. So if I'm standing at the front door with you when you're 17 or so, looking out into the neighborhood, can you tell me what I'd be seeing, hearing, smelling, what was?"},{"speaker":"Chris","time":"00:08:03-3","content":"You'd be seeing a bunch of people hanging out, getting drunk, selling drugs, smoking marijuana, chasing cars down, to selling drugs. That kind of activity. Fighting, a lot of profanity, those types of things that would be your."},{"speaker":"Marcus","time":"00:08:26-5","content":"Sounds pretty chaotic."},{"speaker":"Chris","time":"00:08:28-9","content":"Yeah very chaotic, very."},{"speaker":"Marcus","time":"00:08:35-3","content":"Did you stay in school?"},{"speaker":"Chris","time":"00:08:38-4","content":"No sir I didn't. After I got suspended, that was it. I never went back."},{"speaker":"Marcus","time":"00:08:41-2","content":"You were done, okay. And this is at 14?"},{"speaker":"Chris","time":"00:08:46-8","content":"I was done. Yes sir."},{"speaker":"Marcus","time":"00:08:49-6","content":"So then how do you end up supporting yourself? How are you spending your free time when you're not in school?"},{"speaker":"Chris","time":"00:08:54-9","content":"Then I was selling drugs."},{"speaker":"Marcus","time":"00:08:56-9","content":"Okay."},{"speaker":"Chris","time":"00:08:59-6","content":"I was selling drugs and that's how I supported myself."},{"speaker":"Marcus","time":"00:09:03-6","content":"Sure, and my understanding is once you start doing that, from everybody I talked to, it's getting a firearm as protection in that area is pretty much a given, right?"},{"speaker":"Chris","time":"00:09:19-4","content":"Yeah that's given. You're selling drugs, there's street life, street code and getting a firearm for protection, that's all part of the code of the streets."},{"speaker":"Marcus","time":"00:09:33-0","content":"Sure. Was that relatively easy for you to have access to?"},{"speaker":"Chris","time":"00:09:36-9","content":"That was easy for me. Because you're on the streets, selling drugs, doing all these illegal activities. So guns come easily."},{"speaker":"Marcus","time":"00:09:46-1","content":"Sure. What about a grandparent, was there a grandparents that you had a special relationship with?"},{"speaker":"Chris","time":"00:09:52-7","content":"I have a special relationship with my grandfather. He died on his 100th birthday."},{"speaker":"Marcus","time":"00:10:00-2","content":"My goodness."},{"speaker":"Chris","time":"00:10:02-2","content":"Yeah so 100 years old when he has passed away."},{"speaker":"Marcus","time":"00:09:59-5","content":"Did he visit you up here?"},{"speaker":"Chris","time":"00:10:02-7","content":"No he passed away when I was young."},{"speaker":"Marcus","time":"00:10:06-5","content":"When you were young."},{"speaker":"Chris","time":"00:10:08-3","content":"Both of my grandparents they passed away when I was young."},{"speaker":"Marcus","time":"00:10:12-7","content":"Okay. So who visits you up here?"},{"speaker":"Chris","time":"00:10:15-5","content":"Well, it used to be my auntie before she passed away. My auntie visited me for the last 15 years up until she passed away. She would always come and see me, always. I received one visit from my mom since I've been here. I've never received a visit from my dad, never received a visit from any of my brothers."},{"speaker":"Marcus","time":"00:10:41-3","content":"Okay. Did you say your mother is still living?"},{"speaker":"Chris","time":"00:10:41-8","content":"My mother passed away."},{"speaker":"Marcus","time":"00:10:42-9","content":"She passed away, okay. Do you remember your last interaction with your auntie?"},{"speaker":"Chris","time":"00:10:49-0","content":"Yeah. My last interaction with her, she just had surgery on her eyes, and I called her and talked to her."},{"speaker":"Marcus","time":"00:11:01-4","content":"And how long was that into this, 15 years?"},{"speaker":"Chris","time":"00:11:03-6","content":"Yeah, in that area."},{"speaker":"Marcus","time":"00:11:14-1","content":"What about, you described some of the violence in the home, with dysfunctional alcohol and so forth. Would you say there was any sexual abuse in the home?"},{"speaker":"Chris","time":"00:11:24-7","content":"No it wasn't no sexual abuse, more mental abuse and emotional abuse."},{"speaker":"Marcus","time":"00:11:33-8","content":"All right, sure. And then at 14, what would your highest grade of school be at that point?"},{"speaker":"Chris","time":"00:11:40-8","content":"At 14, my highest grade in school would probably be a D."},{"speaker":"Marcus","time":"00:11:52-0","content":"No, I actually mean the grade level like at 14 you'd be in what, 8th grade?"},{"speaker":"Chris","time":"00:11:53-0","content":"8th grade."},{"speaker":"Marcus","time":"00:11:54-1","content":"So you finished 8th grade?"},{"speaker":"Chris","time":"00:11:55-4","content":"No sir I didn't. When I dropped out, I left the 6th grade and that was it."},{"speaker":"Marcus","time":"00:12:00-8","content":"Okay so 6th grade. So can you tell me a little bit about other relationships with friends that you might have had?"},{"speaker":"Chris","time":"00:12:09-1","content":"Friends, few."},{"speaker":"Marcus","time":"00:12:13-7","content":"Did you have a close group of?"},{"speaker":"Chris","time":"00:12:15-8","content":"Yeah, back then? I had a close group of friends that I grew up with. Matter of fact, Tyrone Jackson, he just passed away in the hospital ward about 3 weeks ago. Me, and him was real close and his family we all grew up together in the same neighborhood. We kind of left the neighborhood together around the same time and we didn't see each other for some years."},{"speaker":"Chris","time":"00:12:15-8","content":"And we crossed paths with each other, unfortunately both of us was into the street life, you know selling drugs and stuff like that. We was real close man, we shared a real special relationship because we like took our first drank together, probably smoked out first cigarette together. You know all of those types moments like that."},{"speaker":"Marcus","time":"00:13:05-5","content":"Sure. And you're the same age I'm assuming."},{"speaker":"Chris","time":"00:13:08-9","content":"The same age."},{"speaker":"Marcus","time":"00:13:11-3","content":"Was he sick?"},{"speaker":"Chris","time":"00:13:13-6","content":"Yes sir he had liver problems, he had some kind of illness with his liver and that's what."},{"speaker":"Marcus","time":"00:13:18-7","content":"Did you two come to Angola at roughly the same time?"},{"speaker":"Chris","time":"00:13:21-5","content":"He came some years after me and we met here."},{"speaker":"Marcus","time":"00:13:28-4","content":"Sure, okay. What about girls? Any girlfriends stand out in your memory?"},{"speaker":"Chris","time":"00:13:34-2","content":"Yeah one particular girl, Melissa. Melissa was with me when I caught my charge. She was there when I caught this charge."},{"speaker":"Marcus","time":"00:13:50-3","content":"Okay, did you stay in touch with her?"},{"speaker":"Chris","time":"00:13:51-5","content":"Yeah off and on she contacted me throughout the years and recently over the last 2 years, we reconnected, and we communicate throughout the chaos."},{"speaker":"Marcus","time":"00:14:02-8","content":"Any children?"},{"speaker":"Chris","time":"00:14:04-5","content":"I have one daughter, Ashley."},{"speaker":"Marcus","time":"00:14:09-7","content":"Tell me about her."},{"speaker":"Chris","time":"00:14:10-7","content":"Ashley, Ashley's about 20, 22 now. Ashley's no not 22, Ashley is about 27, somewhere in there. I talked to her in 2001. Talked to her one time in 2001 when her mother passed. Her mother passed away in 2001, and I talked to her one time. I haven't had any contact with her since."},{"speaker":"Marcus","time":"00:14:44-9","content":"Okay. So let me ask you, when you look back because time creates all this perspective, and you've had time now to look back on your teen years and when you do, do you see that you had alternatives, or did you sort of feel like this was kind of inevitable? How do you kind of make sense of that now?"},{"speaker":"Chris","time":"00:15:10-5","content":"In the beginning, normally I reflect back on my life now in the beginning, I felt like there was no alternatives, it was just the situation I was in. And so there was times, there was moments in my life where things could have been different, I could've taken different directions."},{"speaker":"Chris","time":"00:15:10-5","content":"I was definitely afforded with opportunities. I had people that came into my life in different seasons that cared about me and wanted to see me succeed, and get my education, and take a change. But at the end of the day it all came to me."},{"speaker":"Marcus","time":"00:16:05-2","content":"Sure. Yeah, I say that because some of us have more privilege than others coming up and some of us have tons of opportunities and squandered them all, and for others what else do you expect in that situation? And I think that's what I was trying to get at."},{"speaker":"Chris","time":"00:16:26-9","content":"Yeah in that situation, there's not a lot of opportunities when you're coming from a background like that. And that's the lifestyle that you're living because that's what you have, it is what it is."},{"speaker":"Marcus","time":"00:16:43-9","content":"Yeah, sure."},{"speaker":"Chris","time":"00:16:45-6","content":"You know, your mom, your dad, they can only give you so much. Because they can give you what they have. Your brothers, your family, your friends, they can only, important to you what you have under the circumstances. So you know, it's not much there to work with, so."},{"speaker":"Marcus","time":"00:17:09-7","content":"Yeah. Do you remember the first time you got arrested?"},{"speaker":"Chris","time":"00:17:13-5","content":"Yeah, first time I got arrested yeah."},{"speaker":"Marcus","time":"00:17:18-0","content":"Tell me about it."},{"speaker":"Chris","time":"00:17:19-5","content":"First time I got arrested was for armed robbery. And I'll never forget this because I was young. And the store, I robbed a store. I didn't rob the store. I wasn't going to hurt anybody, I was simply robbing the store to get the money to go buy drugs and alcohol and stuff."},{"speaker":"Chris","time":"00:17:19-5","content":"It's funny because the store, and the lady that owns the store, she knows me."},{"speaker":"Chris","time":"00:17:19-5","content":"She knows my mom because like my mom would get credit from this store all the time when she didn't have any money or anything, and she needed stuff so she would go and this lady would give us credit until she got her check, and you know she would pay her, stuff like that. That was my first time ever getting arrested."},{"speaker":"Marcus","time":"00:18:06-3","content":"Okay, and how old were you then?"},{"speaker":"Chris","time":"00:18:08-6","content":"I probably was about 15."},{"speaker":"Marcus","time":"00:18:14-4","content":"Okay and did you get into the juvenile system after that?"},{"speaker":"Chris","time":"00:18:17-4","content":"Yeah I got into the juvenile system for a little while, and the lady was very lovely and forgiving lady. She didn't press any charges, so I got out of that."},{"speaker":"Marcus","time":"00:18:29-3","content":"All right. Did you have any other significant brushes with the law before this charge?"},{"speaker":"Chris","time":"00:18:36-2","content":"Yes, I had several brushes with the law from being arrested for distribution of cocaine to robbery to car theft. I had several run-ins with the law."},{"speaker":"Marcus","time":"00:18:52-2","content":"So, I guess I'm asking you about it because it seems that you were kind of going down a path that just doesn't really have too many good endings. As opposed to a one off situation. So, maybe you could just very briefly summarize the charge that got you here."},{"speaker":"Chris","time":"00:19:20-7","content":"My charge?"},{"speaker":"Marcus","time":"00:19:21-9","content":"Yeah."},{"speaker":"Chris","time":"00:19:22-8","content":"The charge that got me here, a second degree murder charge, actually I caught this charge in Baton Rouge. And I caught this charge in the midst of some drug activities. Man it's hard to summarize this, when you think about it, because a life has been taken. And I take responsibility for that."},{"speaker":"Marcus","time":"00:19:55-9","content":"I understand. Were alcohol and drugs a major part of your lifestyle at the time?"},{"speaker":"Chris","time":"00:20:01-9","content":"Yes, a majority of all my life up until my incarceration."},{"speaker":"Marcus","time":"00:20:07-4","content":"Okay. And what were your drugs of choice?"},{"speaker":"Chris","time":"00:20:10-4","content":"Marijuana, cocaine, yeah."},{"speaker":"Marcus","time":"00:20:16-3","content":"Okay and alcohol."},{"speaker":"Chris","time":"00:20:17-4","content":"And alcohol yes."},{"speaker":"Marcus","time":"00:20:19-3","content":"Sure. So let me ask you this, let's say that particular incident didn't happen. Like there was no argument over anything and you all went home and went to bed. Can you, imagine a little bit, what would've happened in the next few months, years after that?"},{"speaker":"Chris","time":"00:20:40-2","content":"Of my life?"},{"speaker":"Marcus","time":"00:20:41-7","content":"Yeah."},{"speaker":"Chris","time":"00:20:43-1","content":"Dead, I would be dead."},{"speaker":"Marcus","time":"00:20:46-0","content":"Okay so Angola in some ways or getting this charge I should say in a weird way, saved your life."},{"speaker":"Chris","time":"00:20:53-1","content":"I look at it like this, if you don't mind me saying this I like to look at it like this. God allowed me to go through what I've gone through because he had his hand on me all along. And I like to refer to him as the God of set ups. Because I was chosen."},{"speaker":"Marcus","time":"00:21:17-3","content":"He set you up for this you mean?"},{"speaker":"Chris","time":"00:21:19-4","content":"I was chosen for his purpose and calling. So he had to allow me to go through some things, I knew before I caught my charge that I should've been dead. I was in several situations to where my life could have easily have been taken. And I understand that now as I reflect. I look back over my life, I understand that it was by the grace of God that I even made it through those situations so."},{"speaker":"Marcus","time":"00:21:48-5","content":"Sure. So I want to switch gears little bit and talk about, I assume you did a little time in the parish, in Baton Rouge. And then coming here and I want to talk about some of the changes you've gone through since you've been here."},{"speaker":"Marcus","time":"00:21:48-5","content":"But before I do, is there something else I should know about you coming up that's really important about shaping who you are now that we didn't get a chance to talk about?"},{"speaker":"Chris","time":"00:22:13-5","content":"Well, we pretty much covered everything. I was a very violent person, young, selfish, I was a follower I can put it that way."},{"speaker":"Marcus","time":"00:22:37-3","content":"Okay, sure. So let's get to that bus ride down here, do you remember that? Tell me what's going on in your head once you're coming down the road."},{"speaker":"Chris","time":"00:22:54-4","content":"In my head I heard all the stories about Angola, about the penitentiary. And so in my mind I'm thinking \"wow I'm going to the penitentiary,\" and in my mind I'm thinking about survival. Because I'm young, and I'd heard all these stories about this place, and so I'm thinking about survival, nothing else."},{"speaker":"Marcus","time":"00:23:20-0","content":"Yeah. And I imagine just being scared."},{"speaker":"Chris","time":"00:23:26-3","content":"Scared, yeah definitely."},{"speaker":"Marcus","time":"00:23:29-2","content":"How were your first few months here?"},{"speaker":"Chris","time":"00:23:31-9","content":"My first few months here was very chaotic. I got into a lot of trouble, got a lot of write ups in my first few months here."},{"speaker":"Marcus","time":"00:23:43-7","content":"Over fights?"},{"speaker":"Chris","time":"00:23:46-5","content":"Fights, disobedience, didn't want to work, didn't want to follow the rules. When you come from the streets, and you come into the parish, you kind of got the same mindset. And so in the parish, you know, it's kind of the same thing. It's a violent place, its survival there."},{"speaker":"Chris","time":"00:23:46-5","content":"So a lot of fighting going on and stuff like that. You got people fighting for reputations, and all this type of stuff here. So I'm in the middle of one of those situations and so it just carried on to here. And so for my first few years here, that's what it was. It was about my reputation and that was it."},{"speaker":"Marcus","time":"00:24:33-9","content":"Carrying over from the parish."},{"speaker":"Chris","time":"00:24:35-9","content":"From the parish to here, in those first 5 years because I'm still young, I'm in the system now so."},{"speaker":"Marcus","time":"00:24:46-5","content":"So tell me a little bit. You described yourself as selfish, as arrogant, violent, as a follower. What are you like now?"},{"speaker":"Chris","time":"00:25:00-3","content":"Oh the opposite of all that. I'm a leader now in our community now. I have a group of guys that I mentor. I'm a minister at my church. I preach the Gospel of Christ. I work with the re-entry program. I'm involved with so much. I'm a NOBTS junior right now, and I just, I'm trying to help these reentry guys, these younger guys."},{"speaker":"Chris","time":"00:25:00-3","content":"Go for guys that I spend a lot of time with, mentoring. It wasn't by choice, I didn't want to deal with that, you know because I'm dealing with school and ministry. But you know God has way of doing things. So he allowed me to help these guys by sending me into their life."},{"speaker":"Marcus","time":"00:26:06-9","content":"Yeah, and I want to get into some of that. So first of all, that means you got your GED that must've happened."},{"speaker":"Chris","time":"00:26:12-1","content":"Yes sir I got my GED."},{"speaker":"Marcus","time":"00:26:13-7","content":"How long into your incarceration did some of these changes occur? You said the first 5 years were rough, when does it start to turn?"},{"speaker":"Chris","time":"00:26:22-2","content":"The first 10 years was rough. Partially because I still had the mindset of establishing myself in prison and building that reputation based on what I heard and what I came into and what I saw when I got here. And so being a follower, when you get here and you're under all that pressure, you're looking at all these guys with reputations that have been here a long time. So you want to follow their footsteps because that's the reputation you want because that's the lifestyle you come from."},{"speaker":"Chris","time":"00:26:22-2","content":"So those first 10 years, I spent in prison was just going in a circle doing the same things. Fighting, not wanting to follow rules and things like that. And so after a period of time, after a period of time it's hard to describe in words the process that starts to take place in the mind and in the heart, especially me."},{"speaker":"Chris","time":"00:26:22-2","content":"You know, you start getting tired of going through the, you know. You start thinking that there's more, it could be better, there's more, I don't have to live my life like this. Those are some of the things that I experienced in my transformation process, so."},{"speaker":"Marcus","time":"00:27:46-8","content":"Yeah. Was there you know some people can point to a very specific thing. And for others, it sounds like this may be for you, it's more or less of a gradual kind of getting tired, aging out, trying to do something different. But for others it's like a mentor or an idea or an experience of some kind. Was there anything specific in your change?"},{"speaker":"Chris","time":"00:28:07-5","content":"Two things. Pastor Steve Steward, he's at Hunts right now. He just got his life sentence community numbers. He was a mentor in my life for a long time. And what Steve did with me was, Steve never no matter what I was doing or involved with, he never condemned me for it, he never judged me for it. He was just, just this loving guy with just constantly telling me about decision making, and consequences to actions."},{"speaker":"Chris","time":"00:28:07-5","content":"So my life really began to change when I went through an experience with a guy it almost turned violent, a weapon was involved, and it almost turned violent. And so one evening I got on my knees and I prayed. And I asked God to help me out, I was always a believer, but I was just, by then I didn't really believe like I thought I believed. So I asked god to help me out, as I was praying, my Bible is on my bed, and my Bible opens up."},{"speaker":"Chris","time":"00:28:07-5","content":"And so the whole experience is, read the passage. And when I look and the Bible is opened, it's on Isaiah 40:31and I'm looking at the passage, I don't have a clue of what this is saying or what its meaning. I really don't want to read it because I'm really angry, and I really want to retaliate against this guy, because I felt like this guy disrespected me."},{"speaker":"Chris","time":"00:28:07-5","content":"I went throughout that day angry but that passage, Isaiah 40:31 was in my mind. And so we went to church that evening, and so it's amazing how god works because there's this guy, he have a skull can full of scriptures, and he walks around and he passes them out to everybody. And so I'm sitting in church, and I'm angry because I'm thinking about the situation, and so he walks up and he wants to give me a scripture."},{"speaker":"Chris","time":"00:28:07-5","content":"And I was rude to him and I told him, go away, and the whole experience is called back. And I don't know what made me do it, I immediately called the guy back, and I apologized. And the guy opened the skull can, reached in the skull can, and then gave me a scripture. And at the time I unfolded this scripture, my Bible was open to Isaiah 40:31, and it's the same scripture that he handed me out of the skull can. I said Lord what are you trying to tell me."},{"speaker":"Chris","time":"00:28:07-5","content":"And so from that point on I was sold out to God, and my process began from that point."},{"speaker":"Marcus","time":"00:31:40-3","content":"Can you summarize the scripture?"},{"speaker":"Chris","time":"00:31:42-5","content":"But those who hope in the Lord will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint."},{"speaker":"Marcus","time":"00:31:52-2","content":"Wow."},{"speaker":"Chris","time":"00:31:55-0","content":"Yeah."},{"speaker":"Marcus","time":"00:31:58-2","content":"When you now minister to the young guys who are coming in and you work with the reentry folks as a mentor, surely you see your old self in them. And you're aware of the fact that other mentors tried to reach you when you're 20, and you just didn't have time for them. How do you try to reach out to them, knowing that they may not be very receptive to what you have to say?"},{"speaker":"Chris","time":"00:32:34-2","content":"I'll say this in a twofold way. The first one, the way I reach these guys is through the power of the Holy Spirit by God. Because I'm always connected to God. And my connection with him, allows the Holy Spirit to reach these guys. The guys that I have in my group, I didn't ask for these guys, I really didn't. They just God just set it that way. It just came."},{"speaker":"Chris","time":"00:32:34-2","content":"And as a result I was able to help these guys break addictions, I was able to stir these guys in directions in good directions versus what they were doing. And just I thank God for everything He is doing, I give him all the glory for everything."},{"speaker":"Marcus","time":"00:33:32-0","content":"Okay. And some of them, they're just going to have to learn by experience."},{"speaker":"Chris","time":"00:33:40-4","content":"Some of the, are just going to have to learn by experience. I learned."},{"speaker":"Marcus","time":"00:33:44-9","content":"You were one."},{"speaker":"Chris","time":"00:33:46-3","content":"Yeah so you know some just going to have to learn. Because one thing about doing time or growing up the neighborhood, an area like that is that, when your minds made up, sometimes the only thing that's going to stop you is a hard fall. There's nothing nobody can tell you, there's nothing anybody can do. You just got to experience it, you just got to go through it."},{"speaker":"Marcus","time":"00:34:16-6","content":"You had mentioned, in addition to mentoring and ministering, being in the theological seminary. These are all fairly significant accomplishments for somebody with a 6th grade education coming into Angola."},{"speaker":"Chris","time":"00:34:30-0","content":"Can I tell you the story behind that?"},{"speaker":"Marcus","time":"00:34:32-1","content":"Sure."},{"speaker":"Chris","time":"00:34:34-9","content":"Wow, okay. In my turning point, here at Angola, I got out of the cell blocks. This probably was in 2000, probably mid, early 2000s. I got out of the cell block, I came down the walk, and I got this bad reputation, especially with security. And a lot of inmates and some of them down the walk. But my mindset is that I'm going to fly straight, I'm going to do good, I'm going to get me a job. I'm not going back to the blocks, I'm going to get my GED, and I'm going to accomplish some things."},{"speaker":"Chris","time":"00:34:34-9","content":"So, I'm in the dorm and I like to do legal work, I love doing legal work. So I'm next to a guy that's an inmate counselor, and he says, \"Man write a letter to the legal programs and ask to be an inmate counselor.\" I said, \"Man they not going to give me a job with a record like this.\" Keep this in mind, at the time, I didn't have my GED at the time. Keep this in mind because it's important to the story."},{"speaker":"Chris","time":"00:34:34-9","content":"So, I did it. I wrote the letter and I sent it in, and so about a week later, I come in the dormitories one evening. And so the legal program department calls to the dormitory and tell an office to call into the telephone because they have a meeting scheduled for me, and several other guys. So I definitely don't want to go to the telephone in the dormitory because that's a no no in prison, when you use the telephone in the dormitory, officers' phone. They consider you a snitch, that's the prison mentality type thing."},{"speaker":"Chris","time":"00:34:34-9","content":"And so I said, \"I'm not coming to that telephone, who's on the other line, so relay the message.\" They said, \"It's the legal program.\" So I said okay, I got the phone. So they say, \"You know you have a legal call out in the morning and so forth.\" So I went to the call out and this is what Miss Trish Foster said, and I'll never forget this. She said, \"If it was left up to me, you wouldn't be sitting in this room right now, but it's not my call. Warden DuPont, he signed off on you. He said I'm the youngest guy in the law library, give him a chance.\""},{"speaker":"Chris","time":"00:34:34-9","content":"So she said, \"I'll give you a chance if you can tell me somebody in the law library that will take you on their team.\" And the first person that came to my mind, I said Kurt Hall, because Kurt was always a mentor to me. So she calls Curt, Curt comes down. She said, \"You want to take him?\" Kurt said, \"Yeah.\" She said, \"You're going to be responsible for him.\" And Curt said, \"Yeah I'm going to be responsible for him.\""},{"speaker":"Chris","time":"00:34:34-9","content":"And so as we come up the wall Kurt says, \"Man I'll put everything on the line for you. I said, \"Man listen, I'm not going to let you down, I got you.\" So got into the law library. I don't have a GED but I'm starting to walk in my process, because this is something that I'm passionate about, and that I love doing."},{"speaker":"Chris","time":"00:34:34-9","content":"And so when I start the line, all the stuff, I worked with AC, I worked with Kelvin. I work with all these guys. So I'm learning all this stuff and I'm doing real good, I got my trustee status. I'm doing real good, I'm staying out of trouble, and I get shipped to Hunts. Out of the clear blue, and I get to Hunts, I get in the law library at Hunts. So Kelvin at this time had went home, and he's communicating with me at Hunts. I'm at Hunts in the law library, I'm doing good, attending the seminars and stuff like that."},{"speaker":"Chris","time":"00:34:34-9","content":"And so I got put out the law library at Hunts and I end up at the regular library. And so, I come back to Angola from Hunts, and I come back into the Law library system and I'm doing good. And in 2012, I get shipped again, but this time, I go back to Hunts a second time, but I don't go in the law library. So I'm saying to myself, Lord I didn't like that place when I first went and didn't want to come back here."},{"speaker":"Chris","time":"00:34:34-9","content":"So I'm staying to myself Lord why did you send me back here again, I don't have my GED. So now I get on the pastoral care, Steve Stewart and he is pastoring me, and he is mentoring me, and he's helping me grow and develop. And the Bible College come up, the intake for students come up. So he says man, you have to I want you to go to Bible College. One of the requirements if you have to have your GED."},{"speaker":"Chris","time":"00:34:34-9","content":"Now I don't have a GED at this time, so I'm saying, I won't go. I want to go, but I don't want to tell them I don't have GED neither. So I got in school and I got my GED and the process began. I started to help guys down there. I started ministering the Gospel of Christ, I got the interview, I got accepted into Bible College, I came back here. It's amazing that I came back here with favor with security. No beef, no fallout, no flat, no nothing. It's as if I never existed, my past never existed here. I'm doing good in school."},{"speaker":"Marcus","time":"00:40:53-7","content":"It's a new day."},{"speaker":"Chris","time":"00:40:55-4","content":"It's a new day and God just set it up that way. And he's just, you know…"},{"speaker":"Marcus","time":"00:41:03-1","content":"And Pastor Steve was instrumental in that."},{"speaker":"Chris","time":"00:41:05-9","content":"Very instrumental in that, very."},{"speaker":"Marcus","time":"00:41:10-1","content":"So, let me get into some slightly difficult territory. This is clearly a story of change that you are living. But let's go back to the victim for a second, okay. So with all of these situations, people will say, yeah that's great, he's turned his life around."},{"speaker":"Marcus","time":"00:41:10-1","content":"But what about, there's a victim who never had his chance to turn his life around. It's an unfair question in some ways; but when you think back on that event that has now sent you into something that is very good and its 26 years later. What are your thoughts about it now, after so many years?"},{"speaker":"Chris","time":"00:42:02-7","content":"Thoughts about the victims? I pray for the victims all the time. I never stop praying about them, I never stop thinking about them. I always think about them, and pray for them because I took a part of their life away."},{"speaker":"Marcus","time":"00:42:22-8","content":"What about the impact on your own family? Because people tend to focus on the victim's family, correctly. But then there's also this whole other family that gets affected when something like this happens."},{"speaker":"Chris","time":"00:42:43-1","content":"Yeah it's a twofold situation. A lot of people hurt, and a lot of people suffer. My family as well, phew. My auntie, she took this very hard. She really took it hard. She travelled the highway for many years coming up here to see me. And my mom, she was deeply affected by it as well."},{"speaker":"Marcus","time":"00:43:11-7","content":"Did they live long enough to see some of these changes you'd been making?"},{"speaker":"Chris","time":"00:43:19-9","content":"No, nobody lived to see these changes, so."},{"speaker":"Marcus","time":"00:43:30-0","content":"It's too bad. Here's another difficult question. As much as there is reason to be hopeful for reform and the expansion of parole eligibility, pardon process working. You also are confronted if you're going to be realistic, with the possibility that this might be it for you. And I'm interested in exploring how you cope with that."},{"speaker":"Chris","time":"00:44:13-4","content":"How I cope with it now. My mindset, I don't consider this as prison, this is not prison to me. This is a process, this is a ministering process that God has me in. I know I'm going to walk out of here, there's no ifs and buts about it. Because he showed me I'm going to walk out of here. So I know what he showed me. So I know it's going to happen, just the way he showed it to me, so I'm going to walk out of here."},{"speaker":"Chris","time":"00:44:13-4","content":"So I don't view this as prison. I view it as a ministry ground where I'm called to walk in my purpose. And my purpose is to help people."},{"speaker":"Marcus","time":"00:45:02-5","content":"Sure. And you know, this is a community where you are doing it. Do you mind sharing with me how he showed you? That you're going to get out."},{"speaker":"Chris","time":"00:45:16-4","content":"Okay, he showed me two things. The first thing he showed me was, he showed me my death. I got out, I was sitting in the car, at a red light. And a guy walked up to the car and shot me multiple times, dead. That was the first vision."},{"speaker":"Chris","time":"00:45:16-4","content":"The second one he showed me I walked out of here, I pull up in law firm in my vehicle, I got out, I had my briefcase, I was going to the door, I went in my office, and I started my daily routine. So I had the choice, I had to choose which one. He showed me these visions before I even had the transformation. So when I chose the life that I want to become a reality, then it became clear to me my ending."},{"speaker":"Marcus","time":"00:46:23-3","content":"Sure. Of all the things you have accomplished, what are you the most proud of?"},{"speaker":"Chris","time":"00:46:31-0","content":"Thing I'm most proud of that I've accomplished is, this one particular guy, he's a mentee in a reentry program. He have a heavy drug problem. And he was going downhill, it was just a matter of time. He could've got kicked out the program and ended up doing the time that he had. And man I'm just, I'm grateful and thankful that I was able to inspire this guy to turn his life around. That was one of my most proudest things, that I'm proud about."},{"speaker":"Marcus","time":"00:47:08-5","content":"Sure, absolutely. So let's explore a little bit about what the next chapter of your life could be. So let's say that you go through the pardon process successfully, and you're released. What does that picture look like?"},{"speaker":"Chris","time":"00:47:29-6","content":"When I get out? That picture looks like me continuing my work, this process is ongoing, it's not going to stop here. I see myself doing the same thing out there that I do here, on a daily basis. Definitely I'm going to be in ministry, and I'm definitely going to be involved in a legal field doing paralegal work."},{"speaker":"Marcus","time":"00:48:02-3","content":"Sure, great. It's interesting to me how many people who do really good work here, just continue doing the same thing when they leave. Kelvin is a great example."},{"speaker":"Chris","time":"00:48:30-8","content":"Matter of fact, Kelvin used to send me appeal briefs, guys will get denied on. He would send the briefs to me at hunts, and tell me to put him in a Louisiana supreme court. So I go track the guys down in population, get with them, and I would do all that stuff."},{"speaker":"Marcus","time":"00:48:41-4","content":"Yeah certainly. You know more than I do. So last question, is there something that I should've asked you about that I didn't?"},{"speaker":"Chris","time":"00:48:53-0","content":"Not that I can think of, but there is something that maybe I would like to say to you people like myself, Pastor Steve at Hunts, Pastor Hicks, and Pastor Walters here. There are guys that we have mentored, here, that has got out of here that's very successful. Maybe some kind of way in your process, you can include them in your process, because you know you're looking at where I came from, where I was, where I am at now."},{"speaker":"Chris","time":"00:48:53-0","content":"So when that shift takes place. There's people like one of my mentees he's out right now, he's doing good. He was at the state capital, he a lobbyist for government. He's involved and everything. He's taking his license to be a home inspector, he's working two jobs, taking care of his daughter, you know. And that's as a result of my leadership."},{"speaker":"Marcus","time":"00:48:53-0","content":"Thank you very much for this interview, I really appreciated it."},{"speaker":"Chris","time":"00:49:57-9","content":"Thank you and I appreciate it too."},{"speaker":"Chris","time":"00:49:57-9","content":"#00:50:04-5#"}]}