{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Chuck Unger Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Chuck",
      "time": "00:00:00",
      "upperBoundTime": "00:00:21",
      "content": "My name is Chuck Unger, I've been here forty years. I was arrested for murder, I'm doing a life sentence on first degree murder, and I was seventeen years old when I first got arrested. I'm fifty-seven, I'll be fifty-eight on October the 1st."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:21",
      "upperBoundTime": "00:00:41",
      "content": "I'm going to start by asking you some questions from before seventeen and then we'll spend some time looking at what you've been doing here at Angola too. Can you tell me a little bit about your family growing up?"
    },
    {
      "speaker": "Chuck",
      "time": "00:00:41",
      "upperBoundTime": "00:01:22",
      "content": "I had five brothers and one sister. Actually I had four brothers from my mother, she died when I was five. She was giving childbirth to my youngest brother, Matthew. My dad remarried about a year later, and they had two more kids, my sister and my little brother."
    },
    {
      "speaker": "Chuck",
      "time": "00:00:41",
      "upperBoundTime": "00:01:22",
      "content": "By the way he's deaf and throughout our life I learned a lot of sign language in the family, so that was an experience in itself too. But I grew up with seven, there were seven kids in our family, I was the oldest. We were all real close coming up, and to this day we're very close."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:22",
      "upperBoundTime": "00:01:25",
      "content": "Where did you grow up?"
    },
    {
      "speaker": "Chuck",
      "time": "00:01:25",
      "upperBoundTime": "00:01:31",
      "content": "I'm originally from New Orleans but I got arrested, like I said, when I was seventeen. But I grew up in New Orleans all my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:31",
      "upperBoundTime": "00:01:42",
      "content": "Your father remarried, was there a lot of fighting in the house?"
    },
    {
      "speaker": "Chuck",
      "time": "00:01:42",
      "upperBoundTime": "00:03:05",
      "content": "No. My stepmother and I didn't get along. She and I fought a lot, from I guess from the age when I could really understand what was going on. And around the age of thirteen my father and her decided it was getting kind of out of hand because she and I bickered all the time."
    },
    {
      "speaker": "Chuck",
      "time": "00:01:42",
      "upperBoundTime": "00:03:05",
      "content": "So he wanted to get rid of me and make me go live somewhere else, other people. He tried to sluff me off here, sluff me off there and eventually my grandmother took me in. So she was taking care of my grandfather, he had Parkinson's disease at the time, really bad Parkinson's disease."
    },
    {
      "speaker": "Chuck",
      "time": "00:01:42",
      "upperBoundTime": "00:03:05",
      "content": "So, when I went to live at the house with my grandparents I kind of got, I guess unfortunately you might say I regret it today, I sort of had free reign to start doing what I wanted to do. I eventually quit school, I eventually got in with the wrong crowds and different things in New Orleans. New Orleans is an easy place to get in trouble, so much going on down there, ballrooms in every neighborhood, there's Mardi Gras going on here."
    },
    {
      "speaker": "Chuck",
      "time": "00:01:42",
      "upperBoundTime": "00:03:05",
      "content": "Unfortunately to say, I'm ashamed to say today that I kind of took advantage of that situation and rather than being the grandson I should've been, I ended up being a little juvenile delinquent more or less you might say."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:05",
      "upperBoundTime": "00:03:14",
      "content": "Do you remember the, your memory of the last interaction you had with your grandmother?"
    },
    {
      "speaker": "Chuck",
      "time": "00:03:14",
      "upperBoundTime": "00:03:39",
      "content": "Man she was a saint. She took care of me, she was, like I said, taking care of my grandfather and she worked around the house. Actually back in those days the women, their role was the household, and she had a garden in the backyard, a vegetable garden, and she took care of her own garden and cut the grass, and took care of me and my grandfather. She was just a loving wonderful person man. She really was."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:39",
      "upperBoundTime": "00:03:42",
      "content": "Do you remember the last time you saw her?"
    },
    {
      "speaker": "Chuck",
      "time": "00:03:42",
      "upperBoundTime": "00:04:58",
      "content": "She died in 2000 and, but before then she had, she kind of got sickly and the put her in a home. So I hadn't seen her in like, the last time I saw her was man way in the mid '90s maybe, something like that. I still miss her to this day man she was wonderful, wonderful lady. We also had my aunt I forgot to say, her sister, lived downstairs."
    },
    {
      "speaker": "Chuck",
      "time": "00:03:42",
      "upperBoundTime": "00:04:58",
      "content": "But leaving the regular home with my family going to live with my grandparents in that kind of situation, that was kind of a weird situation because a young kid at the age of thirteen being separated from his siblings, going to live with your grandparents in that kind of environment, having a sick grandfather at home, falling down all the time, having to take care of this old guy, that I loved him with all my heart, but he was just, he couldn't even hardly talk."
    },
    {
      "speaker": "Chuck",
      "time": "00:03:42",
      "upperBoundTime": "00:04:58",
      "content": "So really getting to know him and getting personally strong, and getting to know him as a father figure or as a grandfather figure was kind of impossible at that time. She was the strength of the household, so to speak. But that's kind of what went on with that situation right there."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:58",
      "upperBoundTime": "00:05:11",
      "content": "So between your parents and your grandparents, would it be, would you say you grew up in a household where people cared for you and loved you and took care of you?"
    },
    {
      "speaker": "Chuck",
      "time": "00:05:11",
      "upperBoundTime": "00:05:33",
      "content": "Yeah I would say so, my grandmother did. And I had, like I said, I got along with my sibling and all. As far as my father and my stepmother, no, pretty much not. And speaking for I guess the love and the attention that a child would need, I didn't really get it from my parents so to speak but I got it from my grandmother pretty much."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:33",
      "upperBoundTime": "00:05:34",
      "content": "Did she come visit you here?"
    },
    {
      "speaker": "Chuck",
      "time": "00:05:34",
      "upperBoundTime": "00:05:55",
      "content": "Yeah, she did. Most of the times she could man. She came up here, I had friends that brought her up that were able to bring her up when they could. She stopped driving up here, actually the whole time I was here I didn't let her drive up here because she was too old to drive all the way that way from New Orleans. She did, she came to visit me a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:55",
      "upperBoundTime": "00:05:56",
      "content": "Who visits you now?"
    },
    {
      "speaker": "Chuck",
      "time": "00:05:56",
      "upperBoundTime": "00:06:19",
      "content": "I have a, one of my brothers comes a lot, one of my cousins, I have a lady friend who comes to see me, I met her at the rodeo. We've been getting pretty close. Whenever they can, my father's old, he's dying of cancer right now, he's up in his eighties now, and he can't come anymore. They live in Georgia now, they all moved to Georgia. So, I don't get a lot of visitors but I get some here and there, I do have visitors."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:19",
      "upperBoundTime": "00:06:35",
      "content": "So, because the crime that you were convicted of occurred before you were eighteen, as you very well know you are now eligible for some relief."
    },
    {
      "speaker": "Chuck",
      "time": "00:06:35",
      "upperBoundTime": "00:06:42",
      "content": "Oh I hope so, pray."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:42",
      "upperBoundTime": "00:06:44",
      "content": "Do you remember what you were doing when you heard that news?"
    },
    {
      "speaker": "Chuck",
      "time": "00:06:44",
      "upperBoundTime": "00:07:54",
      "content": "Wow that was, I was in a pretty hopeless frame of mind at the time. I was like man, what's going to happen next? And they were telling me that they passed this new law for people juveniles, but then again it's not retroactive for the people with murder. It was only for the non-homicides and that went on and on and on it took years to get that straight."
    },
    {
      "speaker": "Chuck",
      "time": "00:06:44",
      "upperBoundTime": "00:07:54",
      "content": "But now, man, I'm like, I go off parole in November I just can't, I just don't want to stand, how can you separate a person two or three months apart? I was seventeen, I turned eighteen after my crime, like maybe four months or five months later."
    },
    {
      "speaker": "Chuck",
      "time": "00:06:44",
      "upperBoundTime": "00:07:54",
      "content": "But you've got guys that were eighteen when they committed their crime and they had just turned eighteen. So, I mean, how there is difference there between us. I mean, they were just as young and stupid as I was, I guess you would say. So where's the fairness there? That's probably a big question. Where would you draw the line for a person that would be eligible for parole because they were too young to understand what was really going on. Which is what this is all about, right?"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:54",
      "upperBoundTime": "00:07:57",
      "content": "It's about impulsivity and brain development."
    },
    {
      "speaker": "Chuck",
      "time": "00:07:57",
      "upperBoundTime": "00:08:12",
      "content": "I agree, I feel fortunate and blessed that I have a chance, but what about these other guys who were eighteen, nineteen years old, they were kids too. So I'm fully in agreement with that, I really am. I hope they get some breaks."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:12",
      "upperBoundTime": "00:08:31",
      "content": "Forty years ago, this place was quite different in many respects. You were so young. Can you describe that person? The Chuck, the seventeen, eighteen year old Chuck who comes to Angola, trying to figure it out."
    },
    {
      "speaker": "Chuck",
      "time": "00:08:31",
      "upperBoundTime": "00:10:15",
      "content": "Yeah, I mean, it was really, it was confusing. It was, I would say I was uh, I kind of gave up. I came to the parish prison, I thought that my life was over I said, 'this is it.' And I didn't really care anymore. I came to prison and I'm going to have to conform to the knuckleheads that were trying to school me and show the way."
    },
    {
      "speaker": "Chuck",
      "time": "00:08:31",
      "upperBoundTime": "00:10:15",
      "content": "Now that I think back they were showing me all of the wrong ways. They probably got their amusements in me, doing the things that they didn't want to do. Busting somebody in the head or just getting into it with the guards, or just things that, I look back down and I wish I had never done because all that it did was cause me was a lot of pain and turmoil and a lot of hatred from the people who could've helped me."
    },
    {
      "speaker": "Chuck",
      "time": "00:08:31",
      "upperBoundTime": "00:10:15",
      "content": "So it was kind of like damned if you do, damned if you don't. Back then prison in here prison guards were pretty tough, they pretty were hardcore. They would beat you up if they felt that you were out of line. They'd lock you up and just keep you locked up all the time."
    },
    {
      "speaker": "Chuck",
      "time": "00:08:31",
      "upperBoundTime": "00:10:15",
      "content": "And as far as the rehabilitation that we have now it's now almost nonexistent. You have like five years to go home before you go to school in any kind of way. But now, it's pretty much available to almost everybody."
    },
    {
      "speaker": "Chuck",
      "time": "00:08:31",
      "upperBoundTime": "00:10:15",
      "content": "So, it was different world back then and I was pretty immature, and still, I mean like I say I was only seventeen when I got busted and when I got here I had just turned nineteen. I did like a year and a half in parish prison, and that was another, parish prison was pretty rough too, Orleans. But Angola back then and now is a big difference man, it really is, a big change."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:15",
      "upperBoundTime": "00:10:19",
      "content": "Has Angola been good to you?"
    },
    {
      "speaker": "Chuck",
      "time": "00:10:19",
      "upperBoundTime": "00:11:31",
      "content": "Wow that's a hard question. Has Angola been good to me? I can say yes and I can say no you know what I mean? So, has Chuck been good to me? That is the question, you know what I mean. I mean, I guess it's just like, everybody in life will probably have to make the best of where there are."
    },
    {
      "speaker": "Chuck",
      "time": "00:10:19",
      "upperBoundTime": "00:11:31",
      "content": "And, I'm sure there's been people, I know there's been people who have been in worse situations than me. People in these third world countries, people, all these other places that they don't the opportunities that even we have in Angola. And just because boohoo Chuck this and this, and this, I had the chance to make something out of myself and I didn't. I decided, I made these wrong choices early on in life and it just caused myself to get where I am now."
    },
    {
      "speaker": "Chuck",
      "time": "00:10:19",
      "upperBoundTime": "00:11:31",
      "content": "So, look at people that, they rose up, they're presidents of cooperation now and they have boohoo stories to tell too. So, I can't say has Angola been good or has Angola been bad to me. I'm not going to blame Angola, what I'm saying I mean it's just an unfortunate place I had to be."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:31",
      "upperBoundTime": "00:11:50",
      "content": "Yeah, I say that because, I've talked to some guys who were quite clear that if they hadn't been arrested and brought to Angola they would be dead. And they also have found themselves. And taken advantage of lots of vocational opportunities, self-help groups stuff, and been mentored in that way."
    },
    {
      "speaker": "Chuck",
      "time": "00:11:50",
      "upperBoundTime": "00:13:11",
      "content": "I did do that. I've become a, I am now an inmate minister with the Catholic Church. That's what I do. I go to the death row, I see men on death row. We do retreats, man, that's a wonderful thing. They have these kids that come up here from local Catholic churches and schools."
    },
    {
      "speaker": "Chuck",
      "time": "00:11:50",
      "upperBoundTime": "00:13:11",
      "content": "And we do retreats with them, we answer questions and we tell them about our bad choices and we try to talk them into embracing their faith and staying in the church and getting their confirmation. And we've been doing this now for the past eight, nine, ten years and man its like, it's a wonderful thing. We're known all over the Baton Rouge now, people are really. We're backlogged now to have these retreats. And it's really become a real strong thing with me man. That's one of the turning points of my life here."
    },
    {
      "speaker": "Chuck",
      "time": "00:11:50",
      "upperBoundTime": "00:13:11",
      "content": "It wasn't really that long ago, it was like ten fifteen years ago that I got back into the church. I eventually became an inmate minister because like I said, before that man I was lost, I was just, I was a total mess, I didn't care. I mean, I just felt like this was the end of the world for me, so I gave up. But, like I was trying to say earlier, I can't blame Angola, I might have done that at one time, you can't blame others for what you do, you got to blame yourself, and you got to make the best of yourself."
    },
    {
      "speaker": "Chuck",
      "time": "00:11:50",
      "upperBoundTime": "00:13:11",
      "content": "That's just what I learned I really believe that."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:14",
      "content": "So what led to you turning your life around?"
    },
    {
      "speaker": "Chuck",
      "time": "00:13:14",
      "upperBoundTime": "00:13:19",
      "content": "I was just so tired of doing bad I guess."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:19",
      "upperBoundTime": "00:13:20",
      "content": "Age?"
    },
    {
      "speaker": "Chuck",
      "time": "00:13:20",
      "upperBoundTime": "00:14:00",
      "content": "Age too, maturity, waking up on the dungeon floor. Everybody looking at you like you're no good, you've never been any good all the time, you finally come to the realization like, wait a minute, man this is not what life is about. I don't care where you are, you've got to try to make something out yourself, become a better person. Because once it's over, it's over."
    },
    {
      "speaker": "Chuck",
      "time": "00:13:20",
      "upperBoundTime": "00:14:00",
      "content": "I believe in a higher power too, I believe there's something after this. And if I don't get myself together while I'm on this earth, according to what Jesus Christ and what Lord wants me to do, I'm in trouble now, but I'll really be in trouble then."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:00",
      "upperBoundTime": "00:14:11",
      "content": "So you've got a parole hearing in November. Let's assume that it all goes well. How do you envision your life? What are you going to do? What are your goals?"
    },
    {
      "speaker": "Chuck",
      "time": "00:14:11",
      "upperBoundTime": "00:14:58",
      "content": "I have my family, my brother owns like an electrical contract company, I'm going to go to work with my brother. I want to continue to do with these kids what I'm doing no, I really would like to. Matter of fact, I'm already starting to get, my brothers are getting involved with churches out there they've already accepted me, they want me to come out there and do these things and start a program for these kids out there. That's something that I really want to do or carry on into."
    },
    {
      "speaker": "Chuck",
      "time": "00:14:11",
      "upperBoundTime": "00:14:58",
      "content": "As well as work and just make something out of myself because, like I said, life ain't over I want to continue like I'm doing now. But I have so much to learn once I get out of here as far as making definite plans, and saying, \"Well I want to do this and do that, I don't know, I have no idea what I can do when I get out of here because I don't know what it's like out there, really. Except for when I was a kid, so.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:14:58",
      "upperBoundTime": "00:15:00",
      "content": "And the world changes in forty years."
    },
    {
      "speaker": "Chuck",
      "time": "00:15:00",
      "upperBoundTime": "00:15:20",
      "content": "On absolutely I'm sure man, I looked at the cars out there, I watch TV and I just can't believe. I'll see clips and excerpts from 1975 and '77 and I'm like, \"Wait wooh is that how it was back then?\" It's a whole different world so, I'm ready man, I can't wait. God willing, I'm going to get out and I think it's going to be good, I really do."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:20",
      "upperBoundTime": "00:15:28",
      "content": "What was the last grade that you completed in school?"
    },
    {
      "speaker": "Chuck",
      "time": "00:15:28",
      "upperBoundTime": "00:15:32",
      "content": "I quit school in ninth grade. But I got my GED up here so."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:32",
      "upperBoundTime": "00:15:36",
      "content": "Sure. Were drugs and alcohol a part of your teenage years?"
    },
    {
      "speaker": "Chuck",
      "time": "00:15:36",
      "upperBoundTime": "00:16:01",
      "content": "Yeah it was. I got around the wrong people and, I'm not going to blame them either I did it myself too. Drinking, drugging, I never did hard drugs, I never shot drugs. But I used to eat pills and smoked weed and the normal things back then that the kids did. Alcohol was a real back problem for me too. So yeah it was, it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:01",
      "upperBoundTime": "00:16:05",
      "content": "Do you think alcohol and drugs played a big role in why you're here?"
    },
    {
      "speaker": "Chuck",
      "time": "00:16:05",
      "upperBoundTime": "00:16:13",
      "content": "Yeah I think it was a contributing factor, I think it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:13",
      "upperBoundTime": "00:16:15",
      "content": "Did you ever get kicked out of school?"
    },
    {
      "speaker": "Chuck",
      "time": "00:16:15",
      "upperBoundTime": "00:16:27",
      "content": "Yes I did. Fighting, skipping school, just. And I finally, like I said I ended up quitting school, I got tired. I didn't think school was worth it to me at the time it was just. I had a whole different mindset so, I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:27",
      "upperBoundTime": "00:16:30",
      "content": "Do you have any children?"
    },
    {
      "speaker": "Chuck",
      "time": "00:16:30",
      "upperBoundTime": "00:16:30",
      "content": "No children, no children."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:30",
      "upperBoundTime": "00:16:29",
      "content": "You were still young."
    },
    {
      "speaker": "Chuck",
      "time": "00:16:29",
      "upperBoundTime": "00:16:41",
      "content": "I was well I'm not going to say I was too young but I was young. I was a child myself, so no I don't have any kids."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:41",
      "upperBoundTime": "00:16:44",
      "content": "Do you remember the first time you got arrested?"
    },
    {
      "speaker": "Chuck",
      "time": "00:16:44",
      "upperBoundTime": "00:17:19",
      "content": "Yeah I got arrested when I was like about maybe fifteen or fourteen, fighting in public, shoplifting, and different things like that. Just being a bad kid, a juvenile delinquent. I got about four arrests I think before I got this arrest right here. And this was a murder charge. It was a murder charge. I like to say it was a manslaughter actually, that's what everybody thinks now. But, unfortunately I got a life sentence, so hey this is how fate turned out to be so."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:19",
      "upperBoundTime": "00:17:19",
      "content": "If you had to point to one thing that led you down this wrong road, it may not be one thing, but if you had to pick the most important factor, what do you think it would be?"
    },
    {
      "speaker": "Chuck",
      "time": "00:17:19",
      "upperBoundTime": "00:18:09",
      "content": "Aw man. I say there's so many things but listening to the authorities, people that knew what's going on, that's trying to tell you what's going on. Kids probably all throughout time don't want to listen to what the older people have to say. They don't know what they're talking about, man they do. Even now the authorities that know more than what I know, I listen to them. I mean I want to hear what you're saying because you know man, and I don't. Tell me man."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:09",
      "upperBoundTime": "00:18:26",
      "content": "What advice would you give somebody, a seventeen eighteen year old, guy coming in to Angola on a life sentence, what would you tell him? If you see him tomorrow and he comes up to you he says, \"Chuck, you got any advice for me?\""
    },
    {
      "speaker": "Chuck",
      "time": "00:18:26",
      "upperBoundTime": "00:18:53",
      "content": "Stay in school, leave drugs alone, don't think you're more than what you are, listen to the adults, listen to mom and dad, your teachers, all of the authorities. These people are there, they know what they're talking about. Don't do like I did. If anything about me, don't do what I did."
    },
    {
      "speaker": "Chuck",
      "time": "00:18:26",
      "upperBoundTime": "00:18:53",
      "content": "That's what I would tell them, leave those things alone. Leave drugs alone, stay in school, and listen to your authority. Your parents, your teachers, that's one of the main things I'd tell them."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:53",
      "upperBoundTime": "00:19:11",
      "content": "Yeah. You mentioned earlier on that, it was maybe ten, fifteen years ago, that before that you were really just kind of lost. What led to you, what do you think led to you transforming your life?"
    },
    {
      "speaker": "Chuck",
      "time": "00:19:11",
      "upperBoundTime": "00:19:13",
      "content": "Turning it around, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:13",
      "upperBoundTime": "00:19:14",
      "content": "Was it a spiritual experience of some kind?"
    },
    {
      "speaker": "Chuck",
      "time": "00:19:14",
      "upperBoundTime": "00:19:41",
      "content": "I'd say partly, yeah. I was constantly getting in trouble man, I'd find myself laying on the dungeon floor with a toilet paper roll under my head trying to get my sleep. Getting in trouble, getting in fights, getting in the authorities, I mean it was just total, a spiral down into an abyss, and like I came to a point, like you say, maturity. I finally came to a realization man."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:41",
      "upperBoundTime": "00:19:45",
      "content": "Were you mistreated as a child?"
    },
    {
      "speaker": "Chuck",
      "time": "00:19:45",
      "upperBoundTime": "00:19:57",
      "content": "Physically, no. I would say mentally, yeah, I was. To a, up to a certain point. But no, I was never physically abused in no kind of way. Not by anybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:57",
      "upperBoundTime": "00:20:07",
      "content": "Okay, sure. Aside from the ministry as an inmate minister, what else? What is your typical day like here?"
    },
    {
      "speaker": "Chuck",
      "time": "00:20:07",
      "upperBoundTime": "00:20:49",
      "content": "Oh man, it's pretty laid back now. I'm at Camp F, Camp F is a trustee camp so it's pretty laid back. They don't bother you back there as long as you're doing what you're supposed to do. And like I said, I do the ministry, I go to death row and see the men, and help do services on the weekends, and just counsel the guys and do these retreats with these kids."
    },
    {
      "speaker": "Chuck",
      "time": "00:20:07",
      "upperBoundTime": "00:20:49",
      "content": "My life right now is, I'm just kind of like, I have a lot of tension on me too waiting on this juvenile, this parole deal coming up too but as far as, basically my life's pretty laid back right now just waiting hoping and waiting. And things are pretty easy for my right now, as far as how they were throughout the years of me being here, so."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:49",
      "upperBoundTime": "00:21:04",
      "content": "When you minister to folks on death row, what do you find is the main source of the problems there? What kinds of things do they talk to you about?"
    },
    {
      "speaker": "Chuck",
      "time": "00:21:04",
      "upperBoundTime": "00:22:05",
      "content": "Oh man, it's like hopelessness. Thing that I can relate to as far as like being in cell constantly, because I've been in cells many times. It's like a closet with a toilet and a sink and a bed and you're in there, you're just there. You sort of, how you say, become introverted, like that old song Sound of Silence by Simon and Garfunkel."
    },
    {
      "speaker": "Chuck",
      "time": "00:21:04",
      "upperBoundTime": "00:22:05",
      "content": "The only think you can listen to is the thoughts in your mind, that's all you have, and you can drive yourself crazy if you don't stop and try to better yourself and go to a positive direction because if you steady dwell on negativity, and how bad things were in your life and how rough things were and all the things bad in the world, you can drive yourself crazy."
    },
    {
      "speaker": "Chuck",
      "time": "00:21:04",
      "upperBoundTime": "00:22:05",
      "content": "And I try to bring positive notes and positive word and the lord's word, and if they want to talk and cry on my shoulder there I am, hey, here I am, I'm your brother man, let's talk, that's what we do."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:05",
      "upperBoundTime": "00:22:11",
      "content": "Yeah, and you can relate, I mean."
    },
    {
      "speaker": "Chuck",
      "time": "00:22:11",
      "upperBoundTime": "00:22:23",
      "content": "Yeah, it's just the old saying, 'been there done that.' And men pretty much, I'm pretty much accepted. I go over there, everybody knows me, it seems like they like me, it seems like they do. And so, I'm doing my job man."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:23",
      "upperBoundTime": "00:22:45",
      "content": "When you think back on the crime that you were convicted of, and the victim's family. It's been forty years, you've been punished for forty years. How do you feel about it now?"
    },
    {
      "speaker": "Chuck",
      "time": "00:22:45",
      "upperBoundTime": "00:22:49",
      "content": "In other words, do you think I feel like I deserve forty years?"
    },
    {
      "speaker": "Marcus",
      "time": "00:22:49",
      "upperBoundTime": "00:22:55",
      "content": "Well when you look back on it, what's you're feeling about it?"
    },
    {
      "speaker": "Chuck",
      "time": "00:22:55",
      "upperBoundTime": "00:22:59",
      "content": "Well needless to say I wish it never would've happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:59",
      "upperBoundTime": "00:23:01",
      "content": "Yes."
    },
    {
      "speaker": "Chuck",
      "time": "00:23:01",
      "upperBoundTime": "00:24:20",
      "content": "What I mean like, I feel very remorseful in that I took that man's life. I didn't know him, but still in all, he was a person. He didn't do me anything to deserve that but in the situation that occurred, even though I say it was manslaughter, it wasn't murder, I probably shouldn't have gotten life but I got what I got so I've got to make the best of it."
    },
    {
      "speaker": "Chuck",
      "time": "00:23:01",
      "upperBoundTime": "00:24:20",
      "content": "But the thing is it's something I'll never do again, and. You try to put yourself in his place. I mean, what it would have been like if I would've got stabbed up and killed, and had to die from somebody else when I didn't deserve it. I mean and so many things go through your mind about that. It was so long ago that it happened, it's so vague in my mind the actual incident that occurred."
    },
    {
      "speaker": "Chuck",
      "time": "00:23:01",
      "upperBoundTime": "00:24:20",
      "content": "But, knowing what it is I did do, it's kind of something you don't even like to dwell on really, because it's really a horrible kind of thing in your life that just, that was the whole turning point toward this horrible situation. That I'm hoping ends what I mean."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:20",
      "upperBoundTime": "00:24:24",
      "content": "What do you want the parole board to know about you?"
    },
    {
      "speaker": "Chuck",
      "time": "00:24:24",
      "upperBoundTime": "00:24:42",
      "content": "I want them to know I'm a changed person. I'm not the kid I was then, and I have a lot to offer in society. I have a lot to, I have a place to go, I have people that care about me, I have my brothers and my sister, I have friends, I have people that uh, I think I could do good things when I get out, I think I'm going to make it. I just think I'm ready, man."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:42",
      "upperBoundTime": "00:24:50",
      "content": "Have you taken the vocational training for electricians?"
    },
    {
      "speaker": "Chuck",
      "time": "00:24:50",
      "upperBoundTime": "00:25:16",
      "content": "I started to, I went through the telecommunications, and I got that. And I had done some electrical schooling but things kind of didn't work out on that side so I got moved and went to a different place. But my brother, like I said, he's an electrical contractor and he's going to put me in school when I get out. He's also going to put me to work. I'll probably start as an apprentice I'm sure as an apprentice and I'll be working and learning on the job, training and different things."
    },
    {
      "speaker": "Chuck",
      "time": "00:24:50",
      "upperBoundTime": "00:25:16",
      "content": "So yeah it's going to be good, it's going to be good."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:16",
      "upperBoundTime": "00:25:21",
      "content": "Yeah. What's the worst part about this place?"
    },
    {
      "speaker": "Chuck",
      "time": "00:25:21",
      "upperBoundTime": "00:26:49",
      "content": "Aw man. I don't know where to begin. Being away from your family, realizing what you put them through, that guilt that you have. You put them through a lot, I mean they love you, they want to get you out, and you're like, \"wow, I didn't realize y'all loved me that much.\""
    },
    {
      "speaker": "Chuck",
      "time": "00:25:21",
      "upperBoundTime": "00:26:49",
      "content": "They'll spend their money on you, they'll accept your phone calls, they'll come see you and help you in any way they can and while you're out there you don't realize, you take that for granted. But when you're in this kind of situation then you find out how much your people really care about you, your parents and your brothers and sisters and all that."
    },
    {
      "speaker": "Chuck",
      "time": "00:25:21",
      "upperBoundTime": "00:26:49",
      "content": "And there's a lot of bad things about this place, it's just like but I mean there's a lot of bad places about other places too I guess too, so. I mean, I could sit here and tell you about how the food's bad or they got knuckleheads that want to try to mess over you here and there, which is, I guess that's all a part of life out there too, right?"
    },
    {
      "speaker": "Chuck",
      "time": "00:25:21",
      "upperBoundTime": "00:26:49",
      "content": "I mean, out there in life you've got the same type of people so, I look at this as an exercise of when I get out of here I'm going to be able to handle out there. Because it's probably a lot worse from what I keep hearing and from what I vaguely remember as a kid."
    },
    {
      "speaker": "Chuck",
      "time": "00:25:21",
      "upperBoundTime": "00:26:49",
      "content": "It's just as bad out there, maybe worse in a different way, so, this is my exercise, this is my way what I'm going through now and how I handle this now is going to be, is going to make me what I am to be able to do it when I get out of here. Because I'm getting out of here I think man, I really believe that. God willing."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:49",
      "upperBoundTime": "00:26:53",
      "content": "Are you concerned at all about adjusting to life on the outside?"
    },
    {
      "speaker": "Chuck",
      "time": "00:26:53",
      "upperBoundTime": "00:27:52",
      "content": "Not really. Not really, because I think I'm going to make it man. I got it on my mind, I'm going to make it man. I know. I've got it on my mind. I'm not going to go out there and do nothing to come back here, that's for sure. Believe me, I'm not coming back to this, trust me. So, I look at people like you all and I mean, this young guy here man he's learning how to, making big mega bucks just, look at this kind of stuff."
    },
    {
      "speaker": "Chuck",
      "time": "00:26:53",
      "upperBoundTime": "00:27:52",
      "content": "You man, I mean I look at people like y'all I'm like, this is what I want to do. I want to go make it out there, I want to go be something? Go out there and shoot drugs and all kind of, I see people like that and I'm kind of like appalled at these kind of people man I'm like, \"Why?\" and I try to talk to them and they're already stuck on stupid so I'm like, my thing is, stay away from them. And that's my advice to the kids out there too, stay away from knuckleheads."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:52",
      "upperBoundTime": "00:27:59",
      "content": "Of the various things that you've done in your life, what are you most proud of?"
    },
    {
      "speaker": "Chuck",
      "time": "00:27:59",
      "upperBoundTime": "00:28:24",
      "content": "The retreat thing with the kid's man. Really, the retreat that we're doing. Every time we do it it's a new experience. It's really beautiful, it really is. The kids, they just, they come in there apprehensive, they're scared, and then when it's over man they're hugging you and they're all excited like, \"I'm going to get my confirmation.\" It's like man, I did that. Through the Grace of God. It's nice."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:24",
      "upperBoundTime": "00:28:27",
      "content": "Yeah no, I understand that."
    },
    {
      "speaker": "Chuck",
      "time": "00:28:27",
      "upperBoundTime": "00:28:40",
      "content": "So that's one of my strongest things right there. Should I take more, should I answer these questions longer or should I just? I'm not a long talker man."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:40",
      "upperBoundTime": "00:29:00",
      "content": "No, you're doing perfectly. You're one of these, particularly interesting cases because you have this parole eligibility in your future. Is there something I should've asked you that I didn't?"
    },
    {
      "speaker": "Chuck",
      "time": "00:29:00",
      "upperBoundTime": "00:29:05",
      "content": "You seem to have covered a lot but, you covered a lot. But I mean."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:05",
      "upperBoundTime": "00:29:23",
      "content": "Okay, let me ask you this. Is there something, everything that happens in prison, as somebody in here, it's your whole world, but it's entirely invisible to people on the outside. The good, the bad, the ugly, it's all invisible."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:23",
      "upperBoundTime": "00:29:25",
      "content": "That's true, you're right."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:25",
      "upperBoundTime": "00:29:29",
      "content": "What would you want somebody to know about serving life without parole?"
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "Tha"
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "t's a good one, because, the people out there, like you just said, they don't really understand. They want to just throw you away and they don't know any more about what's happening with you, that's it. They don't know they've got people here that change themselves and made better people out of themselves and deserve another chance. They don't know all about that, they don't care. All they know is about somebody got thrown away, they're no longer their problem, they swept them under the rug and that's it."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "They don't even want to hear about it no more. But I mean, would you do that, say as if your kid got in trouble, would you do that to him or her? Probably not. I mean and we're people too. We screwed up, we did badly, but we're capable of change and doing better."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "So in order to keep, in order to improve people in prison, give them hope. Give them a chance to better themselves. Don't just throw them away. And they're crying about the money now, it's become an outstanding problem how the prison is blowing up, I mean it's just coming apart at the seams, there's nowhere to put anybody."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "When I came here you had Camp A and Camp H that shut down, it's just like a ghost town, there's nowhere to put anybody. Everything's becoming decrepit, where we're living is falling apart, toilets are leaking all over the place, and they don't have the money to fix anything. We're living in squalor in here. We have bunk beds, we're living on top of each other."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "If you look in the dormitory it looks like a third world country like India or something. It's just, and people are sitting there watching TV just blank stare and it's like they're lost, and they're not watching TV they're just sitting there just thinking like zombies waiting for something maybe that can happen for them, like it happened for me and happened for these twenty, forty year guys? And a little bit at a time things are happening."
    },
    {
      "speaker": "Chuck",
      "time": "00:29:29",
      "upperBoundTime": "00:31:48",
      "content": "We've got this good govern now I mean, that's a God that's a lifesaver, this guy's good and so. The people out there need to know that they need to find a way to give people hope and give people the opportunity to change and better themselves and give them a release mechanism so that people can have a chance to get out. Not just thrown away, people will just sit here and wait to die, man, that's not going to get it, that's not going to get it."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:48",
      "upperBoundTime": "00:31:53",
      "content": "That's a good point to stop."
    },
    { "speaker": "Chuck", "time": "00:31:53", "content": "So, is that it?" }
  ]
}
