{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Cleothus Price transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:10",
      "content": "Please state the record by stating your name, the crime of conviction, how old you were at the time, and how much time you've served."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:10",
      "upperBoundTime": "00:00:15",
      "content": "Cleothus Price, second degree murder, 20 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:15",
      "upperBoundTime": "00:00:17",
      "content": "And how much time have you served?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:17",
      "upperBoundTime": "00:00:21",
      "content": "I've served 22 and a half years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:21",
      "upperBoundTime": "00:00:22",
      "content": "And where are you from?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:22",
      "upperBoundTime": "00:00:24",
      "content": "I'm from Monroe, Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:24",
      "upperBoundTime": "00:00:38",
      "content": "I'm going to as I said, the purpose of this is simply to learn about your life. I'm going to start by asking some questions about your life before coming here. Can you tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:38",
      "upperBoundTime": "00:00:43",
      "content": "Well, I basically grows up in a single parent home with my mother, Shirley Price."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:43",
      "upperBoundTime": "00:00:44",
      "content": "Okay."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:44",
      "upperBoundTime": "00:00:53",
      "content": "In Rayville, Louisiana. It's me and my sister and most of my life, it was just me, her and my sister."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:53",
      "upperBoundTime": "00:00:55",
      "content": "Okay, is your sister older or younger?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:55",
      "upperBoundTime": "00:00:56",
      "content": "She's younger."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:56",
      "upperBoundTime": "00:00:57",
      "content": "Okay, what's her name?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:00:57",
      "upperBoundTime": "00:00:59",
      "content": "Her name is Cornelia Price."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:59",
      "upperBoundTime": "00:01:01",
      "content": "Okay."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:01:01",
      "upperBoundTime": "00:01:26",
      "content": "Coming up, it was no father figure in the house. It was just mom, mom was mom, dad, everything. Just basically her and my sister. And I basically tried to be the big brother to her and the man of the household at the same time. But, as I got older, I grew off into sports."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:26",
      "upperBoundTime": "00:01:27",
      "content": "Okay."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:01:27",
      "upperBoundTime": "00:01:53",
      "content": "I liked to play sports. All my life, I was using sports as my escape of not having a father figure in the household. So, I chose sports, which kept me out of the juvenile facilities, for one, kept me active in the communities, and also kept me active in the junior highs and local high school, cause I was a pretty decent football player."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:53",
      "upperBoundTime": "00:01:58",
      "content": "Okay, what about grandparents? Were there any grandparents in your life?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:01:58",
      "upperBoundTime": "00:03:02",
      "content": "Well my grandfather James Price was very much part of my life till he passed away. He passed away at a critical time in my life right before I was charged. Because he always instilled in me, \"Grandson I want you to get your education. No matter what you do in life, get your education.\" So this was a time in my life, I'm fresh out of high school, probably my third semester at Southern University and I was coming back and forth, from Baton Rouge and Martinsville."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:01:58",
      "upperBoundTime": "00:03:02",
      "content": "I lived at my grandfather's before he died. And he was always proud of me: \"Grandson, you're getting your education, you're playing your sports but you're getting your education. You're being a man.\" But, this particular night, March 25th, 1996, things didn't go as according to plans."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:02",
      "upperBoundTime": "00:03:14",
      "content": "Okay. So I'm going to back up a little bit before that. So, what was, you said you played sports in school and I know you must have graduated and you said that you were at Southern University."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:03:14",
      "upperBoundTime": "00:03:15",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:15",
      "upperBoundTime": "00:03:22",
      "content": "But let's go back a little bit before that. Were you ever in trouble with the law, prior to this?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:03:22",
      "upperBoundTime": "00:03:29",
      "content": "No, I never had a juvenile record, a speeding ticket, a traffic ticket, this is my first ever offense."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:29",
      "upperBoundTime": "00:03:36",
      "content": "Okay, well, so now you say you're in the street. I think I have a sense of what that means but can you explain that?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:03:36",
      "upperBoundTime": "00:04:39",
      "content": "Well when I say the streets I'm not saying as though I'm pedaling in the streets, I'm just in the streets, trying to make ends meet without having to go to mom, \"Mom, I need $5.\" I might just go pick up some scraps, go down to where I'm from like with Rayville, Monroe, you could aluminum cans back then, take them to the junkyard, they'll give you a free penny."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:03:36",
      "upperBoundTime": "00:04:39",
      "content": "Or you could haul cotton, haul potatoes, I take that, and try to make ends meet. But, when I get my check, I might go to one of my cousins or one of the little bodillas, and be like, \"look man, I got $200. Moms rent coming up, could you give something?\" I mean, I'm not no regular, to help us out, help her out. That's what I meant by in the street. I wasn't trying to make it a career, Cause I felt like the sports was going to get us out."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:39",
      "upperBoundTime": "00:04:41",
      "content": "And then you played football for Southern?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:04:41",
      "upperBoundTime": "00:04:41",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:41",
      "upperBoundTime": "00:04:45",
      "content": "And were these two other folks, did they also play football at Southern?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:04:45",
      "upperBoundTime": "00:04:59",
      "content": "Well, Eric Simms, he played at Southern. But Dumont went to ULM, but we all went to West Carroll High School and had good high school careers."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:59",
      "upperBoundTime": "00:05:19",
      "content": "So, it sounds like to me, that from a very early age, you felt like you had to make it on your own. As opposed to having a bunch of adults taking care of you, nurturing you, and seeing you through. And yet, you managed to get all the way through school and do well, so you were doing something right."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:05:19",
      "upperBoundTime": "00:05:25",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:25",
      "upperBoundTime": "00:05:33",
      "content": "I'd like for you to tell me a little bit about your grandfather, a little bit more. You said he passed away right before this happened?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:05:33",
      "upperBoundTime": "00:05:33",
      "content": "Right, he passed away, that was like the spring of my freshman year. Spring semester my freshman year, was '95, this charged happened in '96. To me, when he left, a lot of me left. Cause that's who I looked up to as far as guidance, understanding. And he was really a father figure in my life. I spent many days with him, fishing, hunting; he taught me how to drive a car. He'd drink his beer over, \"Boy, get over there and drive me to town.\""
    },
    {
      "speaker": "Cleothus:",
      "time": "00:05:33",
      "upperBoundTime": "00:05:33",
      "content": "I had much love and Cleothus:ect for him. And like when he passed away, a part of me left. When they put him in that ground, some devils within me left. I don't know if the fighter in me left or what, but I say if he was still living, I don't believe I'd be here talking to you right now today, cause that's just how much I Cleothus:ected what he said. If he said \"Grandson, go walk that line straight,\" I'd believe in everything he said."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:33",
      "upperBoundTime": "00:06:59",
      "content": "You mentioned a military experience. Can you tell me more about that?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:06:59",
      "upperBoundTime": "00:07:07",
      "content": "Well, I did basic AIT at Fort Sill, Lawton, Oklahoma."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:07",
      "upperBoundTime": "00:07:09",
      "content": "Was that before going to college?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:07:09",
      "upperBoundTime": "00:07:55",
      "content": "That was in between '95 and '96. See like I said, when I lost my grandpa, I stepped away from Southern, in '95. Between '95 and '96, my grandfather died in the spring of '95, I dropped out of school. That's why I said I lost a lot when he left. The education was kind of like, him. When he died, I said \"Well, there's no need to go to school. I have a son, I need to go take care of my son.\" So I joined the reserve, I went to Fort Sill around the summer of '95."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:55",
      "upperBoundTime": "00:07:58",
      "content": "So you have a son. Tell me more about your son."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:07:58",
      "upperBoundTime": "00:08:50",
      "content": "Well my oldest boy, Deandre, he's 24. He's chasing an NFL dream. He'll be a grad soon, he's only got 2 years left. My baby boy, he's actually at Southern, he's a sophomore. He's more like his mom. And, that's another situation that's kept me kind of disturbed, because she kept them away from me. Now, my oldest boy, he can't do no wrong, he feels that I can't do no wrong."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:07:58",
      "upperBoundTime": "00:08:50",
      "content": "He said, \"Dad, I'm going to make it, I'm going to get you out of there.\" Kind of like my grandfather, I can see my grandfather in him. And I tell him that all the time. I say, \"I can see granddaddy in you.\" But he don't really know granddad because he was real small when granddaddy passed away."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:50",
      "upperBoundTime": "00:08:51",
      "content": "Do they have the same mother?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:08:51",
      "upperBoundTime": "00:08:53",
      "content": "Different moms."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:53",
      "upperBoundTime": "00:09:01",
      "content": "Okay, I'm assuming that the oldest one's mother wanted him to have a relationship with you over the years, is that correct?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:09:01",
      "upperBoundTime": "00:09:02",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:02",
      "upperBoundTime": "00:09:04",
      "content": "Okay, whereas the other one didn't?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:09:04",
      "upperBoundTime": "00:09:04",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:04",
      "upperBoundTime": "00:09:11",
      "content": "Okay, do you still have a relationship with either one of their mothers?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:09:11",
      "upperBoundTime": "00:09:32",
      "content": "Well, my oldest son's mom, we stay in contact with each other. And like she said, we'll always be in contact because we share a kid together. But, my youngest son's mom, every blue moon we'll call and talk to each other."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:32",
      "upperBoundTime": "00:09:34",
      "content": "Are they able to come up here and visit you?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:09:34",
      "upperBoundTime": "00:09:48",
      "content": "Yes. I actually visit both sons while I been here. I visit my youngest son only once, but my oldest son, I've visit numerous times."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:48",
      "upperBoundTime": "00:09:49",
      "content": "But you're not a grandfather yet?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:09:49",
      "upperBoundTime": "00:09:57",
      "content": "No, they haven't made me a grandfather yet. I don't know what they waiting on."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:57",
      "upperBoundTime": "00:10:08",
      "content": "Do you have any specific memories from school, aside from sports? Were there teachers who took an interest in you, try to give you some guidance, or did you kind of just make it through?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:10:08",
      "upperBoundTime": "00:11:01",
      "content": "Well, I always remember my math teacher, Herschel West, which he was my math teacher and my basketball teacher. And he always emphasized basketball isn't always going to be there. Cause math was one of my worst subjects. And He always used to drill me in math, \"You got to get this! I don't care how good you shoot a basketball, you blow that ACL, that's it, you careers over."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:10:08",
      "upperBoundTime": "00:11:01",
      "content": "You got to learn this math\" And, Herschel West was one of my favorite teachers, even though it was one of my worst subjects, he was one of my favorite teachers. And I don't know if it's him being my basketball coach and teacher, but I liked him."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:01",
      "upperBoundTime": "00:11:05",
      "content": "Was there a lot of fighting in your adolescence?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:11:05",
      "upperBoundTime": "00:11:44",
      "content": "Wasn't too much of a fighter. I was like I said, I was an athlete, I worked out a lot, I tried to keep myself up. Like I said, my goal was to get my mom and my sister out them projects and in an apartment. And that meant playing ball, going to college, and trying to make it to the next level. And I even tell, \"Today I feel like I failed y'all\" and she tell me, \"Son, you ain't me, I still love you.\" But, I'm harder on me than anybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:44",
      "upperBoundTime": "00:11:47",
      "content": "Were you kicked out of school?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:11:47",
      "upperBoundTime": "00:12:01",
      "content": "I never been kicked out of school. As far as school, I was probably, I was a model student no suspensions, I went to class, didn't miss days."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:01",
      "upperBoundTime": "00:12:48",
      "content": "Here's the thing, with a lot of guys, the thing that ended up landing them here at Angola, that I've talked to, was almost foreseeable; that they just went down this path, that they were, if it wasn't then it was the next day something would have happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:01",
      "upperBoundTime": "00:12:48",
      "content": "And a lot of folks say \"Well, I would have been dead or I'd be here.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:12:01",
      "upperBoundTime": "00:12:48",
      "content": "But it doesn't sound, your story is quite different. It doesn't sound like this sounds like a real one off event. How do you make sense of it in the context of your broader life story? How did this part pop? It doesn't make any sense to me."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:12:48",
      "upperBoundTime": "00:14:13",
      "content": "In a joking way, I tell my family I guess I'm the black sheep of the family. Cause my family, the Price family, we don't have too many trouble makers. I say, my grandfather retired from the military, my uncle went to the military, my mom raised two kids, and she retired from the state of Louisiana. My grandmother retired from the state of Louisiana. All my immediate family, they was all from the school education. And me, I was striving to do right and I done right for 19 and a half 20 years."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:12:48",
      "upperBoundTime": "00:14:13",
      "content": "It was just like I told mom the other day, \"I just go back to 1995, I don't know what got in me, but as long as granddad was living, I was striving to do right\" When that man died, and I joined Uncle Sam's army, I don't what the tactics I learned in the army, took over me and turned me into the animal I was that night, March 25th, 1996. I don't know, like I told, I never had no intent on killing. I had no intent on killing, and that's why I'm so remorseful."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:13",
      "upperBoundTime": "00:15:00",
      "content": "The fact of the matter is that this interview is about your life story and the whole point of the project is that we are more than our worst moment. So I don't want that to be the main focus of this. Obviously, this was a punctuating point that set the next 20 years of your life up."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:13",
      "upperBoundTime": "00:15:00",
      "content": "But, your situation is a little more unusual in that there weren't these other things that were lining up that caused this to happen. If you had to identify one cause that got you landed up in here, and very rarely is it one thing, what do you think it was? I know about your grandfather, I think that was a significant part."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:15:00",
      "upperBoundTime": "00:16:18",
      "content": "I think a single parent household. See, one thing I learned since being incarcerated, if you look at statistics and you look at more households that has a father figure in their household, that male in that household is less likely to go to jail than that single parent household."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:15:00",
      "upperBoundTime": "00:16:18",
      "content": "And, I don't put nothing on my father, cause I, for years, I didn't have no Cleothus:ect for him, didn't want to visit, didn't even want to talk to him. But I got over it, I forgave him for that. I was harsh on him because I'm like \"Man, you walked out on my mom when we was little."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:15:00",
      "upperBoundTime": "00:16:18",
      "content": "I mean, you were semi-pro, I read all the articles about you, at Grambling State University you were this big time running back.\" But he had a drug problem and, that caused him to set him back from reaching his goals. And I'm talking about probably until 2010, I didn't want to visit him, and I finally forgave him. Around 2010 was the first time we sat down and talked, and I told him I forgive him and I love him. And we been in contact ever since then."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:18",
      "upperBoundTime": "00:16:20",
      "content": "Okay, and what's he doing?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:16:20",
      "upperBoundTime": "00:16:38",
      "content": "Well he had an accident and now he's kind of getting around on a cane, but he's retired. He's a deacon in a local church. And he's been dad, he's been drug free so I'm happy for him."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:38",
      "upperBoundTime": "00:16:42",
      "content": "That's good, that's good. Did you ever have an issue with drugs and alcohol?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:16:42",
      "upperBoundTime": "00:16:45",
      "content": "Not on the streets."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:45",
      "upperBoundTime": "00:16:45",
      "content": "But here?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:16:45",
      "upperBoundTime": "00:16:46",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:46",
      "upperBoundTime": "00:16:55",
      "content": "Sure. I mean there's good reasons for it. Can you tell me a bit about that?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:16:55",
      "upperBoundTime": "00:17:59",
      "content": "I think, like I told George, the drugs, prison to me was a means of trying to escape. Trying to escape the realms of reality that I'm in Angola with a life sentence and you stuck. At the time, the laws was tough. They wasn't allowing us out, you was doing life and it looked like you was going to die here. Because when I come through the gate, Warden Burl Cain said \"85% of y'all going to die here.\" And I never took it at that I mean, I'm gone die here at Angola one day."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:16:55",
      "upperBoundTime": "00:17:59",
      "content": "So the drugs were a means of escape, trying to accept the reality of \"Man, I'm in Angola.\" Instead of just taking the sheet, putting it around your head and killing yourself, you take the drugs to escape, to La La Land for 4-5 hours or whatever it may be. I'm not saying its right."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:59",
      "upperBoundTime": "00:18:08",
      "content": "I get it. I mean, it makes sense to me to want to escape somehow. It's a coping mechanism, for sure. What was your drug of choice?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:18:08",
      "upperBoundTime": "00:18:59",
      "content": "Well, at first, it was marijuana. That was when I first got here. But it graduated and graduated and graduated and before I know it, I'm like \"dang,\" I'm looking at my dad, I look at my dad and I say now, \"you became a mirror image of your dad.\" His drug of choice was coke; hard drugs. And as I looked at myself I said now \"You becoming him."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:18:08",
      "upperBoundTime": "00:18:59",
      "content": "How can you stay mad at him and look at you?\" And that kind of what draw me to him and we sat down at the visit table and I explained to him what I was going through. He was crying, I was crying and he say, \"Son, I'm going to be praying for you, you can get off that.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:18:59",
      "upperBoundTime": "00:19:01",
      "content": "Was that a turning point for you?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:19:01",
      "upperBoundTime": "00:19:45",
      "content": "Yeah, that basically was the turning point, seeing him crying at visiting, telling me \"this not the life you're supposed to be living.\" And especially on drugs, in jail, he said no. And we were weeping together."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:19:01",
      "upperBoundTime": "00:19:45",
      "content": "And I kind of like it looked like my door start revolving. And that's what really kept me in and out of bad situations around here as far as in and out the cellblock, and not in population like I should have been. For the most part. I'm talking about the severe, the hard drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:45",
      "upperBoundTime": "00:19:48",
      "content": "And you've had a few setbacks since then?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:19:48",
      "upperBoundTime": "00:20:48",
      "content": "Right, like when I got out the cellblock this time, I took the thing for a change and saw George, he said \"You want to do an interview with Loyola?\" I said, \"What kind of interview George?\" He said, \"Your life story, things you did at Angola.\" I said, \"Well, I'm gone be truth, I'm not gone lie or nothing.\" He said, \"That's the type of interview we want.\" I said, \"Well, put me on put me on the call.\" And he say, \"Well, that's what I'm do.\""
    },
    {
      "speaker": "Cleothus:",
      "time": "00:19:48",
      "upperBoundTime": "00:20:48",
      "content": "I look more up to George as my mentor. Me and George used to be bed partners, years ago, back in '04 and I used to look at him like I see his progress over the years, and I saw it then. I wanted to I even tried seminary. But I stepped down because I told Ms. at the time, \"I'm not gone play no games with God, Ms\" I'm not living right, so I'm going to get out of seminary school. And I got out."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:48",
      "upperBoundTime": "00:20:50",
      "content": "Do you think you are ready to go back?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:20:50",
      "upperBoundTime": "00:21:00",
      "content": "I think I could go back now and pass with flying colors. Back in 2000, 2001, no, I wasn't ready."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:00",
      "upperBoundTime": "00:21:02",
      "content": "Are you planning to?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:21:02",
      "upperBoundTime": "00:21:02",
      "content": "Well, I'm going to get with George because it's going to take one of them to talk to the administration to allow me in but with my past record they wouldn't just allow me in."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:02",
      "upperBoundTime": "00:21:16",
      "content": "And that's a past record mainly around drugs, is that correct?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:21:16",
      "upperBoundTime": "00:21:24",
      "content": "Right. Drugs and not being a model prisoner. Getting in trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:24",
      "upperBoundTime": "00:21:26",
      "content": "Do you have trustee status at this point?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:21:26",
      "upperBoundTime": "00:21:56",
      "content": "No, right now, I just got me a job and I'm doing better. I mean, I'm doing a lot better. I'm not the old Price, I say I'm not the old Price and a lot of people say, \"Oh, he just pulling our leg.\" But I know me, I know even at the job I'm on right now. A lot of guys, you can tell, they're looking like 'man, I see a little change in you."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:56",
      "upperBoundTime": "00:22:00",
      "content": "Have you always been a believer in God?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:22:00",
      "upperBoundTime": "00:22:21",
      "content": "I was raised in the church since I was this high. But, we choose to venture off down the wrong path. I'm a believer in God, I believe there's a God, I believe there's a Jesus Christ. I mean, how could I made it all these years I'm not I ain't made it on my own."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:21",
      "upperBoundTime": "00:22:46",
      "content": "Sure, sure. So let me ask you this: your grandfather's passing was clearly a pivotal moment for you, and you dropped out of school, you go to basic training. If this particular night, if none of you needed to pee, or for whatever reason, there was no beef with anybody, and this night didn't happen."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:22:46",
      "upperBoundTime": "00:22:47",
      "content": "I wouldn't be here"
    },
    {
      "speaker": "Marcus",
      "time": "00:22:47",
      "upperBoundTime": "00:22:52",
      "content": "Right, and can you tell me how you imagine your life would've continued?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:22:52",
      "upperBoundTime": "00:23:18",
      "content": "Well I really feel, believe, that I would have went on back to Southern, cause we was on spring break, and I would've finished school. I would have finished school, who knows, I might have been playing for the Saints, I might have been an NFL star. I really can't say."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:18",
      "upperBoundTime": "00:23:21",
      "content": "Right, I mean none of can, I was just asking you to."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:23:21",
      "upperBoundTime": "00:23:35",
      "content": "I really feel like, that's probably the direction I would've been heading. Because, like I say, all my life, I wanted my mom and my sister out of them apartments."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:35",
      "upperBoundTime": "00:23:42",
      "content": "Right, sure. What's your relationship like with your mom and sister now?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:23:42",
      "upperBoundTime": "00:23:54",
      "content": "Well, we talk, not as often as we should, but by them having the kiosk machine, I email them as much as I can and when I can."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:54",
      "upperBoundTime": "00:24:17",
      "content": "So, can you tell me, I want to sort of shift gears a little bit and talk about your time here? So, after this charge, you spent some time, I imagine, in the Parish jail, as you're going through the whole procedure. Do you remember the bus ride that you took to come here?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:24:17",
      "upperBoundTime": "00:24:34",
      "content": "Yeah, I remember the bus ride from Bastrop to Wade, then from Wade to here. That was, to me, the longest bus ride I ever been on. Because this is unexpected. You don't know what to expect."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:34",
      "upperBoundTime": "00:24:35",
      "content": "What's going on, through your head at the time?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:24:35",
      "upperBoundTime": "00:26:07",
      "content": "You got all type of thoughts, I mean, Angola, the bloodiest penitentiary am I gone have to kill somebody down there? Or, you don't know, you got all types of wild thoughts going through your mind. I mean, I had all types of thoughts going through my mind. Even when we pull up at the front gate, I'm looking over the 18,000 acres, I'm like, I'm talking to God and I know he hears me but, it's all type of wild thoughts because you don't know."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:24:35",
      "upperBoundTime": "00:26:07",
      "content": "And even when I got to my housing unit, I'm waiting on my cell mate to come to see who he is, or what he is, because I'm ready right then, to just, we gone duke it up right then cause I'm not going to sleep unless we got some type of understanding. I mean, that's how I feel, always, since August 10th, 1998 when I came on this farm. I'm not gone be the one to get jumped on, I'm not gone be the one to get raped, or beaten, we gone get some understanding right here and right now."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:24:35",
      "upperBoundTime": "00:26:07",
      "content": "And my cellmate, when he come off the yard, he sensed the aggression in me. He was like, \"Oh look man, I know you just got here, it's not like y'all think it is.\" And me and him become the best of friends and now he on the street, in New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:07",
      "upperBoundTime": "00:26:11",
      "content": "So, what were your first few months here like? Did you have to work in the field?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:26:11",
      "upperBoundTime": "00:26:42",
      "content": "Oh, man, I was 256 pounds when I got here. In the first 3 months, did me some justice, I got all that fat off. In the Parish you gain a lot of weight, eating, eating, eating, and, them first 3 months in that field, it's hot, you swinging that hoe, you scraping the dirt, so it knocked a lot of that fat, that excess off me, and kind of shipped me back into shape."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:42",
      "upperBoundTime": "00:26:53",
      "content": "Can you describe that person to me? The 20 year old Price. The one who first came here."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:26:53",
      "upperBoundTime": "00:28:14",
      "content": "He was a likeable person, I mean, he always tried to help others, and he wasn't into mistreating others. He just got himself caught in a bad situation. And after 22 years later, had he known himself, he wouldn't be in that situation. That's another thing where I keep bringing my grandfather up because he said \"Growing up to be a man.\" See, I wasn't a man that night, because a man could have walked away and been like \"even if I heard the click, didn't nothing fire.\""
    },
    {
      "speaker": "Cleothus:",
      "time": "00:26:53",
      "upperBoundTime": "00:28:14",
      "content": "He was drinking a little bit, maybe he was tipsy. I could've easily just took the 380, \"Man, sit down, you drunk.\" But I wasn't a man that night, I was still a little boy, I was still in the adolescent state of mind. I grew up to be a man while in jail. I had to find myself while in jail. I really got a chance to understand who I was while in jail. When I was on the street I didn't really know Cleothus Price. I learned myself while incarcerated."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:14",
      "upperBoundTime": "00:28:24",
      "content": "Right, because you were so young. What's your typical day like now? What's your routine? What does your day look like when you get up in the morning until you go to bed?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:28:24",
      "upperBoundTime": "00:28:24",
      "content": "Typical day, I get up, brush my teeth, wash my face. On work days, like today, I get up at 4:30 am, when the count clears I get a pass, I head to work."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:24",
      "upperBoundTime": "00:28:38",
      "content": "What's work?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:28:38",
      "upperBoundTime": "00:28:43",
      "content": "It's at the Transitioning Unit, over there at the TU, beside the hospital."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:43",
      "upperBoundTime": "00:28:45",
      "content": "What do you do there?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:28:45",
      "upperBoundTime": "00:29:19",
      "content": "I feed, I serve trays, keep the canteens clean, and assist the security sometimes when they have knuckleheads that I know. Cause I used to be over there and, you have to really see TU to really understand TU. It could be someone barbaric, it could be someone wild, because they have guys that, they'll throw human feces on the orderlies or the freeman. They'll throw their tray out on the hall."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:19",
      "upperBoundTime": "00:29:21",
      "content": "Yeah, describe it for me. What's going on over there?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:29:21",
      "upperBoundTime": "00:30:39",
      "content": "It's like, if you don't put pears on they try and they supposed to have pears on they tray, the offender might just throw the tray against the wall. Or, you don't pass to wait for one of them, they might throw feces on you. It's constant cursing, constant like I said, it's a barbaric environment, unless you got control within you. And, the ones that's in those cells, if they know you, because like I said, I done been there."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:29:21",
      "upperBoundTime": "00:30:39",
      "content": "They know me, and some of the security know me as well, so they feel as though I can go and talk to some of the guys and control the situation. Like I say, sometimes I have to do, for me, my work partners, and sometimes the security. And I just asked a brother, \"Why you want to throw feces on an orderly, why you want to throw feces on the freeman or the freewoman?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:29:21",
      "upperBoundTime": "00:30:39",
      "content": "That's not gone get you nowhere, that's only gone get you gassed down, or the tag team, or the goon squad, coming in there, jumping on you, no reason at all. When, if it's a pear, I can go get you a pear and put it on your tray. Where if it's something dealing with an officer, just talk to the officer.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:30:39",
      "upperBoundTime": "00:30:42",
      "content": "Yeah. I mean, I also imagine that a lot of it is just built up frustration."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:30:42",
      "upperBoundTime": "00:31:21",
      "content": "Basically. Because I done been through it I done been on both sides. And I know that being in the cage and out the cage, but in the cage, you feel like the frustration. You go to bumming and banging and banging on that cell or that door, then the officer's going to come see what you want. And in the mind, in the cage, that's all they Cleothus:ect. I mean that's how they feel. I done heard them say that, I done even felt that way in the cage. But, at the end of the day, we wrong."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:21",
      "upperBoundTime": "00:31:25",
      "content": "So how long is your job? How long does that take?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:31:25",
      "upperBoundTime": "00:31:52",
      "content": "Well, normally its 12 hours a day, because you got three tries, you got breakfast, you got lunch, and you got dinner. So, by me being on the interview, my work partners, they feeding them. When I leave from here I'm going to feed, last time, one of them wanted to go to the canteen and wanted to take the day off early, I be like \"look man, go on down,\" cause I wasn't there for lunch."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:52",
      "upperBoundTime": "00:32:07",
      "content": "Well, thank you for doing this. So are there some other organizations that you've been part of here? You said something about the Dale Carnegie, but there's always certifications that you can take and all these different clubs, have you participated in any of them?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:32:07",
      "upperBoundTime": "00:32:39",
      "content": "I try to participate in every self-help organization that I can to better myself. From DC to Sober Group, I'm trying to get Joy to put me in Malakai before he leaves. Anything where you can get a certificate to better your record or show that you're trying to better yourself is a big plus in this environment."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:39",
      "upperBoundTime": "00:32:46",
      "content": "What do you think, how has all of this impacted your family?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:32:46",
      "upperBoundTime": "00:33:19",
      "content": "I think, it took a toll on my mom. Because when it first happened, Ma had a jet black hair on her head. And about 8 to 10 years down on this journey, her hair is grey like that on my chin. That's why I always tell her I feel bad, I feel bad for bringing them through this, cause this not their journey."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:19",
      "upperBoundTime": "00:33:24",
      "content": "Well, I mean, it kind of is now. The family goes through the whole thing with you."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:33:24",
      "upperBoundTime": "00:33:31",
      "content": "Right. But it make me feel bad by putting them through this."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:31",
      "upperBoundTime": "00:33:35",
      "content": "So you think your mom has been the most impacted by it?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:33:35",
      "upperBoundTime": "00:34:48",
      "content": "I would say so, because it lead her to drink, something she never done. I never saw mom drink when I was coming up as an adolescent. And, it actually took my oldest son to tell me, about 6 months ago. He was out in Atlanta with her, and he was like, \"Dad, I went out there this summer, I was walking Grandma Shirley around the neighborhood helping her lose weight, but, it's the alcohol. She on the alcohol Daddy, I don't know where it's coming from.\""
    },
    {
      "speaker": "Cleothus:",
      "time": "00:33:35",
      "upperBoundTime": "00:34:48",
      "content": "As soon as he told me that, I knew where it was coming from: it was years of worrying about her child being incarcerated. And it made me feel bad, like I say, because I'm driving her to doing something I never saw her doing I never saw that woman drink a wine bottle the 20 years I was out there I never saw her drink. Now, I saw my grandfather drink, but I never saw her drink. That's something she didn't do drink or drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:48",
      "upperBoundTime": "00:34:53",
      "content": "Sure. What's the worst thing that you've dealt with here at Angola?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:34:53",
      "upperBoundTime": "00:35:35",
      "content": "Man, I would say that the worst thing I've dealt with, no aggravated fights or nothing like that, like I say, probably the drugs. The drugs, cause like I said, I haven't seen dealing with drugs, I've seen pretty much seen it all. I mean, they're sharing the syringes, that's deadly, you taking a chance, you're putting yourself at risk for death. That's probably the worst."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:35",
      "upperBoundTime": "00:35:47",
      "content": "Let's say, when you're released from prison, what's your life going to look like? Paint me a picture, what's the next chapter of your life going to look like, do you think? How do you envision it?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:35:47",
      "upperBoundTime": "00:37:10",
      "content": "Well, I pretty much it's not a vision, I pretty much been formatting my first year. I got a pastor Roosevelt Wright out of Monroe, he's the owner of the Excellent Academy, he's the owner of the Free Press newspaper, and he's the pastor at Tabernacle Baptist Church, one of the biggest churches in Monroe. I've written him, I was in his Boy Scouts troop when I was a little kid, my son followed after me, he made Eagle Scouts, something I didn't make but, he said he would fund me under a nonprofit organization under his, church."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:35:47",
      "upperBoundTime": "00:37:10",
      "content": "To go around, talking to the inner city youth, elementary, junior high, high school, share my experience while I was in jail and just teaching them about going down the wrong path, choosing the wrong journey to go on. And I'm all for that because I would not want no child of mine or nobody else's doing 22 years in prison if we could teach going down the right path. And I would just instill what my grandfather taught me at a young age: education, education, education."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:10",
      "upperBoundTime": "00:37:16",
      "content": "Of all of the things that you've done, what are you most proud of?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:37:16",
      "upperBoundTime": "00:38:14",
      "content": "I'm most proud of, I'm 12 hours away from an associate's degree at Ashford University. I probably would've been finished had it not be for backs and forth in the cells. So, to me, between the times I'm left here, I would like to finish it I would like to obtain that associate degree so I have that as something to take out there with me."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:37:16",
      "upperBoundTime": "00:38:14",
      "content": "But I do have a culinary arts where I, like I told Pastor Wright, I would like to go offshore to be a cook, direct deposit all my monies to the bank and have days off on the water, for 90 days, that way I don't have to worry about no funds, no type of thought of coming back to prison. If I go out there and go offshore for 90 straight days, as a cook, I know one thing I have some revalues when I come in."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:14",
      "upperBoundTime": "00:38:33",
      "content": "That's true. So, Cleothus, thank you for doing this interview. Usually you would have had a little bit more preparation but in terms of giving your life story, is there something that I should have asked you that I didn't, or something that you'd like to talk about your experiences that we haven't talked about?"
    },
    {
      "speaker": "Cleothus:",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "Well, I must say this, and I don't know how it's going to sound cause I'm just going off the fly and off my heart and how I'm feeling right now, and I know deep down, I come from a good background, I come from a good family. My mom did well: she raised me in the church, she did all she could for me and my sister. And, like I say, according to the law, I committed a crime on March 25th, 1996. That changed my life all together."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "I went from an 18-19 year old young boy to a moated man. Now I had to man up and, through everything I've done, I mean, coming up as a teenager, the basketball, the football, the state championship track meets and all that, couldn't take back March 25th, 1996. And, I don't lean on nobody for no support, I don't want no sympathy, I don't want to feel sorry I don't want nobody to feel sorry because I took for full Cleothus:onsibility."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "When I told the judge, 1998, I plead guilty to 2 counts of first degree murder, I took full Cleothus:onsibility as a young man, for the crimes I committed. That's something a lot of people don't discuss. See, on thing about Cleothus, I got to be truthful and real with myself."
    },
    {
      "speaker": "Cleothus:",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "A lot of them went to trial and did this and that. I committed a crime and I hope at the end, when my journey, meaning my life, expires, God got some kind of way to forgive me and let me in the holy gates of heaven. Being a man that day and saying, \"Your honor, I did that, I plead guilty.\" That's where my life at right now, getting myself right with God, to enjoy eternal life."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:03",
      "content": "That's a good place to stop."
    }
  ]
}
