{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:01",
      "content": "Danny Sermon Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:01",
      "upperBoundTime": "00:00:05",
      "content": "Tell me a little bit about your family coming up."
    },
    {
      "speaker": "Danny",
      "time": "00:00:05",
      "upperBoundTime": "00:02:34",
      "content": "My dad and my mom, when I was 6 months old, divorced. I went to live with my dad's parents in a little town called Glenmore, which is south of Alexandria, north of Oakdale, on HWY 165. I lived with them till I was 9."
    },
    {
      "speaker": "Danny",
      "time": "00:00:05",
      "upperBoundTime": "00:02:34",
      "content": "And then my dad remarried, so I went to live with him and my stepmother. Which to me was probably the start of bad things in my life because I was a happy kid, up until then. Me and my step, I had a stepsister and that never really works out a lot of times."
    },
    {
      "speaker": "Danny",
      "time": "00:00:05",
      "upperBoundTime": "00:02:34",
      "content": "Me and my stepmother never really got along. I had problems with her for a long time, even after I was gone from home. And then she did some things to me, I mean not sexually or anything like that but she beat me a couple of times real bad when I was a kid. And I had problems with that for a long time. And she lied on me a lot to my dad and it caused some major problems."
    },
    {
      "speaker": "Danny",
      "time": "00:00:05",
      "upperBoundTime": "00:02:34",
      "content": "When I was 15, and I was rebellious I'm not going to say I wasn't because I was rebellious, I went to reform school. For fortunately I didn't stay, I was only gone for 6 weeks. I was an honor roll student all through high school and everything. But the problem with that kind of upbringing that I had is that my dad moved around a lot, we moved a lot."
    },
    {
      "speaker": "Danny",
      "time": "00:00:05",
      "upperBoundTime": "00:02:34",
      "content": "I mean, I went to, up until the 3rd grade I lived with my grandparents so I went to school at Glenmore. Then we moved to Houma, then we moved to Oakdale, then we moved to Glenmore, then we moved to Lake Charles, then we moved back to Oakdale. So I went through all these different schools and everything and that's not really good for a kid either because I feel like."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:34",
      "upperBoundTime": "00:02:37",
      "content": "You have to adjust over and over again."
    },
    {
      "speaker": "Danny",
      "time": "00:02:37",
      "upperBoundTime": "00:03:20",
      "content": "Over and over again you have to readjust. And you never really made any true friends like that because you don't have time to make friends when you're moving continuously."
    },
    {
      "speaker": "Danny",
      "time": "00:02:37",
      "upperBoundTime": "00:03:20",
      "content": "Since I've been locked up from 1988 to 1992, I lost all four of my grandparents. My mother, my real mother; and my dad; and everybody that really meant anything to me on the streets, I lost all of them. They all died within a 4 year period. Some of them on Christmas day which was bad in itself."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:20",
      "upperBoundTime": "00:03:21",
      "content": "That must have been difficult to deal with behind bars here."
    },
    {
      "speaker": "Danny",
      "time": "00:03:21",
      "upperBoundTime": "00:03:28",
      "content": "It's extremely difficult."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:28",
      "upperBoundTime": "00:03:31",
      "content": "Sure, it's difficult anywhere"
    },
    {
      "speaker": "Danny",
      "time": "00:03:31",
      "upperBoundTime": "00:04:19",
      "content": "The way I've survived all these years is I live day to day and try to do my best, whatever I can do. I wasn't always like that. When I first come here, my life was, I was still thought I was bad and all that. I was young."
    },
    {
      "speaker": "Danny",
      "time": "00:03:31",
      "upperBoundTime": "00:04:19",
      "content": "I was 23 when this crime was committed. I got, they caught me just before my 25th birthday. That, and I was still young and stupid. I don't think I really grew up until I was about 28, 29 years old and I was already here. Just things changed about it but."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:19",
      "upperBoundTime": "00:04:22",
      "content": "Did you have a relationship with your mother?"
    },
    {
      "speaker": "Danny",
      "time": "00:04:22",
      "upperBoundTime": "00:04:57",
      "content": "My real mother? Actually I never saw my real mother but three times in my entire life. Now I have two half-brothers with her. One of them , the youngest one, he's come to see me a couple times since I been locked up but that was a long time ago."
    },
    {
      "speaker": "Danny",
      "time": "00:04:22",
      "upperBoundTime": "00:04:57",
      "content": "He lives in Germany. And he's got a family and four children. And he really doesn't have the time or the means to travel all that way. He's a professor at a university over there, he teaches English to German students."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:57",
      "upperBoundTime": "00:05:08",
      "content": "So the adults that took an interest in you when you were coming up, you consider your grandparents had an influence?"
    },
    {
      "speaker": "Danny",
      "time": "00:05:08",
      "upperBoundTime": "00:06:06",
      "content": "My grandmother was the most stabilizing person in my life. My dad's mom. She was, she was the stabilizer in my life. I'll never forget she told me something when I was in high school, she told me, she said, \"Boy if you don't change your ways, you're going to end up on the river.\" And didn't have a clue as to what she was talking about but now I know."
    },
    {
      "speaker": "Danny",
      "time": "00:05:08",
      "upperBoundTime": "00:06:06",
      "content": "Because she knew, we knew some people that had been to Angola back in the 50s and 60s. And she told me that, she said that, and she reminded me about it after I was locked up. She said, \"Didn't I tell you that? If you didn't change your ways you're going to wind up on this river.\" And then I knew what she was talking about."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:06",
      "upperBoundTime": "00:06:09",
      "content": "So what led up to that fifth of September?"
    },
    {
      "speaker": "Danny",
      "time": "00:06:09",
      "upperBoundTime": "00:08:12",
      "content": "Drugs, alcohol. I mean the whole thing that happened, it was drug related and it was behind drugs. And the way it came about is there were just threats passed back and forth prior to that time. And the night it happened my fall partner George, he was, he hadn't been out of Leavenworth that long actually."
    },
    {
      "speaker": "Danny",
      "time": "00:06:09",
      "upperBoundTime": "00:08:12",
      "content": "He was gung ho, so was I, we were drinking a lot, we were doing a lot of drugs, and stuff, cocaine, crystal meth, lot of Quaaludes, lot of pot and stuff like that. When you get to doing that, you really don't realize a lot of the things that you're doing. And now that I look back at it, I mean and I can't use the drugs and alcohol as an excuse because we did what we did. But it was mitigating factor."
    },
    {
      "speaker": "Danny",
      "time": "00:06:09",
      "upperBoundTime": "00:08:12",
      "content": "I mean because I don't feel like I would've done a lot of the things that I did, during that time period if I had been straight. Because there was times that I didn't remember what I did. And I didn't, it's not that I did anything wrong during those times because I didn't cause I was at home."
    },
    {
      "speaker": "Danny",
      "time": "00:06:09",
      "upperBoundTime": "00:08:12",
      "content": "But there was periods of my life during that period of time that I was doing so much alcohol and drugs that I would just literally be blank, not remember what happened the night before or anything like that, and had never left my house but I couldn't remember anything that happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:12",
      "upperBoundTime": "00:08:26",
      "content": "So, I'm sure you're quite familiar with this, but usually when somebody is turning very heavily to drugs and alcohol, they're trying to escape something. Do you think you were trying to escape something?"
    },
    {
      "speaker": "Danny",
      "time": "00:08:26",
      "upperBoundTime": "00:08:38",
      "content": "I've thought about that for years. It's a good possibility but I can't really put my finger on what it would've been."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:38",
      "upperBoundTime": "00:08:49",
      "content": "Sure. So let's, if you, can you go back and think in time for that first ride through those gates up here on the river? Do you remember what the day was like?"
    },
    {
      "speaker": "Danny",
      "time": "00:08:49",
      "upperBoundTime": "00:08:51",
      "content": "Scared."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:51",
      "upperBoundTime": "00:08:52",
      "content": "Scared, yeah."
    },
    {
      "speaker": "Danny",
      "time": "00:08:52",
      "upperBoundTime": "00:08:57",
      "content": "Yeah, there's always a fear for something like this"
    },
    {
      "speaker": "Marcus",
      "time": "00:08:57",
      "upperBoundTime": "00:09:00",
      "content": "And Angola was a very different place in 1977, '79"
    },
    {
      "speaker": "Danny",
      "time": "00:09:00",
      "upperBoundTime": "00:10:10",
      "content": "It was. It was a totally different place then than it is now. I know there's a lot of people that say Warden Cain or this one or that one changed it, but I think the changes in this prison really started with Warden Maggio. Because he's the one that really started the changes."
    },
    {
      "speaker": "Danny",
      "time": "00:09:00",
      "upperBoundTime": "00:10:10",
      "content": "And we've had some good wardens over the years. Warden Maggio was good, Warden Butler, Hilton Butler was a good warden, Warden Whitley was a fantastic warden in my opinion. Cain was, he was okay. Warden Vannoy is a good warden. I mean I've known Warden Vannoy for almost 40 years now."
    },
    {
      "speaker": "Danny",
      "time": "00:09:00",
      "upperBoundTime": "00:10:10",
      "content": "We basically came here about the same time. We both kind of grew up here. And I've got a lot of respect for Warden Vannoy. And he talks to me pretty regular because of my standing within the community."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:10",
      "upperBoundTime": "00:10:41",
      "content": "Sure, sure. Let's talk a little bit about that because I want to try to shine a little bit more light on some of the transformations that happen here. What, if you, a lot of times it said it took you about 28 to grow up. That's probably true for most people."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:10",
      "upperBoundTime": "00:10:41",
      "content": "But I think that some people have this moment of transformation, like something clicks, it could be a person, an event, some kind of turning catalyst. Was there anything like that for you or was it more gradual?"
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "It was almost like it happened over night. On my 28th birthday, in Angola you can get anything that you can get on the streets. On my 28th birthday, I got rip-roaring drunk, and smoked a few joints. And the next morning I had to get up and go to work. And I had one of the most ferocious headaches and hangovers that I'd ever had in my life."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "And it's not the hangover or anything like that, that made me wake up. It's that something happened that next day to me. I was in field lines and stuff like that. I work in cellblock. And I'm looking at the trustees at this prison and I'm in a cellblock. And I'm saying to myself, what am I doing?"
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "And a few years later I did take AA and substance abuse program here. But I found myself on that day working some of the AA steps without realizing it. I really looked at myself and I didn't like what I saw. And I looked at my past 6, 7 years and I didn't like what I saw. And that was the day I started to change."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "And yeah you have slips and falls along the way, but I don't think I ever went back nowhere close to what I was before. I know it really well that I haven't done it in the last 25 years. I don't partake of any kind of alcohol or any kind of drugs even when it's around me. You can't never totally get away from it, even here. But I don't partake of it and I don't associate with those kind of people no more than what I have to."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "Now the change that came over me from that issue was that, it was within a couple of years that I came to the main, I mean I got moved around some when I first came here, most people do."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "I was at old Camp A in the cellblocks. I went to Camp D I was back there for 7 or 8 months and I got moved back to Camp A upstairs in the dorm, and then I got moved to the main prison in '84 I want to say. Well that's when I started getting involved with some of the inmate organizations."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "One of them was LJYA and the other one was the Main Prison Vets, back during that time. And later on I became the president of both of them at the same time."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "At one time I was the president of both LJYA and the Main Prison Vets. The administration asked me to give one of them up because this was an inmate with too much political power you might want to say. So I gave up the Main Prison Vets at that time and was president of LJYA."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "We used to raise money through our concessions, we had the pizza concession, and we raised money for the Louisiana Juvenile, I mean for the Lafayette juvenile facility. We used to give those 5, 10,000 dollars a year every year to the boys' home there."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "We actually used to go to the boys' home and visit with the kids there. And then along that time's when they started closing down a lot of the camps around the prison, and everything. So it caused a lot of movement within the trustees. And you have a lot of changes here at Angola through administrative changes, or whatever it may be, but you just push forward and you go on with what you're trying to do."
    },
    {
      "speaker": "Danny",
      "time": "00:10:41",
      "upperBoundTime": "00:16:23",
      "content": "A few years later I was at Camp J bass and I was an integral part of the club there. And we used to sell food at Butler Park, which was the trustee park. And we had a really good club there and made some good progress there. And then later on I got moved to RC, which is up front which is closed down now. And I was the president of the club there for a while and did real well there."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:23",
      "upperBoundTime": "00:16:25",
      "content": "What's your typical day like now?"
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "A typical day now? Well I get up in the morning, 5:30, go to pill call and get my insulin shot. Eat a snack or something afterwards and go to work. I work at the plumbing shop. I'm the clerk at the plumbing shop and I'm also, I operate the unimog which is an army machine that has a front end loader and a back hoe on it. So I do that."
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "Actually I, when I came here, I was a heavy equipment operator, when I first got locked up. So that's my 7:00 to 2:00 job. Then I go to the camp and we have a, the veteran's organization back there which is the Camp F Vets and it's also a VVA Chapter 689, which is a Vietnam, we're a nationally registered charter, chapter. We have over 250 members and that starts my second job."
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "Plus I have a third job, a hobby craft because I finance myself. I have nobody to give me anything, so everything that I want and desire I make out of hobby craft. Rodeos and sales through the year and stuff like that. I build rocking chairs and swings, and tables and stuff like that. So I stay busy."
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "And staying busy, and that old saying an 'idle mind brings trouble.' Well my mind's never idle, I promise you that. I'm always trying to do something positive. Just like this afternoon, we have a Louisiana Veterans Foundation is coming from St. Francisville to give us some kind of presentation. And we're also doing a presentation to the War Veterans' home in Jackson. We built a bunch of boxes, shadow boxes, for them to put their medals and flags and stuff like that in. And we're presenting them to the War Veterans' Home in Jackson this afternoon at 1:00."
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "My treasurer and I, we were, Warden Vannoy allowed us to go to the mid-winter state Vietnam Veteran's of America Convention this past February in Baton Rouge. It was held at the Drury Inn. And it was a very positive, I mean, it's like we were free for a day, I mean don't get me wrong we had security and sponsors with us. But it was kind of like being free for a day."
    },
    {
      "speaker": "Danny",
      "time": "00:16:25",
      "upperBoundTime": "00:20:01",
      "content": "When you're in a position like that, you have to act accordingly and we do. Last September, the Vietnam Moving Wall came to St. Francisville. 18 veteran's from here at Angola, 10 from Camp F and 8 from the main prison, we went and put the Vietnam Moving Wall up, stayed all day, and four days later, went and took the Moving Wall down."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:01",
      "upperBoundTime": "00:20:05",
      "content": "Well you're a very trusted person in this community. You clearly earned that."
    },
    {
      "speaker": "Danny",
      "time": "00:20:05",
      "upperBoundTime": "00:21:07",
      "content": "Yes. You have to, I mean, it takes a while to earn the kind of trust that you do have here. I mean Warden Vannoy has approved for me, myself, and Timothy who is the treasurer of the organization, our chapter, to attend the national convention in New Orleans in August."
    },
    {
      "speaker": "Danny",
      "time": "00:20:05",
      "upperBoundTime": "00:21:07",
      "content": "So August 11 and 12 we will be in New Orleans at the Marriott and Sheraton hotels for the national convention. Actually Warden Young will probably be with us. Mr. Abbott will probably be with us. Warden Coody has volunteered to go if she needs to. Warden Vannoy himself said he may be there. If he's able to make it, he will go."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:07",
      "upperBoundTime": "00:21:10",
      "content": "What's the name of the convention?"
    },
    {
      "speaker": "Danny",
      "time": "00:21:10",
      "upperBoundTime": "00:21:28",
      "content": "The Vietnam Veterans of America. The national organization. The national convention, which is every 2 years, this year is in New Orleans. This will be the first time any offenders has ever been to a national convention."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:28",
      "upperBoundTime": "00:21:32",
      "content": "So I think I can guess this but can you tell me what you think you're most proud of?"
    },
    {
      "speaker": "Danny",
      "time": "00:21:32",
      "upperBoundTime": "00:23:12",
      "content": "My last year and a half with what I've done with the veteran's chapter here at Angola. I mean don't get me wrong, there's a lot of things that I'm proud of because last year our chapter did over $12,000 in donations."
    },
    {
      "speaker": "Danny",
      "time": "00:21:32",
      "upperBoundTime": "00:23:12",
      "content": "Every Saturday morning, we send two or three guys to the main prison hospital, or to the hospital. They go over there, we send fruit, we buy bananas and cosmetics and different things that they need. We send them candy or whatever the guys that are in hospice."
    },
    {
      "speaker": "Danny",
      "time": "00:21:32",
      "upperBoundTime": "00:23:12",
      "content": "Actually we do it for the whole ward too. And we do that every Saturday. And not long ago along with the Louisiana Veterans Foundation out of St. Francisville, in conjunction with them we fed the whole hospital a meal. We do a lot of good things."
    },
    {
      "speaker": "Danny",
      "time": "00:21:32",
      "upperBoundTime": "00:23:12",
      "content": "We feed, and we just fed death row this past week. The whole 84 people over there, we fed every one of them. We gave them a barbecue beef sandwich, a bag of chips, and a 20 oz. drink. We do that a few times a year."
    },
    {
      "speaker": "Danny",
      "time": "00:21:32",
      "upperBoundTime": "00:23:12",
      "content": "There's a lot of things, we donated $3,000 worth of hobby craft to the VVA State Convention and the Louisiana Veterans Vets Fest."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:12",
      "upperBoundTime": "00:23:24",
      "content": "Yeah that's even more impressive when you think about what it takes to raise that kind of money in prison compared to raising money outside of prison, it's a lot easier to do that."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "It's not easy, don't get, I go outside the organization. We have a lot of people outside the organization that's not veterans that'll actually give us hobby craft and everything because of the things that we do with the money that we make."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "We're always trying to give back. And I feel like we give back more than we receive. It's just, it's good to have that kind of attitude and it's, and we've all tried to change. You have well and bad in everything that's done. But we have honestly tried to change the way we live our lives."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "Someone asked me what I would do when I get out. Well I'm kind of old now, got diabetes, got a crippled arm, I cut that arm real bad on a chop saw about six years ago and I had surgery at Earl K Long and everything. So I don't have full use of my left arm but I've never let it stop me, I don't have duty status. I've always refused duty statuses, because I don't want one. Because I want to be able to work, and I want to be able to move on."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "If I do get out, or when I get out, what I want to do is stay involved with the vets. I would probably go no further than right here in St. Francisville. I've made some really good friends in the area that are veterans. The majority of my friends now, I have no family left, the majority of my friends are veterans."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "And they're willing to help people getting out of here, not just me but any veteran that they can help that's shown progress toward rehabilitation. They're willing to help them people."
    },
    {
      "speaker": "Danny",
      "time": "00:23:24",
      "upperBoundTime": "00:23:24",
      "content": "We have people that go to the pardon board and parole boards that are veterans that speak for us and everything. Our state council, the VVA state council actually comes and sits at the pardon boards every month and are willing to speak for us."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:24",
      "upperBoundTime": "00:25:54",
      "content": "Yeah it's interesting that you would probably continue to do what you do here."
    },
    {
      "speaker": "Danny",
      "time": "00:25:54",
      "upperBoundTime": "00:26:13",
      "content": "I will. My hobby craft here, building chairs and stuff like that, will actually become a job on the streets because I could make good money at that. I could make 7, 800, a thousand dollars a week doing what I do on the streets."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:13",
      "upperBoundTime": "00:26:33",
      "content": "So its 39 years later, when you look back 39 years and you see yourself having served 39 years, 37 years, how do you make sense of that at this point in your life?"
    },
    {
      "speaker": "Danny",
      "time": "00:26:33",
      "upperBoundTime": "00:26:33",
      "content": "I am nowhere near the same person that I was all them years ago. It's not even close. Its daylight and dark. I'm not the same person I was 20 years ago, or even 10 years ago. Life here is hard. And do I have regrets? I have many regrets."
    },
    {
      "speaker": "Danny",
      "time": "00:26:33",
      "upperBoundTime": "00:26:33",
      "content": "I regret that I ever got involved with drugs. I regret the hurt and pain that I've caused my family. I regret especially the pain that I've caused to the victims and their families."
    },
    {
      "speaker": "Danny",
      "time": "00:26:33",
      "upperBoundTime": "00:26:33",
      "content": "You asked me a question a while ago, what was the most meaningful thing that has happened to me? Working with the vets is actually number 2. This is something I wasn't going to talk about, but I will say this now."
    },
    {
      "speaker": "Danny",
      "time": "00:26:33",
      "upperBoundTime": "00:26:33",
      "content": "Last October at the rodeo, the third Sunday, there was a man and a woman walked up to me, and they were in motorcycle vests and stuff like that. And the guy said 'Are you Danny Sermon?' I didn't recognize him, he had recognized me."
    },
    {
      "speaker": "Danny",
      "time": "00:26:33",
      "upperBoundTime": "00:26:33",
      "content": "And he did this and I saw the name on the motorcycle jacket and I knew who he was. It was his nickname, Skeeter. Skeeter was one of my victims. This was a guy that George and I pistol-whipped and left laying on the ground. And when I saw the name I actually backed up a couple of steps because I didn't know what was happening. And we're talking about 39 years later."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:33",
      "upperBoundTime": "00:29:01",
      "content": "Must have been unbelievable"
    },
    {
      "speaker": "Danny",
      "time": "00:29:01",
      "upperBoundTime": "00:29:46",
      "content": "He put his hands up like this he said, \"Danny.\" He said \"I want you to know one thing.\" He said, \"I come here to let that I forgive you.\" He said, \"Can we talk?\" He had his wife with him. His wife's name was Pam. This guy's name, his real name was Brady Farris."
    },
    {
      "speaker": "Danny",
      "time": "00:29:01",
      "upperBoundTime": "00:29:46",
      "content": "Now, that's why I'm saying, because I don't know what he wants to do. He lives up around Toledo Bend, I don't know exactly where, I don't have his address or anything. But this man said he forgave me for what I had done."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:46",
      "upperBoundTime": "00:29:48",
      "content": "That's a gift."
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "It was a blessing. I mean, when I think back about that because he came into my area, we actually sit down and we talked for like an hour and a half. We cried together. We laughed together. We talked about old times before that. Because you got to realize, these people were actually friends, when all this happened. We were friends. He was a friend. The guy that got killed was a friend, Roland Lambers, he was a friend."
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "The other guy, Greg, I forget Greg's last name, but Greg, he, I mean don't get me wrong, we dealt drugs together. I bought from them, they bought from me. But we were still what I classified as friends. And things just got out of hand. It was the reason it all happened."
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "But when Skeeter come and I mean like I said we talked at the rodeo for a long time. And him and his wife Pam were going to watch the rodeo. So at about 10 minutes to 2:00, he said, \"Danny.\" He said. \"We got to go.\" He said \"But I want you to know, I've forgiven you.\" He said, \"I also want you to know you've been locked up too long, it's time you got out.\""
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "And, but during our conversation he said, \"10 years ago I couldn't have done this\" He said \"But today I'm able to do it. I'm able to forgive you.\" And he asked me another question during our conversation. He says, \"Do you forgive me?' I said, \"Skeeter there's nothing to forgive.\" He said \"Yeah there is.\" He said, \"What there is to forgive is that I haven't done this prior to now.\""
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "And him and his wife they ride motorcycles but they're in what they call some kind of ministry. And his life has changed, because of the ministry that he's in. I have a way of getting in touch with him, but I haven't done it because I feel like I need him to make the first move."
    },
    {
      "speaker": "Danny",
      "time": "00:29:48",
      "upperBoundTime": "00:32:41",
      "content": "And he's probably the largest reason that I haven't already put my paperwork in to go on the board. I mean I have a lot of outside support but I would love for Skeeter to be there for me."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:41",
      "upperBoundTime": "00:32:43",
      "content": "Seems like he would be a perfect candidate."
    },
    {
      "speaker": "Danny",
      "time": "00:32:43",
      "upperBoundTime": "00:33:19",
      "content": "He had talked with a lot of other people about me at the rodeo before he came and found me. He was told good things. Because he didn't know what to expect. And I sure didn't know what to expect when I first saw that man. But it was, that's the most important and the biggest change that has ever happened for me in this prison. It meant more than anything else. Because he said \"Danny I forgive you.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:33:19",
      "upperBoundTime": "00:33:21",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "Danny",
      "time": "00:33:21",
      "upperBoundTime": "00:33:53",
      "content": "Long time ago. But I'll never forget. I don't want to forget because it's made me a better person to take the bad and turn it into good."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:53",
      "upperBoundTime": "00:33:56",
      "content": "I so appreciate you sharing these things because it really, this is what it's about. This is what this project's about."
    },
    {
      "speaker": "Danny",
      "time": "00:33:56",
      "upperBoundTime": "00:33:56",
      "content": "Well, if there's any questions you have or anything."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:56",
      "upperBoundTime": "00:34:17",
      "content": "Well let me ask you one last question. What would you like me to ask you, what would you have liked me to ask you that I didn't ask you? What should I be asking folks who are in your situation?"
    },
    {
      "speaker": "Danny",
      "time": "00:34:17",
      "upperBoundTime": "00:36:22",
      "content": "I feel like everybody needs to tell their own story. And I feel like I've just touched the edge of mine. Because there's, this is kind of a dog eat dog world. People ask me a lot of times do you have anybody you trust in prison? And I always kind of joke about it and say, \"Look, I don't even let my right hand know what my left hand's doing.\""
    },
    {
      "speaker": "Danny",
      "time": "00:34:17",
      "upperBoundTime": "00:36:22",
      "content": "But there has to be some trust in this prison. That's like, I could not do what I've done with the veteran's organization without a lot of help. I have a guy that works, well not just one, but I have a lot of guys that work with me doing different things. We have three file cabinet drawers that are full of veterans' DD214's. We have one on every veteran that we have on as a member."
    },
    {
      "speaker": "Danny",
      "time": "00:34:17",
      "upperBoundTime": "00:36:22",
      "content": "Just yesterday we sent in 48 new members from here at Angola to the national level to make them members of chapter 689. I can't, there's no way one person can do what we've done. So there is people you have to trust. But trust doesn't come easy here, it really doesn t. But you cannot do anything without a good core group of people. That's my whole point on that. You got to have people, but people need to tell their own story."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:22",
      "upperBoundTime": "00:36:49",
      "content": "Yes. Well and I thank you for telling yours. And I know we're just going around the edges, that's all we can do, really. It's all you can do. Let me ask you one last question then. Before we started filming, you said that if you were on the outside and you had the option of releasing folks, there's a whole bunch of folks you wouldn't release."
    },
    {
      "speaker": "Danny",
      "time": "00:36:49",
      "upperBoundTime": "00:36:51",
      "content": "That's true."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:51",
      "upperBoundTime": "00:36:54",
      "content": "And there are a whole bunch of folks you would."
    },
    {
      "speaker": "Danny",
      "time": "00:36:54",
      "upperBoundTime": "00:36:55",
      "content": "Okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:55",
      "upperBoundTime": "00:36:57",
      "content": "What do you think is the main difference between those two groups of people?"
    },
    {
      "speaker": "Danny",
      "time": "00:36:57",
      "upperBoundTime": "00:37:36",
      "content": "Change. Some people, a lot of people here have changed and they've changed for the better. Some people never change. But there's a fine line too because you have a lot of people here that are actually mentally ill, okay. I won't go into no details there."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:36",
      "upperBoundTime": "00:37:40",
      "content": "Well there's no question about that"
    },
    {
      "speaker": "Danny",
      "time": "00:37:40",
      "upperBoundTime": "00:39:13",
      "content": "But you have a lot of people here that are actually mentally ill. Now should they be locked up, throw away the key? I don't have the answer to that, I really don't. I don't feel like they should be free but I'm not sure they should be here either. And you have a lot of those. You've got a couple of them on death row. But you have a lot of them around prison. And I don't know the answer, I don't know if anybody does. But I'm not sure this is the answer for that problem either."
    },
    {
      "speaker": "Danny",
      "time": "00:37:40",
      "upperBoundTime": "00:39:13",
      "content": "Some people can change, some people can't. And whether it's a mental failure or whatever, I don't know. Then I think some people, they're just, they're not ready to change yet. And some are never going to change, even though they're not mentally incapacitated."
    },
    {
      "speaker": "Danny",
      "time": "00:37:40",
      "upperBoundTime": "00:39:13",
      "content": "I don't have the answer but I do know this. When Warden Vannoy goes on that pardon board and speaks before that pardon board or that parole board or Warden DuPont or Warden Dodd or Warden Young or one of them speaks for a guy and they speak highly of them, they should listen to what that warden is saying."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:13",
      "upperBoundTime": "00:39:15",
      "content": "They know them well."
    },
    {
      "speaker": "Danny",
      "time": "00:39:15",
      "upperBoundTime": "00:39:37",
      "content": "Right. You made a statement, you should take a guy getting out that's proven himself over the years of being here and put him on the parole board. I don't think they can legally do that, but it would be good to have him as an advisor."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:37",
      "upperBoundTime": "00:39:53",
      "content": "Indeed. Well a warden would have to have an enormous amount of confidence to put his name or her name behind a person because if that recommendation proves not to be a wise one, then no one's ever going to listen to them again."
    },
    {
      "speaker": "Danny",
      "time": "00:39:53",
      "upperBoundTime": "00:39:56",
      "content": "That's true"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:56",
      "upperBoundTime": "00:39:55",
      "content": "So they've got a lot riding on that recommendation."
    },
    {
      "speaker": "Danny",
      "time": "00:39:55",
      "upperBoundTime": "00:39:58",
      "content": "Sure they do."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:58",
      "upperBoundTime": "00:40:00",
      "content": "Sure and that's why it's important"
    },
    {
      "speaker": "Danny",
      "time": "00:40:00",
      "upperBoundTime": "00:40:28",
      "content": "And it's, I don't know how some of the legislatures think. Some are willing to help, some aren't. I know one thing, I cost them a lot of money. Because I'm on 5 or 6 different medications, I take insulin twice a day. I got nerve damage and everything else. So I cost them a lot of money. If they let me out the veterans will take care of me, or I'll take care of myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:28",
      "upperBoundTime": "00:40:32",
      "content": "Right, that's another good argument. Why don't we leave it there?"
    },
    {
      "speaker": "Danny",
      "time": "00:40:32",
      "upperBoundTime": "00:40:39",
      "content": "Appreciate it, the one other thing that I would like to say is this. This state has no differences between your types of murder. Okay, they say, you have first-degree murder, second-degree murder, and manslaughter. Where's the difference."
    },
    {
      "speaker": "Danny",
      "time": "00:40:32",
      "upperBoundTime": "00:40:39",
      "content": "In the state of Louisiana, manslaughter is 40 years. Second degree and first degree murder is a life sentence. No parole. No probation or anything. No chance. 40 years is really not much of a chance either when you're doing 85% of that 40 years, okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:39",
      "upperBoundTime": "00:41:32",
      "content": "And the same offense are for principals. I mean the same punishments."
    },
    {
      "speaker": "Danny",
      "time": "00:41:32",
      "upperBoundTime": "00:42:48",
      "content": "I was convicted as a principal. My fall partner was convicted as the perpetrator. I was convicted 22, well actually I was convicted 3 years later, almost 4 years later as a principal. They, I had a couple of mistrials and stuff like that. They offered me second degree murder but and they said that's a 40 year-life. That's 40 years before I'm eligible for parole. I'm 25 years old, at that time I was yeah 25, 26 years old."
    },
    {
      "speaker": "Danny",
      "time": "00:41:32",
      "upperBoundTime": "00:42:48",
      "content": "How can you tell a 25 or a 26 year old man, that's still young and stupid, what's the difference between a 40 year life or a so-called 40 year life and a natural life? He's going to be 65 when he gets out of prison, if he gets out of prison. That just means he's going to be eligible for parole at 40 years. There's no differential. They need to differentiate between crimes."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:48",
      "content": "Yes. Alright, great."
    }
  ]
}
