{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Dannie Johnson Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Dannie",
      "time": "00:00:00",
      "upperBoundTime": "00:00:35",
      "content": "My name is Dannie Johnson, I've been convicted of first degree murder in 1982. I was 18 years old when I was convicted, and so far I have served 37 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:35",
      "upperBoundTime": "00:00:49",
      "content": "So I'm going to try to learn a little bit more about your life, and start with your childhood, can you tell me a little bit about the folks who raised you."
    },
    {
      "speaker": "Dannie",
      "time": "00:00:49",
      "upperBoundTime": "00:01:01",
      "content": "My mother her name was Florence and my father his name was Irving, and I also have, I got some siblings nine brothers and 3 sisters"
    },
    {
      "speaker": "Marcus",
      "time": "00:01:01",
      "upperBoundTime": "00:01:05",
      "content": "Oh wow from the same two parents?"
    },
    {
      "speaker": "Dannie",
      "time": "00:01:05",
      "upperBoundTime": "00:01:13",
      "content": "Not from the same two parents I think when my dad met my mom he had about I think 4 or 5 kids."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:13",
      "upperBoundTime": "00:01:14",
      "content": "Already."
    },
    {
      "speaker": "Dannie",
      "time": "00:01:14",
      "upperBoundTime": "00:01:16",
      "content": "Already."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:16",
      "upperBoundTime": "00:01:20",
      "content": "Okay and where you are in the birth order of those 9 siblings?"
    },
    {
      "speaker": "Dannie",
      "time": "00:01:20",
      "upperBoundTime": "00:01:25",
      "content": "At the 9 brothers I'm like the third to the youngest one, there's two more behind me."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:25",
      "upperBoundTime": "00:01:27",
      "content": "Okay and where did you grow up?"
    },
    {
      "speaker": "Dannie",
      "time": "00:01:27",
      "upperBoundTime": "00:01:30",
      "content": "New Iberia Louisiana it's about 20 miles from Lafayette."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:30",
      "upperBoundTime": "00:01:37",
      "content": "Yeah so tell me about your parents what kind of folks were they"
    },
    {
      "speaker": "Dannie",
      "time": "00:01:37",
      "upperBoundTime": "00:02:06",
      "content": "Well my dad was a factory worker he worked at Trappey's Pepper factory in New Iberia my mom was pretty much she was a nurse she was a homecare nurse. She did that later on in life, she did it for a little while if I can remember about 6 or 7 years old. Then she just kind of started working around the house, my dad wanted her not to work anymore. So she kind of just stayed around the house, and worked around the house."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:06",
      "upperBoundTime": "00:02:09",
      "content": "All right sure any grandparents were particularly important in your life?"
    },
    {
      "speaker": "Dannie",
      "time": "00:02:09",
      "upperBoundTime": "00:02:36",
      "content": "I think my all my grandparents for the times that I can remember I don't remember them, my mom used to talk about her dad and her mom her mother's named Agnes and I think her dad was named Manuel. She talked about them a little bit she didn't talk about them much but I never knew them because I think they passed away when I was probably young a couple of years old so."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:36",
      "upperBoundTime": "00:02:45",
      "content": "Okay so aside from your parents were there any other adults who had a special role in your life."
    },
    {
      "speaker": "Dannie",
      "time": "00:02:45",
      "upperBoundTime": "00:02:46",
      "content": "Probably my mother's brother which is my uncle."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:46",
      "upperBoundTime": "00:02:48",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:02:48",
      "upperBoundTime": "00:03:07",
      "content": "Because every now and then I would go probably on the weekends go stay with him maybe a couple day s on a Saturday or a Sunday or something like that but his name was Charles Brown and so other than him this was actually just my mom and my dad."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:07",
      "upperBoundTime": "00:03:23",
      "content": "Okay sure and so is it is it safe for me to assume that you grew up in a house where you knew that there were adults who loved you and cared for you or did you feel like you had to kind of make it on your own."
    },
    {
      "speaker": "Dannie",
      "time": "00:03:23",
      "upperBoundTime": "00:04:29",
      "content": "I don't know. I think at some point I just felt a lot of love from my mom I was pretty close to my mom. My brothers my youngest sister stayed with us at the time and my other two sister was older they was a bit older because those were my dad kids and stuff. So they was older they was on they own but my youngest sister Agnes. She lived with us with all the boys with 6 boys the other two 3 boys they were older also living on they own. So we had actually 6 in the house total plus my sister was 7 in the house."
    },
    {
      "speaker": "Dannie",
      "time": "00:03:23",
      "upperBoundTime": "00:04:29",
      "content": "So but I think I felt more love from my mom than anyone, than my dad because my dad and I had a lot of conflicts and friction going on between us in the way he disciplined us. So it didn't make me feel real love from him and I think now as I'm older now, I believe that he did love me but he just didn't real know how to express it, express his love."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:29",
      "upperBoundTime": "00:04:37",
      "content": "Sure and how did he discipline you?"
    },
    {
      "speaker": "Dannie",
      "time": "00:04:37",
      "upperBoundTime": "00:05:46",
      "content": "Well today nowadays in the 21st Century nowadays it would probably be child abuse he would discipline us real raw with a stitching cord and coat hangers anything he can get his hands on. He was real, he would think would be probably physical abuse nowadays."
    },
    {
      "speaker": "Dannie",
      "time": "00:04:37",
      "upperBoundTime": "00:05:46",
      "content": "But back then it wasn't all that out there in public and so he really used a lot of objects I'm saying to whip us leather straps without us having any clothes on, things of that nature. I think that alone causing me to kind of not feel love from him, but my mom was always the kind of try to save us from going through that."
    },
    {
      "speaker": "Dannie",
      "time": "00:04:37",
      "upperBoundTime": "00:05:46",
      "content": "And any time she would try to intervene he would just complete my dad was like 6'9\" 6'10\" and my mom was she was like wasn't even 5 foot she was like maybe 4'9\" or 4'10\" and so she was short, really short and my dad was real big tall man strong man worked in the field when they was younger, worked at the Pepper factory worked around the house did pretty much everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:46",
      "upperBoundTime": "00:05:46",
      "content": "Very physical person."
    },
    {
      "speaker": "Dannie",
      "time": "00:05:46",
      "upperBoundTime": "00:06:07",
      "content": "Right he's real physical, and so I think from that it made me kind of didn't really feel so much of love towards think from him I never could understand it. I was kind of confused about it as I was growing up."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:07",
      "upperBoundTime": "00:06:18",
      "content": "Yeah. Okay if you had to identify the single most important person in your life coming up adult would it be your mother?"
    },
    {
      "speaker": "Dannie",
      "time": "00:06:18",
      "upperBoundTime": "00:06:25",
      "content": "It probably, yeah it would definitely be my mother it would definitely be her."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:25",
      "upperBoundTime": "00:06:30",
      "content": "Okay what about close friends you had a big family did you have some particularly important friends growing up?"
    },
    {
      "speaker": "Dannie",
      "time": "00:06:30",
      "upperBoundTime": "00:06:52",
      "content": "I had a probably about 2 or 3 neighborhood friends that I knew that we grew up in school went to high school went to middle school and elementary school Gary Alexander was one of them, Ernest Alexander was another one those were two guys that I kind of hung out with most of the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:52",
      "upperBoundTime": "00:06:54",
      "content": "Okay were they brothers?"
    },
    {
      "speaker": "Dannie",
      "time": "00:06:54",
      "upperBoundTime": "00:07:23",
      "content": "They was cousins. They was two cousins we had a park right in between the two streets that we stayed on we stayed on one street and Gary on the other street but right there between they had a little park where we used to go out there in the park and play ball and basketball and merry go round and stuff like that. So we kind of did that around the house those are two guys that I really grew up with and talked to a lot and talked to about whatever I was going through at the house or with the family."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:23",
      "upperBoundTime": "00:07:27",
      "content": "Sure have you managed to stay in touch with any of those?"
    },
    {
      "speaker": "Dannie",
      "time": "00:07:27",
      "upperBoundTime": "00:07:56",
      "content": "No one of the guys Gary he got killed I think somewhere in early 2000 or something like that. Ernest I think he still out there. I get information from guys that after is coming up here that's from the area, from my area some younger guys that's coming up and I would ask them about. So these guys and they really don't know them but they heard about them because they were really young they wasn't even born yet at the time but they heard about that family that lived around my area, my house."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:56",
      "upperBoundTime": "00:08:03",
      "content": "Yeah it's a very small community right so pretty much everybody knows everybody."
    },
    {
      "speaker": "Dannie",
      "time": "00:08:03",
      "upperBoundTime": "00:08:12",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:12",
      "upperBoundTime": "00:08:15",
      "content": "You're describing this park between neighborhoods is it kind of like a subdivision can you paint a picture of what you would be seeing if I was look out your front door?"
    },
    {
      "speaker": "Dannie",
      "time": "00:08:15",
      "upperBoundTime": "00:08:35",
      "content": "When you look out the front door it was the street it was a dead end on one end the south side was the dead end and then when you go toward the north up to the front you would go up to an intersection an intersection light where it would branch off into other streets other areas in the neighborhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:35",
      "upperBoundTime": "00:08:42",
      "content": "Okay would there be people out was there drug activity was it, I mean what's."
    },
    {
      "speaker": "Dannie",
      "time": "00:08:42",
      "upperBoundTime": "00:09:23",
      "content": "They would have some hangout spots where guys would hang out drinking smoking and smoking weed, marijuana, drinking wine. They would be, on the next street that Gary stayed on they had an area right where they would they always hung out at guys older guys that we see growing up and want to be around and smoking dope, smoking cigarettes and drinking wine, and guys that wasn't really doing anything productive properly at that time."
    },
    {
      "speaker": "Dannie",
      "time": "00:08:42",
      "upperBoundTime": "00:09:23",
      "content": "When I was coming up I didn't think it was, I thought it that's what they supposed to be doing but now I see it wasn't really productive. They were just hanging around with each other about 5 or 6 guys throughout the day just hanging around just hanging out."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:23",
      "upperBoundTime": "00:09:23",
      "content": "Right but did you feel safe in the neighborhood?"
    },
    {
      "speaker": "Dannie",
      "time": "00:09:23",
      "upperBoundTime": "00:09:30",
      "content": "Pretty much yeah, I felt pretty safe in the neighborhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:30",
      "upperBoundTime": "00:09:37",
      "content": "Okay. So you mentioned school earlier on, can you tell me a little bit about your school your elementary maybe we can start with your elementary school. Do you have some specific memories?"
    },
    {
      "speaker": "Dannie",
      "time": "00:09:37",
      "upperBoundTime": "00:10:23",
      "content": "Well my elementary school was kind of rough I didn't want to go to school. I had a, I think I didn't want to really leave the house and have to go to school and not be around my mom. I had problems with that coming up in kindergarten in first grade. And when I got into around the 4th or 5th grade I actually got expelled a couple times because I just went out of class and walked home. I was in walking distance of my elementary school, so I would actually walk to school."
    },
    {
      "speaker": "Dannie",
      "time": "00:09:37",
      "upperBoundTime": "00:10:23",
      "content": "So I would just leave out of class and just walk back home and the principal would call my mom and explain to my mom that I just walked out of class. So they was expelled me like for 3 days or whatever 3 or 4 days or something, then I was able to come back but I would get a beating from my dad because of that. I would get chastised because of that because of me just walking off."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:23",
      "upperBoundTime": "00:10:24",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:10:24",
      "upperBoundTime": "00:10:50",
      "content": "So I had problems with learning, and not wanting to learn in my younger days when I was in middle school and the elementary school but it was a relatively big school, we had maybe about 500 students there at the time, from kindergarten to all the way I think to 5th grade or 6th grade or something like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:50",
      "upperBoundTime": "00:10:50",
      "content": "Okay how middle school was for you."
    },
    {
      "speaker": "Dannie",
      "time": "00:10:50",
      "upperBoundTime": "00:11:13",
      "content": "Middle school it was pretty good and it's just got even worse when I got to middle school because I was like again I was having problems really wanting to learn and trying to keep up with the curriculum of the school, curriculum the math and the reading and the writing and all the stuff and the history and all the things that school do at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:13",
      "upperBoundTime": "00:12:13",
      "content": "Yeah did you find yourself finding it a little hard to learn that stuff than other kids or were you good at it, did you get good grades."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:13",
      "upperBoundTime": "00:12:13",
      "content": "Resp #00:11:19-9#Well I was not really because I was I was getting really I was barely passing I was getting Ds and maybe Cs for some reason because again I was just going through a situation in my mind that I just couldn't deal with it, I had some anxiety problems, I had depression problems, I would cry a lot and want to didn't want to go to school when it was time to go to school."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:13",
      "upperBoundTime": "00:12:13",
      "content": "I went through that for a while and then as a matter of fact it happened a few times my mom advised my dad that I had to see somebody about it, and seek some professional help. So I did start seeing a psychiatrist at a young age of maybe probably about 11 or something like that 9 or 10. I started seeing a psychiatrist out of Lafayette, and they prescribed me some medication, and I tried to take that but it would make me too sleepy. I would be too sleepy."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:13",
      "upperBoundTime": "00:12:16",
      "content": "Was it medication for anxiety?"
    },
    {
      "speaker": "Dannie",
      "time": "00:12:16",
      "upperBoundTime": "00:12:34",
      "content": "It was for anti-depression medication, anxiety depression medication. So I started taking that and then I took it for a few months, and then I stopped taking it not on the advice of my mom, but I wouldn't take it. I would fake like I was taking it but I wouldn't take it."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:34",
      "upperBoundTime": "00:12:36",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:12:36",
      "upperBoundTime": "00:12:42",
      "content": "So that went on for some years, maybe 3 or 4 years, well into my teens 13 or maybe 14 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:42",
      "upperBoundTime": "00:13:01",
      "content": "Okay all right and so now you're getting ready to go to high school."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:42",
      "upperBoundTime": "00:13:01",
      "content": "Resp #00:12:48-9#Right ready to go to high school 15 years old. Now I'm in the 7th grade in high school, and working at going through high school until about a year and a half maybe two years when I'm 16 and I drop out of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:01",
      "upperBoundTime": "00:13:03",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:13:03",
      "upperBoundTime": "00:13:05",
      "content": "I get out of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:05",
      "upperBoundTime": "00:13:07",
      "content": "So your highest grade was what then?"
    },
    {
      "speaker": "Dannie",
      "time": "00:13:07",
      "upperBoundTime": "00:13:10",
      "content": "8th grade, I never made it till freshman year."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:10",
      "upperBoundTime": "00:13:19",
      "content": "Okay so then you drop out of school and I understand that makes sense if you're having these problems. What were you doing then once you dropped out?"
    },
    {
      "speaker": "Dannie",
      "time": "00:13:19",
      "upperBoundTime": "00:14:23",
      "content": "Well at that point my mom assured me that I needed to do something that I needed to probably go to Job Corps or something. So I try to go to job core in St. Marcus Texas and that didn't work I maybe stayed maybe 30 days and came back and so I started a welding school class when I was in Job Corps. So when I came back I got into vocational school in New Iberia and went on and took a welding trade didn't completed it but I took a couple tests."
    },
    {
      "speaker": "Dannie",
      "time": "00:13:19",
      "upperBoundTime": "00:14:23",
      "content": "So I was able to get be a second class welder, and then I actually started doing some part time work around different areas and stuff welding a little bit. So I started struggling with Dad, and again I'm about 16 at that time. So I got a couple girlfriends that I'm dealing with and messing with and going out with and fooling with. And this is, at 16 years old I got my girlfriend pregnant."
    },
    {
      "speaker": "Dannie",
      "time": "00:13:19",
      "upperBoundTime": "00:14:23",
      "content": "So that was another problem that was more peer pressure because I'm struggling trying to work, and my mom at that point my dad done passed away my dad passed away when I was like 13."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:23",
      "upperBoundTime": "00:14:28",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:14:28",
      "upperBoundTime": "00:14:46",
      "content": "So my dad is no longer living anymore. So my mom is living she started working with a home care nursing and my other brothers that's older than me they kind of starting to spread out. They started leaving from out the house, and we don't have but like 3 people 4 people in the house now, my two youngest brothers and my sister."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:46",
      "upperBoundTime": "00:14:53",
      "content": "Can you explain the effect of your father passing away on the family and the family dynamic?"
    },
    {
      "speaker": "Dannie",
      "time": "00:14:53",
      "upperBoundTime": "00:15:38",
      "content": "It was kind of hard for my mom and for my brothers them too, pretty much the ones that was involved in my dad life it was pretty difficult he passed away at the house. It was a long process because he had prostate cancer and so when he found out, that was his diagnosis for prostate cancer, he didn't want to be in the hospital, because my mom was a nurse."
    },
    {
      "speaker": "Dannie",
      "time": "00:14:53",
      "upperBoundTime": "00:15:38",
      "content": "So he wanted to be at home so when they did all they could do. They said there's nothing else that they could do for him. They have to just kind of, he went through chemo and all this all type of treatment for maybe a year, so the doctors just gave him the diagnosis that this is it."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:38",
      "upperBoundTime": "00:15:40",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:15:40",
      "upperBoundTime": "00:16:47",
      "content": "So, he lived for probably another 4 more months at that point in the house living in the house just in the bed bedridden, couldn't even do anything. So that was kind of a sad, a really deep sad time for me, and even though I've seen him just withering away, it was kind of really moving for me. I couldn't really, I didn't like to really be in the room with him because he was so weak and so frail and he was always wanting something done. We had to make sure we catered to him and stuff like that."
    },
    {
      "speaker": "Dannie",
      "time": "00:15:40",
      "upperBoundTime": "00:16:47",
      "content": "So it was kind of really hard on me and hard on my sister actually my sister because of my sister he took care of my sister. He loved on my sister a lot so my sister was really, she was really elated about the whole idea of him just passing away."
    },
    {
      "speaker": "Dannie",
      "time": "00:15:40",
      "upperBoundTime": "00:16:47",
      "content": "So the funeral was kind of another deal because my dad again he was a really religious man, my mom the same way they kind of they went to church religiously every Saturday, every Wednesday night they go to Bible study. So we had a lot of people that was part of the church was always at the home always at the house visiting."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:47",
      "upperBoundTime": "00:16:51",
      "content": "Okay so but one thing that stopped was the physical abuse."
    },
    {
      "speaker": "Dannie",
      "time": "00:16:51",
      "upperBoundTime": "00:17:05",
      "content": "Right exactly. So that stopped so I was kind of more felt, more safer felt more my self-esteem probably was changing a little bit because I didn't have no high standards of self-esteem at that point."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:05",
      "upperBoundTime": "00:17:16",
      "content": "Sure so you're 16, and you've got picking up some welding jobs, you got your girlfriend pregnant. Tell me about your girlfriend and is was this now a boy or a girl who was born."
    },
    {
      "speaker": "Dannie",
      "time": "00:17:16",
      "upperBoundTime": "00:19:08",
      "content": "Well it was my daughter, it was a daughter was born. She we was together and then her mother put her out when she found out she was pregnant so that left me in a situation where my mom wouldn't let her stay in the house together because of her Christian views, and her moral views and because we wasn't married. So I had to go live with my brother for a little while. One of my oldest brothers till I got us I got me and my girlfriend an apartment together."
    },
    {
      "speaker": "Dannie",
      "time": "00:17:16",
      "upperBoundTime": "00:19:08",
      "content": "Her name is Tami Collette she's the same age as me, a couple months older than me she's real sweet real nice and everything, but I got an apartment, we stayed in that apartment for a while, I started working and then I started providing until she had the kid and everything."
    },
    {
      "speaker": "Dannie",
      "time": "00:17:16",
      "upperBoundTime": "00:19:08",
      "content": "So my daughter was probably about 2 years old when I actually got and it was like about 2 years later 18 I was 18 and I actually but in between that I had got another girl pregnant while I was living with my girlfriend and I had a son for another woman. So all this stuff was going on. At that point it was so much going on with the girl and my daughter and my and then trying to find jobs trying to work trying to keep a job and working round guys that drunk."
    },
    {
      "speaker": "Dannie",
      "time": "00:17:16",
      "upperBoundTime": "00:19:08",
      "content": "I started drinking a lot, smoking weed a lot and doing all that it because bad judgment, and working you know, and dealing with other people that I shouldn't have to been dealing with but it's the pressure of having to be with somebody all day every day. And I'm just a young adult. I'm not even quite a man yet. I'm just a teenager. And it's a lot to take on at that moment but I was trying to deal with it as much as I can, but it was actually dealing with me."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:08",
      "upperBoundTime": "00:19:15",
      "content": "Yeah no I get it now when you're 18 this incident happens, and there's a firearm involved."
    },
    {
      "speaker": "Dannie",
      "time": "00:19:15",
      "upperBoundTime": "00:19:17",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:17",
      "upperBoundTime": "00:19:19",
      "content": "Now why would you have a firearm?"
    },
    {
      "speaker": "Dannie",
      "time": "00:19:19",
      "upperBoundTime": "00:19:39",
      "content": "Again in the neighborhood when I left my neighborhood I actually moved across town, what you call uptown an area called uptown which is a little more crime infested drug infested, projects. You've got a lot of projects in the area, so it's a lot of violence going on in that area."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:39",
      "upperBoundTime": "00:19:41",
      "content": "Got it."
    },
    {
      "speaker": "Dannie",
      "time": "00:19:41",
      "upperBoundTime": "00:20:06",
      "content": "So the apartment that I was living in, it wasn't like that around that area but when I used to go to different other areas to go to work in other places, I felt I didn't feel safe because I had actually got in a physical altercation with a couple of guys prior to me actually getting locked up. And so actually I went on I felt like I needed to have the gun with me so I can protect myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:06",
      "upperBoundTime": "00:20:11",
      "content": "Yeah that makes sense. So tell me a little bit about your relationship with your children now."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:11",
      "upperBoundTime": "00:20:16",
      "content": "Well now my relationship with my kids is really estranged."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:16",
      "upperBoundTime": "00:20:17",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:17",
      "upperBoundTime": "00:20:57",
      "content": "Because of the length of time we've been away from them. My two kids was coming to see me when they were younger my mom was bringing them up before my mom passed away and my mom passed away in 2011 but all the late 80s and the early 90s and the mid-90s into all the maybe 2000, actually maybe the late 90s maybe 1997, 1998 they stopped coming to see me."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:17",
      "upperBoundTime": "00:20:57",
      "content": "But as they was all the way up to probably teenagers 13, 14 years old they was actually coming to see me because my mom would bring them up and their mother wouldn't they would never come up…"
    },
    {
      "speaker": "Marcus",
      "time": "00:20:57",
      "upperBoundTime": "00:20:59",
      "content": "Right."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:59",
      "upperBoundTime": "00:22:03",
      "content": "…and see me at the time. They was probably involved in other stuff was going on. So my mom was actually the one that kind of catering helping me try to keep the relationship going with my two kids but as my mom kind of got sicker and I wasn't able to see my kids my son or my daughter. It actually got to where it was a void between those two. There was no communication at all."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:59",
      "upperBoundTime": "00:22:03",
      "content": "When I found out, when I started to communicate back with my children which was maybe about 3 or 4 years ago I found out that my daughters an alcoholic. My daughter she had been to jail a couple of times for credit card theft, credit card fraud with the checks and stuff like that."
    },
    {
      "speaker": "Dannie",
      "time": "00:20:59",
      "upperBoundTime": "00:22:03",
      "content": "I had a situation with my son in 2000, I think it was '12 or '13 where actually a guy shot him and almost killed him because he was doing some stuff, some drug using. He was off in some drug activity or whatever, but that was an eye opener for him and his life changed for him. So now he's doing better. He's actually working. He's been working for a while and actually he's the manager of a furniture store."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:03",
      "upperBoundTime": "00:22:02",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:22:02",
      "upperBoundTime": "00:22:17",
      "content": "So he's doing pretty good but our relationship is still, it's kind of not really the way that I desire for that to be its sort of estranged right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:17",
      "upperBoundTime": "00:22:22",
      "content": "Sure I understand it's got to be hard to maintain any relationship for 37 years."
    },
    {
      "speaker": "Dannie",
      "time": "00:22:22",
      "upperBoundTime": "00:22:24",
      "content": "Yeah it is."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:24",
      "upperBoundTime": "00:22:34",
      "content": "So you mentioned that you are going through all these things, were you getting into any trouble with the law 16, 17, 18?"
    },
    {
      "speaker": "Dannie",
      "time": "00:22:34",
      "upperBoundTime": "00:22:38",
      "content": "No not really with the exception of probably I had a DWI."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:38",
      "upperBoundTime": "00:22:40",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:22:40",
      "upperBoundTime": "00:22:42",
      "content": "Because again I started drinking at the age of probably 14 years old I started drinking."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:42",
      "upperBoundTime": "00:22:43",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:22:43",
      "upperBoundTime": "00:22:59",
      "content": "So when I was, when I finally got my license my permit and got my license when I was my permit at 17, I got my license at 18, I was drinking and driving they pulled me over and they arrested me for…"
    },
    {
      "speaker": "Marcus",
      "time": "00:22:59",
      "upperBoundTime": "00:23:00",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:00",
      "upperBoundTime": "00:23:00",
      "content": "…DWI."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:00",
      "upperBoundTime": "00:23:03",
      "content": "Sure but there weren't any other serious charges or anything."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:03",
      "upperBoundTime": "00:23:07",
      "content": "No other no other run in."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:07",
      "upperBoundTime": "00:23:14",
      "content": "Okay so can you just very briefly tell me what led up to the charge that you're here for?"
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "I don't know it just kind of I'm thinking just me just not just not being responsible I think and moving around and just kind of like hanging out and doing stuff and just the pressure, the peer pressure. I was actually at my brother house at the time my oldest brother Bobby. I was at actually at his house and the incident happened probably about a block away they had this grocery store. It's a furniture and a grocery store together, its Fremin's food and furniture. They was playing dominoes at the house and they were drinking whiskey and beer. So I'm drinking beer and with them but they drinking the whiskey. And he needed some more whiskey so he asked me to go to the store and purchase some more whiskey."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "I actually had got paid that day I was working for Intex, a gas company called Intex out in New Iberia and I had been working for them for like four months, the longest I ever had a job. So anyway so he's telling me to go to Fremin's food and furniture and get some more whiskey and beer. And so that's what I but at the time I have the gun on me. It's concealed. I have a shoulder holster and it is concealed weapon."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "This is like in its kind of its February and it's still kind of cool a little bit. So I got a windbreaker on and you can't really see the pistol it's a 32 pistol. So I go over there to Fremin's food and furniture and go around in the aisles, looking around in the aisles trying see what I can get size, what he asked me to get, and I see a pair of gloves that I thought I probably wanted."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "So I picked the pair of gloves up and I looked at them and walked with them a little while to the next aisle and come back and think about say, no I don't want the gloves I put them back up and then I got what I wanted to get what he said two fifth of whiskey and two sixes packs of beer. So I got that and brought it to the counter and paid for it."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "And then when I tried proceed on out to go out of the store the two guys stopped me and said hey where you going punk where you going come on back here with us. I said what's going on and so they sent me to the back, and I went to the back with them and at that moment I'm not really panicking because I have some drugs on me, I have some I have marijuana, I got pills on me. So I know I got some drugs on me I really don't want these people to call the police because I don't want to get arrested for drugs."
    },
    {
      "speaker": "Dannie",
      "time": "00:23:14",
      "upperBoundTime": "00:26:03",
      "content": "So I'm starting to get kind of nervous and fidgeted a little bit so they got me in the back of this area this storage area telling me don't go anywhere what I'm saying they want to get all this stuff straight. And in my mind I know what they gone do they gone call the police and I don't want to be in there. So a physical altercation started because I'm trying to get out and they pushing me back and we started fighting and then that's when I lose my cool, and the incident happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:03",
      "upperBoundTime": "00:26:23",
      "content": "Okay so let me ask you this, let's say this didn't happen. Let's say they asked somebody else to go get the beer and the whiskey and you never went to the store. How do you imagine the next few months and years of your life would have been I'm sure you've spent some time thinking about what if?"
    },
    {
      "speaker": "Dannie",
      "time": "00:26:23",
      "upperBoundTime": "00:26:59",
      "content": "Yeah I think I'd come up pretty good. I think I believe I may have probably did all right. I think at some point I may have probably got some understanding when I probably got older because I liked, I loved the job that I had because I was actually on a construction crew on the Intex gas company."
    },
    {
      "speaker": "Dannie",
      "time": "00:26:23",
      "upperBoundTime": "00:26:59",
      "content": "I was working on the crew with them and I was doing a little welding, and people was paying a gas line, gas leaking and stuff like that. I think I believe I probably would still be working for the same company maybe retiring from the same company."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:59",
      "upperBoundTime": "00:27:01",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:27:01",
      "upperBoundTime": "00:27:31",
      "content": "Because my girlfriend she was she was constantly on me about hanging out with those guys different people that I shouldn't have been hanging out with the exception of a couple of my brothers they would tell me the same thing because they was trying to help me. And I worked with my brother driving trucks for a little while maybe about 5 or 6 month driving trucks and he got a trucking company. So I did some hot shot driving with him."
    },
    {
      "speaker": "Dannie",
      "time": "00:27:01",
      "upperBoundTime": "00:27:31",
      "content": "So I think if I if that probably wouldn't have happened I might have turned out pretty good so."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:31",
      "upperBoundTime": "00:27:40",
      "content": "Yeah I mean some of the folks that I've talked to, you can clearly see that they were just going down a wrong path."
    },
    {
      "speaker": "Dannie",
      "time": "00:27:40",
      "upperBoundTime": "00:27:41",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:41",
      "upperBoundTime": "00:27:44",
      "content": "They often tell me that they would be in prison or dead."
    },
    {
      "speaker": "Dannie",
      "time": "00:27:44",
      "upperBoundTime": "00:27:45",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:45",
      "upperBoundTime": "00:27:48",
      "content": "But it didn't this sounded a little more a one off incident."
    },
    {
      "speaker": "Dannie",
      "time": "00:27:48",
      "upperBoundTime": "00:27:58",
      "content": "Right it just one isolated type of incident at that moment at that time. Had I probably never had the gun I would have probably, just probably just got arrested."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:58",
      "upperBoundTime": "00:28:00",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:28:00",
      "upperBoundTime": "00:28:04",
      "content": "Because they probably would have just patted shake me down and found the little the drugs I had and probably got arrested for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:04",
      "upperBoundTime": "00:28:33",
      "content": "So I want to move switch gears a little bit and talk about coming to Angola and some of your early memories up here and then look at some of the changes that you've been through all this time, but is there something about your first 18 years of your life that's really important in understanding who you are now that we didn't talk about? Something I should have asked you?"
    },
    {
      "speaker": "Dannie",
      "time": "00:28:33",
      "upperBoundTime": "00:28:38",
      "content": "No I don't know."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:38",
      "upperBoundTime": "00:28:48",
      "content": "Okay alright I mean we covered a fair amount. So let me move on then so I imagine you spent a little bit of time in the parish jail as you're going through this."
    },
    {
      "speaker": "Dannie",
      "time": "00:28:48",
      "upperBoundTime": "00:28:50",
      "content": "Yeah I spent a couple years."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:50",
      "upperBoundTime": "00:28:52",
      "content": "Okay yeah and I assume again they bring you up to Hunt for classification."
    },
    {
      "speaker": "Dannie",
      "time": "00:28:52",
      "upperBoundTime": "00:28:54",
      "content": "Right we go to the center in Hunts and then you come up."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:54",
      "upperBoundTime": "00:28:58",
      "content": "Okay so tell me about the bus ride coming down to Angola."
    },
    {
      "speaker": "Dannie",
      "time": "00:28:58",
      "upperBoundTime": "00:29:28",
      "content": "Its normal feelings, you've got mixed feelings. You want to be brave, you want to have courage but at the same time you got mixed feelings you don't know what to expect. I mean I never been a prisoner before. I never the most I ever spent in the county jail, in the city jail was the two days when I got busted with the DWI."
    },
    {
      "speaker": "Dannie",
      "time": "00:28:58",
      "upperBoundTime": "00:29:28",
      "content": "Because my mom took a couple days to come get me out, but I never with the exception of staying in the parish for two years before I got up here, so I never been in no prison. I mean I heard a lot of stories about the prison about Angola, I come up here."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:28",
      "upperBoundTime": "00:29:30",
      "content": "You're so young too."
    },
    {
      "speaker": "Dannie",
      "time": "00:29:30",
      "upperBoundTime": "00:30:03",
      "content": "I came here in 1985. So I'm young I'm still now 21, 22 years old, and I'm like I'm just I don't really know what to expect, but I know one thing, I'm not going to let nobody push me over. I'm not gone let nobody try to hurt me. I don't really I don't have I didn't have it on my mind to really do anybody anything. I wasn't really trying to like get a name for myself and try to go out and just do something to somebody."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:03",
      "upperBoundTime": "00:30:05",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:30:05",
      "upperBoundTime": "00:30:20",
      "content": "I was I had an idea that if I just don't stay to myself and not do any say anything and not fool with too many people, I was using my childhood and coming up and hanging around with the wrong people, if I'd have stayed hanging around with the right people I can probably survive through this prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:20",
      "upperBoundTime": "00:30:26",
      "content": "Okay sure and were you able to do that."
    },
    {
      "speaker": "Dannie",
      "time": "00:30:26",
      "upperBoundTime": "00:31:23",
      "content": "At first well I was able to try to I was able to at first it seemed like I was going to I was able to do that when I was first few months. I was hanging out with some guys who was going to church and some positive guys that was going on but again once you kind of get yourself in an area, then you feel comfortable and everything kind of seems like it's all right and then you want to and then you got a lot of stuff going on."
    },
    {
      "speaker": "Dannie",
      "time": "00:30:26",
      "upperBoundTime": "00:31:23",
      "content": "And I'm still having a lot of problems because the fact that my mom, she got trouble getting up to see me, bringing my kids. So I got stuff in my mind. I got a lot of psychological pressure that's going on. So I just need something to calm my nerves next thing you know I'm messing with drugs. I'm smoking the weed inside the prison. So I'm starting to follow the wrong crowd again."
    },
    {
      "speaker": "Dannie",
      "time": "00:30:26",
      "upperBoundTime": "00:31:23",
      "content": "So it's you fall right in that again. If you don't watch it you'll fall right back with the bad crowd, because just like out in society you got good people, in prison you got good people and bad people."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:23",
      "upperBoundTime": "00:31:25",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:31:25",
      "upperBoundTime": "00:31:43",
      "content": "You got people that will help you be productive and you got people that will help you be nonproductive. So I started hanging out with the nonproductive individuals or hanging out on the yard, not really worried about my education at the time, not worried about nothing else but just telling stories and smoking weed and popping pills and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:43",
      "upperBoundTime": "00:31:47",
      "content": "Yeah sure did you end up getting into some disciplinary problems?"
    },
    {
      "speaker": "Dannie",
      "time": "00:31:47",
      "upperBoundTime": "00:31:49",
      "content": "I did for the first three years."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:49",
      "upperBoundTime": "00:31:51",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:31:51",
      "upperBoundTime": "00:32:29",
      "content": "We've got in a couple fights, couple aggravated fight simple fights got into it with some security officers' authority at the time. I was kind of rebellious. Again I'm still dealing with issues being depressed. When I get depressed I get agitated. When I'm like agitated I might go to acting out."
    },
    {
      "speaker": "Dannie",
      "time": "00:31:51",
      "upperBoundTime": "00:32:29",
      "content": "So I started acting out and then I begin to go to the cell block do some time in the cell block in extended lockdown probably a minimum of three years of all that back and forth and that kind of got kind of old just kind of like man this ain't working."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:29",
      "upperBoundTime": "00:32:33",
      "content": "Yeah I mean one of the things that I'm trying to focus on in this project is the transformation that happens."
    },
    {
      "speaker": "Dannie",
      "time": "00:32:33",
      "upperBoundTime": "00:32:35",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:35",
      "upperBoundTime": "00:32:41",
      "content": "Sometimes it's just aging out people just get tired, and mature, what was the turning point for you?"
    },
    {
      "speaker": "Dannie",
      "time": "00:32:41",
      "upperBoundTime": "00:33:59",
      "content": "Again now you could if from the beginning I always said my dad and my mom was very religious. They was very faith people. So I grew up in a religious home and I knew I knew about God and so that was about it. I knew about God, and I knew of God and I studied the Word of God in church and I heard the preacher preach the Word of God but I never did actually have a relationship and that was the turning point because at that point once I came out the cell blocks, and then I started hanging out."
    },
    {
      "speaker": "Dannie",
      "time": "00:32:41",
      "upperBoundTime": "00:33:59",
      "content": "I changed my mind while I was in the cell block and I'm praying and I begin to because I wasn't even praying. So I started praying, I started really just asking God what I needed to be doing. I need to be doing something other than what I'm doing now. I need to be more positive. I need more strength. I need more faith."
    },
    {
      "speaker": "Dannie",
      "time": "00:32:41",
      "upperBoundTime": "00:33:59",
      "content": "So it started talking, God started talking to me in my spirit and said, well you need to start being with people that love me, that's working, that's serving me. And so when I got out the cell block that's what I began to do. I began to get with guys preachers and ministers that was in the church and I begin to start actually learning more about God and who he is and actually having a relationship with him instead of just acting and saying that I knew him."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:59",
      "upperBoundTime": "00:34:02",
      "content": "Yeah so how far what year would this be?"
    },
    {
      "speaker": "Dannie",
      "time": "00:34:02",
      "upperBoundTime": "00:34:07",
      "content": "I think probably I would say '85 I would think it would probably be like maybe 90, 1990."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:07",
      "upperBoundTime": "00:34:03",
      "content": "Okay so about 5 years in."
    },
    {
      "speaker": "Dannie",
      "time": "00:34:03",
      "upperBoundTime": "00:34:47",
      "content": "Yeah about 1990. I begin to start really actually going to church and doing Bible study, and hanging out with the guys that was actually you know Norris Henderson, guys like that Checo W. Yancy, with guys like Ashanti Witherspoon, guys like that Calvin Duncan, you know Tucker you know guys that was a positive image in the prison system, that a lot of people didn't want to fool with, because they would say they was model prisoners. I started hanging out with those guys and those guys started steering me in the right direction."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:47",
      "upperBoundTime": "00:34:45",
      "content": "Explain that term to me."
    },
    {
      "speaker": "Dannie",
      "time": "00:34:45",
      "upperBoundTime": "00:34:46",
      "content": "What?"
    },
    {
      "speaker": "Marcus",
      "time": "00:34:46",
      "upperBoundTime": "00:34:49",
      "content": "Explain that term to me."
    },
    {
      "speaker": "Dannie",
      "time": "00:34:49",
      "upperBoundTime": "00:34:51",
      "content": "What model prisoners? Well they would say a model prisoner is a person that actually do all the right things, they been in prison for a while."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:51",
      "upperBoundTime": "00:34:52",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:34:52",
      "upperBoundTime": "00:34:58",
      "content": "They doing all the right things."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:58",
      "upperBoundTime": "00:35:02",
      "content": "Yeah but you said was there some sort of tension between those guys and some of the other guys?"
    },
    {
      "speaker": "Dannie",
      "time": "00:35:02",
      "upperBoundTime": "00:35:07",
      "content": "Yeah because they were they would put labels on those guys say they was rats."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:07",
      "upperBoundTime": "00:35:09",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:35:09",
      "upperBoundTime": "00:35:15",
      "content": "That they informants for the administration, that they work for the administration because they had they had jobs that was administrative jobs, the same kind of job that I have now."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:15",
      "upperBoundTime": "00:35:17",
      "content": "Yeah more privilege."
    },
    {
      "speaker": "Dannie",
      "time": "00:35:17",
      "upperBoundTime": "00:35:32",
      "content": "Right they had privilege the job the same job that I have now, those the jobs that they had. I work for classification East Yard classification. I'm a social mentor for the reentry program. I'm a paralegal working in the library I'm saying downstairs down civil and criminal litigation."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:32",
      "upperBoundTime": "00:35:34",
      "content": "Yeah."
    },
    {
      "speaker": " Dannie",
      "time": "00:35:34",
      "upperBoundTime": "00:35:40",
      "content": "So these are the things that they was doing and I wasn't doing. So those are the people that I wanted to hang with and started hanging with."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:40",
      "upperBoundTime": "00:35:42",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:35:42",
      "upperBoundTime": "00:35:47",
      "content": "So that was a turning point of actually getting a relationship with Him and getting a relationship with other people that was positive…"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:47",
      "upperBoundTime": "00:35:48",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:35:48",
      "upperBoundTime": "00:35:53",
      "content": "…at that time."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:53",
      "upperBoundTime": "00:36:03",
      "content": "Sure. So this prison has gone through all kinds of changes I mean actually you've seen it all."
    },
    {
      "speaker": "Dannie",
      "time": "00:36:03",
      "upperBoundTime": "00:36:03",
      "content": "I have I mean it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:03",
      "upperBoundTime": "00:36:11",
      "content": "Can you compare the Angola of the 1980s with the way it is now?"
    },
    {
      "speaker": "Dannie",
      "time": "00:36:11",
      "upperBoundTime": "00:36:55",
      "content": "There's no comparison I mean it's like black and white now. It's like just back in the 80s it was really it was high in violence even on an inmate on an inmate and even an inmate on a security officer. It was a lot of rapes. A lot of rape, people would, they was raping a lot of people. Physical fighting a lot of people, aggravated fighting. They was killing and stuff like that."
    },
    {
      "speaker": "Dannie",
      "time": "00:36:11",
      "upperBoundTime": "00:36:55",
      "content": "And then all of a sudden towards the 2000s and the 90s. When Warden Cain came here it's kind of started downsizing to where the violence started kind of ceasing, and then the Bible College came in. I'm also a Bible college graduate I have a bachelor's degree. So I actually had an opportunity when the Bible College started a few years later, that's one of the routes that I went into."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:55",
      "upperBoundTime": "00:37:00",
      "content": "So that means you got your GED or your high school."
    },
    {
      "speaker": "Dannie",
      "time": "00:37:00",
      "upperBoundTime": "00:37:37",
      "content": "Oh yeah well I got a GED like in a the latter part of the 80s, because again after I stayed them three years into that the area, and I started hanging out with the guys and they started telling me I need to get in school. So I knew I need to get, I knew I need to get an education because I was again I dropped out in the 8th grade."
    },
    {
      "speaker": "Dannie",
      "time": "00:37:00",
      "upperBoundTime": "00:37:37",
      "content": "When I even when I took my TA test I scored like a fifth grade level I was on a 6th grade level, and so I had I went through the GED process and got my GED in about a year and a half, got that and then I started actually doing other stuff from that point."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:37",
      "upperBoundTime": "00:37:56",
      "content": "Okay you've accomplished a lot I can tell that from just the last 5 minutes of what you've been saying. Can you describe what your typical day is now you've obviously got these other responsibilities but what's your routine, can you walk me through it?"
    },
    {
      "speaker": "Dannie",
      "time": "00:37:56",
      "upperBoundTime": "00:38:29",
      "content": "My routine get up in the morning about 4:30 I do me some quiet time I pray and I do me some daily devotion read a couple of scriptures. I meditate. To do some praise and worship, TobyMac, some good worship and after I do that I prepare myself to go to work about 7:30 but I'm out of the dorm about 6 o'clock. So about an hour and a half my supervisor come and I'm actually at work about 7:30, a quarter to 8 and then I'm actually at work all through the day at that point because I work for classification."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:29",
      "upperBoundTime": "00:38:30",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:38:30",
      "upperBoundTime": "00:38:28",
      "content": "And you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:28",
      "upperBoundTime": "00:38:31",
      "content": "Is that Mary Anthony."
    },
    {
      "speaker": "Dannie",
      "time": "00:38:31",
      "upperBoundTime": "00:38:36",
      "content": "No I used to work for Miss Mary Anthony but she's actually like classification she's the head of classification now."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:36",
      "upperBoundTime": "00:38:38",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:38:38",
      "upperBoundTime": "00:38:46",
      "content": "She has an office over in the administration building. I work for Mr. Lee Daryl, Lee and Sherry Boynton, those are the East Yard classification."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:46",
      "upperBoundTime": "00:38:49",
      "content": "Got it."
    },
    {
      "speaker": "Dannie",
      "time": "00:38:49",
      "upperBoundTime": "00:39:17",
      "content": "So pretty much throughout the day I'm more within contact within people talking to people. I do desk messenger also sometimes they call me to do desk messenger sometime so I do that. I have to go to cell block, make round in the cell block. So I got a lot of stuff going on throughout the day."
    },
    {
      "speaker": "Dannie",
      "time": "00:38:49",
      "upperBoundTime": "00:39:17",
      "content": "I kind of stay busy and even in the evening time at night when I retire from work about 3 o'clock about 4:30, 5 o'clock whenever they shift change I go to the law library at night and work at night in the law library until 11 o'clock at night."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:17",
      "upperBoundTime": "00:39:19",
      "content": "Wow."
    },
    {
      "speaker": "Dannie",
      "time": "00:39:19",
      "upperBoundTime": "00:39:16",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:16",
      "upperBoundTime": "00:39:17",
      "content": "That's a very busy day."
    },
    {
      "speaker": "Dannie",
      "time": "00:39:17",
      "upperBoundTime": "00:39:19",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:19",
      "upperBoundTime": "00:39:27",
      "content": "So you are not only inmate counsel but you are also it seems to me going round doing rounds in the cell blocks then that's as an inmate minister?"
    },
    {
      "speaker": "Dannie",
      "time": "00:39:27",
      "upperBoundTime": "00:40:00",
      "content": "Right, I do some counseling working with guys talk to guys I do classes I do substance abuse classes on Mondays. On Mondays in the morning time from 8 to 10 I do a living substance abuse class for the mental health department because I work for the mental health department also."
    },
    {
      "speaker": "Dannie",
      "time": "00:39:27",
      "upperBoundTime": "00:40:00",
      "content": "So on Wednesday, I also do anger management class on Wednesdays from 8:00 to 10:00 on Wednesdays mornings for on anger management for many personnel. so I do two classes twice a week and then throughout the week I'm always doing something with the stuff too."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:00",
      "upperBoundTime": "00:40:29",
      "content": "Yeah well. So let me ask you a couple difficult questions about your reflections on what happened if you think back 37 years now, it's a two lifetimes right at this point. What are your feelings about, when you think about the victim and the victim's family and all these years you've been here, how do you make sense of it all?"
    },
    {
      "speaker": "Dannie",
      "time": "00:40:29",
      "upperBoundTime": "00:41:19",
      "content": "I think about that, I been thinking about that for the last 37 years, what they went through when it first happened. I can't imagine you know the psychological effect that that had on them, the physical effect, the mental effect on them because it was their son. This guy was 17 years old. He was just my age you know 17, 18 years old. So his name was Kevin Broussard."
    },
    {
      "speaker": "Dannie",
      "time": "00:40:29",
      "upperBoundTime": "00:41:19",
      "content": "So just their son was taken from them. So I've always said to myself, if I could do it all over again I would do it totally different. So I believe because of the fact that it affected not only their family, but it affected my family also."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:19",
      "upperBoundTime": "00:41:23",
      "content": "Well tell me a little bit about how it affected your family what impact did that have?"
    },
    {
      "speaker": "Dannie",
      "time": "00:41:23",
      "upperBoundTime": "00:43:03",
      "content": "The way it affected my family I think it put a lot of strain on my mom because of what she had to go through me not being there and have to provide for me financially for so many years before she passed away with my son and my daughter not to have been in a relationship like I should have been in that relationship leaving my son and my daughter out there not to be provided for as a father."
    },
    {
      "speaker": "Dannie",
      "time": "00:41:23",
      "upperBoundTime": "00:43:03",
      "content": "It's affected my family my sisters and brothers we have no communication I have no communication with my sisters and brothers I lost them one of my sisters passed away maybe in like the early 2000, my older sister and then one of my brothers just passed away like about 3 years ago so I had to find out through my wife."
    },
    {
      "speaker": "Dannie",
      "time": "00:41:23",
      "upperBoundTime": "00:43:03",
      "content": "So I mean it all messed around, it just all screwed up on both sides because of the family they grieving because they lost a son but I lost a mom. I lost a son and a daughter, they may not be physically lost but mentally and psychologically lost them, no emotional support or anything."
    },
    {
      "speaker": "Dannie",
      "time": "00:41:23",
      "upperBoundTime": "00:43:03",
      "content": "So it'll affect the family regardless. The victims also because of my because of what I did the charge that I made and I'm understanding that now you know before I couldn't really grasp that. Because when you're young and you're doing time you're not really thinking about it like that but once you start getting older and you start really realizing that man it's a lot you actually put on your family and your nobody take care of me now but my wife."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:03",
      "upperBoundTime": "00:43:07",
      "content": "Right tell me about your wife."
    },
    {
      "speaker": "Dannie",
      "time": "00:43:07",
      "upperBoundTime": "00:43:24",
      "content": "I met my wife at in 2009 at the Angola Rodeo in 2009 she's from Baton Rouge beautiful woman she's about five or six years older than me and we met at the rodeo I was selling Hobbycrafts because I do Hobbycrafts so I was selling them."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:24",
      "upperBoundTime": "00:43:25",
      "content": "What do you sell?"
    },
    {
      "speaker": "Dannie",
      "time": "00:43:25",
      "upperBoundTime": "00:44:53",
      "content": "I sell leather purses and belts and wallets and stuff like that bags I make shoulder bags and so I met her at the Rodeo in 2009. I was in school at the time Bible College I graduated in 2010 class of 2010 at that time and I met her at the rodeo and we started dating each other. We started seeing each other. I had a couple special visits with her and she really enjoyed the visits."
    },
    {
      "speaker": "Dannie",
      "time": "00:43:25",
      "upperBoundTime": "00:44:53",
      "content": "So she wanted to come back and be on my primary visiting list. So I put her on my primary visiting list and we see each other about a year a year and a half we started talking about marriage."
    },
    {
      "speaker": "Dannie",
      "time": "00:43:25",
      "upperBoundTime": "00:44:53",
      "content": "o my wife you know she wasn't never married but she stayed you know with her one of her ex fiancé for almost like 15, 16 years. So she actually was in a relationship for a long time and something transpired and she was separated and she wasn't in a relationship about two years when I met her."
    },
    {
      "speaker": "Dannie",
      "time": "00:43:25",
      "upperBoundTime": "00:44:53",
      "content": "So she's pretty good. She's beautiful. She got a good sense of humor and she's very dedicated family oriented and I love that. She got two sons and she got one daughter she got grandkids and great grandchildren. But she's actually the motivator, my motivating factor. This is the only support that I have right now. I don't have no family support from my brothers my sisters, not even from my son or my daughter."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:53",
      "upperBoundTime": "00:45:11",
      "content": "Okay yeah so for you Dannie I think the only avenue really is to go before the parole board. Sorry before the pardon board and seek commutation of sentence to a fixed set of years and then parole eligibility is that your plan?"
    },
    {
      "speaker": "Dannie",
      "time": "00:45:11",
      "upperBoundTime": "00:45:21",
      "content": "I'm going to still use the pardon board avenue which is 2019 next year I'm going to apply again for pardon."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:21",
      "upperBoundTime": "00:45:20",
      "content": "Okay so you've already applied for a pardon."
    },
    {
      "speaker": "Dannie",
      "time": "00:45:20",
      "upperBoundTime": "00:45:24",
      "content": "I applied once they denied me said I didn't have enough time I didn't do enough time."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:24",
      "upperBoundTime": "00:45:59",
      "content": "So Dannie I know that you church is a big part of your life you've lived for 37 years in prison and from what I can see and I've heard you say a very meaningful life in prison but people also know that a lot of people never leave Angola, do you think about the possibility of not getting out."
    },
    {
      "speaker": "Dannie",
      "time": "00:45:59",
      "upperBoundTime": "00:46:00",
      "content": "For sometimes I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:00",
      "upperBoundTime": "00:46:02",
      "content": "Yeah how do you cope with those moments?"
    },
    {
      "speaker": "Dannie",
      "time": "00:46:02",
      "upperBoundTime": "00:46:22",
      "content": "Sometime I do. Sometime I do I think about that and I say cause again I I'm doing funerals also I do funerals. So I do these guys funerals that some of them I don't know. So we have they have a system here where they actually we do some nice some funerals with dignity."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:22",
      "upperBoundTime": "00:46:24",
      "content": "Sure."
    },
    {
      "speaker": "Dannie",
      "time": "00:46:24",
      "upperBoundTime": "00:47:30",
      "content": "We try to, Warden Caine allowed, when Warden Caine was the warden here, he actually set it all up because he said we got pastors and ministers in here ordained ministers and pastors they could do funerals so we started doing that. So I've often, when I'm actually attending the funeral I sit there and I'm looking and I'm like man this could be me."
    },
    {
      "speaker": "Dannie",
      "time": "00:46:24",
      "upperBoundTime": "00:47:30",
      "content": "So sometime it's emotional. Sometimes I well up in with tears thinking about it because I'm thinking I'm kind of letting my family down because I want to try to really you now make some contact with family especially my son and daughter and my grandkids I have grandkids. So I'm like will I ever be able to be with them, to spend some time with them."
    },
    {
      "speaker": "Dannie",
      "time": "00:46:24",
      "upperBoundTime": "00:47:30",
      "content": "So sometime it's a sad you know it's a sad moment when I think about it and then I revert back to who God is. He's a good God, he's a great God and I'm just want to just do what His will and that's to serve Him and if it's to serve Him in this capacity for the rest of my life I think I'm okay with that."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:30",
      "upperBoundTime": "00:47:33",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:47:33",
      "upperBoundTime": "00:47:39",
      "content": "So that's what gives me, that's what consoles me and comforts me to know that I'm doing it serving him."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:39",
      "upperBoundTime": "00:47:51",
      "content": "Yeah I mean that it what I see is that maybe you're coping with it for leading a very meaningful life while you're here because this is also a community."
    },
    {
      "speaker": "Dannie",
      "time": "00:47:51",
      "upperBoundTime": "00:48:53",
      "content": "Right and it plays a big part because again even asking God what is my purpose and I think my purpose is to always to serve people, and I say this all the time when I'm doing classes, I tell guys I say it's like a brain surgery, everything I've acquired and learned over the years it's really not for me it's for the next person."
    },
    {
      "speaker": "Dannie",
      "time": "00:47:51",
      "upperBoundTime": "00:48:53",
      "content": "And I them that a brain surgeon became a brain surgeon not to perform surgery on himself but to perform a surgery on somebody else that need the surgery done."
    },
    {
      "speaker": "Dannie",
      "time": "00:47:51",
      "upperBoundTime": "00:48:53",
      "content": "So it's the same thing a doctor and a nurse they go to school for 6 or 7 or 8 years, 12 years not for themselves they do it for other people. So I acquire all the information that I have the education, the knowledge, the degrees that I have not for me it's for the guys that's coming in."
    },
    {
      "speaker": "Dannie",
      "time": "00:47:51",
      "upperBoundTime": "00:48:53",
      "content": "The ones that needed to be counseled and be steered in the right direction and to be mentored and saying, look you can do better even though you in prison you still got purpose you still got a life."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:53",
      "upperBoundTime": "00:49:01",
      "content": "Yeah. Having said that what for you is the worst part of this experience today?"
    },
    {
      "speaker": "Dannie",
      "time": "00:49:01",
      "upperBoundTime": "00:50:04",
      "content": "The fear of dying here. Dying and not having the people that I met since I been here to share some moments with, because I've acquired a lot of friends since I've been here from all over the states Shreveport, Monroe Louisiana, West Monroe Baton Rouge New Orleans."
    },
    {
      "speaker": "Dannie",
      "time": "00:49:01",
      "upperBoundTime": "00:50:04",
      "content": "So I've acquired a lot of friends and people that I have contact with and fearing that I will never have the opportunity to spend some moments with them. Having just that feeling of not being able to be connected with them physically, and being out there in society, and having my freedom to go and call them on the phone and take a ride up to their house, to their home and spend a couple hours with them just sitting down and talking about whatever."
    },
    {
      "speaker": "Dannie",
      "time": "00:49:01",
      "upperBoundTime": "00:50:04",
      "content": "So the fear of not being able to do that."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:04",
      "upperBoundTime": "00:50:26",
      "content": "Yeah so let's imagine that you do you either prevail on this legal issue or you go through the pardon process, get parole eligibility, we've just been celebrating AC's success with that."
    },
    {
      "speaker": "Dannie",
      "time": "00:50:26",
      "upperBoundTime": "00:50:30",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:30",
      "upperBoundTime": "00:50:38",
      "content": "How do you imagine the next chapter of your life would be how do you see that."
    },
    {
      "speaker": "Dannie",
      "time": "00:50:38",
      "upperBoundTime": "00:51:08",
      "content": "Man I'm a freelance writer, I love writing. I'm working on a book. Right now I'm kind of working on a book writing a book. I'm also a marriage counselor. I'm counseling guys here on marriage and their relationship. I have a ministry called Faith Focus and Marriage and Family Ministry. So I'm writing a book called Many Shades of Marriage because I want to write a book concerning marriage incarcerated marriages."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:08",
      "upperBoundTime": "00:51:11",
      "content": "Okay."
    },
    {
      "speaker": "Dannie",
      "time": "00:51:11",
      "upperBoundTime": "00:52:21",
      "content": "How to sustain your marriage while you're incarcerated. What the spouse go through while they incarcerated to try to maintain their union that God put them together whether they got married while they're in prison or they had the wife before they left or they had a husband before they left and they went to prison."
    },
    {
      "speaker": "Dannie",
      "time": "00:51:11",
      "upperBoundTime": "00:52:21",
      "content": "So I know I'm going to write a book. I'm going to write a book to cater to that to help guys and counsel people while they in prison while they incarcerated to deal with those type of problem those situation and everything's Biblical based all the answers in the Bible."
    },
    {
      "speaker": "Dannie",
      "time": "00:51:11",
      "upperBoundTime": "00:52:21",
      "content": "So it's based it just reiterate some things that God to use about our union as husband and wife and how we should lead our life as husband and wife. So I'm going to write a book, and I know I'm going to deal with a mentorship program when I get out when I get home, and work with guys, young guys, young men and women to try to steer them in the right direction."
    },
    {
      "speaker": "Dannie",
      "time": "00:51:11",
      "upperBoundTime": "00:52:21",
      "content": "Men and women that having problems with school, men and women that having problems with criminal, behavior criminal background and working with them and trying to get them in the right direction, get some kind of federal government grant where I can actually do that."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:21",
      "upperBoundTime": "00:52:48",
      "content": "Sure yeah you've accomplished an unusually large number of things since you've been here of all of those things what are you the most proud of?"
    },
    {
      "speaker": "Dannie",
      "time": "00:52:48",
      "upperBoundTime": "00:53:35",
      "content": "I think me being a mentor after spending time with people being in relationship with mentees the guys that's actually need leadership being in a leadership position I enjoy that I enjoy doing that and having to sit and listen to guys what they dealing with what kind of problems they working with or what kind of problems they're working with dealing and giving them methods and skills to work with those kind of problems."
    },
    {
      "speaker": "Dannie",
      "time": "00:52:48",
      "upperBoundTime": "00:53:35",
      "content": "So I think leadership and being a mentor working in a social mentor capacity working with people, because these guys they like 19, 20 years old, they like my grandkids that's in jail I have grandchildren you know that age. So it's like man I'm just trying to help you get along and move on through life and you still have a purpose because a lot of guys are lost."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:35",
      "upperBoundTime": "00:53:39",
      "content": "Yeah."
    },
    {
      "speaker": "Dannie",
      "time": "00:53:39",
      "upperBoundTime": "00:53:47",
      "content": "They lost in the system and they really don't know how to get out of that particular field of being lost."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:47",
      "upperBoundTime": "00:54:01",
      "content": "Yeah I think that's a good place to stop is there something else before just before we stop. Is there something else you wanted a chance to say or something I should have asked that I didn't?"
    },
    {
      "speaker": "Dannie",
      "time": "00:54:01",
      "upperBoundTime": "00:54:04",
      "content": "You covered the bases, you covered everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:04",
      "upperBoundTime": "00:54:27",
      "content": "Yeah well let me ask one final question then. For people who are on the outside who never really give very much thought to criminal justice or prison or anything don't really know anything about it they're just busy doing their thing. What would you want that person to know about the reality of living a life without parole sentence?"
    },
    {
      "speaker": "Dannie",
      "time": "00:54:27",
      "upperBoundTime": "00:56:36",
      "content": "I would probably want that person to think about taking a person and not able to give them eligibility for parole give them another chance at going out in society. It's a waste of humanity in that individual that the person is actually not being aware of to think about maybe at some point to give that person another chance or to give that person another opportunity."
    },
    {
      "speaker": "Dannie",
      "time": "00:54:27",
      "upperBoundTime": "00:56:36",
      "content": "Based on individual cases, based on individuality in cases, having that person have another opportunity in society because even the person that is moving along in society right now they actually still pain, paying the bill, they're suffering anyway because they have to pay for in the criminal justice system."
    },
    {
      "speaker": "Dannie",
      "time": "00:54:27",
      "upperBoundTime": "00:56:36",
      "content": "But however you can have an individual that actually did 10, 15, 20 years at some point he still can be productive. He still can give back to society he still went through a process at that point in his life to where he can actually no longer think in the same way, and now he acting a different way and he is going to help out his society."
    },
    {
      "speaker": "Dannie",
      "time": "00:54:27",
      "upperBoundTime": "00:56:36",
      "content": "So I think they should take a second look. The person should take a second look and be more educated get more educated in prison reform and prison rehabilitation and find that it actually does it really work. And look at the classic cases that many of the guys that got out in the last 5 years you probably got about 20 guys, 30 guys that been released in society that did over 20 years plus, and now they functioning citizens in society and they're doing tremendously well."
    },
    {
      "speaker": "Dannie",
      "time": "00:54:27",
      "upperBoundTime": "00:56:36",
      "content": "So just take a second look at the laws and the procedures and the policies and some kind of way maybe could change them just a little bit to where they can have some hope."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:36",
      "content": "Yeah that's a good stop."
    }
  ]
}
