{"name":"","transcript":[{"content":"Darnell Craft Transcription REDACTIONS FINAL"},{"content":"Darnell Craft"},{"content":"Transcribed by Dari Zeltser"},{"content":"10/07/19"},{"speaker":"K:Intvr:Marcus","time":"00:00:02-1","content":"Mr. Craft would you mind starting off by stating your name, the crime you were convicted of, your age at the time, and how much time you've served, and then Iwe'll start the interview."},{"speaker":"DC:Resp:Darnell","time":"00:00:11-6","content":"My name is Darnell Dion Craft i'veI've been convicted of second degree murder uh 1995, I'm from in gibsonGibson louisianaLouisiana."},{"speaker":"K:Intvr:Marcus","time":"00:00:27-2","content":"andAnd how old were you?."},{"speaker":"DC:Resp:Darnell","time":"00:00:29-4","content":"iI was 18 years old."},{"speaker":"K:Intvr:Marcus","time":"00:00:32-2","content":"howHow much time have you servedserved?"},{"speaker":"DC:Resp:Darnell","time":"00:00:34-1","content":"23 years."},{"speaker":"K:Intvr:Marcus","time":"00:00:35-4","content":"Ok Sso mrMr. Ccraft i'mI'm gonnagoing to start by asking you a few questions about your time before coming to angolaAngola uh 18 years of your life before that and of course now more time since that uh that you've served here. Okay s ? soSo let me start by asking you a few questions about your childhood and maybe you can begin by telling me a little bit about the folks who raised you? Ttell me about your family."},{"speaker":"DC:Resp:Darnell","time":"00:00:59-1","content":"Well i'mI'm from a small town called gibsonGibson, louisianaLouisiana uh my mom's a single parent iI grewowed up with 3 2 brothers and one sister. uh Wwe had a nice mom tried her best to take care of us you know we did the best we can. and uh"},{"speaker":"K:Intvr:Marcus","time":"00:01:19-8","content":"whereWhere are you in the birth orderorder?"},{"speaker":"DC:Resp:Darnell","time":"00:01:23-5","content":"oh i'mI'm ii'm second i'mI'm second.."},{"speaker":"K:Intvr:Marcus","time":"00:01:22-7","content":"Ok Sso an older brother, one younger brother and a baby sister."},{"speaker":"DC:Resp:Darnell","time":"00:01:22-7","content":"And an older brother, me, a younger brother, and a baby sister."},{"speaker":"K:Intvr:Marcus","time":"00:01:28-1","content":"okOk Whwhat are they doing tell me about them?."},{"speaker":"DC:Resp:Darnell","time":"00:01:36-6","content":"uh My older brother he live in dallasDallas. HHe uh a police officer my younger brother he used to work for likee $$ uh Oshore, but right now he laid off. um Mmy younger sister she in washingtonWashington DC you know with a nice family."},{"speaker":"K:Intvr:Marcus","time":"00:01:56-9","content":"okOk um Sso is it accurate for me to say that for the most part the efforts that your mother made that you grew up feeling loved and cared for or was it, were you kind of left to your own devices?."},{"speaker":"DC:Resp:Darnell","time":"00:02:13-7","content":"oh iI grew up very very loved definitely. Mmy mother she did the best she can with mostly boys and one girl um she took care of me the way $$ best she can. Sshe worked every day and and made sure she $$ with put food on the table for us."},{"speaker":"DC:Resp:Darnell","time":"00:02:13-7","content":"K:Intvr:Marcus #00:02:30-6#: Okay and are you still in touch with your mother regularly."},{"speaker":"DC:Resp:Darnell","time":"00:02:29-7","content":"Yes iI am. Sshe most definitely in my life."},{"speaker":"K:Intvr:Marcus","time":"00:02:37-8","content":"Does she come visit you herehere?"},{"speaker":"DC:Resp:Darnell","time":"00:02:39-8","content":"Often."},{"speaker":"K:Intvr:Marcus","time":"00:02:41-7","content":"okOkay. Ttell me about the last visit with her, how was that?"},{"speaker":"DC:Resp:Darnell","time":"00:02:40-0","content":"iI really be it be wonderful you know we. uh Shshe's encouraging. you know uh Sshe comes and sometimes iI be down or and she comes in you know uh when and she encourage, she know her child so she just trying tona you know find the best thing to say to me, you know to uplift my spirit as it go so."},{"speaker":"K:Intvr:Marcus","time":"00:03:09-0","content":"Yeah iI imagine that it's extremely difficult for your family to see you here. um i'mI'm gonnagoing to ask you a little bit about that um in a bit uh what about other um friends you had some real close friends that you still stay in touch with from before you came here?"},{"speaker":"DC:Resp:Darnell","time":"00:03:25-3","content":"Well iI had a lot of friends when iI was coming up in uh in the neighborhood but unfortunately when iI got to prison uh they were no more in touch you know."},{"speaker":"K:Intvr:Marcus","time":"00:03:39-2","content":"yeahYeah."},{"speaker":"DC:Resp:Darnell","time":"00:03:41-2","content":"$$ Lived Tthey own life they just faded away."},{"speaker":"K:Intvr:Marcus","time":"00:03:44-5","content":"sureSure iI feel that happens a lot. Um Aside from your mother um iI know a couple of your siblings are out of town do you get other visits who else visits you here."},{"speaker":"DC:Resp:Darnell","time":"00:03:56-9","content":"Yes iI got a girlfriend."},{"speaker":"K:Intvr:Marcus","time":"00:04:01-0","content":"okOk Ttell me about her.."},{"speaker":"DC:Resp:Darnell","time":"00:03:56-6","content":"Her name's Angetele. Sshe comes to see me uh twice a month. Sshe is very supportive. um Sshe understand you know what's really uh actually taking place in Louisiana, $$ she's like a freedom fighter."},{"speaker":"K:Intvr:Marcus","time":"00:04:19-7","content":"Ok Ggreat."},{"speaker":"DC:Resp:Darnell","time":"00:04:17-5","content":"Soo um so she's most definitely uh supportive."},{"speaker":"K:Intvr:Marcus","time":"00:04:23-7","content":"yeahYeah uh how did you meet herher?"},{"speaker":"DC:Resp:Darnell","time":"00:04:26-1","content":"Well iI met her iI met her through the visit, $$ through one of her relatives and it just we became best friends you know."},{"speaker":"K:Intvr:Marcus","time":"00:04:34-4","content":"yeahYeah yeah that's awesome. Hhow long have you known her for?."},{"speaker":"DC:Resp:Darnell","time":"00:04:38-2","content":"Four years."},{"speaker":"K:Intvr:Marcus","time":"00:04:40-4","content":"Ok Ggreat. You said she s freedom fighter tell me a little bit more about that."},{"speaker":"DC:Resp:Darnell","time":"00:04:45-5","content":"um she um She just like, you know um she be like at the rallies you know uh supporting like prison reform, you know doing everything she can do out there to support us ."},{"speaker":"K:Intvr:Marcus","time":"00:05:02-2","content":"yeahYeah."},{"speaker":"DC:Resp:Darnell","time":"00:05:04-3","content":"you know uh Like legislative and just staying on top of stuff and just rally for you know for us to get a second chance.…"},{"speaker":"K:Intvr:Marcus","time":"00:05:08-0","content":"greatGreat."},{"speaker":"DC:Resp:Darnell","time":"00:05:09-7","content":"... aAt life."},{"speaker":"DC:Resp:Darnell","time":"00:05:09-7","content":"5:37"},{"speaker":"K:Intvr:Marcus","time":"00:05:14-2","content":"thatsThat's awesome. Is she in New orleansOrleans?"},{"speaker":"DC:Resp:Darnell","time":"00:05:16-8","content":"No she in Baton Rouge louisianaLouisiana."},{"speaker":"K:Intvr:Marcus","time":"00:05:19-6","content":"Baton Rouge. I've ve interviewed quite a few $$ from gibsonGibson but i'veI've never been there. Sso iI need you to paint a little bit of a picture for me. Sso letslet's say let's go back to when, letslet's say we're both 17 years old k around there, and i'mI'm sitting next to you in front of your door to your house k where you grew up, can you uh tell me what iI can see and hear and smell like paint a picture for me."},{"speaker":"DC:Resp:Darnell","time":"00:05:49-6","content":"Well little country part of Gibson, that's where i'mI'm from its we sitting in the front door of my house, itsit's its a bayou like right across from my house. um Iit's mostly the woods and swamps little country town but iI love it, there iI love it. um everybody know each other everybody's family uh everybody get along most of the part. Soso you got one store huh where everybody go to everybody and you know everybody go to, everybody is just they love each other."},{"speaker":"K:Intvr:Marcus","time":"00:06:26-5","content":"uh huh Is it a what'sa's the racial makeup of the town?"},{"speaker":"DC:Resp:Darnell","time":"00:06:29-8","content":"uhh it'sIts majority black, but it got white down there too but uh they but all us all of are entwined with each other, us in $$ $$ all of us know each other, all of us are like family."},{"speaker":"K:Intvr:Marcus","time":"00:06:41-1","content":"okOk Ggreat. um Sso what about school, do you have any memories from school?."},{"speaker":"DC:Resp:Darnell","time":"00:06:50-1","content":"Yeah. um"},{"speaker":"K:Intvr:Marcus","time":"00:06:52-7","content":"Was school good for you, did you like it it?."},{"speaker":"DC:Resp:Darnell","time":"00:06:54-0","content":"Well to a point iI liked the school. iI used to be on the honor roll when iI was in, in uh…, uhhh iI was on the honor rolell when iI was in elementary school iI used to be doing good uh until iI got to about the 5th grade things were getting down, going down."},{"speaker":"K:Intvr:Marcus","time":"00:07:20-5","content":"okOk Ttell me about that what happened."},{"speaker":"DC:Resp:Darnell","time":"00:07:24-1","content":"um iI just seen my mother struggling and iI start to realize iI aintain't have no dad um my dad had passed away and uh and my mind just started to open up, and iI aintain't started feeling love anymore towards like my father things. . uh $$ $$"},{"speaker":"K:Intvr:Marcus","time":"00:07:43-9","content":"okOk nwoNnow when did your father pass awayaway?"},{"speaker":"DC:Resp:Darnell","time":"00:07:45-7","content":"My dad $$ passed away in 1983."},{"speaker":"K:Intvr:Marcus","time":"00:07:51-9","content":"okOk Aand how old were you."},{"speaker":"DC:Resp:Darnell","time":"00:07:52-2","content":"iI was 7 years old."},{"speaker":"K:Intvr:Marcus","time":"00:07:55-4","content":"Ok Aalright yeah and can you tell me the circumstances under which he passed away."},{"speaker":"DC:Resp:Darnell","time":"00:07:59-1","content":"He passed away, uh actually he got shot. Hhe got killed by a woman. When"},{"speaker":"DC:Resp:Darnell","time":"00:07:59-1","content":"K:Intvr: Okay. ok"},{"speaker":"DC:Resp:Darnell","time":"00:07:59-1","content":"DC:Resp: and iI i started realizing he was gone, and got killed, it started affecting me me."},{"speaker":"K:Intvr:Marcus","time":"00:08:14-6","content":"yeahYeah yeah sure. um Sso what was the um how did how did that manifest itself, idddid you start getting into trouble at school?."},{"speaker":"DC:Resp:Darnell","time":"00:08:25-4","content":"um iI started getting into a lot of trouble. iI started acting out. um iI don't know why um but iI just started just being alone to myself, and started nobody really cared, nobody really loved me."},{"speaker":"K:Intvr:Marcus","time":"00:08:41-1","content":"Ok Ffights? Did you starting getting into fights."},{"speaker":"DC:Resp:Darnell","time":"00:08:43-6","content":"Fighting, expelled expelled from school like every school year from the 5th grade on to to high school."},{"speaker":"K:Intvr:Marcus","time":"00:08:53-0","content":"Ok Wwhat was the highest year of school that you completedcompleted?"},{"speaker":"DC:Resp:Darnell","time":"00:08:51-2","content":"11th grade."},{"speaker":"K:Intvr:Marcus","time":"00:08:58-1","content":"alrightAll right so you kept at it."},{"speaker":"DC:Resp:Darnell","time":"00:09:00-4","content":"yeah Yeah."},{"speaker":"K:Intvr:Marcus","time":"00:08:59-7","content":"alrightAll right and um was that because it was interrupted your school was interrupted you didn't graduate because of this incident."},{"speaker":"DC:Resp:Darnell","time":"00:09:08-1","content":"Yeah basically."},{"speaker":"K:Intvr:Marcus","time":"00:09:10-3","content":"orOr did you just drop out."},{"speaker":"DC:Resp:Darnell","time":"00:09:11-4","content":"iI just drop out. iI just dropped out um just feeling school aintain't working for me."},{"speaker":"K:Intvr:Marcus","time":"00:09:18-7","content":"okOk Hhow were you supporting yourself as a teenagerteenager?"},{"speaker":"DC:Resp:Darnell","time":"00:09:21-9","content":"um My my grandma and my mother take real care of me they give me money and stuff and by being from the country I used to make a little hustle to cut they make us cut grass and you know stuff like that."},{"speaker":"K:Intvr:Marcus","time":"00:09:34-7","content":"Ok Ggreat. Um No fighting at home."},{"speaker":"DC:Resp:Darnell","time":"00:09:36-7","content":"Yeah my brothers."},{"speaker":"K:Intvr:Marcus","time":"00:09:38-8","content":"yeahYeah ok ok."},{"speaker":"DC:Resp:Darnell","time":"00:09:42-8","content":"FightM my brothers, I don't fight with my brothers."},{"speaker":"K:Intvr:Marcus","time":"00:09:44-9","content":"alrightAllright. Were there any men in your mothersmother's life that came into your life?"},{"speaker":"DC:Resp:Darnell","time":"00:09:50-5","content":"Yeah iI had a stepdad."},{"speaker":"K:Intvr:Marcus","time":"00:09:53-0","content":"Tell me about him."},{"speaker":"DC:Resp:Darnell","time":"00:09:55-0","content":"My stepdad at first um we ain't iI didn't like him."},{"speaker":"DC:Resp:Darnell","time":"00:09:55-0","content":"10:24"},{"speaker":"DC:Resp:Darnell","time":"00:09:55-0","content":"you know iI aintain't wannawant to $$ in with being my step dad but eventually it went on iI see he's taking care of, really he take care of me and my family and my brothers and my sisters. Soso iI started to like him iI did iI did develop a relationship with him up here."},{"speaker":"DC:Resp:Darnell","time":"00:09:55-0","content":"K:Intvr: Ok."},{"speaker":"DC:Resp:Darnell","time":"00:09:55-0","content":"DC:Resp: In angolaAngola we got closer before he passed away."},{"speaker":"K:Intvr:Marcus","time":"00:10:29-4","content":"oh Ok Anand how did he pass awayaway?"},{"speaker":"DC:Resp:Darnell","time":"00:10:30-6","content":"Lung cancer."},{"speaker":"K:Intvr:Marcus","time":"00:10:32-5","content":"okOk i'mI'm sorry. Um But your mother's still healthy right?"},{"speaker":"DC:Resp:Darnell","time":"00:10:36-1","content":"Yyes sir."},{"speaker":"K:Intvr:Marcus","time":"00:10:40-3","content":"um we a lot of A lot of folks experience some kind of abuse as a child it's much more common than people think, was that part of your childhood? Physical or sexual abuse at all?"},{"speaker":"DC:Resp:Darnell","time":"00:10:51-4","content":"Yeah iI was uh mentally and physically abused uh iI was uh molested a few times."},{"speaker":"K:Intvr:Marcus","time":"00:11:01-5","content":"Ok Aand can you tell me a little bit more about that. we You don't have to talk about it if you don't want to, its up to you."},{"speaker":"DC:Resp:Darnell","time":"00:11:04-6","content":"No problem for you. uh Wwhen iI was iI was at the age of like 11 11 years old, iI was molested um a few times."},{"speaker":"K:Intvr:Marcus","time":"00:11:16-4","content":"byBy who?"},{"speaker":"DC:Resp:Darnell","time":"00:11:18-3","content":"uh By a guy he end up coming in prison uh he end up coming the same prison i'mI'm in now. iI end up meetingbeating him here. uh Hehe just got out of prison and came home and you know uh iI was a little child and uh asked me to ride uh ride with me on my bicycle, and iI give him a ride, and he end up molesting me."},{"speaker":"K:Intvr:Marcus","time":"00:11:37-0","content":"yeahYeah and did you feel that that experience kind of also contributed to you acting out?"},{"speaker":"DC:Resp:Darnell","time":"00:11:47-0","content":"Oh most definitely iI worsened. So would have $$ and had $$ so when iI got to, my momma tried her best she just never asked me whatswhat's what's really going on with me, you know as a single parent she aintain't know uh but when iI got older you know that age of 15, 14, iI went towent acting out real worse, and iI just didn't care."},{"speaker":"K:Intvr:Marcus","time":"00:12:17-7","content":"Yeah iI mean you've had quite a bit of time uh that has passed since then. Wwhen you lookok back on that, you know now with the wisdom that time gives you when you lookok back on it, um do you see that as being a major factor in in how you ended up here or was it just part of a whole series of things that ended up getting you here."},{"speaker":"DC:Resp:Darnell","time":"00:12:39-5","content":"iI think it was definitely a major factor then because iI aintain't have no control of it, iI aintain't have no big brother to really sit down and talk to me. Soso iI just did things iI just you know um what iI feel."},{"speaker":"K:Intvr:Marcus","time":"00:12:51-2","content":"rightRight and did iI imagine you wouldn't have the tools to make sense of what was going on very few children did."},{"speaker":"DC:Resp:Darnell","time":"00:13:01-0","content":"Right right iI didn't understand what really was going on."},{"speaker":"K:Intvr:Marcus","time":"00:13:04-8","content":"youYou said earlier that you ended up meeting him here. um"},{"speaker":"DC:Resp:Darnell","time":"00:13:08-4","content":"Yeah."},{"speaker":"K:Intvr:Marcus","time":"00:13:13-9","content":"Do you do you have any kind of relationship with this man now."},{"speaker":"DC:Resp:Darnell","time":"00:13:15-6","content":"Well at first uh when iI got here, when iI first ran across him. We had a fight, um he $$ $$ iI was angry to the point iI fought him. um Before he left, then $$ $$ we actually build a relationship you know um he told me he's sorry and iI accepted his apology. and um"},{"speaker":"K:Intvr:Marcus","time":"00:13:43-0","content":"Sure sure ok well we can move on from that. um Aany relationships with girls before coming here. iI know you have a relationship right now with somebody you met 4 years ago but what about when you were a teenager close girlfriend you might have had?"},{"speaker":"DC:Resp:Darnell","time":"00:13:59-0","content":"Yeah iI i talked to one of $$ $$ named them now. $$ $$ iI be talking to her. Sshe's my junior high sweetheart my first love and uh iI always talk to her, she encouraged me."},{"speaker":"K:Intvr:Marcus","time":"00:14:15-6","content":"yeahYeah what's she doing with her lifelife?"},{"speaker":"DC:Resp:Darnell","time":"00:14:18-5","content":"uh She she works. Sshe got a family and uh she doing pretty goodwell."},{"speaker":"DC:Resp:Darnell","time":"00:14:18-5","content":"K:Intvr:Marcus: okOk #00:14:24-8# Yyeah that's good. Um Do you have any childrenchildren?"},{"speaker":"DC:Resp:Darnell","time":"00:14:29-5","content":"Yes iI have one daughter one daughter and one stepdaughter ."},{"speaker":"K:Intvr:Marcus","time":"00:14:37-8","content":"Ok Tthe stepdaughter through the woman that you refer to $$ who you met before, , your $$ tell me about your first child."},{"speaker":"DC:Resp:Darnell","time":"00:14:37-8","content":"My first daughter um she's 22, thatsthat's my baby baby girl uh she she."},{"speaker":"K:Intvr:Marcus","time":"00:14:52-1","content":"whatsWhat's her namename?"},{"speaker":"DC:Resp:Darnell","time":"00:14:54-4","content":"Her name Dariane johnsonJohnson she live in Port $$ Arthur, texasTexas. uh Sshe is very supportive. Sshe got, I a got a little granddadughtergranddaughter, and she just love her papa most definitely."},{"speaker":"K:Intvr:Marcus","time":"00:15:07-1","content":"yeahYeah iI hope have they've been able to visit you here."},{"speaker":"DC:Resp:Darnell","time":"00:15:09-0","content":"Yeah my daughter always come, but iI ain't never seen my granddaughter yet, i'llI'll hopefully get to see her."},{"speaker":"K:Intvr:Marcus","time":"00:15:14-3","content":"howHow old is she your granddaughtergranddaughter?"},{"speaker":"DC:Resp:Darnell","time":"00:15:21-1","content":"She two years old."},{"speaker":"K:Intvr:Marcus","time":"00:15:22-7","content":"Ok Sso she's itty bitty."},{"speaker":"DC:Resp:Darnell","time":"00:15:23-1","content":"Yeah itty bitty."},{"speaker":"DC:Resp:Darnell","time":"00:15:23-1","content":"15:47"},{"speaker":"DC:Resp:Darnell","time":"00:15:23-1","content":"K:Intvr:Marcus: okOk #00:15:26-7# Aalright um did you get arrested uh do you know iI know you were acting out $$ did you get you got in trouble with the school. Ddid you get in trouble with the law prior to this particular charge."},{"speaker":"DC:Resp:Darnell","time":"00:15:39-7","content":"Yeah iI got in trouble with the law uh before this charge."},{"speaker":"K:Intvr:Marcus","time":"00:15:46-9","content":"beforeBefore this charge yeah and were you arrested before this."},{"speaker":"DC:Resp:Darnell","time":"00:15:51-5","content":"uhh Yeah iI was arrested before uh on a charge, but not too much with the law."},{"speaker":"K:Intvr:Marcus","time":"00:15:58-7","content":"L Right right . let me ask you something if this particular charge hadn't happened the way it did, let's say you just you didn't get out of bed that day how do you think your life would have progressed from there there? Wwhat do you envision would have happened over the next few years."},{"speaker":"DC:Resp:Darnell","time":"00:16:13-8","content":"To be honest with you, um probably come to prison or dead. ."},{"speaker":"DC:Resp:Darnell","time":"00:16:13-8","content":"K:Intvr: Ok."},{"speaker":"DC:Resp:Darnell","time":"00:16:13-8","content":"DC:Resp: i was a um iI was out of control. iI had nobody to really um be there in my corner you know to sit down and just be there and let me know it was gonnagoing to be all right. iI just like basically just started just hanging in the streets p."},{"speaker":"DC:Resp:Darnell","time":"00:16:13-8","content":"K:Intvr: yeah Yeah."},{"speaker":"DC:Resp:Darnell","time":"00:16:13-8","content":"DC:Resp: Pretty much much."},{"speaker":"K:Intvr:Marcus","time":"00:16:42-9","content":"Yeah um one of the things behind this project is the realization that for a lot of folks if they hadn't gotten arrested and brought to angolaAngola, a lot of them tell me that they think they might have been dead you know and uh things were getting very dangerous."},{"speaker":"DC:Resp:Darnell","time":"00:17:08-3","content":"Right yeah it's very true. The life um like iI started $$ living,just iI know it wasn't right. iI just started doing drugs, selling drugs just trying to stay, do the best iI can."},{"speaker":"DC:Resp:Darnell","time":"00:17:08-3","content":"20:18"},{"speaker":"K:Intvr:Marcus","time":"00:17:24-2","content":"mhm sureSure um you just mentioned doing drugs and selling drugs. Wwere drugs and alcohol part of your life in terms of what you did, not not selling them in terms of using them?."},{"speaker":"DC:Resp:Darnell","time":"00:17:34-9","content":"Yeah it was $$ um iI started smoking weed at the age of like um probably like 10 years old."},{"speaker":"DC:Resp:Darnell","time":"00:17:34-9","content":"K:Intvr: Okay."},{"speaker":"DC:Resp:Darnell","time":"00:17:34-9","content":"DC:Resp: iI was trying to na cope, trying tona get away, and then iI graduate from that, and got away from that and started doing cocaine, um starteding drinking, just by depression uh what i'mI'm feeling."},{"speaker":"K:Intvr:Marcus","time":"00:18:02-6","content":"sureSure iI understand that iI mean iI think a lot of people medicate uh that way. um .. iI want to switch gears and talk a little bit about your life since coming here um but iI also want to make sure that i'veI've gotten a pretty good picture in this very short time of you uh as a kid. um Isis there something else iI should know about you something else you wanted to tell me about like your childhood before you grew up.we move on?"},{"speaker":"DC:Resp:Darnell","time":"00:18:30-6","content":"Yeah um iI was a good kid coming up, um uh very loved, and you know iI just um wanted to do all the right things. you know i'mI'm from a small country town not too much violence, uh iI've never seen too much violence, uh just wanted to be good people, just wanted to live up in the right with people. . $$"},{"speaker":"K:Intvr:Marcus","time":"00:18:58-2","content":"mhm um Ok Sso obviously you know i'veI've explained a little bit to you about the project already but one of the reasons that we're talking with you is that first of all you were very very young when you were convicted of this. Yyou um have spent more than 20 years in here. Yyou are a trustee. Yyou are considered a trusted member of this community."},{"speaker":"K:Intvr:Marcus","time":"00:18:58-2","content":"Yyou are a very different man than you were when you came here but let's go back for a minute and revisit uh the young Darnell Craft who was brought through the gates of angolaAngola can you describe that guy?"},{"speaker":"DC:Resp:Darnell","time":"00:19:41-6","content":"Yeah when iI was brought through the gates of angolaAngola oh Llord iI was .. was. Llike the prison was prison prison prison then, um young young teenager in a grown mansman's world. um iI was confused. iI was scared. um iI didn't know what to do. iI had no friends here u. h Nnobody here from gibsonGibson. iI was by myself, iI was alone and just trying to find my way through prison."},{"speaker":"K:Intvr:Marcus","time":"00:20:17-9","content":"yeahYeah tell me about your first few weeks, months here, how was that?."},{"speaker":"DC:Resp:Darnell","time":"00:20:22-2","content":"uh My first few weeks were hard iI just cry all day wonder why God why me all the questions of that. um $$ A long journey uh got here went to the cell blocks, um guys here was like you know um try to take advantage of the young, you know um fought a lot here, and end uh in uh in a making aboard, a $$ you know going to population. I went to population, stayed down there, about stayed population probably 2 weeks before iI got hit in my eye. It happened you know in my sleep, and then iI lose my eye here, um and just things just down hilldownhill, about but for the last 5 first 5, 6 years for me."},{"speaker":"K:Intvr:Marcus","time":"00:21:20-3","content":"yeahYeah a lot of fighting a lot of self preservationself-preservation, it was $$ for you. ."},{"speaker":"DC:Resp:Darnell","time":"00:21:22-0","content":"Right right yeah a lot of fighting."},{"speaker":"K:Intvr:Marcus","time":"00:21:25-9","content":"yeahYeah and what are these fights about."},{"speaker":"DC:Resp:Darnell","time":"00:21:29-6","content":"About you know my manhood first off justof all. Just being a man, um uh not being strong, $$ um just willing toreally stand up for me, kyou know not let nobody take advantage."},{"speaker":"K:Intvr:Marcus","time":"00:21:44-6","content":"yeahYeah sure iI understand. um .. it'sIt's a veryI it seems to me that what i'veI've learned from you guys is that it's a very different place now now."},{"speaker":"K:Intvr:Marcus","time":"00:21:44-6","content":""},{"speaker":"K:Intvr:Marcus","time":"00:21:44-6","content":"DC:Resp: Okaymhm."},{"speaker":"K:Intvr:Marcus","time":"00:21:44-6","content":"K:Intvr: andAnd young guys coming in now, don't have to deal with quite as much of that is that true."},{"speaker":"DC:Resp:Darnell","time":"00:22:02-8","content":"That's true uh angolaAngola is very changed um the prison today is you know um you know they got a lot of reentry programs, a lot of programs set up uh in, the uh a lot of you know churches here, at least ten you know our faith. you know Aa lot of positives things going on here positive work."},{"speaker":"K:Intvr:Marcus","time":"00:22:31-4","content":"mhm yeahYeah can you tell me how you how you've changed over the time iI mean everybody changes in 20 years, what are the changes, whatswhat's the transformation been for you."},{"speaker":"DC:Resp:Darnell","time":"00:22:46-6","content":"um iI changed a lot in um $$ $$ my mind uh iI believe in God um first thing. Um i'mI'm a mentor here iI mentor."},{"speaker":"DC:Resp:Darnell","time":"00:22:46-6","content":"25:53"},{"speaker":"DC:Resp:Darnell","time":"00:22:46-6","content":"The the young who come in here. um"},{"speaker":"K:Intvr:Marcus","time":"00:22:55-5","content":"Is that through reentry or just."},{"speaker":"DC:Resp:Darnell","time":"00:23:05-3","content":"Just mentoring just on the yards."},{"speaker":"DC:Resp:Darnell","time":"00:23:05-3","content":""},{"speaker":"DC:Resp:Darnell","time":"00:23:05-3","content":"K:Intvr: Ok."},{"speaker":"DC:Resp:Darnell","time":"00:23:05-3","content":"DC:Resp: you know um Young guys who having a hard time finding theythe way trying tona find theythe way to get get out, or just you know $$ $$ just help them on theythe way on their journey. .. Uh Things like that mostly, but a lot of things hasis changed uh very positively in angola Angola."},{"speaker":"K:Intvr:Marcus","time":"00:23:31-8","content":"mhm yeahYeah, um can you describe what your typical day lookokss like now?"},{"speaker":"DC:Resp:Darnell","time":"00:23:39-3","content":"My day is pretty. $$ $$ um iI just iI go to work andum come back. um"},{"speaker":"K:Intvr:Marcus","time":"00:23:49-3","content":"What's your jobjob?"},{"speaker":"DC:Resp:Darnell","time":"00:23:51-4","content":"uh iI work uh tier walking watching, you know go help guys in the cell block um who having a hard time who got a demerit write up you know we'll talk to them stop them from you know uh you know acting out or doingor doing back things maybe want to commit suicide uh just things like that iI talk to them about my hope and just keep on just be strong you know God won't make you wait for us to get out. $$"},{"speaker":"K:Intvr:Marcus","time":"00:24:30-2","content":"yeahYeah is is what are what are the main things that you deal with on the tier what are the main kinds of issues that come. um"},{"speaker":"DC:Resp:Darnell","time":"00:24:33-8","content":"um aA lot of dudes that are depressed, got so much time here you know um they don't feel like they're going home no more. They thought um $$ wiatwait not be loved, and iI feel the same way sometimes too. here um justJust things like that, you know but thing be on our shoulders boiled down, you know so iI deal with most of that, you know nobody care."},{"speaker":"K:Intvr:Marcus","time":"00:24:59-2","content":"itsIt's the idea of just having a life sentence. Iis it mainly the life sentence that creates the problems for so many guys."},{"speaker":"DC:Resp:Darnell","time":"00:25:08-5","content":"oo It's just that, uh matter of fact just having a life sentence guy went probably ustus just yesterday went to court came back got a life sentence on his back, and he like a new dog just in seeing his owner he's just. phss"},{"speaker":"K:Intvr:Marcus","time":"00:25:24-1","content":"yeahYeah how did he get that is, he a juvenile offender."},{"speaker":"DC:Resp:Darnell","time":"00:25:31-0","content":"No uh he uh he was very young he been here 24 years same as me, but uh he went back to court, and uh they reversed his charge charge, and give him a lesser time ."},{"speaker":"K:Intvr:Marcus","time":"00:25:40-7","content":"ohOh. N"},{"speaker":"K:Intvr:Marcus","time":"00:25:40-7","content":"DC: $$"},{"speaker":"K:Intvr:Marcus","time":"00:25:40-7","content":"K: now he has an update."},{"speaker":"DC:Resp:Darnell","time":"00:25:45-2","content":"Yeah like still got 2 years left, but thatsthat's like like heaven to him, he knows he is gonnagoing to get out, so he better keep on his lifen. $$"},{"speaker":"K:Intvr:Marcus","time":"00:25:52-8","content":"yeahYeah no iI can imagine thatsthat's a huge difference."},{"speaker":"DC:Resp:Darnell","time":"00:26:00-0","content":"Right right."},{"speaker":"K:Intvr:Marcus","time":"00:26:01-0","content":"and One of the things that I'm trying to explore in this project is how people handle that sense of hopelessness, the idea of not ever getting out. you know"},{"speaker":"K:Intvr:Marcus","time":"00:26:01-0","content":"K: Tell me a little bit about coping with a life sentence."},{"speaker":"DC:Resp:Darnell","time":"00:26:11-4","content":"uh Well it's so hard um if it wouldn't be for my um my family, my mother, my girlfriend, my daughters, uh especially my grandbaby, iI love her. um iI just trying tona do my best tryingna put my my focus and my energy on the positive and put Ggod first you know not not iI try to walk by faith, not by sight, or just the things. iI think if you walk by sight you know it will get the best of you."},{"speaker":"DC:Resp:Darnell","time":"00:26:11-4","content":"29:57"},{"speaker":"DC:Resp:Darnell","time":"00:26:11-4","content":"Um"},{"speaker":"K:Intvr:Marcus","time":"00:26:53-7","content":"Tell me about that explain that please."},{"speaker":"DC:Resp:Darnell","time":"00:26:55-9","content":"um Putting your trust in Ggod. Llet Ggod work it out for you. you know i'mI'm a very religious man iI believe in God so iI just let God uh iI read my Bbible daily. uh iI go to church service daily my pastor is george um georgeGeorge Spears um and he just come around and just he just love on us and we just love on each other and try to do our best while we here, but it's the most definite, um it's been a long journey, have the feeling, don't have any release date, um being incarcerated 24 hours a day."},{"speaker":"K:Intvr:Marcus","time":"00:27:41-5","content":"Yeah no iI understand. um Aare there a bunch of different organizations that you've been a part of here? Hhave you taken advantage of any of the trades the certificates or any of the clubs."},{"speaker":"DC:Resp:Darnell","time":"00:27:53-9","content":"Yeah iI took uhok iI took several. iI tookok a a lot of trade. iI took um iit took $$ $$took Faith Be, for a year. iI tookokk that i took malachiMalachi dads iI know how to father for my children iI took AA and now substance abuse everything what iI supposed to get here. i'mI'm still working on a trade but i'mI'm doing what i'mI'm supposed to do."},{"speaker":"K:Intvr:Marcus","time":"00:28:15-1","content":"whatWhat about the GED."},{"speaker":"DC:Resp:Darnell","time":"00:28:20-4","content":"iI didn't get the GED yet because i'mI'm kindakind of like a slow learner. uh iI mean iI know that in school uh but uh iI am in school."},{"speaker":"K:Intvr:Marcus","time":"00:28:31-5","content":"sureSure um do you know anything about the impact that this had on the victimsvictim's family."},{"speaker":"DC:Resp:Darnell","time":"00:28:39-0","content":"Yeah um .. through my trials iI seen it then."},{"speaker":"K:Intvr:Marcus","time":"00:28:45-6","content":"yeahYeah tell me about that."},{"speaker":"DC:Resp:Darnell","time":"00:28:47-4","content":"My family was sitting on my side, theiry family sitting on the side mother''s just constantly crying, uh sisters just constantly crying, everybody going hysteric, $$ $$ uh everybody just you know uh angry, mad, uh seeing all the faces iI can see, uh you know the things like that but just a lot of hurt ."},{"speaker":"DC:Resp:Darnell","time":"00:28:47-4","content":"K:Intvr: yeahYeah."},{"speaker":"DC:Resp:Darnell","time":"00:28:47-4","content":"DC:Resp: iIn the victivictim family."},{"speaker":"DC:Resp:Darnell","time":"00:28:47-4","content":"K:Intvr:Marcus: yeahY#00:29:20-0# Yeah can you please something that you might be more familiar with can you tell me a little bit about the impact that this has had on your family."},{"speaker":"DC:Resp:Darnell","time":"00:29:28-0","content":"uh.. It had a big impact on my family. Mmy mother uh she uh went to going down uh and seeing me in prison. Her health was kind of um $$ $$ $$ going down a little bit, coming to e and see her uh mesee me in prison like this, uh by me not understanding about what's really going on. you know Or hhow serious the matter was when iI was younger. Wwhen iI first got to prison iI thought iI was just gone do 10 years and get out not knowing the law. iI was uh illiterate to the law, iI didn't know iI just thought ten years on a life sentence iI get out."},{"speaker":"K:Intvr:Marcus","time":"00:30:11-9","content":"mhm youYou thought that a life sentence meant ten years."},{"speaker":"DC:Resp:Darnell","time":"00:30:15-4","content":"mhm Ten years then you get out."},{"speaker":"K:Intvr:Marcus","time":"00:30:18-7","content":"yeahYeah there was a time when that was what it meant before 72."},{"speaker":"DC:Resp:Darnell","time":"00:30:21-1","content":"Right that what iI thought that what guys were telling me then when iI got to angolaAngola start asking questions and say life is life. You're not going home unless they you know um reflip your case, you know um that's the only way other than that, you're gonnagoing to die here."},{"speaker":"DC:Resp:Darnell","time":"00:30:21-1","content":"So that was like a scary feeling there, and iI started to tell my mother all these things, starting telling 19 years no more .iI didn't know how to tell her. Sso there's like an 8 year part iI told her iI said um life is life. you know Sshe's like, you're not comincoming on 10 years. i'mI'm like nah. Iif they don't turn me turn my case."},{"speaker":"K:Intvr:Marcus","time":"00:31:06-6","content":"mm how'sHow's she been copingcoping?"},{"speaker":"DC:Resp:Darnell","time":"00:31:09-1","content":"Well she's she's doing her best. Sshe's doing it. um iI could say she very supportive but iI can see every time she come through these gates, it's just tearing her apart."},{"speaker":"K:Intvr:Marcus","time":"00:31:21-9","content":"yeahYeah. How far is the drive from gibsonGibson?"},{"speaker":"DC:Resp:Darnell","time":"00:31:25-9","content":"um About 3 and a half hours."},{"speaker":"K:Intvr:Marcus","time":"00:31:28-0","content":"soSo itsit's pretty itsit's a long day."},{"speaker":"K:Intvr:Marcus","time":"00:31:28-0","content":"35:35"},{"speaker":"DC:Resp:Darnell","time":"00:31:29-8","content":"mhm About 7 hourshour's altogether and all to come."},{"speaker":"K:Intvr:Marcus","time":"00:31:35-8","content":"whatWhat about um your siblings, how have they handled it."},{"speaker":"DC:Resp:Darnell","time":"00:31:50-0","content":"um My older brother, um he by him being in law enforcement he turned his back on me. Um So like did the crime do the time. Mmy younger brother he 100 percent% with me. Mmy sister she 100 percent % with me."},{"speaker":"DC:Resp:Darnell","time":"00:31:50-0","content":"K:Intvr: sureSure."},{"speaker":"DC:Resp:Darnell","time":"00:31:50-0","content":"DC:Resp: Like just things like that that."},{"speaker":"K:Intvr:Marcus","time":"00:32:03-5","content":"yeahYeah but it again iI imagine it is hard for them to see you here.So"},{"speaker":"K:Intvr:Marcus","time":"00:32:03-5","content":"y"},{"speaker":"K:Intvr:Marcus","time":"00:32:03-5","content":"DC:Resp: Right."},{"speaker":"K:Intvr:Marcus","time":"00:32:03-5","content":"K:Intvr: soSo your older brother the police officer he doesn't visit you here."},{"speaker":"DC:Resp:Darnell","time":"00:32:14-1","content":"No, he only has visited me one time since i'veI've been here."},{"speaker":"K:Intvr:Marcus","time":"00:32:16-2","content":"Ok. Do you understand how he might feel or not."},{"speaker":"DC:Resp:Darnell","time":"00:32:22-7","content":"No not really iI don't understand because we were close coming up. all iI did lookoked it up to my brother. iI wonder always wonder why now, why he don't dont' forgive me or come see me. ."},{"speaker":"K:Intvr:Marcus","time":"00:32:36-8","content":"yeahYeah sure. Have you tried to um communicate with him?"},{"speaker":"DC:Resp:Darnell","time":"00:32:39-8","content":"Yeah years ago trying to reach out to him but .. no.. iI guess he's just still in his ways."},{"speaker":"K:Intvr:Marcus","time":"00:32:51-0","content":"sureSure. Um iI said earlier on you know one of the things we're exploring is sort of this change that occurs behind prison walls over time and some people can point to a very specific thing either a mentor uh sometimes it's a religious awakening um and other times it's just people just get older and they get they get tired and stop looking for a new way to be can you tell me a little bit about what it was for you personally."},{"speaker":"DC:Resp:Darnell","time":"00:33:28-7","content":"Well um me personally it was just my journey was like constantly fighting and getting in trouble um stuff like that uh iI started acting out didn't have nobody here no friends no family um. and Then um and iI had some guys you know probably like georgeGeorge $$ gusy here started you know talking in my life, started you know asking me to come to church, uh asking me to uh just start to uh get in different programs. and"},{"speaker":"DC:Resp:Darnell","time":"00:33:28-7","content":"iI start to um started to get involved with different people who actually come in prison too like coming out in prison here and iI just started getting in programs and iI started just like bettering myself and start thinking more positive and start doing more positive stuff ."},{"speaker":"K:Intvr:Marcus","time":"00:34:31-6","content":"yeahYeah it sounds like you're also trying to pass that on to the young guys and be that person for them."},{"speaker":"K:Intvr:Marcus","time":"00:34:31-6","content":"DC:Resp:Darnell #00:34:38-8#: Right. Right causebecause iI see the road they going down. iI mostly definitely see me in them. you know um iI most definitely know what they feel. um iI know why it is they acting out the way they acting out. Sso iI just try to tell them iI understand man and be the big brother what iI hadn't had coming up. what i $$ $$"},{"speaker":"K:Intvr:Marcus","time":"00:34:41-5","content":"sureSure sure but is it diff is there a difference in the young guys who are coming in now than the young guys that came in with you."},{"speaker":"DC:Resp:Darnell","time":"00:35:02-7","content":"Yeah it's a big difference because the young guys like me when iI came in here um it just very very few and had more olderolder guys."},{"speaker":"DC:Resp:Darnell","time":"00:35:02-7","content":"K:Intvr: Ok."},{"speaker":"DC:Resp:Darnell","time":"00:35:02-7","content":"DC:Resp: Than younger guys so you know you was in like iI said it was a grown man world, but now it's more a younger guys and $$ older guys. Sso um but it's a little different with young, they like they're faster every day, iI say that you know they're faster, um theiry they mindset is different."},{"speaker":"K:Intvr:Marcus","time":"00:35:46-3","content":"yeahYeah how how so tell me a little bit about that."},{"speaker":"DC:Resp:Darnell","time":"00:35:52-1","content":"They um iI guess by the world changing technology and you know um i'mI'm a country boy. iI was raised with a $$ you know just thingsa barn, and do its just when they like, iI guess when they grewowed up in theythe neighborhoods, um it's just fast. you know Tthey just learn more, they just pick up fast, the technology just like, at the age of 8 years old they got phones and different things. Iit's different and just we're slower slower and they're faster.."},{"speaker":"DC:Resp:Darnell","time":"00:35:52-1","content":"K:Intvr: yeahYeah."},{"speaker":"DC:Resp:Darnell","time":"00:35:52-1","content":"DC:Resp: And they faster."},{"speaker":"K:Intvr:Marcus","time":"00:36:35-3","content":"okOk um Ddo you see any guys come up from gibsonGibson?"},{"speaker":"DC:Resp:Darnell","time":"00:36:38-3","content":".. Well iI got about very few like still about 4, not very many come from gibsonGibson you know um to prison I think, i uh but it a few of them here w."},{"speaker":"DC:Resp:Darnell","time":"00:36:38-3","content":"K:Intvr: sureSure."},{"speaker":"DC:Resp:Darnell","time":"00:36:38-3","content":"DC:Resp: With a life sentence."},{"speaker":"K:Intvr:Marcus","time":"00:36:53-8","content":"um What is it that you would want a pardon board to know theyrethey're gonnagoing to theyrethey're gonnagoing to tell you iI see them all the time they're gonnagoing to ask you why should we give you a second chance."},{"speaker":"DC:Resp:Darnell","time":"00:37:04-0","content":"ha iI wannawant to say pLEASEplease give me a chance um iI did everything what iI supposed to do uh i'mI'm no longer the man iI was when iI came here. um iI just love people um and you can forgive me for my mistake iI made and just lookok $$ the credibility what iI did while iI was in angolaAngola to change, like that old selfish person is long gone. ."},{"speaker":"DC:Resp:Darnell","time":"00:37:04-0","content":"K:Intvr: yeahYeah yeah."},{"speaker":"DC:Resp:Darnell","time":"00:37:04-0","content":"DC:Resp: i'mI'm a new person now, 100%0 percent."},{"speaker":"K:Intvr:Marcus","time":"00:37:36-3","content":"Yeah that makes sense to me um you were telling me a little bit about how violence was the main sort of thing that characterized your life when you first got here having to constantly fight for your manhood you said. Aand things changed a little bit and as and as you're now an older member of this community and you're not fresh in here, what's the worst thing you have to deal with today?."},{"speaker":"DC:Resp:Darnell","time":"00:38:00-9","content":"Well the worst things is just $$ part just being around men 24//7, you know um and just you know ujmjump calling my kids, seeing my kids, you know thatsthat's my mom you know when theycome visit me. uh Tthat's just part you know iI got strong in a lot of areas but just every time iI see my mom or my kids or uh my girlfriend just when they leave out the gate, a part of me leaving you know with them and iI can't go."},{"speaker":"K:Intvr:Marcus","time":"00:38:40-8","content":"yeahYeah yeah... Um Of all the things that you've accomplished and it's been quite a bit that you were telling me about. Wwhat are you the most proud of of the man you are today."},{"speaker":"DC:Resp:Darnell","time":"00:38:57-1","content":"um Just self changeself-change you know just i'mI'm so happy oh you know like no more negatives just a lot of positive now and for people who are around me you know even for security you know um good relationship with them you know uh that iI never had, never thought it would never happen but all us here at angolaAngola it's a family. Wwe really are, $$ from security you know to inmates if you do the right thing you don't have to worry about you know um security. you know Tthen Ggod gone bless you with them on your side."},{"speaker":"K:Intvr:Marcus","time":"00:39:37-9","content":"sureSure sure... Um you know Do you think that iI mean everybody has their own coping mechanism you know for dealing with life without parole here and uh it sounds to me that you've turned to to Ggod to kind of cope with that and make sense of that. Aand iI understand that it's a common strategy."},{"speaker":"K:Intvr:Marcus","time":"00:39:37-9","content":"and um do you you know Wwhen you when you see folks getting buried here out at Point Lookokout it uh it just remind you guys that that's a possibility. Wwhat do you think, how do you think most people here deal with it?"},{"speaker":"DC:Resp:Darnell","time":"00:40:16-3","content":"um Let me tell you allall about this. Uh iI used to be a health $$ iI used to work in the hospital in the ward and uh iI done seen many many many friends my real partners, my family inmate who die in my arms, who i'mI'm taking care of in the hospital, cleaning up, i'mI'm bathing them. and i just"},{"speaker":"DC:Resp:Darnell","time":"00:40:16-3","content":"iI did that for 4 years straight, and that's just teared my heart to pieces because the reality is you know it could be me, you know and um iI just iI ain't want the job no more because iI went to thinking down iI don't wannawant to do this. iI don't wannawant to, um iI see it first handfirsthand."},{"speaker":"DC:Resp:Darnell","time":"00:40:16-3","content":""},{"speaker":"DC:Resp:Darnell","time":"00:40:16-3","content":"45:35"},{"speaker":"DC:Resp:Darnell","time":"00:40:16-3","content":"AndAnd a lot of people die here with cancer,council with TB, uh $$ $$ uh tvTV just a lot of things, what we drink here are uh not healthy or eat not healthy, and it's just basically enventually you just die out."},{"speaker":"K:Intvr:Marcus","time":"00:41:28-0","content":"yeahYeah iI think it takes a very special person to do that kind of work."},{"speaker":"DC:Resp:Darnell","time":"00:41:35-2","content":"i'mI'm very special. Aa lot of guys uh can't do it because it's so much reality in they faces, um seeing guys actually just you know beg for they lives, uh just die very sick um helpless can't do anything for they self cantself-can't walk, cantcan't eat, um can't bathe theyselfthyself. uh Sso it take especially a type a kind of a person to do that. so um"},{"speaker":"K:Intvr:Marcus","time":"00:42:07-4","content":"Is this hospice work? Or just?."},{"speaker":"DC:Resp:Darnell","time":"00:42:08-8","content":"Yeah hospice work."},{"speaker":"K:Intvr:Marcus","time":"00:42:10-3","content":"soSo its hospice."},{"speaker":"DC:Resp:Darnell","time":"00:42:08-6","content":"Yeah. ."},{"speaker":"DC:Resp:Darnell","time":"00:42:08-6","content":"K:Intvr: Ok."},{"speaker":"DC:Resp:Darnell","time":"00:42:08-6","content":"DC:Resp: i was uh iI was like uh iI wasn'twasn't in hospice work, but iI was in health care this my job. iI was an $$ assistant to the nurses, uh what they cantcan't do to the inmate, iI do like bath them and feed them, and get theythe water, and you know walk them around try to make sure they get their strength and stuff like that, uh writing letters."},{"speaker":"K:Intvr:Marcus","time":"00:42:39-7","content":"soSo you must have known redbird."},{"speaker":"DC:Resp:Darnell","time":"00:42:41-5","content":"Redbird, yeah. d yeahH he was a very good friend of mine, he's very happy now."},{"speaker":"K:Intvr:Marcus","time":"00:42:45-8","content":"yeahYeah he's going home."},{"speaker":"DC:Resp:Darnell","time":"00:42:47-6","content":"He's going home. yeah Mmy um girlfriend actually um you know theiry family in Baton Rouge, and they said he is doing well."},{"speaker":"K:Intvr:Marcus","time":"00:42:54-8","content":"yeahYeah good iI hope iI wish good things for him."},{"speaker":"K:Intvr:Marcus","time":"00:42:54-8","content":"DC:Resp: Yeah."},{"speaker":"K:Intvr:Marcus","time":"00:42:54-8","content":""},{"speaker":"K:Intvr:Marcus","time":"00:42:54-8","content":"K:Intvr: um So tell me a little bit about this this is a slightly easier question when you uh imagine uh getting out of here right you there's some people who go home like you said you just ran into somebody who got his case reversed, he is going home, but he's a different man."},{"speaker":"DC:Resp:Darnell","time":"00:43:20-0","content":"Right."},{"speaker":"K:Intvr:Marcus","time":"00:43:21-7","content":"whenWhen you imagine yourself out of here, what does it lookok like? Ccan you paint a picture about what what would you, what do you see yourself doing."},{"speaker":"DC:Resp:Darnell","time":"00:43:31-2","content":"God willing. he uh iI just wannawant to get a job, you know just work and just be with my my daughter and my grandbaby, just you know just live an old country life like like iI've been living, like you know just being with my family and just enjoying the rest of $$ my days and try to impact people life. iI wannawant to do so much. iI wannawant to talk to students like in school. you know iI wannawant to coach the football teams and stuff like that because iI know how to play sports, iI played before just so much. iI wannawant to make an impact on a on the future children that's going out and acting out. generation like thatsthat's. thats $$ $$"},{"speaker":"K:Intvr:Marcus","time":"00:44:22-2","content":"yeahYeah yeah do you think that there are some skills that you picked up here at angolaAngola that would be useful to supporting yourself when you leave leave?"},{"speaker":"DC:Resp:Darnell","time":"00:44:27-7","content":"Yeahh um pretty much uh iI know how to work. iI know how to um do like uh like healthcare work iI did that um iI know how to do uh like landscaping work, I know how to do that. and iI do that uh you know $$ workT there's a lot of stuff in angolaAngola iI picked up you know iI know how to do."},{"speaker":"K:Intvr:Marcus","time":"00:44:59-5","content":"Sure sure great. Sso let me ask you one last thing um is there something that in my um attempt to try to learn about you as a as aa person. Isis there something that iI should have asked you that iI didn't ask you or is there something about the experience that you've gone through at angolaAngola and dealing with life without parole that iI should have asked you about that iI didn't that you want to talk about?"},{"speaker":"DC:Resp:Darnell","time":"00:45:21-7","content":"Yeah iI just wannawant to just say to the legislation and to theto the people, uh they got people here very changed and you know when they're young they made a mistake in their life but um they got to prison and they very much changed now. We're all um $$ people and we just ask for a second chance. you know iI never had a chance know uh. We're that's a $$ you know uh you just asking for a chance to get out, to be with our loved ones, and make a difference in our community."},{"speaker":"K:Intvr:Marcus","time":"00:45:59-8","content":"mhm Sure makes sense to me. yeah alright alright."},{"speaker":"K:Intvr:Marcus","time":"00:45:59-8","content":"DC:Resp: Than you much."},{"speaker":"K:Intvr:Marcus","time":"00:45:59-8","content":"K:Intvr: Thank you very much."},{"speaker":"K:Intvr:Marcus","time":"00:45:59-8","content":"DC:Resp: Thank you man man."}]}