{"name":"","transcript":[{"content":"Darren James transcription REDACTIONS FINAL"},{"speaker":"Darren","time":"00:00:00-0","content":"My name is Darren James. My date of birth is 9/14/67. I was convicted for first-degree murder. I have been incarcerated for 30 years."},{"speaker":"Marcus","time":"00:01:20-6","content":"And you were 22?"},{"speaker":"Darren","time":"00:01:23-1","content":"I was 19 years old"},{"speaker":"Marcus","time":"00:01:31-2","content":"You were 19 years old, okay. I'm going to ask you a few questions about growing up, life before the conviction, and then we're going to talk a little about some of the changes you've been through since you've been at Angola here. Can you tell me a little about your family, the folks you were close to, the folks who raised you, what your family life was like?"},{"speaker":"Darren","time":"00:01:51-7","content":"My mother had five kids, three boys and two girls. I am the youngest of the five. My mother, by day she was a domestic worker and by night she worked in the pantry at a restaurant. And my older brother that stayed in the home with us, me and my sister, he was kind of like the overseer while my mother was off at work. But my brother at that time was a teenager so he did a lot of hanging out in school, I mean hanging out in the streets as well."},{"speaker":"Marcus","time":"00:02:31-3","content":"Was there a man in your mother's life that came into your life?"},{"speaker":"Darren","time":"00:02:54-1","content":"Yes. My real dad, I never had a chance to know him. The man that came into my mother's life was real abusive. He was an alcoholic, so my momma was in an abusive relationship when I was small."},{"speaker":"Marcus","time":"00:02:59-1","content":"Is that something you witnessed"},{"speaker":"Darren","time":"00:03:01-8","content":"I witnessed that a lot of times. I witnessed that on various occasions yeah."},{"speaker":"Marcus","time":"00:03:07-6","content":"Is that something that led to fights between you, your brothers, and your stepfather? Well I shouldn't call him your stepfather, but this man"},{"speaker":"Darren","time":"00:03:24-9","content":"No we, I never did get a chance to participate in any of the arguments that he and my mom had. Although there was, you know, sibling rivals at the house between me and my sister and my brother. My older sister and my older brother was grown when I was coming up so they never stayed in the house with me."},{"speaker":"Marcus","time":"00:03:40-6","content":"Okay, so there was a lot of fighting in the house"},{"speaker":"Darren","time":"00:03:46-2","content":"There was a lot of fighting in the house between my step-dad and my mother"},{"speaker":"Marcus","time":"00:03:53-2","content":"Was there fighting outside the house?"},{"speaker":"Darren","time":"00:04:11-1","content":"Yeah there was. There was a lot of fighting outside the house and that was basically based upon the environment that I came in. There was a lot of fights around the house with a lot of the kids. Kid stuff. Kids always fight and I was a part of that."},{"speaker":"Marcus","time":"00:04:13-9","content":"Did your, did this person, this man in your mother's life, were they ever abusive to you?"},{"speaker":"Darren","time":"00:04:20-6","content":"Yes he was. I used to get spanked by him a whole lot. And sometimes I would get spanked by him because he was frustrated that he couldn't get his liquor. Or he was frustrated about some other things and he always wind up taking it out on us, me and my sister and my other brother."},{"speaker":"Marcus","time":"00:04:40-7","content":"So it would be fair to say that opposed to having would it be fair to say that you were not raised in a loving, caring, nurturing home where adults took an interest in you and made sure you were cared for?"},{"speaker":"Darren","time":"00:04:59-7","content":"I believe that would be a fair accuracy of the situation at the time because my mother worked two jobs and when she wasn't home I had a stepfather that was home that was abusive to us as well as abusive to my mother. So yeah that would be an accurate statement."},{"speaker":"Marcus","time":"00:05:20-1","content":"Okay. Did you move a lot when you were a kid?"},{"speaker":"Darren","time":"00:05:28-5","content":"We moved around the city a whole lot. That would led me to going to different schools because you have to be in a certain district to attend a certain school. So every time we would move, I would have to go to another school. So you know, we actually, we did move around the city a lot."},{"speaker":"Marcus","time":"00:05:46-4","content":"The last house that you lived in at the time of your conviction were you, or charge let's say, were you living at home?"},{"speaker":"Darren","time":"00:05:56-9","content":"I was."},{"speaker":"Marcus","time":"00:05:58-7","content":"Where was that?"},{"speaker":"Darren","time":"00:06:01-3","content":"This was on St. Claude Street, right on the edge of the French Quarter."},{"speaker":"Marcus","time":"00:06:06-0","content":"Ok yeah I know exactly where-"},{"speaker":"Darren","time":"00:06:08-8","content":"Around the corner from WWL, and Louis Armstrong Park was like a half a block away Treme area."},{"speaker":"Marcus","time":"00:06:23-4","content":"Right I know exactly where that is, Treme. Was it in public housing?"},{"speaker":"Darren","time":"00:06:23-4","content":"No sir, it wasn't in public housing"},{"speaker":"Marcus","time":"00:06:30-8","content":"Ok so if you could, would you mind, I'm trying to get a mental picture of it. If you could have me standing in the doorway of your house, looking out, what would the scene be? What would you smell and hear?"},{"speaker":"Darren","time":"00:06:38-0","content":"You would probably see kids playing in the street, adults back and forth. You could probably smell food cooking from someone's kitchen, fried chicken or something like that. But basically the neighborhood was like any other neighborhood kids playing and running about, adults going about their daily businesses. Food being cooked in the neighborhood, you could smell it from the various kitchens in the various residences that they had in the neighborhood."},{"speaker":"Marcus","time":"00:07:10-2","content":"Did you feel safe?"},{"speaker":"Darren","time":"00:07:12-9","content":"For the most part I did, yeah."},{"speaker":"Marcus","time":"00:07:21-5","content":"How was school for you? I know you said you moved around a lot."},{"speaker":"Darren","time":"00:07:24-1","content":"I was a slow learner. And that was, they found that out when I was in 3rd grade. I loved school. I loved school a whole lot. As a matter of fact I attended schools that I wanted to be a part of and finish. But because my mother kept moving around the city, every time we moved I would be uprooted from that school. So I really never did get a chance to really adjust to going to one particular school."},{"speaker":"Marcus","time":"00:07:58-3","content":"Do you have memories of having a best friend?"},{"speaker":"Darren","time":"00:08:02-0","content":"Yes I do."},{"speaker":"Marcus","time":"00:08:03-8","content":"Can you tell me about him or her?"},{"speaker":"Darren","time":"00:08:11-7","content":"My best friend was Kent Louis and Kent was a guy that I went to school with. And he stayed around my house. Even when we moved, me and him always seem to be able to hook up some kind of way. On Saturdays I'll go by his house, sometimes he'll come by my house. And we would play with each other, football was the main thing. And that was my best friend that was my childhood friend growing up."},{"speaker":"Marcus","time":"00:08:35-2","content":"When was the last time you were ever in touch with him?"},{"speaker":"Darren","time":"00:08:40-2","content":"I haven't heard from Kent since I've been incarcerated."},{"speaker":"Marcus","time":"00:08:45-1","content":"So do you know how his life turned out?"},{"speaker":"Darren","time":"00:08:46-7","content":"Actually his life turned out pretty good. He moved from the west coast to Seattle. He's a welder and he's been out there ever since."},{"speaker":"Marcus","time":"00:08:56-4","content":"What was your highest grade of school?"},{"speaker":"Darren","time":"00:08:59-2","content":"I completed 12th grade. I never received a diploma because I was in special education so they gave me a certificate of completion."},{"speaker":"Marcus","time":"00:09:14-2","content":"What kinds of education opportunities have you taken up here at Angola?"},{"speaker":"Darren","time":"00:09:21-0","content":"Well, I attended GED school up here, so I got my GED. I've also attended NOBTS, which is the bible college. I got 2 degrees in there. I got my Associates and my Bachelors."},{"speaker":"Marcus","time":"00:09:39-1","content":"Wow. When did you get your degrees? Recently?"},{"speaker":"Darren","time":"00:09:44-2","content":"I got my degrees in 2009"},{"speaker":"Marcus","time":"00:09:52-2","content":"Wow. So can you describe what your typical day is like here? Your routine?"},{"speaker":"Darren","time":"00:10:01-9","content":"Basically, I would get up in the morning, maybe 4:30 in the morning, take me a shower. After I take me a shower I would get out of the shower typically at about 5. Go watch the news at 5:00 then when the news come on I would watch it a little while until they call chow. Then I'd go to breakfast, I'd come back for breakfast. I have a little time before they call work call. Then at about 7:00 they call work call and I'm off to work all the way to 2:30."},{"speaker":"Marcus","time":"00:10:32-1","content":"And what's your job?"},{"speaker":"Darren","time":"00:10:40-3","content":"I work in line 15E. What we basically do is cut grass around the farm. We take care of the farm."},{"speaker":"Marcus","time":"00:10:43-7","content":"So you're outside."},{"speaker":"Darren","time":"00:10:45-7","content":"I'm outside all day basically yeah."},{"speaker":"Marcus","time":"00:10:47-4","content":"Rain or shine?"},{"speaker":"Darren","time":"00:10:49-5","content":"Rain or shine we outside."},{"speaker":"Marcus","time":"00:10:51-7","content":"Ok and what happens after 2:30?"},{"speaker":"Darren","time":"00:10:53-5","content":"Well, after 2:30 I'll come in from work. I'll take me another shower. After I take that shower we'll be waiting on chow. Chow is normally called at about 4:30. I'll go eat. 5:30 when the shift change they have callout here in the education building. I'm involved with a few clubs up here. I am the of the chairman pardon and parole committee."},{"speaker":"Darren","time":"00:10:53-5","content":"So what I do is I prepare my lesson plans for the guys. Those classes are taught on Monday nights and Saturday mornings. So what we do is, we try to prepare the guys for going on the pardon and parole board."},{"speaker":"Marcus","time":"00:11:36-7","content":"Yeah can you tell me a bit about that?"},{"speaker":"Darren","time":"00:11:39-7","content":"Well one of things we do is, we find out the guys that's within a year of their parole date or a year within their hearings for a pardon and what we do is, we send out this list to all of the dorms. And for those guys that have things coming up, we ask them to sign up. Those guys sign up. Once they sign up we get a copy of the callout and we have an orientation class that we bring the guys through."},{"speaker":"Darren","time":"00:11:39-7","content":"And we kind of like give them a syllabus once they get in the orientation class. Once they get in the orientation class we describe to them what the class is all about, what our purpose is, and how we're going to prepare them after they finish this class to go up on the pardon and parole board."},{"speaker":"Marcus","time":"00:12:29-9","content":"So you, do you sort of deal with presentation of self, issues like how to speak to a board, like practical skills"},{"speaker":"Darren","time":"00:12:39-6","content":"Yes well we have a program called breaking the ice. That's one of the programs that we got from Toastmasters. They kind of like help the guys learn how to articulate themselves. Because what we find is that a lot of guys don't know how to articulate themselves once they get in front of the board. And that's seemed to be a big problem here so we took it up on our own to come up with a facilitator's manual to help those guys and prepare those guys for going up on the boards."},{"speaker":"Marcus","time":"00:13:07-7","content":"Yeah I want to get to that actually with your case and ask yourself about how you represent yourself to a parole board too. But a little bit more about how you ended up here. Were drugs and alcohol a big part of your life?"},{"speaker":"Darren","time":"00:13:32-0","content":"I used drugs sparingly. Never alcohol but I smoked a lot of pot occasionally, holidays"},{"speaker":"Marcus","time":"00:13:40-6","content":"But no heavy drugs?"},{"speaker":"Darren","time":"00:13:44-4","content":"No."},{"speaker":"Marcus","time":"00:13:48-7","content":"Can you take just a minute to describe, I'm sure you see people coming here for the first time all the time. I imagine every time they come through the door there you probably must be thinking back to the young man that you were when you came here. Can you describe the young Darren James who came through the gates at Angola? What kind of person was that?"},{"speaker":"Darren","time":"00:14:14-8","content":"When I came to the gates of Angola I was very confused, I was a troubled young man, I didn't have no sense of direction and I think that was because of my upbringing. And I did a lot of things, I stayed in a lot of trouble. I didn't have no discipline in my life so that was the person I was at the time. That's who I was when I first came here. Didn't have any respect for authority, didn't know nothing about working, so that's who that person was at the time."},{"speaker":"Marcus","time":"00:14:56-0","content":"Did you find yourself getting in a lot of fights?"},{"speaker":"Darren","time":"00:15:01-2","content":"I did, I got in some fights when I came up here. Sometimes if you don't get in a fight, you know, you get run over. So sometimes you have to show that you were strong because if you didn't show you were strong then people take advantage of you... So you have to show that sometimes."},{"speaker":"Marcus","time":"00:15:26-5","content":"It's a very different place, from what I gather, than what it was 30 years ago."},{"speaker":"Darren","time":"00:15:30-6","content":"Very different. It's not the same place that it was. When I came here they had a lot of homosexuality going on. They had a lot of stealing, a lot of theft, a lot of drugs and a lot of prostitution going on here. So there was a lot of things going on here that doesn't goes on here now."},{"speaker":"Marcus","time":"00:15:52-7","content":"Why do you think that changed?"},{"speaker":"Darren","time":"00:15:56-0","content":"I think when Warden Cain came and Warden Cain changed the culture of Angola by bringing in certain programs and when he brought those programs and people had opportunity. He brought with him opportunity. Not only did he bring opportunity but he brought change."},{"speaker":"Darren","time":"00:15:56-0","content":"The mindset of the prison guards had changed because that's what he wanted. He wanted change in the institution. So in order to get change, he had to change the way security was thinking. And when he changed the way security was thinking, security kind of like changed the way we were thinking."},{"speaker":"Marcus","time":"00:16:38-1","content":"So 30 years later you are obviously like anyone who's 30 years older, a very different person. So if you were to come before a parole board, what kinds of things would you want them to know with respect to rehabilitation in your own case?"},{"speaker":"Darren","time":"00:17:02-3","content":"When I came here again like I said there wasn't many opportunities. You didn't have the rehabilitating programs that you have now. I was given the opportunity to help change myself but I wanted to change."},{"speaker":"Darren","time":"00:17:02-3","content":"And one of the things that helped me changed was being able to go out and see guys that was in various positions in the penitentiary. Guys that was welding, guys that was building, guys that was cooking. I didn't have any of those skills. I wanted to learn something so I decided to take it up on my own to get me some academic education."},{"speaker":"Darren","time":"00:17:02-3","content":"I wanted to get me a trade, I wanted to do anything that was positive. So in doing that I started pushing myself, I've pushed myself to the rim that nobody thought I could do certain things. And I used to challenge myself and I start challenging myself and the more I challenge myself and see how much I can do, I wanted to challenge myself even farther. So that's one of the things that changed about me. Being able to work hard for what I wanted. And I've worked pretty hard for the things that I've accomplished since I've been here."},{"speaker":"Marcus","time":"00:18:30-3","content":"What are you the most proud of?"},{"speaker":"Darren","time":"00:18:36-8","content":"I'm most proud of the fact that I was able to get through my GED school. That's probably the thing I'm most proud of."},{"speaker":"Marcus","time":"00:18:40-0","content":"That's interesting, more so than even an associate's degree or a bachelor's degree."},{"speaker":"Darren","time":"00:18:53-8","content":"Right, right because I was always told that I would never amount to be, you know I would never amount to be nothing. That I was a knucklehead. And you hear all these negative things about what you can't do. And I kept proving people wrong. When they told me I couldn't do it, I'll find a way to do it. You know so I kept moving on."},{"speaker":"Marcus","time":"00:19:08-4","content":"And the GED's the beginning of that"},{"speaker":"Darren","time":"00:19:11-0","content":"Right."},{"speaker":"Marcus","time":"00:19:17-0","content":"It's interesting, a number of guys have said that same things about the GED, the importance of that GED. Can you tell me a little bit more about, I know the organization you just mentioned about the pardon and parole board? Are there other organizations that you've been part of over the last 30 years?"},{"speaker":"Darren","time":"00:19:31-5","content":"Yeah. I was a part of Toastmasters. That's a group that helped you with your speaking. We had what they call speak up classes. I was a volunteer in the hospice program."},{"speaker":"Marcus","time":"00:19:43-9","content":"Is that your shirt?"},{"speaker":"Darren","time":"00:19:52-1","content":"Yes. The hospice program is my passion. I always looked at myself as being of service to people. And my volunteering to be a part of the hospice program was a part of me helping out. I didn't think I could do it at first but I found that I could. It's an experience that you never experience, sitting with a person and watching that person die. I never thought I could do that, but I challenged myself to do it."},{"speaker":"Darren","time":"00:19:52-1","content":"And that's one of the greatest accomplishments I had since I been here, being a part of the hospice program. I also was a part of Angola's special series project. I was part of the Islamic community. I was part of the AA organization. I was part of lifer's organization. You know, so I was a part of a lot of organizations."},{"speaker":"Marcus","time":"00:20:55-0","content":"Can you tell me a little more about the experience of serving a life sentence without parole and how you make sense of that for your life?"},{"speaker":"Darren","time":"00:21:04-1","content":"I believe that if you commit a certain crime, you should do the time. But at the same time, I believe that you should have the opportunity to get out. If a man been locked up as long as me, I think if he show himself approval that he should be given a chance to get out. We haven't had that chance in Louisiana."},{"speaker":"Darren","time":"00:21:04-1","content":"We have so many guys here that are skilled that are ready to go out and work. I think I'm one of those guys that can serve my community. That can go out and be a law-abiding citizen. You know so yeah"},{"speaker":"Marcus","time":"00:21:53-8","content":"Yeah and there's something about the irony that everybody who comes to Angola notices that this is the place where you have the best vocational training, state of the art stuff, they're not training you with technology that's obsolete. And the folks who seem to take most advantage of all those opportunities are the very folks who will never be released unless something changes. How does that sit with you all?"},{"speaker":"Darren","time":"00:22:28-8","content":"It don't sit well with us because you trying to do the best. You try to give your best, you try to do everything that they ask of you. And when you do it and you rehabilitate yourself and you know you rehabilitate yourself and asking the chance to go out or just to be heard, you can't even get that chance."},{"speaker":"Darren","time":"00:22:28-8","content":"So we would like at least the chance to be heard. But we don't have the chance to be heard. You know, so, it hurts. But hope keeps you going. That's the only thing we have here is hope."},{"speaker":"Marcus","time":"00:23:19-3","content":"So let's examine that for a minute. When you do, you hold on to some hope that you're going to be released, you must have some idea of envisioning what you're going to do with your life should you be released. Tell me about that. What would that look like for you?"},{"speaker":"Darren","time":"00:23:38-9","content":"I always envision myself as going back to my community. Volunteering my time. Helping those that are less fortunate. Being a help to those who can't do anything."},{"speaker":"Darren","time":"00:23:38-9","content":"I want to be able to give my life experience so that someone else don't follow in the steps that I followed. Because once you, you know Angola's like that, like the roach motel, once you go in you never come out. If my life story can be an example for somebody on the street then I'd feel like I did my part."},{"speaker":"Marcus","time":"00:24:27-2","content":"Do you think it would be hospice work you would be interested in doing?"},{"speaker":"Darren","time":"00:24:32-4","content":"I would love to do hospice work on the streets. Because like again, I say that's my passion, helping people. And I did that up here for 9 years. And it's a hell of an experience to help a person and to comfort a person in his last, you know, days of living. So that would be one of the things that I would look forward to doing."},{"speaker":"Marcus","time":"00:25:02-6","content":"So you talked a lot about the changes folks go through and certainly the changes that you've gone through since you've been here. Was that a gradual process for you, or was there some kind of an 'aha' moment like a light bulb went off to turn things around. Was it a slow progression towards realizing that this is not the way you want to keep doing things?"},{"speaker":"Darren","time":"00:25:30-4","content":"I think it was a gradual process for me. I did a lot of things when I came here that was negative. And as I start to get older I started to change my ways. It's just like being on the streets. When a person get older, criminal menopause set in on that person. And that person will stop doing the things they used to do because he's getting older."},{"speaker":"Darren","time":"00:25:30-4","content":"And I think the same thing happened with me here. As I got older I stopped doing some of those things. I started to learn how to respect authority. You know I was a hot head when I first came. But as I got older you would see the gradual development of me over time. You know, so yeah."},{"speaker":"Marcus","time":"00:26:20-5","content":"Yeah. So let me ask you a little bit about the concept of remorse. When you look back on the crime you were convicted for and the victims involved, 30 years have passed. How do you feel?"},{"speaker":"Darren","time":"00:26:43-1","content":"One of the things I regret is the fact that I can't express to the family the remorse that I feel for them. And we are not allowed to write the families because of state law. That's one of the main things that hurt me. I want to be able to express to them, I want to be able to articulate to them my apologies for what I've done."},{"speaker":"Darren","time":"00:26:43-1","content":"So not being able to do that or given the opportunity to do that, that kind of hurt me too. But over 30 years, I just would hope that the family would find somewhere in their heart to forgive me for what I did."},{"speaker":"Marcus","time":"00:27:42-4","content":"Have you forgiven yourself?"},{"speaker":"Darren","time":"00:27:45-1","content":"I have. I have forgiven myself. I think I beat myself up a long time about what I did. Yeah I think I beat myself up all across the head. You know because, had I not did what I did I wouldn't be in the situation that I'm in."},{"speaker":"Marcus","time":"00:27:59-8","content":"So how much punishment is enough punishment?"},{"speaker":"Darren","time":"00:28:05-2","content":"I really can't answer that question."},{"speaker":"Marcus","time":"00:28:09-2","content":"How much should it be, you know, when is it enough? When has a person given enough, paid enough? It's kind of an important question."},{"speaker":"Darren","time":"00:28:24-0","content":"It is. I think after a person have shown themselves to have rehabilitated himself, I think that person should be given a shot at going home. Most people say 20 years is enough. 20 years is a lifetime, it is. And I've been out 30 years so I know it's a long time. What I'm saying, but a lot of times, you know, if you would ask the victim that fact, that same question, the victim would say he should never get out. But we human beings, we make mistakes, you know, I'm not my worst mistake. I'm not that person."},{"speaker":"Marcus","time":"00:29:24-2","content":"Well is there anything, what are the good things about Angola? People, again you know people think \"oh it's prison,\" but there's a lot of good things that are also happening in people's lives here. For you, what's the good stuff?"},{"speaker":"Darren","time":"00:29:36-4","content":"For me I think some of the good things is the fact that I'm able to share my experiences with the young guys that come. To try to put those guys on the righteous path. Because if the older prisoners don't do that, then those guys turn to the wrong path and then all kind of stuff happen with them. They miss out on opportunities that are available here for them."},{"speaker":"Darren","time":"00:29:36-4","content":"So that's one of the things that I cherish, being able to share my story with them. Being able to share my experience with them. And being helpful in this community. Though this is a prison community, this is my community. So if I can be of service to them, I want to be of service to them."},{"speaker":"Marcus","time":"00:30:56-0","content":"How long do you think it takes for most guys, you know crime is for the young. So generally speaking, when people come to prison they are young. And if they have been sentenced to a long sentence, how long generally do you think it takes folks to make that turn?"},{"speaker":"Darren","time":"00:31:21-9","content":"For me, it took over 10 years. Because when you first come here, you seeing all this for the first time. I've never been in the fields, I never knew that cotton grew on little trees. I never picked vegetables out of the field. There is a part of the younger generation that's coming up here that has a rebellious nature. And because they have that rebellious nature, they have to go around to different places to actually see this place."},{"speaker":"Darren","time":"00:31:21-9","content":"This is a large institution and you have to go around to see it to understand where you're at. And a lot of times when you bump your head so many times and you get a hickey and your hickey get big enough, then you stop doing some of the things you was doing."},{"speaker":"Darren","time":"00:31:21-9","content":"You start to learning and you start to understand. You know, so when you first come you going to have that rebellious nature. And it normally takes about 5 to 10 years before you start understanding you not going to beat these people up. So once you understand that."},{"speaker":"Marcus","time":"00:32:48-3","content":"But it takes awhile"},{"speaker":"Darren","time":"00:32:51-2","content":"Yeah it takes awhile"},{"speaker":"Marcus","time":"00:32:52-7","content":"Do you think there's a big difference in the young men who are coming into prison in 2017 compared to when you came in?"},{"speaker":"Darren","time":"00:33:02-0","content":"Yeah and I'll tell you the biggest difference between the two. The younger guys coming in these days, when I came up here they had a lot of sports programs. The prison was consisted of a lot of sports programs. Nowadays the younger guys coming in the prison had never played sports on the streets. We don't have contact sports like we used to. We used to have football but they don't play football no more."},{"speaker":"Darren","time":"00:33:02-0","content":"You have a lot of Mexicans coming into the institution. When I came, there wasn't no Mexicans. But now, you have those Mexican people coming in. You have a different mindset of guys coming in."},{"speaker":"Darren","time":"00:33:02-0","content":"The guys that's coming in now are less violent than they were when I first came because the institution changed. And because the institution changed, then they don't have a reason to be violent when they come up here."},{"speaker":"Marcus","time":"00:34:18-3","content":"Well that's good. So is there something else I should have asked you about? We're trying to learn about your experiences and you as a person. But also shine a light on rehabilitation in the context of life without parole. Is there something else I should have asked you about? Or is there something else you want to talk about or teach us about?"},{"speaker":"Darren","time":"00:34:45-6","content":"The thing that a lot of people misunderstand when they come up here. The prison here don't show all that it has to offer. And people get a chance, you know, people from out on the streets don't have the chance to see this. There are varying parts that they only want to show you. But I think everybody need to be able to see everything. And largely when you guys come up here, you don't see everything"},{"speaker":"Marcus","time":"00:35:25-9","content":"Yeah so tell me what am I not seeing that's important?"},{"speaker":"Darren","time":"00:35:26-8","content":"I think one of the things that you don't see, when the administration want to show something off, there's a certain group of men that they're going to call. If the administration want to do certain things, they're going to set up for a certain inmate. But they got inmates in every capacity in this prison that are rehabilitated. And that's the part that they don't show."},{"speaker":"Darren","time":"00:35:26-8","content":"That's the part you don't see. It's only the people that they put forward to you. These are the people we want you to see. These are the people that we don't want you to see. And a lot of times people come through here, they never see those people. They only see the people that the administration want you to see."},{"speaker":"Marcus","time":"00:36:26-0","content":"Well you mean I should talk to somebody who will be a really good care for that, let me know who they are?"},{"speaker":"Darren","time":"00:36:26-0","content":"I'll sure will."},{"speaker":"Marcus","time":"00:36:26-0","content":"Alright well thank you so much"},{"speaker":"Darren","time":"00:36:26-0","content":"Thank you"},{"speaker":"Marcus","time":"00:36:26-0","content":"Thank you for talking with us. It's really important and I appreciate it."},{"speaker":"Darren","time":"00:36:26-0","content":"Thank you all."}]}