{"name":"","transcript":[{"content":"Darwin Willie Transcription RREDACTIONS FINAL"},{"content":"Darwin Willie"},{"content":"Transcribed by Dari Zeltser"},{"content":"08/17/18"},{"speaker":"DW:Resp:Darwin","time":"00:00:19-1","content":"My name is darwinDarwin willieWillie, i'mI'm in prison for second degree murder and this octoberOctober iI would have served 22 years flat."},{"speaker":"K:Intvr:Marcus","time":"00:00:25-5","content":"howHow old were you?"},{"speaker":"DW:Resp:Darwin","time":"00:00:28-3","content":"iI was 18 years old at the commission of my crime."},{"speaker":"K:Intvr:Marcus","time":"00:00:31-9","content":"um i'mI'm gonnagoing to ask you a few questions about your life before the growing up uh where did you grow up?"},{"speaker":"Resp:Darwin","time":"00:00:39-4","content":"DW: iI grew up in TangipahoaTinville Parish which uh probably the biggest city is around hammondHammond most of uh my dadsmy dad's family is from a place called of Loroja,$$ which is kind of rural and my mom's family is from a town um Latonkin uh both of them are uh my mother's family were dairy farmers and vegetable farmers most of my dadsmy dad's family was into livestock or they getdid what we call blue collar work."},{"speaker":"K:Intvr:Marcus","time":"00:01:14-5","content":"mhmh What did your parents do for a livingliving?"},{"speaker":"DW:Resp:Darwin","time":"00:01:17-5","content":"um My mom was a stay at home mother my dad worked as a he started off as a school teacher and he got a job as a lab tech for a chemical plant."},{"speaker":"K:Intvr:Marcus","time":"00:01:32-4","content":"Do you have siblings?"},{"speaker":"DW:Resp:Darwin","time":"00:01:35-1","content":"iI have one yes."},{"speaker":"K:Intvr:Marcus","time":"00:01:36-4","content":"Tell me about them."},{"speaker":"DW:Resp:Darwin","time":"00:01:38-1","content":"um itsIt's my sister she's probably the uh iI would like to say the smarter of the two in that she has great ability to see things in a more grey area than what iI do and she kindakind of is the person. iI rely on that whenever uh iI have some grand idea that she kindakind of brings me back down to earth by telling me you know you're probably not as intelligent as you think you are."},{"speaker":"K:Intvr:Marcus","time":"00:02:06-3","content":"Is she older than you?"},{"speaker":"DW:Resp:Darwin","time":"00:02:08-7","content":"No she's younger."},{"speaker":"K:Intvr:Marcus","time":"00:02:11-2","content":"whatsWhat's her namename?"},{"speaker":"DW:Resp:Darwin","time":"00:02:13-8","content":"Her name is kristieKristie."},{"speaker":"K:Intvr:Marcus","time":"00:02:16-1","content":"um Are you still in frequent contact with your parents and your sistersister?"},{"speaker":"DW:Resp:Darwin","time":"00:02:17-7","content":"Yes yes uh fortunately they have not abandoned me in my incarceration."},{"speaker":"K:Intvr:Marcus","time":"00:02:19-9","content":"mhm Did your parents get along?"},{"speaker":"DW:Resp:Darwin","time":"00:02:29-3","content":"uh They got along until they decided to get a divorce you know and they they're cordial with one another of course their divorce is uh you know things get a little intense sometimes but uh they're cordial now they can talk and converse and sit in the same room together. So iI would say they can get along yes."},{"speaker":"K:Intvr:Marcus","time":"00:02:33-2","content":"howHow old were you when they split up."},{"speaker":"DW:Resp:Darwin","time":"00:02:47-4","content":"Wow letslet's see iI was iI wannawant to say 9 years old."},{"speaker":"K:Intvr:Marcus","time":"00:02:51-8","content":"Were there and did you live with your mother."},{"speaker":"DW:Resp:Darwin","time":"00:03:01-3","content":"hmm Well no initially iI lived with my father and then for a time iI went and lived with my mother and then for a time iI went back and lived with my father."},{"speaker":"K:Intvr:Marcus","time":"00:03:09-1","content":"Were there other men in your mothersmother's life who came into your life?"},{"speaker":"DW:Resp:Darwin","time":"00:03:14-9","content":"uh Yes she had remarried uh once uh while iI was still a kid uh it was alright iI mean as a kid iI guess you're more distraught behind the uh separation of family uh your loss of ideology behind this uh concept that you've constructed that you found security in in life and when that is destroyed and you don't have another concept to replace it with to find security in you act out. and"},{"speaker":"DW:Resp:Darwin","time":"00:03:14-9","content":"Especially when you're younger and you don't know how to deal with the emotions that you're feeling or you have no experience to be able to gauge what is happening everything seems extreme. and So uh iI guess you interpret everything in a survival type mindset which probably intensifies things way more than what they actually are."},{"speaker":"K:Intvr:Marcus","time":"00:04:21-4","content":"mhm Was there physical violence in your home?"},{"speaker":"DW:Resp:Darwin","time":"00:04:26-4","content":"No."},{"speaker":"K:Intvr:Marcus","time":"00:04:28-3","content":"whatWhat about outside the home did you fight a lot?"},{"speaker":"DW:Resp:Darwin","time":"00:04:31-5","content":"No iI wasn't really a fighter"},{"speaker":"K:Intvr:Marcus","time":"00:04:33-6","content":"whatWhat was school like for youyou?"},{"speaker":"DW:Resp:Darwin","time":"00:04:35-5","content":"School was fine uh actually probably school was maybe a little slow for me iI uh not trying to brag or anything else but iI do a pretty good job of comprehending the information if its presented fairly thoroughly and uh sometimes iI would catch on and iI was as a kid you know if you don't hold their attention they get bored."},{"speaker":"DW:Resp:Darwin","time":"00:04:35-5","content":"So iI would get bored you know and doodle here and doodle there its wasntwasn't so much getting in trouble as can you pay attention. So iI was thinking pay attention for what i'veI've got this stuff already why do iI need to rehear it again. so"},{"speaker":"K:Intvr:Marcus","time":"00:05:20-5","content":"Did you was this did you graduate from high school?"},{"speaker":"DW:Resp:Darwin","time":"00:05:24-2","content":"Yes."},{"speaker":"K:Intvr:Marcus","time":"00:05:27-3","content":"okOk um what were your plans when you graduated from high schoolschool?"},{"speaker":"DW:Resp:Darwin","time":"00:05:34-8","content":"Wow man uh you know you look back as you get older and you realize i'mI'm surprised that i'mI'm alive because iI should have you know iI was an idiot uh my plans really weren't nothing iI had almost no plans iI had a thought of going to a technical school to pursue a technical trade, and d"},{"speaker":"DW:Resp:Darwin","time":"00:05:34-8","content":"5:38t"},{"speaker":"DW:Resp:Darwin","time":"00:05:34-8","content":"Then uh right prior to the offense. iI decided to well you know let's go into the military and iI was pursuing that at the time that iI committed the offense"},{"speaker":"K:Intvr:Marcus","time":"00:06:06-9","content":"Did you have a particular branch of the serviceservice?"},{"speaker":"DW:Resp:Darwin","time":"00:06:09-1","content":"Just to show you how much of an idiot iI was yeah iI was going into the army because uh iI had aan aunt that was married to a recruiter. So you know it just easiest path to take uh $$ as bad probably the first 15 jobs iI got were in mechanics or diesel mechanics and me being the kid that iI was, i'mI'm thinking i'veI've never worked on nothing mechanical in my life and so what other options. iI think iI chose like telecommunications or some kind of communications which was the least thing iI was apparently qualified for."},{"speaker":"K:Intvr:Marcus","time":"00:06:42-6","content":"Were there any other adults that took an interest in you other than your parentsparents?"},{"speaker":"DW:Resp:Darwin","time":"00:06:44-5","content":"Yeah yeah grandparents had a great influence a couple of aunts you know but mainly it was sprobabyprobably grandparents."},{"speaker":"K:Intvr:Marcus","time":"00:07:02-1","content":"soSo grandparents on both sides?"},{"speaker":"DW:Resp:Darwin","time":"00:07:03-6","content":"Yes iI would say yes."},{"speaker":"K:Intvr:Marcus","time":"00:07:05-1","content":"Are they still alive?"},{"speaker":"DW:Resp:Darwin","time":"00:07:07-1","content":"No."},{"speaker":"K:Intvr:Marcus","time":"00:07:09-4","content":"okOk which one were you closest to?"},{"speaker":" DW:Resp:Darwin","time":"00:07:11-4","content":"Probably my father's father."},{"speaker":"K:Intvr:Marcus","time":"00:07:14-1","content":"fathersFathers father whatswhat's your last memory of him?"},{"speaker":"DW:Resp:Darwin","time":"00:07:17-5","content":"Wow uh besides attending his funeral was just you know him coming up here probably not so much a specific memory but more of who he is as a person he just uh he had a real easy way of being able to reach you and how to express himself in a manner to where you either understood what he was asking not what he was telling."},{"speaker":"DW:Resp:Darwin","time":"00:07:17-5","content":"But what he was asking and you didn't feel ashamed because of something he did to make you feel ashamed it was like iI should do better because of the respect and the care iI have for this person. you know So his mannerism was like if anybody says iI have a memory of him itsit's his mannerism that they have a memory of."},{"speaker":"K:Intvr:Marcus","time":"00:08:20-1","content":"yeahYeah. Do you still get visits quite often here?"},{"speaker":"DW:Resp:Darwin","time":"00:08:21-7","content":"uh Not as much as iI used to but iI still get visits from time to time."},{"speaker":"K:Intvr:Marcus","time":"00:08:23-9","content":"otherOther guys say that as time goes on it gets harder and harder."},{"speaker":"DW:Resp:Darwin","time":"00:08:25-6","content":"Yeah itsit's just uh out of sight out of mind some of it is that and some of it is just the natural cycle of life as siblings grow up they have children they have jobs life becomes more responsible and they don't have the time they dontdon't have the freedom of time to be able to take off to come visit. and As parentsparent's age they have health concerns and they also have responsibilities and some people begrudge that but if you sit down and think about it it just makes sense."},{"speaker":"K:Intvr:Marcus","time":"00:08:57-0","content":"sureSure sure um is your home your childhood home in a rural area."},{"speaker":"DW:Resp:Darwin","time":"00:08:59-4","content":"iI would say yes."},{"speaker":"K:Intvr:Marcus","time":"00:09:06-3","content":"okOk i'mI'm trying to imagine it if i'mI'm sitting on your you know on your porch let's say um what would iI what would the scene look like paint this paint the picture for me."},{"speaker":"DW:Resp:Darwin","time":"00:09:21-2","content":"Alright let me paint the picture by asking this question is uh iI have one home iI grew up in that was before we moved to another place and then you have the homes that after the divorce"},{"speaker":"K:Intvr:Marcus","time":"00:09:34-2","content":"Okay."},{"speaker":"DW:Resp:Darwin","time":"00:09:36-2","content":"iI grew up in as well so."},{"speaker":"K:Intvr:Marcus","time":"00:09:37-7","content":"soSo let's do the most recent one where you were living uh in your senior year of high school."},{"speaker":"DW:Resp:Darwin","time":"00:09:43-4","content":"Ok so iI was living with my dad when i'mI'm a senior in high school uh we live next to an interstate so you're gonnagoing to hear traffic like constantly."},{"speaker":"K:Intvr:Marcus","time":"00:09:49-7","content":"sureSure."},{"speaker":"DW:Resp:Darwin","time":"00:09:58-4","content":"But itsit's a wooded area as well you know we have neighbors within distance but itsit's not like we're packed on each other you know you still go to the woods and hunt you know we've got bird dogs my dad likes to quail hunt. So you know you hear the dogs barking outside something like that."},{"speaker":"DW:Resp:Darwin","time":"00:09:58-4","content":"10:04"},{"speaker":"DW:Resp:Darwin","time":"00:09:58-4","content":"You know Mmost of my grandparentsgrandparents' house if you go there you know you walk out its fences and open fields with cattle in them uh crops in the ground. you know"},{"speaker":"K:Intvr:Marcus","time":"00:10:29-9","content":"sureSure."},{"speaker":"DW:Resp:Darwin","time":"00:10:32-4","content":"itsIt's just your idealistic farm."},{"speaker":"K:Intvr:Marcus","time":"00:10:34-2","content":"Yeah sure iI think iI get a picture of it is there a place you know like when you look back on our childhood sometimes we have this place that we associate this with good things and being safe something like a harbor of all of the place that you were as a child is there one that stuck out to you like this is where i'mI'm home this is the best place for me."},{"speaker":"DW:Resp:Darwin","time":"00:10:58-3","content":"(laughs) Kitchen table. Uh Well iI don't know iI think iI considered anywhere that my family was."},{"speaker":"K:Intvr:Marcus","time":"00:11:00-2","content":"Ok sure."},{"speaker":"DW:Resp:Darwin","time":"00:11:13-1","content":"iI felt safe and secure you know because uh don't misinterpret the use of this terminology but it was kindakind of clan ish you know to point to where if youreyou're my family then iI don't have to question your intentions toward me iI dontdon't need not to feel safe."},{"speaker":"K:Intvr:Marcus","time":"00:11:32-3","content":"iI understand that very well. Um So family was the important thing there."},{"speaker":"DW:Resp:Darwin","time":"00:11:33-8","content":"Yes."},{"speaker":"K:Intvr:Marcus","time":"00:11:35-3","content":"whatWhat about close friends outside of the family."},{"speaker":"DW:Resp:Darwin","time":"00:11:36-7","content":"uh Yeah iI mean iI had friends growing up going through school stuff like that."},{"speaker":"K:Intvr:Marcus","time":"00:11:37-8","content":"anyoneAnyone you would consider a best friend, soul mate."},{"speaker":"DW:Resp:Darwin","time":"00:11:48-2","content":"wow (laughs) No iI don't think if iI consider them a soulmatesoul mate i'mI'm sure they dontdon't consider me a soulmatesoul mate but iI mean iI had some friends and iI think iI could go back and talk to a few of them but iI don't think iI don't think iI could say you know a real soulmatesoul mate."},{"speaker":"DW:Resp:Darwin","time":"00:11:48-2","content":"I had friendly, iI have friendships we've helped each other out on various things you know you could rely on each other but to say that man iI knew without a shadow of a doubt that this person is within the same security setting as my family iI don't think iI ever actually."},{"speaker":"K:Intvr:Marcus","time":"00:12:34-0","content":"So darwinDarwin um your um life story as i'mI'm understanding it up until your senior year of high school um it doesn't look like iI can't ask you to say well you know how did you end up going down this wrong path."},{"speaker":"DW:Resp:Darwin","time":"00:12:35-8","content":"(laughs) Right."},{"speaker":"K:Intvr:Marcus","time":"00:12:53-6","content":"soSo it seems that everything was relatively conventional and you know sort of normal uh you weren't getting in trouble um do you was this the first time you were arrested?"},{"speaker":"DW:Resp:Darwin","time":"00:12:55-4","content":"Yes."},{"speaker":"K:Intvr:Marcus","time":"00:12:57-3","content":"soSo can you give me a brief sense of how how we got to this point?"},{"speaker":"DW:Resp:Darwin","time":"00:12:58-2","content":"ah Let's see let me see if iI could summarize it for you. In 1995 iI was in a relationship with a girl uh she ended up getting pregnant um obviously that wasn't a good thing for her family you know nor mine but it was it was and iI had an ideology concept of this is what happens or this is what you do."},{"speaker":"DW:Resp:Darwin","time":"00:12:58-2","content":"And just being young you know and lack of experience you don't realize that maybe everybody doesn't see it from the same angle as you do and so when they're when they didn't want me involved anymore it was a probably a crucial blow to who iI was and my concept you know uh of what should happen."},{"speaker":"K:Intvr:Marcus","time":"00:14:08-1","content":"sheShe wanted to keep the baby but didn't want you involved?"},{"speaker":" DW:Resp:Darwin","time":"00:14:09-6","content":"Right and so iI think probably that really pushed me into iI hate to use depression but iI can't think of a better word for it. you know and So uh iI just did a good job of hiding it well and going throughout my day but iI never dealt with the issue iI never turned to the people who probably could help me the most who did care probably about who iI was. and So iI hid it from the ones iI needed to show it to the most."},{"speaker":" DW:Resp:Darwin","time":"00:14:09-6","content":"And just one bad decision after anotherr uh got involved with another guy and he was in a situation. and So iI had these emotions going through me that iI have no reference point iI wish to deal with them to gauge them i'mI'm not asking for help. uh"},{"speaker":" DW:Resp:Darwin","time":"00:14:09-6","content":"14:56"},{"speaker":" DW:Resp:Darwin","time":"00:14:09-6","content":"For whatever reason pride ignorance lack of maturity and uh eventually you reach a point where you're looking for some type of uh not so much some type of release but some type of uh what's the word i'mI'm looking for here"},{"speaker":"K:Intvr:Marcus","time":"00:15:29-8","content":"distractionDistraction?"},{"speaker":"DW:Resp:Darwin","time":"00:15:31-5","content":"Yes thank you you're looking for a distraction you're looking for something to some action to to do to get what's in me out and iI guess uh just as things were he seemed a good opportunity to uh for me to be able to feel something he wanted done and in my state iI was in iI played that part and iI ended up taking the life of uh robertRobert Penton.$$"},{"speaker":"K:Intvr:Marcus","time":"00:16:03-6","content":"ofOf a what?"},{"speaker":"DW:Resp:Darwin","time":"00:16:05-4","content":"robertRobert Penton?(?)"},{"speaker":"K:Intvr:Marcus","time":"00:16:07-1","content":"oh Ok."},{"speaker":"DW:Resp:Darwin","time":"00:16:09-4","content":"and iI say that because iI always try to make make it a person you know a lot of times you hear guys in here and you'll hear them say my victim or the person iI committed a crime against and in trying to trying to mature trying to accept responsibility. iI want to give him a name and a face because that's he is a name and a face he's someone's son you know he's someonessomeone's brother. So iI don't want to devalue his position in this world or his placement or you know what iI did."},{"speaker":"K:Intvr:Marcus","time":"00:16:43-1","content":"mhm um In your mind then did you have a good reason?"},{"speaker":"DW:Resp:Darwin","time":"00:16:46-1","content":"No iI don't even think iI had a good reason it was such a tumultuous chaotic swirl of emotions that uh iI was just looking for something to try to stop it and drugs and alcohol have never been an attraction for me maybe in this instance it would have been the lesser of two evils iI don't know but it just never has. But you know it's just one bad decision after another and once you get to rolling down a hill it's really hard to stop."},{"speaker":"K:Intvr:Marcus","time":"00:17:10-7","content":"um When you look back on what happened and the family and as you say this person um it's been 22 years? That's a very very long time itsit's longer than you were alive before. You were a kid when you look back on that what how do you feel what is the feeling you know people talk about remorse but after so much time you've been punished every day for 22 years what are your feelings about that?"},{"speaker":"DW:Resp:Darwin","time":"00:18:03-0","content":"iI mean on one hand you say my feelings with this is that iI guess on one hand you say that is there such a thing as mercy? You know Is there such a thing as forgiveness is there such a thing as uh another opportunity despite a worst action? Is one abnormal moment in time the definition of who we are as a person throughout our entire life or is it only a definitive moment in our lifetime that creates some change in us in some way.way?"},{"speaker":"DW:Resp:Darwin","time":"00:18:03-0","content":"And i you know iI try to do better and in trying to do better sometimes you get the self pityself-pity party iI guess that uh you know man look at what i'veI've done look at what i'veI've tried to do and look at who iI was before this is an isolated incident its abnormal it's a mutation of if you were to ask consensually of who iI would have been characterized as and at the same time you say you know if that would have been someone close to me how would iI feel about it. and"},{"speaker":"DW:Resp:Darwin","time":"00:18:03-0","content":"So you battle between uh asking for mercy and yet being on the same foot if you're honest with yourself uh of a person who would want vengeance as well. and So uh itsit's kind of like sitting in the judgesjudge's seat iI think it's a really stressful really really difficult position to be in and uh you know iI just don't know. At times iI ask for mercy and at times iI say it's my just consequences. And its uh itsit's a battle back and forth between those 2 extremes."},{"speaker":"K:Intvr:Marcus","time":"00:20:23-7","content":"howHow much vengeance is enough?"},{"speaker":"DW:Resp:Darwin","time":"00:20:25-3","content":"iI don't think any amount of vengeance is enough iI mean just a person who is bitter iI don't think they ever actually have enough. iI think vengeance is the point that it almost becomes a characteristic of who we are it comes again it calls its an insatiable thirst no matter how much water you drink you're still thirsty you still want more."},{"speaker":"K:Intvr:Marcus","time":"00:20:33-0","content":"Have you had any contact with the victimsvictim's family?"},{"speaker":"DW:Resp:Darwin","time":"00:20:58-9","content":"Yes."},{"speaker":"DW:Resp:Darwin","time":"00:20:58-9","content":"20:47"},{"speaker":"K:Intvr:Marcus","time":"00:21:00-9","content":"Can you tell me about thatthat?"},{"speaker":"DW:Resp:Darwin","time":"00:21:01-8","content":"wow in… 19.. No it was in 2000 it was in 2009 iI was fortunate enough that the warden appeared at the time had uh decided to help me out send me to a lesser uh intense security facility in order to do that. You have to have permission from or you needed permission from your victims or your victimsvictim's family."},{"speaker":"DW:Resp:Darwin","time":"00:21:01-8","content":"and So a meeting was brought about through channels that iI don't you know have full information of and iI got to sit down across the table from them and actually have a conversation with them. and uh iI was able to express you know my remorse not just because i'mI'm in prison but because iI understand what iI did to them to their family you know to their entire way of life as much as mine was changed. and"},{"speaker":"DW:Resp:Darwin","time":"00:21:01-8","content":"My familyies was changed iI changed theirs. and So iI was able to express that you know and truly try to convey if words are able to convey you know the depth of your sincerity and your you know your remorse for what you did. iI tried to do that and thankfully they're people of faith and you know they had come past the point- not that they didn't hurt or not that they didn't have loss or uh pain in their lives still from that occurrence."},{"speaker":"DW:Resp:Darwin","time":"00:21:01-8","content":"But that they had come to a point of forgiveness in their lives toward me and even at the end of it they you know they asked to give me a hug and they hugged me. and Since then you know we off and on stay in a relation they talk to my family and stuff like that.that you know you know i They say you know that they wouldn't they don't want to see me die in prison. Which.. You know is more than what really iI could ask for."},{"speaker":"K:Intvr:Marcus","time":"00:23:31-0","content":"yeahYeah that must have been so intense. There are so many people who would long for an opportunity to apologize to talk to the victims and tell them how they feel?"},{"speaker":"DW:Resp:Darwin","time":"00:23:33-1","content":"iI would hope so yeah."},{"speaker":"K:Intvr:Marcus","time":"00:23:40-6","content":"soSo for them vengeance stops short of a life sentence."},{"speaker":"DW:Resp:Darwin","time":"00:23:49-5","content":"Yes for them after talking with them you know more than just that conversation they've taken in the consideration that you know this is something that's done as horrible as it is and as irreparable as it is it is done and iI think they take into consideration my family's position and iI think they even go so far amazingly as it is to put themselves in the position of say my father or my mother or my sister and ask what would we want if our son was in that position?"},{"speaker":"DW:Resp:Darwin","time":"00:23:49-5","content":"And for them to do that is more than you can even ask and hope for but that they did iI think allowed them to get past that point of vengeance and bitterness in their lives that may have consumed them and to be able to show mercy and actually come to some point of forgiveness you know toward the situation toward me."},{"speaker":"K:Intvr:Marcus","time":"00:24:51-9","content":"yeahYeah um was there any relationship at the time between the two families or actually what was the relationship between you and this person?"},{"speaker":"DW:Resp:Darwin","time":"00:24:53-7","content":"uh We had actually went to the same high school"},{"speaker":"K:Intvr:Marcus","time":"00:25:00-3","content":"Ok so you knew each other."},{"speaker":"DW:Resp:Darwin","time":"00:25:03-2","content":"Yes we did and we didn't have an issue with one another my issue was a side issue but uh the people iI was associating with uh it was basically an uh exchange that iI wanted something over here and they wanted this over here. and So thatsthat's how that how my lack of maturity and uh my selfishness spilled over into their lives."},{"speaker":"K:Intvr:Marcus","time":"00:25:20-6","content":"soSo,"},{"speaker":"K:Intvr:Marcus","time":"00:25:20-6","content":"25:45"},{"speaker":"K:Intvr:Marcus","time":"00:25:20-6","content":"Um you've never gotten in trouble never been in a jail you're 18 iI could just only imagine what how insane that must have all felt um and then you go in to angolaAngola where you've only heard terrible things s… do you remember your first few days here?"},{"speaker":"DW:Resp:Darwin","time":"00:25:39-2","content":"Yeah iI can $$ my first few days but iI remember the bus ride up you know the emotions you're on the bus ride up."},{"speaker":"K:Intvr:Marcus","time":"00:25:40-7","content":"you'reYou're handcuffed?"},{"speaker":"DW:Resp:Darwin","time":"00:25:42-3","content":"oh Yeah you're definitely shackled and restrained and every horror story that you've ever heard or could imagine is running through your mind and you know you're afraid you know you're trying not to be consumed by fear but fear at the time is trying to consume you partially because of what you've heard and what you don't know and when you go into a place where you don't know anything and you're young and you don't have any life experiences with which to be able to try to say i'veI've been in this before or this is how i'mI'm gonnagoing to deal with the situation."},{"speaker":"DW:Resp:Darwin","time":"00:25:42-3","content":"Well now again you're back in that mode of i'mI'm just trying to survive i'mI'm trying not to you know lose my life or have my life become maimed you know to a point that iI may not feel that iI can recover from and so you're fearful and out of that fear you try to uh iI guess compensate for that trying to not be aggressive. But you're aware and you're cautious and you deal with every situation as if itsit's a survival situation and that makes it more intense than a lot of times it needs to be."},{"speaker":"K:Intvr:Marcus","time":"00:28:02-3","content":"Did you get into some fights here?"},{"speaker":"DW:Resp:Darwin","time":"00:28:04-7","content":"uh Yeah iI did iI got into one fight uh and you know it's kindakind of like a cardinal rule of prison that until we know who you are we dontdon't know who you are. And not everyone who comes here has to do that but the younger you are when you come the probability that you're gonnagoing to have to fight is."},{"speaker":"K:Intvr:Marcus","time":"00:28:28-2","content":"Someone's gonnagoing to try you."},{"speaker":"DW:Resp:Darwin","time":"00:28:30-6","content":"Yeah they just need to know who you are what you stand for what you're gonnagoing to stand for where your lines are you know your boundaries and in this environment you can't necessarily say this is my boundary and iI would appreciate it if you would respect it and not cross it because let's just face it we're in an environment where that's what most people will do they're here."},{"speaker":"DW:Resp:Darwin","time":"00:28:30-6","content":"Because at one point in their life they were selfish to the point that it didn't matter where another person's boundaries are and if they haven't grown past that well they're still selfish enough to where they don't care where your boundaries are until there's a consequence severe enough to where they'll say alright iI don't want to face that consequence so that's his boundary."},{"speaker":"K:Intvr:Marcus","time":"00:29:18-4","content":"sureSure. Sometimes you have to communicate that reaction."},{"speaker":"DW:Resp:Darwin","time":"00:29:20-1","content":"Yes. yes"},{"speaker":"K:Intvr:Marcus","time":"00:29:22-4","content":"um When you look back on that kid again just causebecause you were a kid how 20 years in 20 years everybody changes not always for the better."},{"speaker":"DW:Resp:Darwin","time":"00:29:24-2","content":"Right."},{"speaker":"K:Intvr:Marcus","time":"00:29:39-9","content":"howHow are you different from that kid now?"},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":"i'mI'm not in survival mode you know i'veI've had time to experience things to become better educated to mature to the point to where iI realized that how iI deal with the situation can greatly affect the situation itself and so iI try not to, um you know iI try to always attack not attack but approach in a calm manner you know try to lets calm this thing down if iI can stay calm speak calmly and i'mI'm not physically aggressive the chances are we can come out of this situation without you know any aggression whatsoever."},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":""},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":""},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":""},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":"30:20"},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":"Uh and Aa lot of the times it works you know and iI think that's the biggest difference is when you're young you don't know you're not you don't have the same level of maturity you don't have the same experiences of life to be able to use as reference points and so everything is a survival moment you know it's the cub trying to go out on their own and until they realize that okokay this is what iI can do and this is what iI can't do."},{"speaker":"DW:Resp:Darwin","time":"00:29:42-1","content":"This is what this situation means or this is how iI can interpret this situation everything is aan intense uh possibly chaotic you know possibly traumatic event in your life. You know We remember the short intense bursts of life more than the the common place everydayevery day complacent links and so early on that's what you experience everything your experience is intense."},{"speaker":"K:Intvr:Marcus","time":"00:31:13-1","content":"soSo tell us a little bit about what you've been up to you know what kinds of organizations you're involved with what kind of educational or vocational opportunities you've taken advantage of since you've been here give us a quick picture of that."},{"speaker":"DW:Resp:Darwin","time":"00:31:49-4","content":"uh Since i'veI've been here i'veI've been fortunate enough to where uh some people have helped me out through the entirety of my, you know they see something uh that maybe says i'mI'm not a complete idiot and uh they help me out uh one thing was probably uh the uh seminary up here the uh New orleansOrleans Baton Rouge Theological Seminary. and"},{"speaker":"DW:Resp:Darwin","time":"00:31:49-4","content":"iI think the greatest thing about that where iI helped me the most was it taught me how to think it taught me how to see things from more than my point of view had to be able to abstractly consider the other side and not just the other side."},{"speaker":"DW:Resp:Darwin","time":"00:31:49-4","content":"But the sides of both sides you know and uh how to contemplate how to analyze myself um how to try to have a plan for different things. and That's just the being able thing iI guess maybe that's just getting higher education you know uh as far as seminary goes it's a moral component and ethical component so it also makes you begin to question as you read the material how does this apply to me? you know"},{"speaker":"DW:Resp:Darwin","time":"00:31:49-4","content":"Where do iI fit in with this and so some level of self examinationself-examination happens whether we choose to or not and in that iI think you begin to mature and grow because you begin to realize that the concept iI have of who iI am maybe isn't the actual concept of who iI am. and So then you have to start questioning who am iI and who do iI want to be and why. you know"},{"speaker":"K:Intvr:Marcus","time":"00:33:37-6","content":"Okay. mhm"},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"Another organization wasuh was uh the LJY program they have on here which is Louisiana young adult juvenile and young adult program and although we never got to really put in an application what we would practice is being able to talk to young adults and juveniles that maybe have got in a little bit of trouble. and"},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"Tell them you know we've been where you are we didntdidn't come to prison full grown and that what you're going through thousands of us have gone through and this is where iI made the mistake in not choosing these avenues to try to get help at."},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":""},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"and So if society grows forward by building on the mistakes and the successes and the failures of others you know hopefully they would see our failures and our successes and be able to build and not have to travel the same road we did. Um iI did some tour speaking up here and what that was was uh sometimes tours come in and you have yoyou kind of tell them about the prison and naturally they're curious and wannawant to know about prison life. and"},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"So you kind of have to be transparent because if you're not transparent even if a person dontdon't know you they still can get a feeling and in doing that iI had to uh learn how to say uh what iI needed to say properly you know you can't say do you understand what i'mI'm saying because maybe they do understand what you're saying and then again maybe their interpretation of what you're saying isn't accurate. So if you want an accurate interpretation of what you're saying you need to be able to say it."},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"35:16"},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"And So and in doing that you know you also have to sit down and say what am iI saying and iI need to say what i'mI'm saying uh iI guess the latest um programming is the reentry program and uh you know the whole point and purpose of the reentry program is try to return offenders. you know"},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"Guys that come to prison that um they arentaren't come with life sentences they are gonnagoing to return and you know to try to do the same thing with them. Tell them look man you're not the only person in this world you know you're important but you're not so important that you can't have consideration for those around you and how your actions or even the things you say affect others. And also to give them a vocation you know to teach them a skill or trade to where a lot of guys in our classes they say well my hand was forced iI was in this environment."},{"speaker":"DW:Resp:Darwin","time":"00:33:41-9","content":"iI was raised like this and this is what iI saw every day and iI didntdidn't see no other option and this program kind of allows us to say well here's the other option. I'm gonnagoing to help you learn how to see the other options but at the end of the day it's on you to try to fully reap the benefits of the opportunities that we're trying to present for them."},{"speaker":"K:Intvr:Marcus","time":"00:36:28-9","content":"Have you taken advantage of any of those vocational?"},{"speaker":"DW:Resp:Darwin","time":"00:36:41-4","content":"Yes. yes"},{"speaker":"K:Intvr:Marcus","time":"00:36:43-7","content":"whatWhat have you donedone?"},{"speaker":"DW:Resp:Darwin","time":"00:36:45-1","content":"uh i'mI'm an HVAC guy which is uh air conditioner refrigeration most commonly itsit's a field that um when iI first got into it there wasn't no program up here a guy iI knew helped me get into a job uh in outside maintenance. and"},{"speaker":"DW:Resp:Darwin","time":"00:36:45-1","content":"iI had a supervisor who just for whatever reason seeing iI had an aptitude and an appetite for the field. So he helped me learn and he would test me and he would push me and is he did this like iI said i'mI'm one of those guys that in some ways the harder you push the more iI grow and i'veI've come to appoint know where i'veI've i'mI'm not gonnagoing to say i'mI'm the best or anywhere near the greatest."},{"speaker":"DW:Resp:Darwin","time":"00:36:45-1","content":"But i'veI've got a pretty good understanding of it a grasp iI like it it deals with the physics of molecular structure it deals with electricity it deals with air flow and movement you know psychometrics you know there's so many different things that iI enjoy about this that you have to if you just look at the if you just see the tree you forget there's a forest and you have to be able to see that there is a forest and in that forest there's specific trees."},{"speaker":"K:Intvr:Marcus","time":"00:37:51-7","content":"soSo if you were released tomorrow you would find a job very quickly."},{"speaker":"DW:Resp:Darwin","time":"00:37:53-7","content":"(laughs) iI would hope so but iI don't know."},{"speaker":"K:Intvr:Marcus","time":"00:37:55-6","content":"darwinDarwin let me ask you a question that iI actually iI have aan it's just a difficult question so forgive me for that um… its uh part of you as in an earlier discussion we were having before we started rolling here was the having a little bit of skepticism of becoming parole eligible. When you think about the possibility of dying here how do you cope with that?"},{"speaker":"DW:Resp:Darwin","time":"00:38:50-2","content":"… Well when you think of that i'mI'm probably gonnagoing to die in prison most people say it but they don't ever really think about it because the best way to cope with it is to think of it as not a real thing even if you go see some of the guys on the wards that are dying."},{"speaker":"DW:Resp:Darwin","time":"00:38:50-2","content":"iI think to a point in order to in order to keep yourself from just losing all hope you know all fortitude you just never really see it as truly dying and iI think that's a safety mechanism you know they say people in traumatic situations deal with it by sometimes not by avoiding it."},{"speaker":"K:Intvr:Marcus","time":"00:38:52-5","content":"denialDenial."},{"speaker":"DW:Resp:Darwin","time":"00:38:53-7","content":"iI think a lot of us do that it's not so much that were denying it but in a sense we are denying it because we never really consider it and those few moments that iI have it can get so overwhelmingly oppressive that it will make you say why continue? And some people never shake back from that and iI think in order to cope with it you have to say that again."},{"speaker":"DW:Resp:Darwin","time":"00:38:53-7","content":"iI can't be selfish and say let me not continue because iI still have people out there that that would be again committing another selfish act. Where iI don't consider the feelings of others iI don't consider how"},{"speaker":"DW:Resp:Darwin","time":"00:38:53-7","content":"40:14"},{"speaker":"DW:Resp:Darwin","time":"00:38:53-7","content":"my actions would affect others and so if i'mI'm truly gonnagoing to try to not be the incident that brought me into incarceration then iI need to apply even in the face and the light of death in prison."},{"speaker":"K:Intvr:Marcus","time":"00:38:53-7","content":"alongAlong with that idea is that some of the guys i'veI've talked to have said is that is you can lead a very meaningful life here"},{"speaker":"DW:Resp:Darwin","time":"00:40:50-6","content":"If you so choose to yes."},{"speaker":"K:Intvr:Marcus","time":"00:40:51-7","content":"ifIf you so choose to."},{"speaker":"DW:Resp:Darwin","time":"00:40:53-1","content":"iI mean like iI said there's programs that you can get involved in and you can even try to change the culture we always saying you can be the component of change but how can you be the component of change you can't do it by saying that change cannot happen you know you have to be able to say that if iI want change to happen then iI need to do something to assist change in happening. And So if you want to change a culture then you try to help the mindset of that culture. and"},{"speaker":"DW:Resp:Darwin","time":"00:40:53-1","content":"So if iI can find hope if iI can find purpose and a guy that say is younger than me that is going through the early stages of what iI went through iI maybe can relay to him say look you can't see it now you cantcan't see the finish line and how close it is. But i'mI'm telling you if you keep running along this path when you hit the finish line you're gonnagoing to be like i'mI'm glad iI chose this direction instead of the other."},{"speaker":"K:Intvr:Marcus","time":"00:42:14-3","content":"mhm and This may seem like an odd question because its prison but what it's different for different people actually what for you is the hardest thing the worst part about being here?"},{"speaker":"DW:Resp:Darwin","time":"00:42:15-7","content":"Wow man i'veI've been in here so long iI don't know if there's a worst part any moreanymore and trust me $$ but iI would have to say that probably the worst thing about prison.. Is the isolation. And first question is well you're surrounded by someone every day all day every moment um from entrance until exit yet even being surrounded by all these people you're still not really uh iI guess with someone you know like when you're home although you might not visit family or be around them as much as i'mI'm around the people."},{"speaker":"DW:Resp:Darwin","time":"00:42:15-7","content":"i'mI'm in the dormitories with you have a sense of security you know that iI have a support system out here that i'mI'm not alone in the world you know i'mI'm not alone. So i'mI'm trying to do something trying to accomplish something well here you're kind of alone sure you're gonnagoing to meet people as you go through this journey that are gonnagoing to try to help you and guide you. But they're never gonnagoing to go to the point or to the efforts that the people who truly care about you do you know and that's iI think that's an unrealistic expectation to have on people who per se aren't iI guess as invested or as close to you. and"},{"speaker":"DW:Resp:Darwin","time":"00:42:15-7","content":"Every once in awhilea while you do you know as a saying i'veI've heard a bunch of times that you know if you can count your friends on one hand consider yourself lucky and iI think in here we have friendships you know um and to a point you can even call them family but it's never you know the relationship the intimacy of a mother of a father of a grandparent of a sibling you know aunt cousin whatever."},{"speaker":"K:Intvr:Marcus","time":"00:44:29-4","content":"sureSure. So there's a lot of loneliness without being alone."},{"speaker":"DW:Resp:Darwin","time":"00:44:30-9","content":"Yes if that's not an oxymoron."},{"speaker":"K:Intvr:Marcus","time":"00:44:32-7","content":"noNo that makes perfect sense to me. What about the best part?"},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"The best part wow (sighs) let me say that the best part is tied up in probably also some of the worst is that you come here young well prison provides. So you never have to be responsible if you don't want to. There's not billsibills have to pay iI don't have to go to the grocery store iI don't have to go to the clothing department iI don't have to try to get a job iI don't have to get an education."},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"and"},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"iI don't have to do anything except wake up and do what i'mI'm told iI don't need to know what time it is iI mean so in one way itsit's had to mature in prison because prison isn't set up for you to bear the stress of responsibility and to grow from that. So you know you have to kind of seek it out your own and iI don't know if you've ever encountered, but a lot of times guys that come to prison you get like in a time warp to where even though you're growing and you're aging and to some extent you mature."},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"46:02"},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"You're not you're not in society you don't see things change you don't see how mindsets change and how people change you don't see you know the aging process you don't see things spring up new and things old pass away. and So itsit's its to an extent not tangible to you."},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":""},{"speaker":"DW:Resp:Darwin","time":"00:44:34-0","content":"And So if you don't if you're not aware and you don't stay if you don't try of your own initiation to grow and not to stay you'll find that you're always thinking like to take me for an example you're always saying things as an 18 year old. you know and So if you don't push yourself or if you don't surround yourself with people who are gonnagoing to say no it's not like that you know itsit's not this or this there's this area in between that's where most of life happens and it's not yes or no its iI have to iI have to address it per the application of the situation."},{"speaker":"K:Intvr:Marcus","time":"00:48:04-8","content":"butBut for many folks you were saying who don't try they get stuck and stop growing."},{"speaker":"DW:Resp:Darwin","time":"00:48:06-0","content":"Right. I mean i'veI've seen 50 year olds that still act probably like the day they come to prison and iI mean to an extent their question is, why do iI need to act any different especially when iI have a life sentence and iI know that there is no merymercy there is no forgiveness there is no second chance. My chance was the day iI went to court and my sentence is death."},{"speaker":"K:Intvr:Marcus","time":"00:48:08-3","content":"mhm That sort of nihilism about it you know what's the point of it all."},{"speaker":"DW:Resp:Darwin","time":"00:48:11-4","content":"Yes."},{"speaker":"K:Intvr:Marcus","time":"00:48:12-7","content":"butBut what's remarkable is that so many of you don't choose that."},{"speaker":"DW:Resp:Darwin","time":"00:48:16-0","content":"iI don't know if this is a great characteristic but that's probably because to a certain extent we're rebellious. Rebellion usually has a negative connotation to it that you're not a rule abider well maybe in this situation it's what helps us survive is that with everything around you and surrounding you says there's no hope you should give up you should do better yeah well that's what you say you know that's not exactly what iI want to. you know"},{"speaker":"DW:Resp:Darwin","time":"00:48:16-0","content":"i'mI'm not buying what you're selling per se. you know and iI guess maybe a little bit a little bit of that spirit that you have in you before you do a vast amount of time in prison that's still there and it says you know have a little fight left in you don't just you know give up."},{"speaker":"K:Intvr:Marcus","time":"00:49:12-2","content":"Right. Um It sounds like you've accomplished quite a few things since you've been here that's the things you're talking about. What stands out as the thing that you're proudest of?"},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"The thing i'mI'm proudest of uh is probably being able to get to say that i'mI'm sorry for what iI did to the people iI need to say it to to the mother and father of uh you know robert'sRobert's mother and father iI think that's probably the proudest thing i'mI'm most proudest of because my other accomplishments are you know good things too but at the end of the day who we are as a person is defined by what we do as that person. It's not so much what we know or you know and how much we can know."},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":""},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":""},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":""},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"50:11"},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"It's what we do whenever it counts iI have a friend and he said he says what you do when nobody else is looking you know that really helps define who you are uh and sometimes its burdensome. Because iI want to throw that piece of trash on the ground but at the same time my conscience is like you know you're littering man and at the same time i'mI'm like just shut up and let me litter. and"},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"itsIt's like at the same time do you want to be you know is that who you are it's like no that's not who iI want to be that's not who iI am iI don't iI dontdon't imI'm not a criminal iI committed a criminal act yes."},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"But iI don't wake up everydayevery day thinking about how iI can violate the law or how iI can do something to my benefit regardless of how it affects others. and iI don't want to be that person because a fear of mine is to wake up and one day i'mI'm not bothered by doing something that iI know is wrong."},{"speaker":"DW:Resp:Darwin","time":"00:49:13-7","content":"Because at that point then probably iI really need to be afraid because at that point you begin to question am iI still a human do iI have any humanity left in me?"},{"speaker":"K:Intvr:Marcus","time":"00:51:19-0","content":"Is there um a question that iI should have asked you that iI didn't?"},{"speaker":"DW:Resp:Darwin","time":"00:51:20-4","content":"i'veI've come to realize that life is almost is almost guided by emotions and that they're the worst thing in the world to make a judgement by because very rarely do they see anything but one side of the coin and until we realize that there's another side of the coin. and Then there's a lot of stuff in between those two sides are we ever gonnagoing to really be able to make you know an accurate and iI guess we to a point adjust decisions about things. uh iI know in seminary a lot of times you hear people say that that if if GgodOD is so good then why do these things happen?"},{"speaker":"DW:Resp:Darwin","time":"00:51:20-4","content":"And iI remember reading in a text that GgodOD is just and being good is interpretive of who is receiving the goodness. And being just isn't necessarily interpretive of who is receiving the justice because justice much like the symbol for it justice is a woman whoswhose blindfolded with scales and a sword. Well we know that the scales balance we know that the sword is swift to act we know that it should be blind to anything but the facts but so often we overlook who is holding all these things."},{"speaker":"K:Intvr:Marcus","time":"00:51:36-9","content":"Okay. mhm"},{"speaker":"DW:Resp:Darwin","time":"00:51:38-5","content":"and itsIt's a woman and why wasn't it a man? I think because in life women are much more compassionate they're much more forgiving they're much more merciful. So iI think that mercy has been forgotten in the application of our justice and although we would like to say that iI want mercy extended to me iI don't think we're really honest whenever it comes to do we give mercy to others?"},{"speaker":"K:Intvr:Marcus","time":"00:53:58-2","content":"Okay. mhm"},{"speaker":"DW:Resp:Darwin","time":"00:53:59-9","content":"That might be the only thing iI want to add."},{"speaker":"K:Intvr:Marcus","time":"00:54:02-5","content":"sureSure sure very well said. That's a good place to end. Thank you darwinDarwin"},{"speaker":"DW:Resp:Darwin","time":"00:54:03-9","content":"No problem thank you all.all"}]}