{"name":"","transcript":[{"content":"Daryl Evans Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:15-0","content":"You can start by stating your name, the crime of conviction, your age and the number of years you've already served."},{"speaker":"Daryl","time":"00:00:15-7","content":"Okay when you want to start?"},{"speaker":"Marcus","time":"00:00:20-3","content":"Right now."},{"speaker":"Daryl","time":"00:00:22-8","content":"Ok my name is Darryl Evans, the crime I was in, I'm here for is second degree murder. I was 22 years old at the time. I've been down so far 35 years."},{"speaker":"Marcus","time":"00:00:35-1","content":"So I'm going to start by talking about your time, those first 22 years of your life, beginning with early childhood. Can you tell me a little bit about the folks who raised you?"},{"speaker":"Daryl","time":"00:00:45-5","content":"Well I come from a Christian family, and I came up in a single parent dwelling because of my mother, our father really died a month before I was born. He was a military man, and I became basically, the only tie that my mother had between my father and her. I was spoiled. I had great parents. My mother remarried some years later, and my sister was born."},{"speaker":"Marcus","time":"00:01:29-2","content":"Were you an only child?"},{"speaker":"Daryl","time":"00:01:31-2","content":"For."},{"speaker":"Marcus","time":"00:01:34-0","content":"Until then?"},{"speaker":"Daryl","time":"00:01:33-7","content":"Yes I was an only child for about, 9 years, 10 years. And then she remarried and my sister came, then."},{"speaker":"Marcus","time":"00:01:41-3","content":"What's her name?"},{"speaker":"Daryl","time":"00:01:42-4","content":"Tanya. Okay and now coming up, she's in high school and stuff like that."},{"speaker":"Marcus","time":"00:01:53-8","content":"Yes so what's your relationship like with Tanya?"},{"speaker":"Daryl","time":"00:01:56-1","content":"Sister and brother, she's just a sibling."},{"speaker":"Marcus","time":"00:01:59-7","content":"Yes, ok. Does she visit you up here?"},{"speaker":"Daryl","time":"00:02:02-5","content":"She had stopped visiting because she got married and moved out, because my mother had passed away. My mother passed."},{"speaker":"Marcus","time":"00:02:05-2","content":"When did your mother pass?"},{"speaker":"Daryl","time":"00:02:07-5","content":"She passed in '97."},{"speaker":"Marcus","time":"00:02:13-1","content":"Do you remember the last, what's your last memory of your mom?"},{"speaker":"Daryl","time":"00:02:16-6","content":"The last memory of my mom was her being in New Orleans coming up here. I didn't want her to come here. She had been coming, and she had been a faithful person, to come visit me since I've been incarcerated. It took a toll on her. It destroyed her health, and financial burdens was unbelievable."},{"speaker":"Marcus","time":"00:02:41-7","content":"She made that trip from New Orleans?"},{"speaker":"Daryl","time":"00:02:45-1","content":"All the way from Orleans Parish, New Orleans."},{"speaker":"Marcus","time":"00:02:46-8","content":"That's not an easy trip. I'm going to ask you a little bit about that can you tell me since you brought it up, how did this whole thing impact your mother?"},{"speaker":"Daryl","time":"00:02:56-9","content":"It was devastating to her. It was devastating to her and my other family members. Because first time I'd ever been in any kind of problems. I never, I worked, never was a problem child. Never had a traffic violation, it devastated her."},{"speaker":"Marcus","time":"00:03:20-4","content":"Yeah and you're her only son."},{"speaker":"Daryl","time":"00:03:27-7","content":"True."},{"speaker":"Marcus","time":"00:03:29-6","content":"That's also difficult."},{"speaker":"Daryl","time":"00:03:31-4","content":"Right."},{"speaker":"Marcus","time":"00:03:33-2","content":"So, you said you were spoiled."},{"speaker":"Daryl","time":"00:03:35-7","content":"Yeah."},{"speaker":"Marcus","time":"00:03:38-0","content":"Is it safe to say?"},{"speaker":"Daryl","time":"00:03:39-7","content":"Talking about yeah."},{"speaker":"Marcus","time":"00:03:35-8","content":"That you felt loved and cared for?"},{"speaker":"Daryl","time":"00:03:38-5","content":"True."},{"speaker":"Marcus","time":"00:03:39-4","content":"Okay grandparents, close relationships with them?"},{"speaker":"Daryl","time":"00:03:44-3","content":"Yes grandparents."},{"speaker":"Marcus","time":"00:03:46-6","content":"Tell me about them."},{"speaker":"Daryl","time":"00:03:47-7","content":"My grandfather died in '68, and my grandmother was a mother in the church."},{"speaker":"Marcus","time":"00:03:54-3","content":"What were their names?"},{"speaker":"Daryl","time":"00:03:56-3","content":"His name was Roy J Evans, that's my grandfather. And my grandmother's name was I always called her mama for so long. Boy, that's a shame."},{"speaker":"Marcus","time":"00:04:08-2","content":"That's okay she was grandma to you."},{"speaker":"Daryl","time":"00:04:09-8","content":"Yes she was grandma. I never really called her by her name that was a no, no in the family. It was either Big Mama or Grandmother, so basically yeah that was it."},{"speaker":"Marcus","time":"00:04:16-8","content":"All right. Did they out live your Mother?"},{"speaker":"Daryl","time":"00:04:24-5","content":"No, no."},{"speaker":"Marcus","time":"00:04:27-0","content":"Okay so it sounds like from the name that these are your Father's parents, is that correct?"},{"speaker":"Daryl","time":"00:04:32-7","content":"No, not my Father's parents, that's my Mother's parents."},{"speaker":"Marcus","time":"00:04:35-4","content":"Oh Okay. Did you say Evans, Roy J Evans? Okay that's just a coincidence, oh you have your Mother's last name."},{"speaker":"Daryl","time":"00:04:43-0","content":"Right, right"},{"speaker":"Marcus","time":"00:04:43-1","content":"I got it, great. So tell me about school, how was school for you?"},{"speaker":"Daryl","time":"00:04:46-8","content":"Are you talking about like Pre-school or High school?"},{"speaker":"Marcus","time":"00:04:49-1","content":"Let's talk about middle and high school."},{"speaker":"Daryl","time":"00:04:51-5","content":"Okay middle school was, something just like anybody else, it's learning, it's a learning process."},{"speaker":"Marcus","time":"00:04:58-1","content":"Okay where were you?"},{"speaker":"Daryl","time":"00:04:59-5","content":"In New Orleans"},{"speaker":"Marcus","time":"00:05:01-8","content":"What's the school?"},{"speaker":"Daryl","time":"00:05:03-7","content":"Priestley junior high. Then I went to McDonough Senior high school, I didn't graduate because I had stopped school in my 12th year because my mother was having all kind of financial problems, and I couldn't see her going through this, at that time I was still with my Mother. I had made the dumb choice to quit school to work. I got a nice job and everything."},{"speaker":"Marcus","time":"00:05:32-5","content":"What was your job?"},{"speaker":"Daryl","time":"00:05:34-1","content":"My job was driving trucks for American Army Vets and then it went from that to construction work, which I really enjoyed doing that. And I did that at an early age, along with whatever else I could come up, get extra funds which was legal, carpentry work and stuff like that."},{"speaker":"Daryl","time":"00:05:34-1","content":"But I'm not a carpenter, I had guys to teach me to do this, and I was more of a laborer and everything like that, but construction was basically what I was doing."},{"speaker":"Marcus","time":"00:06:09-5","content":"You said, legal work, were you engaged in any kind of illegal work?"},{"speaker":"Daryl","time":"00:06:14-7","content":"No, no."},{"speaker":"Marcus","time":"00:06:16-5","content":"Okay you had mentioned that this was the first time you got in trouble so."},{"speaker":"Daryl","time":"00:06:14-2","content":"True."},{"speaker":"Marcus","time":"00:06:20-2","content":"What was your last job when this happened?"},{"speaker":"Daryl","time":"00:06:21-7","content":"My last job was at St. Vincent De Paul."},{"speaker":"Marcus","time":"00:06:31-6","content":"And what were you doing there?"},{"speaker":"Daryl","time":"00:06:33-4","content":"I was painting and a custodian. Painting the rooms and stuff like that, whatever, basically maintenance."},{"speaker":"Marcus","time":"00:06:39-4","content":"Can you tell me who visits you up here to this day, 35 years now?"},{"speaker":"Daryl","time":"00:06:50-2","content":"Well now, no family members visit because all the known family members that I had passed. But I have people that I've met during the course of the Rodeo. We have an annual rodeo, spring rodeo, and October rodeo, and you meet a lot of people coming through there. So you have to be on your best behavior and everything like that. And, they ask you questions just pretty much like you're asking."},{"speaker":"Daryl","time":"00:06:50-2","content":"Any given moment what are you up here for? This that and the other. And being honest and telling them, it's basically it. They look at you and some of them shy away from you, but I don't actually visit, in the visiting like that, so I basically have Penpals and stuff like that."},{"speaker":"Marcus","time":"00:07:39-3","content":"Yes."},{"speaker":"Daryl","time":"00:07:40-7","content":"I see them at the rodeos and like that, so I consider that being visited."},{"speaker":"Marcus","time":"00:07:42-3","content":"Yes, I mean, as you said, over 35 years, people move on and pass away."},{"speaker":"Daryl","time":"00:07:50-1","content":"True"},{"speaker":"Marcus","time":"00:07:51-4","content":"I imagine that's a particularly difficult part about serving so long here is that you see it all on the outside. Were you able to attend your Mother's funeral?"},{"speaker":"Daryl","time":"00:08:06-5","content":"Yes I went to her wake, not the funeral. They won't let you bring, go to the funeral, they'll bring you to the wake to the church. And it was the church was church of God Christ, New Orleans. And I hadn't been there in quite some time since I got incarcerated. But everyone welcomed me there with open arms and everything. But by being the mother of the church, she was laid to rest with a lot of respect."},{"speaker":"Marcus","time":"00:08:40-7","content":"Sure, so was it difficult for her, did people look down upon her after you were arrested and convicted of this crime. Did she has any issues with the church or anybody giving her, how there's a little bit of a stigma associated with having a family member in prison, was that a problem for her?"},{"speaker":"Daryl","time":"00:09:00-2","content":"It was until they understood they had someone that was incarcerated, then they understood her points…"},{"speaker":"Marcus","time":"00:09:07-0","content":"Sure, then they can empathize."},{"speaker":"Daryl","time":"00:09:09-3","content":"...right. And then they was able to understand exactly her point of view, and how she was so devoted to me. And I feel, back to my sister now, I feel somewhat responsible that she, it wasn't a personal neglect, but she spent more time with her energy towards me than she did for my sister."},{"speaker":"Daryl","time":"00:09:09-3","content":"But my sister understood, even as a small child, she understood. But she doesn't, I don't believe that she faults me for anything like that. I became an Uncle, not too far, not too many years ago and so the tie of love and siblingship is still there."},{"speaker":"Marcus","time":"00:09:53-8","content":"Absolutely. Did your mother come to terms with that you had done and forgive you?"},{"speaker":"Daryl","time":"00:10:02-0","content":"She was, well being a Christian it was, believe it or not, it's like a two-edged sword, she was upset with me by being her child, and her oldest child, her only son. She wanted to know what happened and why? And I told her, I said, it was a thing, whereas it wasn't something that I was planning to do, just something that was in me. It was just like it happened."},{"speaker":"Daryl","time":"00:10:02-0","content":"Whereas my grandmother was staying with us at the time and she became ill and my mother was going through a fit, and I was working and the thing was, if I had been thinking, if I had been more mature minded as of now, years passed and stuff like that. I'd took time to tell her, look let me get another job and stuff like that."},{"speaker":"Daryl","time":"00:10:02-0","content":"By her basically having a nervous breakdown, because she was already, we were both paying bills, I was paying and helping her and stuff like that, and she decided this would be the best thing. It was an emotional thing. I wasn't thinking. When that happened it was like a spur in the moment, I really didn't know what I was going to do. And when this happened, it wasn't meant to happen. I was mostly acting off of emotions instead of thinking."},{"speaker":"Marcus","time":"00:11:41-0","content":"Yes can you very briefly just summarize what happened?"},{"speaker":"Daryl","time":"00:11:44-2","content":"My grandmother went into a seizure, and we had to get her to the hospital. So I had to come in from work, my mother says, \"It's your fault\" you understand, everything fell on me, and I'm trying to figure out, what happened, why is it my fault."},{"speaker":"Daryl","time":"00:11:44-2","content":"So by me being, so say the man of the house at that time, she went through this, I mean like it was like she had lost her mind, and I never seen my mother like that before. I mean it's my grandmother and I love her and I understand and everything was happening so fast. We need money to cover this, we need money for this here, and I don't know what's going to happen with this here. You're to blame."},{"speaker":"Daryl","time":"00:11:44-2","content":"I'm not saying it was my mother's fault that I did what I did, I'm responsible for it, but if I'd have known now to think instead of just reacting, I would not have went out and did that. But once I got to a place to, a business, I didn't know what to do. I did come there with a gun, my intention was to rob, but the way things happened, I became confused, the guy had seen the gun, I wanted to leave now, so he said, \"Oh.\" I got scared. I was a cowardly act, is all I can tell you."},{"speaker":"Marcus","time":"00:13:22-7","content":"But you were feeling a lot of financial pressure from your mom that is what it was."},{"speaker":"Daryl","time":"00:13:29-1","content":"Right"},{"speaker":"Marcus","time":"00:13:26-5","content":"Primarily motivated by trying to get some money."},{"speaker":"Daryl","time":"00:13:31-1","content":"Right."},{"speaker":"Marcus","time":"00:13:32-4","content":"I understand, that's all we need to say. If this hadn't happened, it's your first time you're getting in trouble from what you've said, let's say you hadn't gone down there, your mother had found a different way to express what was bothering her, how do you think your life would have trotted out?"},{"speaker":"Marcus","time":"00:13:32-4","content":"What were the next few years of your life look like? I mean I know you, there's no way to know, but how do you imagine it?"},{"speaker":"Daryl","time":"00:14:11-2","content":"Well, I was in, at the time, I was going to night school too, and I was doing a class of welding, Medical Technical Institute, so I feel that had it not happened, like this, I'd have been, owned my own at home, taken care of whatever needed to be taken care of. A life of crime never even crossed my mind. I feel I'd been a normal citizen."},{"speaker":"Marcus","time":"00:14:46-6","content":"Yes, I mean every person I've talked to has a unique story, but what's certainly different about yours is that it wasn't as if you were going down this wrong path, and then finally something happened, it sounds like something much more out of the blue. So it makes sense that you would think of yourself as just having a conventional life, right. Tell me about any girlfriends, any people that you are close to?"},{"speaker":"Daryl","time":"00:15:18-0","content":"Right, well you're going to have that. Of course the years, high school, I had a high school sweetheart, two of them, but that didn't work out because there was a problem between both of them finding out about the other. But later on in the years, I had met a young lady and we stayed together quite a few years."},{"speaker":"Marcus","time":"00:15:45-7","content":"Tell me about her."},{"speaker":"Daryl","time":"00:15:47-0","content":"Well, her name was Lisa, she's still alive but, when her when this happened here, it was like devastating to her. And she went to my mother and asked what happened. And asked her if there was anything she could do. I let down a lot of people. I let down a lot of people. She came to the parish jail to see me, but I felt so embarrassed about this whole thing. I was mad at myself."},{"speaker":"Daryl","time":"00:15:47-0","content":"It took a lot of years, I'm still not over the forgiving part of myself, and I haven't fully forgiven myself for this. I really haven't, but I'm trying, I pray every day, and I ask God to forgive me. But his mercy is the only thing that is really going. But Lisa, she is well I hope, but I haven't really had ties with her since the parish jail."},{"speaker":"Marcus","time":"00:16:51-3","content":"Yes I mean it hurts."},{"speaker":"Daryl","time":"00:16:52-6","content":"Yes, and that was by choice."},{"speaker":"Marcus","time":"00:16:54-2","content":"Sure, any kids?"},{"speaker":"Daryl","time":"00:16:57-5","content":"No kids, unfortunately."},{"speaker":"Marcus","time":"00:17:01-7","content":"Sure, I understand that. Ever kicked out of school?"},{"speaker":"Daryl","time":"00:17:10-2","content":"No, never had any problems like that. Actually in school I had stopped a couple of guys from getting into fist fights and stuff like that because it was hormones I guess, you could say, testosterone type of thing. I was a jock in school myself."},{"speaker":"Marcus","time":"00:17:30-8","content":"What sports did you play?"},{"speaker":"Daryl","time":"00:17:32-5","content":"I played football and baseball. But the thing is, never got kicked out of school."},{"speaker":"Marcus","time":"00:17:39-7","content":"Right. How did you get access to a firearm?"},{"speaker":"Daryl","time":"00:17:54-7","content":"I had bought the firearm for protection years ago, so it was my own personal weapon. The weapon that was supposed to been used at the crime was my own gun, so it was never even asked for. It wasn't even registered kind of thing, because I was collecting guns too."},{"speaker":"Daryl","time":"00:17:54-7","content":"They say it was a specific type of gun. It was nickel-plated pearl handle 38, and the gun believe it or not, is probably was still at the house. Because it was like when this happened, I wasn't aware of what to do with it, I just brought it home, because I was in shock of what happened."},{"speaker":"Marcus","time":"00:18:46-7","content":"Sure. It's hard, I think if you have to identify one thing that you now you have more than 30 years to look back on it with fresh eyes, and a whole lived experience. What do you think it was?"},{"speaker":"Daryl","time":"00:19:08-4","content":"Ignorance. No patience, no patience whatsoever. Not trusting God's movements really. If I had took the time to really stop and think, to take control of the situation with my parents, and try to seize the moment and just, slow everything down because everything was happening so fast. That's basically it."},{"speaker":"Marcus","time":"00:19:38-9","content":"Okay drugs and alcohol were not part of your life?"},{"speaker":"Daryl","time":"00:19:35-5","content":"No."},{"speaker":"Marcus","time":"00:19:40-3","content":"So I want to shift gears a little bit and talk about, I think you probably spent a little bit of time at the parish jail as you just mentioned."},{"speaker":"Daryl","time":"00:19:54-6","content":"True."},{"speaker":"Marcus","time":"00:19:56-6","content":"And then you come into Angola, a young man, 35, 33 years ago, and I imagine to a very different Angola that the Angola is today. And I want to talk a little bit about that. Is there anything I should have asked you about Daryl Evans before coming to Angola that I'm missing?"},{"speaker":"Daryl","time":"00:20:16-7","content":"Well number one is that I'm a good person, I'm a good person. And a lot of times bad things happen, and I just I'm totally devastated for what I did, and I want to let the family know that I'm truly sorry for what happened."},{"speaker":"Marcus","time":"00:20:45-9","content":"Sure, it's one of those things where, I don't think any of us would want to be defined by the worst thing we've ever done. Not a single person."},{"speaker":"Daryl","time":"00:20:52-6","content":"No."},{"speaker":"Marcus","time":"00:20:55-4","content":"Yet this has kind of set the trajectory for the rest of your life in ways that I think are particularly challenging. Let's go back to the Daryl Evans that came through the gates of Angola. What kind of a man what he? Can you describe that person?"},{"speaker":"Daryl","time":"00:21:13-3","content":"Well, coming in the first time, the first arrival here on the bus. You got a million and one things going through your mind, what to expect, what not to expect. You heard so many different stories."},{"speaker":"Marcus","time":"00:21:29-7","content":"What had you heard about Angola?"},{"speaker":"Daryl","time":"00:21:33-9","content":"Well that if you don't have the heart to take a life because I'm trying to figure out why you have to take a life. I understand when you come in, you've got to protect your manhood. You don't want to be a slave to a slave. You have to walk a certain way and act a certain way, things of that nature. I was scared. I was scared, and believe it or not, I was scared."},{"speaker":"Marcus","time":"00:22:02-6","content":"Oh I believe it."},{"speaker":"Daryl","time":"00:22:04-3","content":"Oh yeah, but after coming here, I didn't know what to expect, who to expect it from. So I was always on my guard. But just so happened during the time of coming to Angola, believe it or not I was mentored by a lot of people. Back then, security considered to be the scum of the earth."},{"speaker":"Daryl","time":"00:22:04-3","content":"These guys basically took me in, and said, \"Check this out guy, you don't want to do this, you don't want to do that. You get your education. You go to these health programs you take and you learn what you can in law library, you understand? Don't mess with this, don't mess with that, don't do this.\" And I said, \"Well first of all I'm not going to do that.\" He says, \"The main thing go to church, you understand? Get yourself right.\""},{"speaker":"Marcus","time":"00:23:03-6","content":"Did you follow their advice?"},{"speaker":"Daryl","time":"00:23:05-0","content":"Oh yeah. He said like, basically it was like a father thing, don't do what I do, do as I say do. And these guys here, I was like wow, and then after a year or so, they said, well man look you need to take and support yourself, don't always lean on your people to do this here."},{"speaker":"Daryl","time":"00:23:05-0","content":""},{"speaker":"Daryl","time":"00:23:05-0","content":"So leadership was one of those things these guys had here. And then after a year or so, not even that really, months passed, I found out that, the stories that you hear about Angola were basically made up, you understand like."},{"speaker":"Marcus","time":"00:23:42-4","content":"Exaggerated?"},{"speaker":"Daryl","time":"00:23:44-1","content":"Right, it's like tales that you tell the kiddies to keep them from doing, going down this way, going down this trying path, to scare them. Everything happens here, you had killings here and stuff like that, but it was those guys who went across certain lines, for the disrespect thing or whatever, stealing from someone, that was a no. But I was surprised at the men that I met here."},{"speaker":"Marcus","time":"00:24:13-0","content":"Are they still here, any of them?"},{"speaker":"Daryl","time":"00:24:15-8","content":"Quite a few of them have passed, quite a few."},{"speaker":"Marcus","time":"00:24:20-0","content":"Sure, did they pass while they were here?"},{"speaker":"Daryl","time":"00:24:18-3","content":"Yeah they passed here. And it was like losing a family. And over like the decades that I've been here, these men have become my family. And each death is like a part of you that's been taken away from you. So I had people to guide me, teach me different things like that."},{"speaker":"Daryl","time":"00:24:18-3","content":"Put my name on cards so I could go to certain clubs, functions and stuff like that. At the time we had the Lifer's Club, and they would bring their literature to teach you what's going on with the legislative, bringing new laws and stuff like that."},{"speaker":"Marcus","time":"00:25:08-8","content":"Right. Did you work as inmate counsel at all?"},{"speaker":"Daryl","time":"00:25:11-2","content":"No. Somebody asked me about that but I didn't have the, I didn't feel that my qualifications or really wanted to be obligated to that type of thing. But a guy told me, he said, \"Check this out, the way you carry yourself, the way you talk with people, you understand, it would help for you to be inmate counsel.\""},{"speaker":"Daryl","time":"00:25:11-2","content":"I said, \"I don't know anything about law.\" He said, \"You got to take the first step, everything is a learning process.\" So I said, \"Okay.\" He said, \"Your comprehension is all right.\" And I said, this and that and the other, but that responsibility I don't want."},{"speaker":"Marcus","time":"00:25:53-1","content":"Sure, being responsible for somebody else's case?"},{"speaker":"Daryl","time":"00:25:55-2","content":"Right, and that is playing with somebody's life."},{"speaker":"Marcus","time":"00:26:00-7","content":"Yeah I get that."},{"speaker":"Daryl","time":"00:26:03-1","content":"So that's why I never took on that responsibility."},{"speaker":"Marcus","time":"00:26:05-3","content":"Well tell me a little bit about, it sounds like what you're saying is when you first came here, some people took you under their wing and said look here's how to, did you find yourself staying out of trouble for the most part when you got here?"},{"speaker":"Daryl","time":"00:26:16-8","content":"Yeah, it's not. Trouble, in Angola, trouble is something that you go look for."},{"speaker":"Marcus","time":"00:26:23-0","content":"Okay alight, sure."},{"speaker":"Daryl","time":"00:26:24-4","content":"It's not whereas you, it just happens, like you see gang fights, you hear about this that and the other, that's not really Angola."},{"speaker":"Marcus","time":"00:26:31-1","content":"Sure, so it is possible to keep your nose clean."},{"speaker":"Daryl","time":"00:26:31-1","content":"Yeah, that's a person, that's an individual's choice."},{"speaker":"Marcus","time":"00:26:31-1","content":"I got it. Right, so can you tell me a little bit about some of the other programs? What else have you done here, these clubs, you mentioned some of them, what have you done here?"},{"speaker":"Daryl","time":"00:26:58-7","content":"The concept club back in the early 80's, well early 90's, and the life program. I've taken Bible Study courses and stuff like that. I've taken AA and Experiencing God, all the faith-based programs that I can probably come up with. And I took CPR, so I feel like there was a life taken, if I could save a life, I could do that too, I have 100 hours. They have nice program about victim awareness. I've taken that twice. Quite a few other programs like that right now."},{"speaker":"Marcus","time":"00:27:48-6","content":"Sounds like you've taken advantage of all of those things."},{"speaker":"Daryl","time":"00:27:51-6","content":"Not quite. Because a lot of time, they have programs that I don't want. And lifers at that time lifers weren't permitted to take up certain types of programs or take up any type of trades. But I got blessed to be able to be moved from one camp to another camp, after I got my trustee status, where I can take and apply for different courses and stuff like that."},{"speaker":"Marcus","time":"00:28:23-7","content":"So have you gotten any trades, certificates?"},{"speaker":"Daryl","time":"00:28:26-9","content":"Yeah over the course of the many years being here, I've done jobs, as is like a hands on thing. And I've taken up heavy equipment, operating heavy equipment, such as bulldozers, backhoes, dump trucks, 18-wheelers, things of that nature. So, you learn, I worked at a ranch over quite a few years. So you learn how to doctor animals, and just do, be a ranch hand. Bailing hay, you on equipment doing that. Transporting hay from one spot to another spot, unloading it there, and wrapping hay. I don't know, it just goes on and on."},{"speaker":"Marcus","time":"00:29:18-2","content":"Yeah, I mean skills that are in demand outside of Angola as well. I'm sure."},{"speaker":"Daryl","time":"00:29:23-2","content":"Yes."},{"speaker":"Marcus","time":"00:29:25-6","content":"So, one of the things that a pardon board would be interested in knowing about you is how you're a different person right. So in some ways they have difficulty moving past the crime of conviction and it's important for you to be able to communicate that. I was 22 then, and I'm a different person now and look at the record."},{"speaker":"Daryl","time":"00:29:48-1","content":"I would tell them from my heart that person that I am now from the person that I was then is a totally different person. That person was naïve, unrest, not thoughtful of anything. This person here thinks before he acts."},{"speaker":"Marcus","time":"00:30:08-6","content":"Sure."},{"speaker":"Daryl","time":"00:30:10-6","content":"I take careful note at other people's feelings, their thoughts, what they go through, so it's a thing. Whereas then, me knowing that person then, I wasn't selfish, I was just unlearned, uneducated. So basically now, I'm more mature. I don't have, whereas it's an emotional thing now, I use a lot of rational thinking before I act. Whereas then it was just a thing acting off of emotion. It's an impulse."},{"speaker":"Marcus","time":"00:30:55-0","content":"So you've learned to control impulses?"},{"speaker":"Daryl","time":"00:30:57-9","content":"Yes, as best I could."},{"speaker":"Marcus","time":"00:30:58-9","content":"And you're in your 50's."},{"speaker":"Daryl","time":"00:31:01-6","content":"Yes."},{"speaker":"Marcus","time":"00:31:03-5","content":"That happens."},{"speaker":"Daryl","time":"00:31:07-7","content":"Yes."},{"speaker":"Marcus","time":"00:31:08-6","content":"Can you describe what your typical day is here? Like today is a little unusual because I interrupted your day with this interview, but, let's say tomorrow, what's your routine?"},{"speaker":"Daryl","time":"00:31:28-4","content":"Routine, I guess basically the Lord, he touches me and wakes me up, and I go get up, do my hygiene, get dressed, go to work."},{"speaker":"Marcus","time":"00:31:33-1","content":"Where's work?"},{"speaker":"Daryl","time":"00:31:38-9","content":"Work at the carpenter's shop. I'm an equipment's operator at the carpenter shop. Anytime they need the grounds, straightened up, things moved, I use a front-end loader to do that too. But basically after that, I'll come in to camp regroup, go into the hobby shop and work on things, a lot of work and stuff like that."},{"speaker":"Marcus","time":"00:32:07-3","content":"And that's for, to sell things at the rodeo?"},{"speaker":"Daryl","time":"00:32:10-7","content":"Yes, I'm trying to be self-sufficient and stuff like that. And not only that it's like how can I say this, therapy. So it helps both financially, and spiritually and mentally because you're creating new things and you're learning. You're helping yourself, and then you get peace of mind, when you see somebody happy to see the product that you made. They give you a pat on the back and say, \"I like that, it's well done.\" So you try to improve that. But basically that's it."},{"speaker":"Daryl","time":"00:32:10-7","content":"And then, on certain days like Mondays, that's church night. So that's a thing where, I'm not saying that I make church all the time, God forgive me, but I try to be a prompt attendance. For the word said, forsake not the assembly of the saints. That means for separation. They want everybody together. But I try to make prompt attendance in church."},{"speaker":"Marcus","time":"00:33:34-6","content":"We talked a little bit about the impact that this had on your family. Do you have a sense of the impact what it did have on the victim's family?"},{"speaker":"Daryl","time":"00:33:44-1","content":"Well I can imagine, every day, even after that happened, I've talked to other inmates about that here. It's a thing where, only another inmate can relate to what another inmate goes through. But it's a thing where I feel for them. I know that loss that they had. Because if it had been a family member of mine, but it wasn't intentional. But it had to be intentional, it was intentional, and then it wasn't because I should not have done that. I should not have gone there."},{"speaker":"Daryl","time":"00:33:44-1","content":"If I had not have went there, it would have never happened. So, it was intentional and then it wasn't. I'm at fault, nobody else, and I grieve for that family for their loss. It's a thing where I know that they are going through pure hell because of that, and they went through pure hell."},{"speaker":"Marcus","time":"00:34:53-2","content":"After 35 years I imagine that you have figured this place out pretty well."},{"speaker":"Daryl","time":"00:34:57-2","content":"No, this place changes, it changes. There's no set tempo to this place. If you tried to figure this place out or think that you have everything pat, that's not it. What you do is, you learn to adjust. You learn to adjust, you ask questions and you follow orders."},{"speaker":"Daryl","time":"00:34:57-2","content":"It may not be something that you agree with, but being another person, being rehabilitated, to show that you've been rehabilitated, you have to learn how to follow orders how to set in that path. If they set a pattern for you, you got to learn how to follow that pattern. It may not be what you want."},{"speaker":"Marcus","time":"00:35:36-4","content":"You have to follow the rules."},{"speaker":"Daryl","time":"00:35:41-9","content":"You have to follow the rules."},{"speaker":"Marcus","time":"00:35:43-7","content":"Yes. Is there anything good about Angola? I mean you've had 35 years, tell me about that."},{"speaker":"Daryl","time":"00:35:48-8","content":"Oh yeah. I'm going to tell you for me, the experience, I've been blessed because out of the men that I've met, a lot of the men that I've met, has shown me things that you miss. These guys go to church, these guys, I mean before it was a thing where you had to have this here, these guys was already doing this here. I mean they seen."},{"speaker":"Marcus","time":"00:36:23-7","content":"Even when nobody was getting out."},{"speaker":"Daryl","time":"00:36:25-6","content":"Right, they seen that look, this is meaningful. I've met some of the best men here than when I was on the street. And I wasn't alone on the street but during the course of work and jobs, stuff like that you meet a lot of people that try to show you this, and try to direct you to do this here."},{"speaker":"Daryl","time":"00:36:25-6","content":"And basically it has become a high standard here, you got to meet this here. This ain't something you try to do for security to get a grade from them or nothing like this. This is something we got to amongst ourselves."},{"speaker":"Daryl","time":"00:36:25-6","content":"There's a great, I can't say great, whatever word there is better than great. But these men here, you look at them, and you try to save them, and it's just a waste man. And you talk to guys, and you try to get bonded with them."},{"speaker":"Daryl","time":"00:36:25-6","content":"It's not a thing whereas, this group of people don't get along with this group of people, you're going to always have that. But when time happens whereas you meet this guy, and you need help, and you got problems, family problems, financial problems, these guys will go out of their way and help you with that."},{"speaker":"Marcus","time":"00:37:51-4","content":"Right, you guys are family here."},{"speaker":"Daryl","time":"00:37:54-1","content":"Right it's a family where there's no, I mean you're going to have black, white and whatever else, but everybody is on the same thing, we're trying to get out. Let's help each other the best way we can."},{"speaker":"Daryl","time":"00:37:54-1","content":"We have too many people, up in that hospital, you got some of these guys that will go out their way to go over there, don't even know these guys, and bring things to them. Showing, say man we care, don't even know these guys. By me seeing this here, because I was in Gospel Band, you move around the institution, you see a lot of things that you don't really see by staying in one spot."},{"speaker":"Daryl","time":"00:37:54-1","content":"I met a lot of people that I normally would not have known that I could approach. A lot of these men here are approachable. You got those that are unapproachable, like the ones that's coming in. Until they get that change of mind where they can be transformed from what they are, to someone better. But you got a great group of guys here, fathers here that have kids on the street. Grandfathers, great-grandfathers."},{"speaker":"Marcus","time":"00:39:06-7","content":"People who have just grown up here."},{"speaker":"Daryl","time":"00:39:08-1","content":"Yes."},{"speaker":"Marcus","time":"00:39:11-1","content":"So, Mr. Evans, this is a difficult question, because it's just a difficult place to go, but I have to ask you about this. Because one of the reasons that we are doing this project, is to point to the very difficult, almost impossible task of coming to terms with the fact that you have a life sentence without parole. And that even in the face of being able to go in front of the pardon board."},{"speaker":"Daryl","time":"00:39:38-0","content":"It's not a promise."},{"speaker":"Marcus","time":"00:39:40-3","content":"There are more people who are dying here that are leaving here. You yourself referred to a number of men who were instrumental in guiding you when you first came here, who you had to watch pass away out here in prison. When you think of the possibility that that may be your fate as well, how do you cope with that?"},{"speaker":"Daryl","time":"00:40:01-7","content":"I'm at peace with it. You understand, because I accepted God in my life. I accepted His son Jesus Christ as my personal savior. So it's a thing whereas you got to get at peace with yourself. But yet you do yearn for that freedom, the physical freedom, but you need a spiritual freedom first."},{"speaker":"Daryl","time":"00:40:01-7","content":"See once you get the spiritual freedom you all right. That makes the transition right there. But yes, no, like I said earlier, I haven't really come to grasp with forgiving myself for what happened, because it was a stupid act. And it didn't need to happen."},{"speaker":"Daryl","time":"00:40:01-7","content":"I know I got forgiveness from God, and I know the Judge, he was doing his job, police was doing their job and all that stuff. But the forgiveness part is the hardest thing to do with me on myself. I'm the hardest person on myself than anybody else."},{"speaker":"Daryl","time":"00:40:01-7","content":"But, in case I have to stay here for the rest of my life, I'm good with it. I'm good with it. Because I know that the people that I've met here they'll take care of me just like I take care of them."},{"speaker":"Marcus","time":"00:41:24-5","content":"One of the most amazing things I've seen about Angola is the hospice program. If you're taking care of folks, and you're volunteering over there, I don't know what else you need as evidence that somebody has changed in terms of selflessness."},{"speaker":"Marcus","time":"00:41:24-5","content":"I've been fortunate enough in this project to be able to interview quite a few guys who worked over there. Yes and they are hoping also that somebody will take care of them when it's their turn. Yes I'm happy to hear that you've come to terms with that. Tell me what you're most proud of."},{"speaker":"Daryl","time":"00:42:03-0","content":"I'm proud of being born again. I'm proud of the men that I've met here. That I feel it is a shame of people that supposed to be forgiven that's in the legislator, to still house good men in this place for profit like that, it's a shame. We're here because we're a commodity."},{"speaker":"Daryl","time":"00:42:03-0","content":"I feel that every man that I've met here, well not everyone because I've met some knuckleheads that didn't deserve a second chance. I feel it is a shame that there's no forgiveness like what we were talking about in Louisiana. Dealing with incarcerated men and women."},{"speaker":"Daryl","time":"00:42:03-0","content":"You've done so many time, so much time, you did so many years, you try to better yourself through different programs and stuff like that, these programs, you're learning stuff, your not doing this here to show the warden that, I'm able to do this here."},{"speaker":"Daryl","time":"00:42:03-0","content":"You got men who have trusted with million-dollar equipment that works in the field. You got men that does probably 85 to 95 percent of the workforce is in Angola. So, if they're able to do this here, and do it well, they're able to do something on the streets. They can be replaced, I mean it shows all the crime that goes on, we need to replace these people. I mean something needs to be done."},{"speaker":"Marcus","time":"00:43:58-0","content":"Yes. This is something that I think quite a bit about, I mean that there's overwhelming evidence of rehabilitation here in this prison. I mean you're a great example of that, after so many years."},{"speaker":"Daryl","time":"00:44:17-3","content":"As long as you got the scale over they eyes and you hiding this and you're telling them one story when this here is the truth over here, then you have a problem. But like me and so many other men in what you want from us? I mean, why we can't pay it forward back to what we've done. I know we can't take and put breathe back in the victim."},{"speaker":"Daryl","time":"00:44:17-3","content":"I know we can't undo what's done, but what we can do, you understand, to show that we seriously feel like we have a chance of being profitable citizens out there on the streets. That if we can pay taxes."},{"speaker":"Daryl","time":"00:44:17-3","content":"If there's something that we need to do to help the victim's family, were more than willing to do it. If there's something that we can do, pay tax towards whatever, because I don't feel that finances is going to take to help somebody. What do you want from me? If I'm able to give it to you, I'd give it to you."},{"speaker":"Marcus","time":"00:45:23-5","content":"So let's talk a little bit about that. This is an easier question. You've probably spent some time thinking about how you might create a life for yourself on the outside. What does it look like?"},{"speaker":"Daryl","time":"00:45:36-8","content":"Well I'm a simple individual. I'm like work, church and do a little fishing whatever. Basically that's it. Community service, if need be, talk to the youth that I can reach. Share my experiences to whoever wants to listen, a church or whatever."},{"speaker":"Daryl","time":"00:45:36-8","content":"Show them whereas this here is a dead end, this is not how you this is not how to live your life out. That there's a spot that you can stop before you ever even cross that threshold. There's a limitation to everything. And you have to reach that, but for me, a simple life. That's what I, that's just me."},{"speaker":"Daryl","time":"00:45:36-8","content":"I can't see traveling the world and all this stuff here. I'm just a simple individual. Home, family, whatever, that's it."},{"speaker":"Marcus","time":"00:46:44-5","content":"Do you think you would start in New Orleans?"},{"speaker":"Daryl","time":"00:46:48-1","content":"I don't think I would want to go back to Orleans, but if I had to go back I would but I would eventually try to go to another state."},{"speaker":"Marcus","time":"00:47:00-2","content":"Okay sure. What else should I have asked you? I'm trying to capture this experience of serving these kinds of sentences here in Louisiana. What else do you think people should know about the experience that you've gone through?"},{"speaker":"Daryl","time":"00:47:17-3","content":"Well the experience, it depends on the individual. If that individual is different, or hasn't become a monster, or has he learned from that? That's the transition period. So I feel like, I'm a good person, I believe that, I'm a good person."},{"speaker":"Daryl","time":"00:47:17-3","content":"This place, it can either make you aware or it can make you very bitter. So I am what they call well aware. At one time I became bitter to a certain extent. And I said well the only person that I'm mad at is me. So that's what I have to deal with is me, because I was the one that did this. No one is at fault but me."},{"speaker":"Daryl","time":"00:47:17-3","content":"The bitterness, you got to get rid of that. So now I got to get aware of what I have to do to straighten me out, to better myself, and help others if possible. I can mentor the dudes that are here, but it's just a stepping-stone for what I can do on the streets. It's not a practice to me, its life. It's not acting. This is a live thing here."},{"speaker":"Daryl","time":"00:47:17-3","content":"Whereas each day that I see these guys getting older and older, they're losing that glow. I'm praying that I don't get to that point. I'm up in age now, but as long as I keep myself healthy, as long as I can stay mentally aware of what's going on. You know what I'm saying, with what I want, how I want to do things."},{"speaker":"Daryl","time":"00:47:17-3","content":"If I can reach out and help somebody I'll do that because I've had that done to me at times where I knew it was God who intervened in a lot of things, because I was a foot or two away when guys was getting killed, but it wasn't ejected at me. I've witness guys being stabbed, and I walked right in the midst of it, not thinking, just a spontaneous thing, not like back then where I've seen my life in jeopardy."},{"speaker":"Daryl","time":"00:47:17-3","content":"And I said man stop, you're goanna kill him. But you don't know what he did, it doesn't matter. I'm talking about what you're doing. You don't need to go there for. I mean he's paying the price right now, but you don't need to kill him. So there's a thing where a person had to have a word, and a person had to have someone by themselves in order to get respect."},{"speaker":"Daryl","time":"00:47:17-3","content":""},{"speaker":"Daryl","time":"00:47:17-3","content":"Now, the respect thing is limited. You have the convicts who are old and the inmates who are knew now, which is totally out of control. But the thing is this, if you don't have God in your life, if you don't have a foundation, if you don't have guidance, and you don't have a goal that you're trying to set for yourself and for others around you, you're going to miss the point."},{"speaker":"Marcus","time":"00:50:39-4","content":"It's a very good place to stop."}]}