{"name":"","transcript":[{"content":"Daryl Waters Transcription REDACTIONS FINAL"},{"speaker":"Daryl","time":"00:00:02-4","content":"My name is Daryl Walters, and I'm serving a life sentence for second degree murder. The crime was committed in 1992, I was 23 years old and I've been incarcerated for 24 years."},{"speaker":"Marcus","time":"00:00:19-7","content":"I'm going to ask you some questions beginning with your experiences before you were incarcerated. And it makes sense to start with the most basic unit, which is your family. Can you tell me a little bit about the folks who raised you?"},{"speaker":"Daryl","time":"00:00:38-4","content":"I was raised primarily by my grandparents. My mother was young and single. She had left for a while when I was really young to New York to seek employment. So, I was with my grandparents until I was a teenager. I had a beautiful experience, a beautiful childhood. They were devoted Christians. And they raised me as their own child."},{"speaker":"Daryl","time":"00:00:38-4","content":"Actually, my grandfather who was in his 70s was my childhood friend you would see this old man sitting down in the dirt playing with this little kid, and we were inseparable. My grandmother was my first teacher before I was old enough attend school. She taught me how to count, and how to read and write. And every day, they would ask me to recite what I learned in school every single day."},{"speaker":"Marcus","time":"00:01:36-7","content":"And where were you raised?"},{"speaker":"Daryl","time":"00:01:39-2","content":"Gibson, Louisiana. It's a little quiet town on the Bayou."},{"speaker":"Marcus","time":"00:01:43-6","content":"Do you have siblings?"},{"speaker":"Marcus","time":"00:01:43-6","content":"Resp #00:01:44-2#:Yes, I have 3 brothers and 1 sister."},{"speaker":"Marcus","time":"00:01:48-6","content":"Were they also raised with you and your grandparents?"},{"speaker":"Daryl","time":"00:01:51-8","content":"Well my youngest brother and sister weren't. They came later when my mother had a home of her home, but my other two brothers were."},{"speaker":"Marcus","time":"00:02:04-3","content":"Can you tell me your last memory with your grandfather?"},{"speaker":"Daryl","time":"00:02:11-9","content":"That's interesting. The last time I heard I heard his voice is when I was at Fort Leonard Wood for training in Missouri. I was in the army reserve for a while. I made a phone call we had to run to a bank of phones I'll never forget this. I talked with him and he would always talk about being sick, he was kind of like one of those guys, \"Oh this is it. I'm sick.\" So I was used to that over the years but this time, something was a little different. So, I stood there in my uniform talking to him. He called me Tackle, it was his nickname for me."},{"speaker":"Daryl","time":"00:02:11-9","content":"He said he won't make it and I get emotional because he's like my very best friend and I was like don't say that and he said he I won't see you when you come home and I dropped the phone and raced back to the barracks. And I was regarded as the best soldier in my company. So when the drill sergeant saw me, he said, \"Waters what's wrong?\""},{"speaker":"Daryl","time":"00:02:11-9","content":"I said, \"I'm not with you today,\" and I explained it and told him that I wanted to leave and go to the funeral. He said that, \"Your granddad wouldn't like that. He raised me to be a soldier, a champion.\" And he was right, so I stayed and finished my basic training. But that was my last time talking to him in '87."},{"speaker":"Marcus","time":"00:03:51-8","content":"Thank you so much for sharing that. Did he die before your grandmother died?"},{"speaker":"Daryl","time":"00:04:10-0","content":"Yes, my grandmother died 2 years later. Actually, after my grandfather's death, she was just a shell of a person because they'd been married over 60 years and they were so close and I saw so much love between two people. I always remember hearing my grandmother pray for me, she would wake me with prayers."},{"speaker":"Daryl","time":"00:04:10-0","content":"I would hear my grandparents talking, having intimate conversations at like 2 or 3 in the morning, and I would wake and listen. So I learned to love by listening to them."},{"speaker":"Marcus","time":"00:04:50-4","content":"They sound like wonderful influences in your life. I'd imagine your grateful that neither one of them had to watch you go through the criminal justice system."},{"speaker":"Daryl","time":"00:05:04-2","content":"Actually, I think if my grandfather were alive, one of two things would have happened because he was a patriarch. My uncles they jumped to attention around him, he was a very honorable man and respected in the community."},{"speaker":"Daryl","time":"00:05:04-2","content":"He loved me so much that I know for a fact if he were alive, man my family would literally would have had to gone bankrupt trying to prevent me from being incarcerated. It would have killed him literally. So I probably wouldn't be here if it was humanly possible, if he were alive."},{"speaker":"Marcus","time":"00:05:50-8","content":"Would it have been worth it to you?"},{"speaker":"Daryl","time":"00:05:53-6","content":"No because of that's the irony of it; he raised me to be a sacrificial lover but only I would have been able to talk him out of that decision."},{"speaker":"Marcus","time":"00:06:08-6","content":"I think it's fair for me to assume that you were raised in a loving, nurturing environment?"},{"speaker":"Daryl","time":"00:06:17-1","content":"Very. I didn't know I wasn't rich until I got older."},{"speaker":"Marcus","time":"00:06:21-0","content":"What about friends outside the home? Did you have some very close friends?"},{"speaker":"Daryl","time":"00:06:26-4","content":"Mostly cousins because Gibson is a place where everyone is related it's very small. So, my playmates and friends were mostly cousins. As I got older and attended high school, I had a few close friends but I've always been somewhat of a loner. You can find me in the yard alone or even though I had brothers, I just didn't hang in crowds, I was always very pensive, I love to read books and just sit and think a lot."},{"speaker":"Marcus","time":"00:07:03-5","content":"Did you like school?"},{"speaker":"Daryl","time":"00:07:05-3","content":"I loved school, school and church, those were my favorites. I was a teacher's pet throughout school."},{"speaker":"Marcus","time":"00:07:12-5","content":"What was your favorite subject?"},{"speaker":"Daryl","time":"00:07:16-6","content":"English and then computer science."},{"speaker":"Marcus","time":"00:07:28-7","content":"Did you go all the way through school, did you graduate?"},{"speaker":"Daryl","time":"00:07:30-7","content":"Yes sir."},{"speaker":"Marcus","time":"00:07:28-5","content":"Any college?"},{"speaker":"Daryl","time":"00:07:30-4","content":"Yes sir. I went to Louisiana Tech for computer engineering for a while but then because of racial discrimination, I was actually on a track scholarship, I transferred to USL, University of Southwestern Louisiana, where I ran track and I was a computer science major with scientific option."},{"speaker":"Marcus","time":"00:07:54-5","content":"Did you manage to finish?"},{"speaker":"Daryl","time":"00:07:56-4","content":"No, I didn't. There's a story behind that. My grandmother was alive at the time. I received a check at the time. I had a partial scholarship because of an injury. My grandmother informed me that the money I was receiving was money that was reserved for our home, part of the mortgage. And upon hearing that, I was very, very sad."},{"speaker":"Daryl","time":"00:07:56-4","content":"I wrote my mother a letter and I returned the check and made a very stupid decision. I decided to leave college and hit the streets. 10:00"},{"speaker":"Daryl","time":"00:07:56-4","content":"I decided to make my own way and help my mother because she had sacrificed far too much already. I never returned to school because of that decision."},{"speaker":"Marcus","time":"00:09:03-6","content":"So, when you say you decided to hit the streets, that also means supporting yourself in the streets?"},{"speaker":"Daryl","time":"00:09:10-0","content":"Yes sir."},{"speaker":"Marcus","time":"00:09:08-6","content":"So, what did that involve?"},{"speaker":"Daryl","time":"00:09:13-1","content":"Selling drugs."},{"speaker":"Marcus","time":"00:09:15-4","content":"Was that in the college environment or did you move back to Gibson?"},{"speaker":"Daryl","time":"00:09:18-0","content":"No, it was in Gibson."},{"speaker":"Marcus","time":"00:09:21-0","content":"I love small towns in Louisiana. Can we just go back to your grandparent's house for a minute? When you were an adolescent, coming up there, and we were standing on the property of your grandparent's house, maybe looking away from the house, if I was standing next to you, what would I be seeing, what would I be hearing, smelling?"},{"speaker":"Daryl","time":"00:09:49-7","content":"If we were in the yard, maybe usually sit out on, a carport. Well, you would feel a breeze. There was always a breeze, no matter how hot. You would see trees in the yard, cars parked, on, not concrete, sort of like with shells that type of driveway. You would hear kids, laughs, because I had cousins."},{"speaker":"Daryl","time":"00:09:49-7","content":"You would always hear one of my aunts yelling at a kid, always. You would probably overhear my grandmother in the house singing songs, spiritual songs while cooking. You would hear birds, lots of birds, always. You would, at that time, you might even smell sugarcane, because there were nearby sugarcane fields. And it was wave through the community, you can kind of smell it at times."},{"speaker":"Marcus","time":"00:11:14-6","content":"So, let's come back to the decision to drop out of school. So, my understanding is that you didn't want to be a financial burden? Did you have some idea that, I will drop out for now, and finish later on?"},{"speaker":"Daryl","time":"00:11:28-0","content":"Yes, that was my original intention, but it just didn't work out that way."},{"speaker":"Marcus","time":"00:11:37-0","content":"So, supporting yourself by selling drug, were drugs and alcohol part of your personal life as well?"},{"speaker":"Daryl","time":"00:11:41-9","content":"Yes. Growing up, all of my uncles, they were all alcoholics and womanizers, every one. None of the women use alcohol or drugs. I started at the age of 8, I still remember, stealing a bottle of Budweiser out an ice chest, and I ran around my grandmother's house and I tried it and it was bitter and it was nasty. So I didn't really drink much."},{"speaker":"Daryl","time":"00:11:41-9","content":"And being in the country, there's nothing to do, so we'd flirt with things like that. Let's drink a beer, let's smoke some weed or whatever. As I got older, it wasn't a problem because I loved school, so I didn't want to be inundated, I didn't want to be distracted in any way."},{"speaker":"Daryl","time":"00:11:41-9","content":"I started this little ritual of drinking quarts of beer with my cousin every Friday night, we'd go to a football game. That's the only time I would drink. However because of track I heard I couldn't drink much because my coach would kill me on Monday."},{"speaker":"Daryl","time":"00:11:41-9","content":"The drinking really became a problem when I left for college and joined a fraternity prematurely in my opinion, and I started partying. I really started being irresponsible at the wrong time. There's never a good time but that was the worst time. As a kid I was very disciplined, but as a college student, I lacked discipline, and I started drinking a lot and it became a serious problem."},{"speaker":"Daryl","time":"00:11:41-9","content":"I shared a room as an athlete with one of my cousins who came to see me a few years ago at the Rodeo and he reminded me of my mistakes because he and I both ran track at USL. He barely graduated from high school while I was an honor student. So I utilized that. I had stopped studying and didn't do anything. I would drink and I'd play with girls, that was it."},{"speaker":"Daryl","time":"00:11:41-9","content":"He didn't. He was studying and I would help him. And he was like, \"Man I don't understand how you barely come to the dorm. And you're always gone and you're still making As.\" After a while, we passed each other, I started going down and he started going up. While he has a bachelor's degree and a wife and family and I'm in prison serving a life sentence."},{"speaker":"Daryl","time":"00:11:41-9","content":"And the part that really hurts me is that everyone I know, every family member, everyone from my community, they see me as the shining hope, the star, the person who would give Gibson a name, and I'm in prison serving a life sentence. How could I be the smartest person people know, and yet be in prison serving a life sentence?"},{"speaker":"Marcus","time":"00:14:57-6","content":"Did you get in fights?"},{"speaker":"Daryl","time":"00:15:05-5","content":"No, that was never my, the only time I would fight, everyone knew this, if you wanted to beat Daryl Waters, you had a shot, if you would just fight him head up, but if you touch his brothers, you were through. I protected my brothers. I never lost a fight when protecting my brothers. I lost fights head up, but I protected my brothers."},{"speaker":"Marcus","time":"00:15:34-9","content":"Do you have any children?"},{"speaker":"Daryl","time":"00:15:37-4","content":"Yes, I have 1 biological child, I have a son, who is 24. When I left, he was 4 months old. He lives in Tallahassee, Florida. His name is DJ, he's my joy. I love him, we look alike. He's a very good kid, very smart. I asked him once, said \"DJ, why aren't you upset with me?\" He said, \"Dad I can't be upset with you, I love you, honor you and respect you.\" I asked, \"Why I've never been there.\" He said, \"It doesn't matter.\""},{"speaker":"Daryl","time":"00:15:37-4","content":"Because he told me someone asked who raised him one day, and he said I told them that, even though I lived with my grandmother, she didn't raise me. They're like, \"What who raised you?\" He said, \"My mother didn't raise me.\" He said, \"Your voice raised me.\""},{"speaker":"Daryl","time":"00:15:37-4","content":"So, DJ and I, we have a beautiful relationship. He's doing well, graduated from high school. He's a manager of a little pizza place in Tallahassee, and even hired his older sister. He has two older sisters who were 2 and 3 when I met his mother. They called me dad, because I'm the only father they've known. Now their father is there in Tallahassee, but he just never took time with them. So I am their dad. So I always tell everybody that I have 3 kids, 2 daughters and one son."},{"speaker":"Marcus","time":"00:17:15-2","content":"Do they visit you here?"},{"speaker":"Daryl","time":"00:17:20-1","content":"Yes, but I haven't seen them in a while, since 2011, because they're grown now and have jobs. My oldest daughter has 3 daughters, so we talk, and I call, we write and send emails."},{"speaker":"Marcus","time":"00:17:36-0","content":"So, I think I have a sense, if I had to say, what was involved in getting you down the path you shouldn't have been on was you dropped out of school and were selling drugs and in selling drugs, you're in a very dangerous world. It went south from there. Would you say that your crime that which you were convicted was drug related?"},{"speaker":"Daryl","time":"00:18:02-4","content":"Yes, definitely. I had become a terrible alcoholic. My crime was definitely drug related, and I will say this, I think the inability to cope with failure probably hurt me more than anything else, because every morning I would wake up, look in the mirror and just become angry."},{"speaker":"Daryl","time":"00:18:02-4","content":"I had a lot of self-hatred because I couldn't believe what I had done to myself. And so the only way to overcome would be to get drunk quickly and that was the only way I would cope. I didn't have any other coping skills at the time."},{"speaker":"Marcus","time":"00:18:59-0","content":"So, one of the reasons that we wanted to speak with you as you probably know, is because you're widely respect and are considered a trusted member of this community. 24 years have gone by and a lot of things have changed. But when you look back on the Daryl Waters that was driven through the gates of Angola, how would you describe that young man?"},{"speaker":"Daryl","time":"00:19:34-3","content":"I would have to actually take a few steps back to my incarceration in Florida, leaving the streets and actually entering the system. At that time, I was very, very confused young man, knowing that I had a lot of potential, knowing that I was in the world where I did not belong. I never felt like I belonged and the only way I could fit into that foreign world is by being inebriated or being under the influence or intoxicated in order to overcome who I was."},{"speaker":"Daryl","time":"00:19:34-3","content":"So, yet I had such internal conflict, because to give you an example, and I will answer you question. I remember being in the county jail in Tallahassee, Florida and other guys were doing things people do in jail. They were playing cards, gambling, they were making noise; none of that made any sense to me. So I'd be in my cell reading. I'd tell the guys from my area, in Tallahassee, I say, \"Look don't bother me unless you need me.\""},{"speaker":"Daryl","time":"00:19:34-3","content":"And they would want to fight and there were a lot of guys involved and they would come to my cell, look we need you. I say okay. I'll put the book down. I will put the bookmark in it, put on my shoes, and go help them fight. Finish fighting, and clean myself up and get back in bed, and finish reading and that was it because it didn't make sense to me."},{"speaker":"Daryl","time":"00:19:34-3","content":"So, when I entered to prison, actually I was relieved because I was dealing with all of this self-hatred. I had disappointed my mother. I had disgraced my family. I felt like, I don't belong here, how did I get to this place. It doesn't make sense. I used to go over and over and think about my childhood and like, \"What am I doing here?\""},{"speaker":"Daryl","time":"00:19:34-3","content":"So, when I entered prison for the first time, I actually felt free to be who I was, to be true to myself. And I'm also a quick learner, and so, as soon as, I just needed a little time to clear my thinking and to be away from all the pressures of life and to kind of, re-stabilize. And I mean, it didn't take very long and from that point, I was the person you see today, and I've been that person for like well over, nearly 24 years. It didn't take long at all."},{"speaker":"Marcus","time":"00:22:43-8","content":"So I know that you've been involved with seminary. Can you just give us a sense of the other activities you do here? The typical day here at Angola for you is very busy? What are the various organizations that you're involved with?"},{"speaker":"Daryl","time":"00:23:01-6","content":"The best way I can do this I would have to actually walk through my day. So, like 5:00AM the lights come on, but before the lights come on, I wake up at about 3:00 AM and I would of course, use the restroom. When I return, I hit my knees and pray. I would take some time, I would meditate and think about the things that I would have to do that day."},{"speaker":"Daryl","time":"00:23:01-6","content":"Then I would return and I would lie down because we only get a break from the heat for about 3-4 hours, so I would enjoy being cool for a while. Then the lights would come on at 5, and it would start to heat up again. Other guys will wake up. I might glance at the news, but I don't really have much time for that."},{"speaker":"Daryl","time":"00:23:01-6","content":"So, I get up, and look at my task list and see all the responsibilities I have to take care of. Then it would be time to eat breakfast, and go to the computer club and do some paperwork for the club, maybe order breakfast, drink a cup of coffee I would do those things until 7:00. At 7:00, I would go to the chapel for motivational meeting."},{"speaker":"Daryl","time":"00:23:01-6","content":"At 7:30, I'd return to the club to have a meeting with the guys, and upper management and we will talk. So I will let the guys know what we need them to do for a particular day. After that, I'd go to education department, because I'm a supervisor over the education department at reentry. So I'd talk to the education supervisor about guys who need to be tested, or whatever needs we might have, different concerns, to have guys enrolled etc. We'd talk for a while."},{"speaker":"Daryl","time":"00:23:01-6","content":"Then I'd leave and go to what's called a Compound. And I would talk to the reentry supervisor about reentries and different issues about reentry. Then I would leave and before 10:00, I would probably run back to the reentry club, and order lunch and tell them to deliver it to the East Gate Hobby Shop, because I work in the Hobby Shop. That's how I was able to support my children financially, and now my grandkids."},{"speaker":"Daryl","time":"00:23:01-6","content":"So, I would do some leather work until the Compound clears at about 12:30, at which time, I would probably run, take care of a few other errands for some of the mentees. Then I would exercise. I would to the yard for about an hour, and then of course take a shower and then try to get some last-minute tasks done before 3:00, at which time I would return to my dormitory, take a nap. Then I would start my evening schedule."},{"speaker":"Daryl","time":"00:23:01-6","content":"During the evening schedule, I would have to check in with Pastor Hicks, because we both pastor a large congregation we have about 200. We would talk about different issues in the Church and have meetings. Then I would return to the reentry club to make sure that all is going on, make sure all the food being prepared, and orders are taken care of."},{"speaker":"Daryl","time":"00:23:01-6","content":"And on most nights, whenever I don't have to return to the Hobby Shop to finish some projects, or I don't have a meeting or anything else going on, I would go to a place where social mentors meet, so we can discuss reentry issues, issues that concern the program."},{"speaker":"Daryl","time":"00:23:01-6","content":"We may get an hour or two to get a little leisure time. We might watch something on TV together, eat a meal together. Then we'll report to the dormitory at about 9:00, take a shower, read, look at some last-minute things that I might not have done that day, and then I prepare my mind to do it all over again."},{"speaker":"Marcus","time":"00:27:39-3","content":"That's a busy day."},{"speaker":"Daryl","time":"00:27:41-0","content":"Right. That's the light day actually is the average."},{"speaker":"Marcus","time":"00:27:46-5","content":"So the reentry guys are serving short sentences which is an unusual thing here at Angola. I'm familiar with the program. I'm sure the type of advice that you have for them, they type of mentoring you have for them might be a little different than if you were to mentor an 18-year-old coming to Angola serving a life sentence."},{"speaker":"Marcus","time":"00:27:46-5","content":"What would you tell that 18-year-old serving a life sentence if they came up to you and said, \"Mr. Daryl I'm lost, can you give me some advice?\""},{"speaker":"Daryl","time":"00:28:26-6","content":"Well, the first thing I would tell him is the advice that my mentor gave me. A guy I met in Florida, he's from Barbados. He was a public accountant in London, England for like 15 years expert in a lot of things. He asked me a question one day, I would utilize that. He asked me, \"Daryl, are you in a hole? Are you in trouble?\" I said \"Yes sir.\" And he said, \"Tell me something little chap, what is the first thing that you would do, what is the first thing you would do to get out the hole that you're in?\""},{"speaker":"Daryl","time":"00:28:26-6","content":"I said, \"Well, I would try to find some way to I guess crawl out of the hole.\""},{"speaker":"Daryl","time":"00:28:26-6","content":"He said \"That would be one of the steps, but not the first one. So, what would be the first one?\" I said \"Stop digging.\" So that would be my advice to that guy. I would help him to assess his situation, where he is. And I'd say, \"The first thing you do is stop the bleeding, stop digging, and stop making it worse. It could be worse.\""},{"speaker":"Daryl","time":"00:28:26-6","content":"Then I would try to maybe help him to see the opportunities that are afforded, to assure him he can't change the past, and he has to move forward. And that deck is stacked against you but there's another deck that's under your control. And you need to stack that overwhelmingly high. It needs to be so high, till it dwarfs that other stack."},{"speaker":"Daryl","time":"00:28:26-6","content":"And that is the only way that you will ever have a chance to live. The only way you will have a chance to have freedom. And while you're waiting to secure your freedom, make sure that your life has purpose. Don't quit for anyone, don't give up. Love people, sow good things and that's the only thing you can do to ensure a good future for yourself."},{"speaker":"Marcus","time":"00:30:43-9","content":"So, the reentry guys, it's a different set of issues that they're concerned about. They are not serving a life sentence, they're trying how to get through this two-year program and got to go the judge's court a few times, and then they're getting out. So, it's a short-term kind of mentality. So how do you advise them? How do you try to get them to think in terms of a longer course of action?"},{"speaker":"Daryl","time":"00:31:14-6","content":"Yesterday I was talking to such guys and I told the guys this, I said \"Look, you all are aware of the opportunities you will be able to gain a trade, a skillset, so that you can seek viable employment."},{"speaker":"Daryl","time":"00:31:14-6","content":"If you don't have a GED or high school diploma, you have the opportunity to obtain one. We understand that, but realize that, if you don't deal with, make peace with your past and deal with the ills that have brought you to this place then you will repeat this process.\" I said, \"So really think about that.\" I said, \"You know what getting out is good, but staying out is far better, so we want to help you to change, to be a better person, to think differently because a man thinks, so is he. So, we need to change your thinking paradigm.\""},{"speaker":"Daryl","time":"00:31:14-6","content":"I told those guys, this I say, \"You have an opportunity I wish I had.\" And they were like, \"What I'm talking about?\" I said, \"Well, the judge was so gracious until he saw the path you were traveling and he hit pause. He froze the pain and you stop.\" I said. \"And then he allowed you to enter this program. So you're here. You see us, you've heard about us, you've heard about mass incarceration, you've heard about Angola, lengthy sentences, and now you know it's real. You see guys walking down, and you see them on call at a point, they're dead for real.\""},{"speaker":"Daryl","time":"00:31:14-6","content":"Men are really dying and we're not animals here locked up in a cage as you thought or as you supposed, we're some of the best men you've seen in your life. We have great morals, there are some great guys here. So you see that, you don't have to be a terrible person to end up here. You could be a former college student and end up in this place. You could have been a doctor or lawyer and end up in this place it's possible. So you see that it's real."},{"speaker":"Daryl","time":"00:31:14-6","content":"I told those guys, I said, \"You can see one of the possible outcomes of your life. The other one is far worse which should be death. When you finish this two years, make sure you gain all the wisdom you can because when you go back before the judge and he tells you have completed the program. He will hit play and say, \"Now how will you live your life because I've fast-forwarded your life and allowed you to see. I've given you a possible preview of what your life could be and now you have an opportunity to live with that vision in your head.\" I said, so now how will you live?"},{"speaker":"Marcus","time":"00:34:15-8","content":"I'm going to ask you a difficult question. I really struggle when I try to put myself into the position of somebody serving a life sentence. I try to imagine how they face that. The reality of it. Right. There's a way to hope, I imagine, but as the years go on, and you're coming into your 25th, how do you cope with the possibility of never leaving here?"},{"speaker":"Daryl","time":"00:34:56-2","content":"Okay, I'm glad you asked that. It's my favorite question actually. I don't want to minimize it or make light of it, but I'm going to be very candid and open, you're going to hear my heart. This is how I deal with a life sentence, and the possibility of this being as good as it gets."},{"speaker":"Daryl","time":"00:34:56-2","content":"I realize that I could possibly die in Angola, that this could be the sum total of my life. I realize that it's possible. So, the way I cope with it is I make sure that my life is purposeful. I live an intentional life, and I realize that I can't speak for everyone else, but for Daryl Walters, this is my reality. I am not a convict, an offender, an inmate. I am not a prisoner."},{"speaker":"Daryl","time":"00:34:56-2","content":"I am a man. I am an American who is living in the USA, who only happens to be within a prison, the confines of a prison. I am walking my path of life. And I am heading somewhere, I have the same dreams I had before this prison."},{"speaker":"Daryl","time":"00:34:56-2","content":"So, I see myself as taking this track in life, I'm walking and I made some bad decisions so I had to come on this detour and now when I walk down the walk, I'm just taking a long route because of my bad decisions, but I'm still heading somewhere that surpasses the confines of Angola. I have to keep that in mind, that man this is a long route and I keep going up and down this walk, this prison, this dormitory, but I'm still heading somewhere because I still have purpose."},{"speaker":"Daryl","time":"00:34:56-2","content":"And another thing is this, every time I invest my time in someone else, I free a part of myself. Especially with these mentees, I tell them, \"Don't waste me. Don't waste me. When you get out of here, utilize me. I'm hear teaching you in this prison.\" But when I tell guys, \"When I teach someone, I don't just teach their person, I have to touch the next generation. I'm teaching your son's, son's sons. I want to impact you so strongly that I'm going to touch them.\""},{"speaker":"Daryl","time":"00:34:56-2","content":"So I can't be confined. That's impossible, that's a decision. I have chosen not to be confined. I have chosen not to be limited. Everyone I talk to, family, friends, interviews, a part of me will leave here with you, whomever I come in contact with. I'm going to love people so passionately, until a part of me will always live outside the gates of Angola."},{"speaker":"Daryl","time":"00:34:56-2","content":"My thing is, if I do die here, I'm going to die standing. I'm going to die with dignity. I'm going to die an educated me. I'm going to die with good intellect. I'm going to die growing. I'm going to die with purpose, and I'm going to die the best death possible with dignity."},{"speaker":"Daryl","time":"00:34:56-2","content":"When I have my funeral, wherever it is, people's lives are going to change, because I am going to live that way, with that type intent, with that type of purpose, with that type of strength. No matter where I go, I'm going to grow. And my voice is going to be heard. I can't let prison change who Daryl Waters is, I'm here to change the prison. And that's how I live."},{"speaker":"Marcus","time":"00:39:05-9","content":"Yeah, that's an immensely powerful way to deal with that."},{"speaker":"Daryl","time":"00:39:13-6","content":"One other thing I have to say is this, I'm not being arrogant when I say this. This came forward when I was preaching some years ago. I look at hardship differently now, I've learned. I've learned that some of us are entrusted with affliction and with hardship."},{"speaker":"Daryl","time":"00:39:13-6","content":"So, I see it on this. Not only is this necessary for me, because I'm enduring it, it's necessary to mold me and to chisel my life to produce the person I am to be. But also, like I said, I don't want to appear to be proud or arrogant, but I just believe and that this is for me, that there's something in me, I can't explain. I've always felt like this from a child because just to go back a little, when I born at Charity hospital in New Orleans, I was on a die list."},{"speaker":"Daryl","time":"00:39:13-6","content":"My grandmother prayed and took me in her arms and walked out of the hospital, and ignore everyone who was howling at her. She said I'm taking him home. I was born with twisted intestines and she said she knew I had a purpose, a great purpose."},{"speaker":"Daryl","time":"00:39:13-6","content":"I believe that purpose have is so great. I feel like earthquakes going off of me sometimes. I know there is something I have to do that's do awesome and so big, until a life sentence is needed to tamper me. I feel like I have such a mark, and advantage that my purpose is so strong, and so powerful until I need a life sentence on my path to tamper me, to keep contained a little. That's how I feel."},{"speaker":"Marcus","time":"00:41:26-0","content":"Yeah. It would be a great gift to be able to past that onto others, you know, because it really is transforming the way you're choosing to deal with this situation. Having said that, what do you find to be the worst thing about being here?"},{"speaker":"Daryl","time":"00:41:55-2","content":"The worst thing is having an opportunity to help others, help others, help guys in the seminary, help guys in the Church, and not be able to help my family the way I would like to, my community."},{"speaker":"Daryl","time":"00:41:55-2","content":"I remember reading a letter from one of my daughters, her spelling is atrocious. Don't let her see this. And I'm like man, I teach this, and yet I can't help my daughter. To have a son that says things like, \"Well, dad, you can't come to my graduation but you might make my marriage.\" Because he's about to get engaged this year. To say that's its unfair that he loves me the way he does. It is so unfair that he honors and respects me and I can't be there to hug him and walk with him through the difficulties of life. I can give him advice but he needs me there in flesh."},{"speaker":"Daryl","time":"00:41:55-2","content":"I know my daughters really need a hug sometimes, they need me there to protect them sometimes. I have a mother who wants to grow in ministry and we work together, but I think about the tears that she has shedded over the years and the pain that I brought to her heart and all the sacrifices she had to make."},{"speaker":"Daryl","time":"00:41:55-2","content":"I remember one time saying, \"Mom, take a break. Don't come see me for a while. I know it's hard, but do it for me please. May I give you a vacation? Mom I don't have anything to give you, but if I don't take thanksgivings. That's anonymously giving, so just let me not take and that's all I can give is to just be selfless and let me altruism speak to you, please.\""},{"speaker":"Daryl","time":"00:41:55-2","content":"That's just what I want to do man, I just want my life to count, no matter what and I am going to do that."},{"speaker":"Marcus","time":"00:44:21-0","content":"But when you look back at the crime, having served almost 25 years for that crime and every day being punished for that crime, how do you think about that now? Do you look back and think about the crime and the victim and the victim's family? How do you feel about that?"},{"speaker":"Daryl","time":"00:44:52-6","content":"Definitely, all the time. I don't let it weigh me down, but I think about it and I am very remorseful and I realize that I have a son that I can possibly visit and I think about a son that is no longer here and I feel horrible about that, knowing I can't change it. So, I thought about it these years, \"Well what I can do. Well I can do is I can give life. I can vow to myself never to take another life, never to even harm anyone.\" I don't even want to, I mean I'm going to offend because I'm human but I just want to try to be a blessing to people, to help people."},{"speaker":"Daryl","time":"00:44:52-6","content":"As far as the family, this is my take on it. I would feel far better if the victim's family would benefit from my incarceration. I mean someone is getting paid because I'm here, someone is making money somewhere or else I would not be here. I understand that. So, I would feel better if the victim would receive some type of monetary compensation or something. I think it's not fair to the victim."},{"speaker":"Daryl","time":"00:44:52-6","content":"Another thing I think about is how in this country, if I had committed this crime in another state, I would not be here talking to you from prison and so I try to, I can't understand, so I asked this question. I think I was, I forget, the walls of posters, or someone I was talking with. And I ask, I said, \"Are souls in LA more valuable then souls in other states in USA? Is that what we're saying?\" Because I'm a rational person, I'm trying to rationalize it."},{"speaker":"Daryl","time":"00:44:52-6","content":"What if I stood on the state line, and committed a crime on one side as oppose to the other a life sentence on one side and parole eligibility on the other. How do I reconcile that? I don't understand. I'm just a thinker, I just try to figure things out. And the victim affected and I care for the victim, the victim is very important. I can understand why most victims are so angry and so bitter, because time is just passing and all they know is a crime is committed and we're suffering loss."},{"speaker":"Daryl","time":"00:44:52-6","content":"We don't know what's going on with the perpetrator of the crime. We don't know if he's being rehabilitated. We don't know he is helping to ensure public safety by working in the reentry program. We don't know that he's become a good person with good morals, we don't know anything about him. All we know is that he was, what we regarded a thug on the street 24-25 years ago. And now we don't know. So we're angry at that person, not realizing that that person doesn't exist, actually he hasn't existed for like over 20 years."},{"speaker":"Daryl","time":"00:44:52-6","content":"So, they are angry at another person. I fully accept responsibility and I would like nothing more than to express from my heart how sorry I am for having committed this crime, but I just believe in reconciliation and I believe in going beyond that and trying to make amends if possible."},{"speaker":"Daryl","time":"00:44:52-6","content":"But being in this prison, you know, becoming more and more rehabilitated, actually how can I and others not be rehabilitated when we're part of the rehabilitation process? We help other to rehabilitate others. So how can we ourselves not be regarded as being rehabilitated? We're part of the process and I think they should know that."},{"speaker":"Marcus","time":"00:49:18-8","content":"Yes, as you were saying earlier, all of that is invisible. And I believe there are actually laws in place to prevent you from reaching out to victims now, there's for rights, for restoration."},{"speaker":"Daryl","time":"00:49:28-1","content":"Right."},{"speaker":"Marcus","time":"00:49:37-3","content":"Can you tell me a little bit about your goals for the future? Say for the next 10 years or so what do you want to accomplish?"},{"speaker":"Daryl","time":"00:49:46-3","content":"We'll let me ask you, some of the goals I have, they are beyond the gates, so which ones?"},{"speaker":"Marcus","time":"00:49:58-7","content":"Let's do this. Let's spend a minute envisioning your life should you be eligible to go in front of a parole board and see you for who you are now and they give you a chance, what would you be doing? What's your vision for what you'd do with your life?"},{"speaker":"Daryl","time":"00:50:22-9","content":"Well the first thing I'd do is have a family union first, see all my aunts and uncles. Then I would want to actually, I have employment that's waiting. I've always have employment, so I would work to get reestablished. And then I would try to start sharing with my community and go back to my high school and do some of what I do here and speaking to them also. I will go to local churches and different places to share from my experience to benefit others, but I've always had I would work, I would work and get reestablished in my community and I have this idea of a \"pre-ventry\" program."},{"speaker":"Daryl","time":"00:50:22-9","content":"I'm sure that's not a word. I made it up, pre-ventry. We here reentry, what about pre-ventry. I would want a program that would take preventative measures to prevent guys from getting in the trouble in the first place. Then they wouldn't have to worry about reentry because they'd never enter in the first place. I would have that type of program and it will be for kids ages 8-12 and I would utilize some of the things I learned in the reentry program. But it will go a little deeper to deal with families. I would have the families involved as well."},{"speaker":"Daryl","time":"00:50:22-9","content":"I'd request government grants or some funding or talk to some people I know to try to raise the funds for that program."},{"speaker":"Daryl","time":"00:50:22-9","content":"Another thing I'd do, I'd use my leather-craft to help in the program because I'd train kids and show them, from a young age, you can actually help yourself, and you can even help the family by learning these crafts, making belts, and Bible cases or whatever to support themselves give them alternatives to crime."},{"speaker":"Daryl","time":"00:50:22-9","content":"Another idea I have in doing this, I would start writing applications again. I love writing computer code. I noticed some of the apps are very expensive, and I know a little bit about Microsoft and how they do business and I would buy whatever is the latest thing on the market and analyze it and realize that only 60% of apps are used because people cannot learn all of the functions."},{"speaker":"Daryl","time":"00:50:22-9","content":"So, I would start a little company that will actually make available, very affordable, applications that would be the bare essentials of what's on the market, just what people need and make it very affordable and I would use that to be able to finance some of the other adventures I have in mind."},{"speaker":"Daryl","time":"00:50:22-9","content":"One last thing that I have to mention, years ago I envisioned a school, Rose Waters Institute of Learning in my mother's name and in her honor. She is alive but I want to have it for her. She's always talked about education. She's big on education. She sacrificed for us. And I want to do something for her."},{"speaker":"Daryl","time":"00:50:22-9","content":"So I would have this school state of the arts, equipment, have a place kids can come right after they leave the public-school system or whatever with mentors available and to give them a different experience. Take them on field trips, take them to England. Let them explore parts of the world and let them know the world is bigger than your block and it's bigger than this few."},{"speaker":"Daryl","time":"00:50:22-9","content":"And I want to dedicate the rest of my life to make sure there are no other Daryl Waters with a lot of potential who are wasting a quarter of century in prison. I no longer want this. I want rehabilitation for the worst of the worst. But I also want those guys, those kids who started off well from a good family, good Christian homes, and had a good education, with a lot of potential, but they kind of lost their way or made one bad decision I would make sure that those guys don't end up in the prison system."},{"speaker":"Daryl","time":"00:50:22-9","content":"So that's what I would devote my life to."},{"speaker":"Marcus","time":"00:55:18-8","content":"I don't think it's fair to say the last quarter century of your life was wasted. Certainly not from what you do, but yes, it's wasted in respect with the impact you could have had outside of the prison walls. So I understand that."},{"speaker":"Marcus","time":"00:55:18-8","content":"So, last question you know what we're trying to accomplish with this project. We're trying to bring what's invisible, and make it visible in many regards. Is there something I should have asked you that I didn't? Or something that you would like who never visit prison, never come in here, have no idea what is going on here. It's for whom its life without parole sentence is an abstraction that happens to other people."},{"speaker":"Marcus","time":"00:55:18-8","content":"Or if there's anything else that I didn't give you an opportunity to talk about that you wanted to talk about?"},{"speaker":"Daryl","time":"00:56:18-8","content":"Probably I guess there's one thing and it would be I guess to just give people a feel for I guess how frustrating it could be at times to have potential and to have dreams, and to be in a system where there are no provisions for you to achieve those goals or fulfill those dreams. There's like a ceiling and you just keep hitting your head on the ceiling, so no matter what you do, you can't go any higher. You're so restricted."},{"speaker":"Daryl","time":"00:56:18-8","content":"Life is about growth, we see it in all of nature and in mankind, and when you enter a system that's a dead end system, there's just no process, because there should be an end to everything. I was thinking if rehabilitation is a process, there should be an end to it. And yet we're in a dead end system when we're told, \"You're good, you're great, man, great job, man you.\" Yet it's like okay, the system doesn't afford, there's not, you get to a certain grade level and there's no high school, and college that you could pursue undergraduate and graduate studies. There's none of that. It is just life sentence."},{"speaker":"Daryl","time":"00:56:18-8","content":"So it's like I see that there's a wall and there's a ceiling and I just keeping my head against it. And even with the natural birth process, like I tell guys, if you would just grow enough, if you could just get big enough. If you could just cause this area to be incapacitated, you will cause it go into labor, and it will start having contractions, and it will give you up. But the system is unwilling to go into labor, and we're growing and many of us have outgrown this womb called the system. And it would not go into labor. It would not have contractions to give us another opportunity at life."},{"speaker":"Daryl","time":"00:56:18-8","content":"So we have to stand by and see good men, our pastors, die here. Great moral men, men we look up die. Men who are sick and die because they're not afforded the treatment that they need. And we have such a love for people and people come and see us, and they tell us how great we are. And how we bless their lives. And yet they leave us in this condition and they say, \"Man keep being a great guy till I come back again. I will see you next year.\""},{"speaker":"Daryl","time":"00:56:18-8","content":"And then we lose our hair and we begin to get gray hair. Then we start having a stomp, we bend over, and then they have visit us in the ward. Then it is all over."},{"speaker":"Daryl","time":"00:56:18-8","content":"And I just pray that people can realize that they're everyday people being these walls who love, who get sad, who hurt, who are happy, who have dreams. You can lock us up but you can't stop us from being human beings."}]}