{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:02",
      "content": "David Chenevert Transcript REDACTIONS FINAL"
    },
    {
      "speaker": "David",
      "time": "00:00:02",
      "upperBoundTime": "00:00:07",
      "content": "My name is David Chenevert. My prison number is 95250. I'm from Baton Rouge Louisiana. I've been incarcerated since October the 6th 1979. In a couple weeks I complete my 39th year, start my 40th year on the inside, it will be my 40th Christmas. I'm a first offender. I'm from Baton Rouge Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:07",
      "upperBoundTime": "00:00:12",
      "content": "How old were you?"
    },
    {
      "speaker": "David",
      "time": "00:00:12",
      "upperBoundTime": "00:00:15",
      "content": "I had just turned 21 when I got arrested. Just turned 21, just made 60 in July on the 4th. So I've grown up inside prison. Inside Angola. I'm a first offender. My case is most unique like all cases are. I didn't grow up running from the law. I grew up with the law at my house."
    },
    {
      "speaker": "David",
      "time": "00:00:12",
      "upperBoundTime": "00:00:15",
      "content": "My dad was a policeman as was my brother, my uncle, 3 or 4 of my cousins. My brother in law is now chief of police in Lavonia Louisiana, he's been there about 20 years. My dad tried to get me to be a police officer, and it wasn't me. I went another way. I grew up in an excellent family."
    },
    {
      "speaker": "David",
      "time": "00:00:12",
      "upperBoundTime": "00:00:15",
      "content": "My folks were married for 49 years. I have a brother and 2 sisters under me. I'm the oldest of 4 children. Unlike most of the guys in this prison I finished high school, I started several months at LSU in Baton Rouge before I resigned, I just withdrew, it wasn't me. I got a job working at a fire extinguisher company in Baton Rouge, recharging fire extinguishers; I did that for 4 full years."
    },
    {
      "speaker": "David",
      "time": "00:00:12",
      "upperBoundTime": "00:00:15",
      "content": "It's what I was doing when I got arrested. My dad was the one that arrested me, it was heartbreaking. I'm incarcerated for 2 counts of second degree murder and I am serving 2 natural life sentences that are running concurrent, so I have 1 life sentence. I've been in front of the pardon board twice in September of 1992 and September of 1995. I was denied for the board's discretion. I've done well since I've been in prison, I've done real well. Coming up through school I was never suspended, never expelled, never had any fights, none of that stuff so jail was new to me."
    },
    {
      "speaker": "David",
      "time": "00:00:12",
      "upperBoundTime": "00:00:15",
      "content": "I had a very big case. I had a case where they were seeking the death penalty on me and with my family all being police officers there was a lot publicity. And that very fact I was allow to, I was granted a change of venue from East Baton Rouge Parish to Ouachita Parish in Monroe. After a year in Baton Rouge in jail in a one man cell, the jail in Monroe is entirely different, its wide open, I had a couple of fights in jail, but, I've had no fights in Angola, my conduct record is very good."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:15",
      "upperBoundTime": "00:04:02",
      "content": "Can we talk a little bit about how what got you into this mess, I mean sometimes you can see a sort of pattern of behavior that ends up with a second degree murder it doesn't sound like that was the case with you?"
    },
    {
      "speaker": "David",
      "time": "00:04:02",
      "upperBoundTime": "00:05:04",
      "content": "Yes it was, as I told you earlier, my case is most unique, it's definitely different. The man that I killed was my best friend. Him and I were sharing a house together, we had work together for about 3 years at the fire extinguisher company, and his name was Michael Brown. I, we were pushing dope, we were selling dope."
    },
    {
      "speaker": "David",
      "time": "00:04:02",
      "upperBoundTime": "00:05:04",
      "content": "When you're dealing in large quantities you are able to front individual's money and tell them to give me my money later, and that was the case. I was fronting a lot of marijuana and I was fronting it out to other people I guess that's the simplest way to say it. And I was pressured for the money back unexpectedly and I got scared and I ended up stabbing my best friend to death and as well as his girlfriend. The only reason she died, she got in the way. Sad but it's true."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:04",
      "upperBoundTime": "00:05:15",
      "content": "He owed you money?"
    },
    {
      "speaker": "David",
      "time": "00:05:15",
      "upperBoundTime": "00:06:46",
      "content": "No he was, I was having to, I owed him money, and he knew that I was trying to get it to, and I had money owed to me. It was all the same money it's just that we were free with it. He gave me a lot of dope to distribute, I distributed it with no hurry on the money back and all the sudden we needed the money back and several months earlier. And I couldn't get it that quick, I had told people other things. As I said I stabbed 2 people to death it was a onetime event. I haven't had any violence in my life like that since."
    },
    {
      "speaker": "David",
      "time": "00:05:15",
      "upperBoundTime": "00:06:46",
      "content": "When I came to prison I was, I was under another mentality, I felt justified for what I did, and I didn't feel guilty or hurt or embarrassed that I killed 2 people. And I wound up pleading guilty in Monroe, when I had excellent, expensive, legal representation and my dad's friends were all in the police community from East Baton Rouge parish."
    },
    {
      "speaker": "David",
      "time": "00:05:15",
      "upperBoundTime": "00:06:46",
      "content": "I mean he knew everybody from the judge to the DA to the entire police force, and no one believed that a cop's son would do something like this, but it happened. And I lied to my folks I lied to my lawyer for 2 years that I was in jail."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:46",
      "upperBoundTime": "00:06:49",
      "content": "What were you lying about?"
    },
    {
      "speaker": "David",
      "time": "00:06:49",
      "upperBoundTime": "00:07:59",
      "content": "My guilt. I created a fictitious fall partner and had them looking for him and stuff like that and I had fled the state, I'm driving a brand new transom that I had 6 months and drove it six months and it was given to my little brother bottom line, but what happened is, I fled the state and I called home and my dad talked me into turning myself in and he come got my out of south Texas, and got me the best legal representation and lied to her."
    },
    {
      "speaker": "David",
      "time": "00:06:49",
      "upperBoundTime": "00:07:59",
      "content": "So after 2 years in jail, after a couple of fights in jail the defense, my lawyers gave me a polygraph, and they told me I failed it, which I knew I did, I lied through the whole thing. I changed my mind and I pleaded guilty. It was the best thing that I could have done, putting my family through a death penalty trial would have been traumatic, and this was traumatic as it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:59",
      "upperBoundTime": "00:08:06",
      "content": "How did your father respond when you?"
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "It crushed him, it crushed him, my dad was a supervisor. My little brother was a cadet at the time. Like I said, I grew up with 2 police cars in my front yard, it's just, that was crazy it's just, it happened. My dad had to work another 10 years before he wound up retiring in Baton Rouge and all the officers under him knew Mr. John's son is at Angola."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "Same with my little brother, Jonny's brother is at Angola. My dad retired, it crushed him. It hurt it hurt my little brother who is recently retired himself. And my incarceration has just been a part of our family. We have a large family. And it's been accepted. My dad passed in 2006. And I've hung on, I have done real good. I have put major changes in my life. It took a major, I've had major changes my whole life, my wife and I finally sealed our marriage in prison."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "She's the one who helped put God in my heart and make me realize that, you've messed up; you've made a big mistake. It took me a long time to realize that, what I did, probably could have been squashed with a simple fistfight. Maybe just a verbal argument, I say that now. Putting God in my heart led me to the seminary in 2003. I finished from the New Orleans Baptist Theological Seminary in 07."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "I've been an inmate minister ever since. I also serve as a, prior to that I've been a high voltage electrician here in Angola and I worked on a, that's what I do. I do high voltage electrical work. But they got a good reentry program here 8 or 9 years ago they ended up I got picked, I got told what I was going to do."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "So now I teach class, I teach a class to a bunch of new young nonviolent drug offenders here at Angola. I've been, thank you. I've been successful in probably helping about 90 people leave Angola in the last 8 or 9 years. That's saying a real mouthful right there."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": ""
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "It's a real blessing. Oh what is this? Jesus anyway, I teach class 5 days a week. I've got a very nice classroom on the compound. I'm the lead mentor over at the electrical program. We teach a lot. What we teach residential electricity. I teach guys something they can run out of here and go get a job with. Wiring houses, roughing in commercial buildings. Pulling wire, if you can do that, if you can pull conduit, you can go out there and get a job."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "I'm very familiar with, I've become very good friends with Judge Knight out of St. Tammy Parish and Ms. Laurie White, out of New Orleans, and Judge Shlygel, I know me all, Judge Hunter. They know all the lead mentors here, there are 13 of us here that each teaches school and we got favor."
    },
    {
      "speaker": "David",
      "time": "00:08:06",
      "upperBoundTime": "00:12:48",
      "content": "One of the other things I do that's real big in my life is I'm a member of united Pentecostal church and I'm a deacon in the church, I am not a Pastor, but I serve on the point lookout committee, I bury people, I bury people here at Angola. I do about 10 to 15 a year. Which is a lot, there are 5 of us that rotate in performing the funerals. Some have family, most don't."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:48",
      "upperBoundTime": "00:12:56",
      "content": "Will you describe the whole process like when people get buried here at Angola?"
    },
    {
      "speaker": "David",
      "time": "00:12:56",
      "upperBoundTime": "00:14:31",
      "content": "Sure, depending on the conditions of your death, if you're an old guy and you've been on the ward for months and they know that you didn't die a violent death or drug overdose, they're not going to perform an autopsy on you. If you're a young man and you die of an apparent heart attack, they're going to do an autopsy on you to see if you had drugs in you. They do that in Baton Rouge, they bring you back here. Dress the body partially put it in a body bag, put it in a closed coffin."
    },
    {
      "speaker": "David",
      "time": "00:12:56",
      "upperBoundTime": "00:14:31",
      "content": "A very nice coffin that's built at the carpenter shop. The service is performed in the hospice chapel here at the treatment center. From there, and the services they include a worship service, song, prayer, bible scripture and a message as well. Inmates as well as family in attendance are given the opportunity to speak on the inmate's behalf."
    },
    {
      "speaker": "David",
      "time": "00:12:56",
      "upperBoundTime": "00:14:31",
      "content": "All funerals are closed coffin funerals. If it's a vet that were burying, the ceremony is somewhat different, it's a flag draped coffin. The vet's organization here inside the prison plays a little bit bigger part. They escort the coffin, they play taps and all that."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:31",
      "upperBoundTime": "00:14:34",
      "content": "The sermon?"
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "They sermon is one of the people, that's correct, he's in charge of the vet program back there. But all funerals are different. Some days, it's been a few days, we put 2 or 3 people in the ground the same day. People die here all the time."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "Sometimes we have a stretch, we're in a stretch right now, no one's died in the last couple of weeks. That's a long stretch, normally its one a week or 2 a week. There's a morgue at the hospital and it has 2 drawers inside and we can't keep any people."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "We can't save people over there they put them in the ground. Your family has, if you die in prison, Department of Corrections is going to take 48 hours to notify your family that you've passed and they have an opportunity to come get you. If they can't reach you, your family, you will go in the ground."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "There have been people, I know of one instance for sure, my friend, we buried my friend Bobby Holmes during Katrina, and that was a real mess. Bobby went in the ground with his family unnotifed and his daughters came up, they were displaced from the storm, and they came up to visit several months later, you're dads been in the ground."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "It's sad but the stories like that are crazy. We've had people in the hospice chapel get out of control, family members, upset with the nurses, upset with the doctors. Upset that their loved one has passed in prison. It's a unique situation. I'd like to say something about my wife."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "My wife and, her name is Sheila, we've been together since 6th grade. I've known her since diapers, it's unheard of. We got married here in prison on May the 12th 2001. And my wife probably comes through; my wife comes through the front gate more than anybody else."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "She's here every Friday. Anytime she can get in the gate, a banquet, the rodeo, a church service, she's here. She's the woman has helped me get my mind right, and she's the one who helped me put God in my life, and I'm very honored to say that I have a very successful marriage. I have a very godly marriage; I have a very godly wife. My wife is, and it takes a lot for a woman to sacrifice her entire life for someone serving a life sentence."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "We had a banquet here the other night and they asked my wife to speak. My wife is an encourager, when you hear her speak, she can speak. She's very intelligent. She runs one of the outside organizations that helps ex-offenders. It's called Louisiana Coalition for Reform."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "She used to be the President around 2002 of Louisiana Cure. In her eyes Louisiana Cure wasn't doing enough to help her husband. They were worried about the telephone rates and holding banquets for the long termers and stuff like that."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": ""
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "That wasn't trying to get us out. My wife speaks regularly in front of the pardon board and the parole board. She's assisted in getting definitely a dozen people out of this prison. They know my wife well in front of the pardon board, all the staff knows her here. She's not a troublemaker, and they know that. She's a, blessing she's spoken at many of the banquets here. She's been inside of a number of the prisons, DCI, LCIW."
    },
    {
      "speaker": "David",
      "time": "00:14:34",
      "upperBoundTime": "00:19:17",
      "content": "Penitentiary in Texas, she's been in a number of prisons, she's taught life skill classes in East Baton Rouge Parish prison for the women. Very involved, so I've got a real hard hitter on my side and it's a real blessing, and everyone knows that I've got a dedicated wife. That's big, that's big in my life and I'm very proud of my marriage. I guess that's about the extent of my testimony unless you want to go with other questions."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:17",
      "upperBoundTime": "00:19:20",
      "content": "Yes, I'd like to ask you some more questions."
    },
    {
      "speaker": "David",
      "time": "00:19:20",
      "upperBoundTime": "00:19:23",
      "content": "Go for it. Anything I've left out or?"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:23",
      "upperBoundTime": "00:19:32",
      "content": "Yes, so let me go back and sort of, go back to your time before coming here."
    },
    {
      "speaker": "David",
      "time": "00:19:32",
      "upperBoundTime": "00:19:36",
      "content": "What is this? Peach?"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:36",
      "upperBoundTime": "00:19:37",
      "content": "That is a,"
    },
    {
      "speaker": "David",
      "time": "00:19:37",
      "upperBoundTime": "00:19:41",
      "content": "Sparkling water"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:41",
      "upperBoundTime": "00:19:45",
      "content": "It is a sparkling water drink that has essence of passion fruit in it."
    },
    {
      "speaker": "David",
      "time": "00:19:45",
      "upperBoundTime": "00:19:47",
      "content": "They don't sell stuff like that here, ever."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:47",
      "upperBoundTime": "00:19:50",
      "content": "I imagine not."
    },
    {
      "speaker": "David",
      "time": "00:19:50",
      "upperBoundTime": "00:19:51",
      "content": "Sprite is about as close as you're going to get."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:51",
      "upperBoundTime": "00:19:55",
      "content": "Yes I thought that you might want something,"
    },
    {
      "speaker": "David",
      "time": "00:19:55",
      "upperBoundTime": "00:19:58",
      "content": "This is excellent, go for it. Prior to coming to prison?"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:58",
      "upperBoundTime": "00:20:05",
      "content": "Yes, prior to coming to prison. Maybe, can we talk a little bit about relationships with grandparents, or special adults in your life?"
    },
    {
      "speaker": "David",
      "time": "00:20:05",
      "upperBoundTime": "00:21:35",
      "content": "I had 2 excellent sets of grandparents. Both sets of my grandparents were married over 50 years. All of my grandparents are now deceased, they've died since I've been locked up. All of them had been to Angola numerous times."
    },
    {
      "speaker": "David",
      "time": "00:20:05",
      "upperBoundTime": "00:21:35",
      "content": "I had my dad's family, from New Roads, Morgana, across the river, so it's really quick for them to come. My mother's family migrated from East Germany. That's a whole other story there. But they resided in Harington Texas down in the Rio Grande Valley."
    },
    {
      "speaker": "David",
      "time": "00:20:05",
      "upperBoundTime": "00:21:35",
      "content": "Until they passed and they made numerous trips up here through the 80s for sure while they still lived and my dad's the oldest of 14. And my mom was the middle of 3 girls. Excellent Grandparents. Never no trouble, my grandfather, he was a log truck driver, not a rich man, but, he put 14 kids through high school, and set up what I mean."
    },
    {
      "speaker": "David",
      "time": "00:20:05",
      "upperBoundTime": "00:21:35",
      "content": "There was never any extra funds. My grandfather on my mother's side, he was a machinist. He repaired typewriters and calculators and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:35",
      "upperBoundTime": "00:21:43",
      "content": "You said firmly that college wasn't for you, did you do well in school?"
    },
    {
      "speaker": "David",
      "time": "00:21:43",
      "upperBoundTime": "00:23:48",
      "content": "Yes I did very well in school. I graduated at the end of my junior year in 1975. There was a new program that they started in Baton Rouge that allowed, it was called the graduating junior. I took advantage of it; I was ready to get out of school."
    },
    {
      "speaker": "David",
      "time": "00:21:43",
      "upperBoundTime": "00:23:48",
      "content": "And my mom worked at LSU. I was still living at home at the time, and which was on the other side of town from LSU. As a 16 year old just turning 17, just getting my driver's license, using the family car, living at home, I'm commuting to the campus and I've got weird classes at weird hours."
    },
    {
      "speaker": "David",
      "time": "00:21:43",
      "upperBoundTime": "00:23:48",
      "content": "I guess you could say I'm taking a zolab class at 7 in the morning and a math class in the afternoon. I find myself with 2 or 3 hours in between classes on the other side of town and I had a little job working at a gas station at the time, trying to go to school and work at the same time. Not making any money but, I wound up in the, in the union shooting pool and bowling and got interest in girls and I just lost interest in school."
    },
    {
      "speaker": "David",
      "time": "00:21:43",
      "upperBoundTime": "00:23:48",
      "content": "Lost interest and wound up withdrawing, but I would have never thought that I would have completed the seminary here. I left school in 1976. To attempt the seminary in 2003. I wasn't tired of change. I can read and write and type very well, I'm pretty computer literate, but I did well in school."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:48",
      "upperBoundTime": "00:23:51",
      "content": "Ok, I also wanted to ask you a little bit about relationships, intimate relationships before coming to Angola. I know that you're married to your 6th grade, or 6-year-old sweetheart."
    },
    {
      "speaker": "David",
      "time": "00:23:51",
      "upperBoundTime": "00:24:08",
      "content": "I've been with my girl since junior high."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:08",
      "upperBoundTime": "00:24:09",
      "content": "And that's been the person you've been with the whole time?"
    },
    {
      "speaker": "David",
      "time": "00:24:09",
      "upperBoundTime": "00:24:13",
      "content": "That's correct."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:13",
      "upperBoundTime": "00:24:14",
      "content": "Do you have any children?"
    },
    {
      "speaker": "David",
      "time": "00:24:14",
      "upperBoundTime": "00:24:17",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:17",
      "upperBoundTime": "00:24:18",
      "content": "And this was your first arrest?"
    },
    {
      "speaker": "David",
      "time": "00:24:18",
      "upperBoundTime": "00:24:22",
      "content": "Yes absolutely, never been to juvenile hall, nothing."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:22",
      "upperBoundTime": "00:24:35",
      "content": "You've also covered quite a few things I had planned on asking you about."
    },
    {
      "speaker": "David",
      "time": "00:24:35",
      "upperBoundTime": "00:24:40",
      "content": "As far as relationships, I was with a couple other girls, but nothing intense."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:40",
      "upperBoundTime": "00:25:20",
      "content": "This is an unusual and must be a special relationship clearly, but I also want to, you've told me a lot about what happened and you're life since 2000 or so, 2001. Id likes to go back a little earlier."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:40",
      "upperBoundTime": "00:25:20",
      "content": "Look at some of the extraordinary circumstances of being a police officer's son, coming to Angola. Not only the impact that might have had on your family, but perhaps but you in a category for being more vulnerable or perhaps getting some special treatment. How were your first few months here at Angola?"
    },
    {
      "speaker": "David",
      "time": "00:25:20",
      "upperBoundTime": "00:27:09",
      "content": "When I was arrested, it's an easy question. When I was arrested, thy made a big thing over it, policeman's son, brother of a police officer, made a big thing, front pages of the paper for weeks. And, I went immediately to lockdown, which is a one-man cell and I stayed there the entire time I was locked up."
    },
    {
      "speaker": "David",
      "time": "00:25:20",
      "upperBoundTime": "00:27:09",
      "content": "My dad was a supervisor at the time and basically I was not in population. Or one of the big wings, one of the big tanks in the prison. None of the guys that were in jail was anyone that my dad or my brother might have arrested. Okay, same when I come here, my dad for so long, as a supervisor, anyone that he would have arrested would have already been here 20 some years what I mean? I didn't let that become a factor."
    },
    {
      "speaker": "David",
      "time": "00:25:20",
      "upperBoundTime": "00:27:09",
      "content": "You do not want to put yourself in a position where you need protection in here. You don't want to tell the people, I need protection, I think this guy wants to kill me because my dad sent him to prison, you don't want to get yourself in that kind of, you can go into protection and stay there forever and it's very difficult to come out of."
    },
    {
      "speaker": "David",
      "time": "00:25:20",
      "upperBoundTime": "00:27:09",
      "content": "I've never been in a protection situation, you want to be a man when you come in here. It has flipped greatly since I got here, it was an ugly prison when I got here."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:09",
      "upperBoundTime": "00:27:15",
      "content": "I mean let's talk about that, you came here in the late, early 80s?"
    },
    {
      "speaker": "David",
      "time": "00:27:15",
      "upperBoundTime": "00:27:20",
      "content": "Early 80s I got here on October the 5th 1981."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:20",
      "upperBoundTime": "00:27:24",
      "content": "Right, tell me about the Angola of 1981."
    },
    {
      "speaker": "David",
      "time": "00:27:24",
      "upperBoundTime": "00:28:41",
      "content": "Well, I went straight to the cellblock, camp C Tiger. The cellblock, I was a little bit bigger than I am now, long hair, I went straight to the field. Life sentence, they try to get any unruliness out of you that they possibly can, though I didn't have that, I was ready to come out of the cell, go work in the field. I'd been in the cell 2 years now, it's time to get some sunshine, lose a little bit of weight, what I mean, and put some muscle back on. So I went in the field, I stayed a couple of years before I got a job."
    },
    {
      "speaker": "David",
      "time": "00:27:24",
      "upperBoundTime": "00:28:41",
      "content": "There was a lot going on around me, mostly fights and cuttings and, I kept away from all that bullshit. It's just straight up, that was not me, I seen it, I could tell real quick you could get yourself in more trouble. I have seen guys escape and killed and stabbed and brains beat out of them and I was just a good kid, Eagle Scout, policeman's son, I don't need to be getting, I'm in enough trouble as it is. I don't need to be getting in more trouble. For me to tell you I've been here all this time and I've never had a fight. That's crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:41",
      "upperBoundTime": "00:28:45",
      "content": "That is crazy."
    },
    {
      "speaker": "David",
      "time": "00:28:45",
      "upperBoundTime": "00:28:58",
      "content": "That's crazy, ain't nobody want to tell you that. No one's going to tell you that, that's crazy. But it's true. There are people like myself that exist. I know some guys that have been here 40 50 years, one write up, 2 write-ups."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:58",
      "upperBoundTime": "00:29:04",
      "content": "It is very unusual, how do you do that? How do you stay away from a fight when someone's obviously going to try to test you?"
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "That's not a proper question. Because someone's not obviously going to test you. I'm a big guy, now if you're a young weak looking guy, and the same is true in the dorm that imp in. The dorm that I'm in in mag 2 right now, there's about 60 guys in the dorm and most of them are young between 20-27 years old and they rip and run and they are all drug offenders. And this prison has sunk into their head."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "Most of the reentry guys are on their last leg, they are 3rd and 4th offenders and they can't take another lick in the courtroom. There will be some guy just don't take this penitentiary seriously. I came with my wife and what I told myself I'm going to hang on, I'm going to hang on and just try to live it out. Something's going to happen, something is going to happen."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "And let me tell you something, when I got here and I was one of those first people to get one of those brand new natural life sentences. Because the law changed in 1979 for the 40-year lifers, the cutoff date was in July of 79 and I got busted in October, so that made me a natural lifer."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": ""
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "And like I said, this prison was ugly, it's quiet now, its peaceful. You still have ugly things that go on here, but not nearly like it was. The coming of the seminary and came to this prison. They changed the mentalities of prison. It's quiet. You still got drugs here, you still got some minor violence but you've got god in this prison and that's a big thing. Everybody knows it too. God's in camp C and camp D and camp F, down death row."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "Warren Cain brought so many volunteers in this prison. And one other thing is that, when I came to prison they were just throwing people away, everybody was getting life sentences. And what's really encouraging is that these last 10 years this last 10 years we have seen the Louisiana legislature do something for the juvenile lifers, the heroin lifers, the habitual offender lifers, we've seen the legislator try stuff like 15550, the ankle bracelet program for the violent offender."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "We've seen them try for the 24 this last couple of years, they've tried for the 30, 50, if you've been on the inside 30 years and you're over 50 years old they want to make them parole eligible."
    },
    {
      "speaker": "David",
      "time": "00:29:04",
      "upperBoundTime": "00:32:07",
      "content": "That hits me in the face, that's a big thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:07",
      "upperBoundTime": "00:32:08",
      "content": "Yes, and the thing is, is that it is indeed a very hopeful time. You probably more than anybody has, you've paid attention to these changes because they directly affect your life."
    },
    {
      "speaker": "David",
      "time": "00:32:08",
      "upperBoundTime": "00:32:10",
      "content": "Sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:10",
      "upperBoundTime": "00:32:14",
      "content": "But let me also point out that prior to these changes, most of the folks who have been living a life sentence for most of this time have lived here with the understanding that they may never get out. And I want to ask you a little bit about that, about coping with that."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:10",
      "upperBoundTime": "00:32:14",
      "content": "So you've been here for 40 years, you are in a situation quite rightly that you are quite hopeful in this period in time; you have been through times where it didn't look at good as this. Especially in your role as somebody that buries people at Angola, when you bury people you are surely reminded a new every time that this could be you."
    },
    {
      "speaker": "David",
      "time": "00:32:14",
      "upperBoundTime": "00:33:04",
      "content": "Every time."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:04",
      "upperBoundTime": "00:33:06",
      "content": "How do you cope with that possibility?"
    },
    {
      "speaker": "David",
      "time": "00:33:06",
      "upperBoundTime": "00:36:01",
      "content": "Acceptance is the thing and though I was sentenced to a life sentence, I have never truly taken it in to my system and said what, this is me. This where I'm going to be for the rest of my life. I have just not accepted that, it's been that long and I have always had some hope and putting Christ in my life has made all the difference in the world. I have a new mentality on if I die today or tomorrow, I have another hope. I have a wife that stands by me that knows the seriousness of my charge and I stabbed 2 people to death."
    },
    {
      "speaker": "David",
      "time": "00:33:06",
      "upperBoundTime": "00:36:01",
      "content": "And they look at a stabbing murder as more heinous than if I had shot you in the stomach and you died what I mean? But I've been encouraged, I've got God on my side and I've got a wife on my side. And I can't let a life sentence drag me down. One of the things that I saw, that I've seen, I know many people that have been here, theirs about 300 people that have been here longer than me, that's saying a mouthful right there."
    },
    {
      "speaker": "David",
      "time": "00:33:06",
      "upperBoundTime": "00:36:01",
      "content": "And the 30 year lifers, the 40 year lifers, the 10, 6 lifers and people that had their parole eligibility taken away from them in the 70s and the last at the last legislator session, they've come to prison and they've done 40 years and with that mentality, keeping that mentality, they just said the hell with it, I'm going to live my life how the hell I'm going to do it."
    },
    {
      "speaker": "David",
      "time": "00:33:06",
      "upperBoundTime": "00:36:01",
      "content": "And if that means getting high or trying to escape or gambling or whatever they want to do, and now you done messed up your jacket and here comes 40 years later and they've just reinstated everyone's parole eligibility and you've got 200 write-ups in your jacket according the how you've been living the last 40 years."
    },
    {
      "speaker": "David",
      "time": "00:33:06",
      "upperBoundTime": "00:36:01",
      "content": "And we see some 40-year lifers denied in front of the pardon board, the parole board for cutting up, doing it their way. Who would have known that your parole eligibility would have been reinstated? One of the big things that was big, like you said I've buried a lot of people, I've had some major health issues here in the last 2016, 2017."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:01",
      "upperBoundTime": "00:36:03",
      "content": "Tell me a little bit about that."
    },
    {
      "speaker": "David",
      "time": "00:36:03",
      "upperBoundTime": "00:37:51",
      "content": "I've never been sick, I've never been seriously sick here in Angola, but in September of 2016 I had 10 inches of my large intestine removed I had something called gastrointestinal and it's a ruptured large intestine and left me with a colostomy bag for 10 miserable months. That was major surgery and I had to have major surgery again to take the bag off. Then I developed an upper hernia, had major surgery again, they put a couple pieces of mesh in my stomach what I mean."
    },
    {
      "speaker": "David",
      "time": "00:36:03",
      "upperBoundTime": "00:37:51",
      "content": "So I'm good now, they got it right, they spent about $350,000 on major surgery on me, 5 operations. I've got a couple big scars but I'm not hurting. God has blessed me, I know it, and I have recovered. To take that colostomy bag off of my side that was huge, that was 10 miserable hard months for me. 2017 was tough. I stayed in New Orleans numerous times, I stayed on the ward here."
    },
    {
      "speaker": "David",
      "time": "00:36:03",
      "upperBoundTime": "00:37:51",
      "content": "It was good to get back up on my feet and out of that wheelchair and get that staples out, start carrying that with me. But I've been through major health issues the last couple of years and I'm fully recovered praise the lord. But my spirit has been good, because I also serve as an inmate minister I've gone on ward 1. Have you been on ward 1 and ward 2?"
    },
    {
      "speaker": "Marcus",
      "time": "00:37:51",
      "upperBoundTime": "00:37:53",
      "content": "No."
    },
    {
      "speaker": "David",
      "time": "00:37:53",
      "upperBoundTime": "00:38:51",
      "content": "That's the hospital. And I make rounds on Sunday mornings, me and a couple of the other inmate ministers and we go sit with guys and pray with guys and try to encourage guys on the ward. Ward 1 is for people that are hurt, sick, recovering. Ward 2 is for the dying and it stays full. There are 24 beds on the floor about 10 lock rooms, you can have about 30 something people there at any given time."
    },
    {
      "speaker": "David",
      "time": "00:37:53",
      "upperBoundTime": "00:38:51",
      "content": "And it stays full. And you have men there, if you get the opportunity, if you have time, you ought to get someone to let you go to ward 2. I'm sure it wouldn't be a problem. But wave got men on machines and in diapers and double amputees. Blind men and men with COPD and just the list is so long and we have men on Hospice all the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:51",
      "upperBoundTime": "00:38:54",
      "content": "Have you ever been involved with the hospice program?"
    },
    {
      "speaker": "David",
      "time": "00:38:54",
      "upperBoundTime": "00:41:13",
      "content": "Well actually yes, actually I am involved with the hospice program, I'm not a hospice volunteer, but when I go on Sunday mornings I do gloves on and I see, we have an awesome hospice team. We also have an awesome team of orderlies that work, actually the orderlies that work in the hospital I appreciate more than the hospice people."
    },
    {
      "speaker": "David",
      "time": "00:38:54",
      "upperBoundTime": "00:41:13",
      "content": "Because the hospice guys sit with you when you're dying, the orderlies on the ward they wipe butts and put diaper son you bathe you, change your bed linen ok, they do stuff that the doctors and nurses don't want to do. And when you become that incapacitated you need someone like that and those guys are a real blessing."
    },
    {
      "speaker": "David",
      "time": "00:38:54",
      "upperBoundTime": "00:41:13",
      "content": "But like I said, I've put on gloves and I help, when I go in there we are subject to help put a gown on or help roll somebody over, but I, burying people, burying people that I prayed with last week. What I mean, or have been praying with for the last month that's deep. And that's about as involved one can get I guess you could say. As far as hospice. I'm not an official, I don't have a hospice t-shirt, but imp on the point lookout committee, that's the burial committee."
    },
    {
      "speaker": "David",
      "time": "00:38:54",
      "upperBoundTime": "00:41:13",
      "content": "They work together. For me to tell you they spent $350,000 on me medically last year. Regardless, plus another $50, $60,000 to keep somebody like me in prison you're wasting your time. You're wasting your money keeping somebody like me."
    },
    {
      "speaker": "David",
      "time": "00:38:54",
      "upperBoundTime": "00:41:13",
      "content": "And there are a lot of people here, you can walk through ward 2 and look, you can go here on cypress 2 and look, you can go to camp F and look at all the old men that have been here 40 years, that couldn't walk to the front gate if you told them, there it is. Its senseless keeping people in here for something they did 50 years ago."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:13",
      "upperBoundTime": "00:41:31",
      "content": "But I'd like to talk a little bit about the impact this has had on your family. And you did mention that there was a stigma associated with it in the beginning for your family, who in your family"
    },
    {
      "speaker": "David",
      "time": "00:41:31",
      "upperBoundTime": "00:41:32",
      "content": "There was stigma, go ahead."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:32",
      "upperBoundTime": "00:41:34",
      "content": "Who in your family do you think has had the hardest time with this whole thing?"
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "That's a tough question, that's a tough question. I have this picture of my dad arresting me in the chief of police's office downstairs, upstairs in Baton Rouge, he's on his knees, and the chief of police is putting hand cuffs behind my back, handing me over to his work partners, but I have that vision."
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "And he had to live with that he knew all of his all the officers that worked for him were talking behind his back. To him, it was hard for my dad to share."
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "When you spend your whole life as a police officer and to turn around and to arrest your son and send him to Angola for life, that's, that was hard. And it broke his heart. He would have loved to see me come out of prison. My brother as a young cadet, he just did his entire career, he just accepted it. It's kind of a like that's on you, you did that; there's nothing I can do to help you."
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "My younger sister at one time she was running for public office in some little parish race, I don't know what it was, district representative or something like that and, my sister is a very pretty young girl, this was, I don't know, 30 years ago, 20 years ago, and the guy that she was running it against made a, out of the ordinary statement, her brothers in Angola for murder, and it got out in the news and it broke my sisters heart and she wound up just stepping out of the way and stuff like that."
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "When I went to, when I came to prison my mom would tell stories about, your sisters got on the bus and you're the first thing on the radio going to school when they are in elementary and junior high together and all the kids on the bus turn and point at them and that's their brother and like that, what I mean."
    },
    {
      "speaker": "David",
      "time": "00:41:34",
      "upperBoundTime": "00:44:25",
      "content": "My dad has passed, my brother and both my sisters have gone on to have very successful marriages and kids and all that. My baby sister Tanya, she's married to the chief of police in Lavonia, married a man that became a police officer."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:25",
      "upperBoundTime": "00:44:29",
      "content": "How about your mom?"
    },
    {
      "speaker": "David",
      "time": "00:44:29",
      "upperBoundTime": "00:46:15",
      "content": "It's been a tough lick. We are on estranged terms right now, it's very, she has, not on bad terms, but she's grown tired of coming to prison. She's grown tired of driving up here. When I first came, her and my dad came twice a month, every other weekend."
    },
    {
      "speaker": "David",
      "time": "00:44:29",
      "upperBoundTime": "00:46:15",
      "content": "Which was, my brother and sisters came with them for years, and like I said they've all grown up and got married and got their own families and careers and they have other things to do besides Dave. Dave has always had Sheila in prison and Sheila takes care of Dave psychologically I guess you could say."
    },
    {
      "speaker": "David",
      "time": "00:44:29",
      "upperBoundTime": "00:46:15",
      "content": ""
    },
    {
      "speaker": "David",
      "time": "00:44:29",
      "upperBoundTime": "00:46:15",
      "content": "It's a blessing, they don't really have to worry about me, so my family has kind of withdrawn from my life. Not on bad terms, but I understand. I'm very blessed to visit as much as I do with my wife. I'm happy I'm happy with that. I can live with that. If my mom or my siblings would die of course I would be crushed but it's been hard on my family, it's been hard, it's been hard. Everyone in the neighborhood knows. Got a murderer from over there."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:15",
      "upperBoundTime": "00:46:16",
      "content": "That has to be hard."
    },
    {
      "speaker": "David",
      "time": "00:46:16",
      "upperBoundTime": "00:46:18",
      "content": "It has to be."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:18",
      "upperBoundTime": "00:46:19",
      "content": "So, you've been through the pardon board twice."
    },
    {
      "speaker": "David",
      "time": "00:46:19",
      "upperBoundTime": "00:48:07",
      "content": "Probably everything I've just shared with you in the last half an hour, especially what I've just shared with you in the last 10mins. That imp sorry for what I did. I made a mistake, I made a mistake. And I've asked myself this question as a prisoner. How would I react if someone would kill my wife? As brutally as I killed 2 people. Or if they killed my mother or my sisters, how would I react? Or my dad. Could I forgive, how long would it take?"
    },
    {
      "speaker": "David",
      "time": "00:46:19",
      "upperBoundTime": "00:48:07",
      "content": "How long would it take me to forgive, my mentality has gone from far left to, I could never do it, to, I would have to. The world has changed out there, it's very violent it's very crazy and I think everyone deserves another chance. I do, I do. Especially the long termers. Especially the first offenders. You can see a man, you can see a man's heart, you can see what he's done. It's in that conduct record, it's in that folder right there that he totes around with him, you can see it in his face you can hear it in his voice."
    },
    {
      "speaker": "David",
      "time": "00:46:19",
      "upperBoundTime": "00:48:07",
      "content": "You can't make a decision on a man like that, especially when that man has a support background like I do and I know so many others do. Yu know I don't have to go to a vets home or a odyssey house or something like, I've got several people who would put me to work tomorrow if I could leave today."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:07",
      "upperBoundTime": "00:48:09",
      "content": "Sure. So, let's move forward with that, what are you most proud of?"
    },
    {
      "speaker": "David",
      "time": "00:48:09",
      "upperBoundTime": "00:49:47",
      "content": "I knew you were going to ask me that question and I've dealt with it the last couple day looking at that paper. My relationship with Christ and the fact that my wife is the one that introduced me to him and the success of my marriage. Because you don't, you can't carry on a successful marriage inside this prison as long as Sheila and I have without god in your life on both sides. Her side and mine, and people see that, they know that, they know that that's what I'm most proud of."
    },
    {
      "speaker": "David",
      "time": "00:48:09",
      "upperBoundTime": "00:49:47",
      "content": "Yes, when they see her they see me. Someone stopped me on a walk yesterday and said your wife did excellent speaking at the banquet the other night. People tell me that from years ago. My wife's been all over prison. All the camps, all the vesting the chapel everywhere. The ranch house, the big house, my wife's been everywhere. And they know her and they know that she doesn't mean anything but good for me and would love nothing more than to take me home."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:47",
      "upperBoundTime": "00:49:58",
      "content": "Yes let's talk a little bit about that. So let's say when as opposed to if, let's say you go before the pardon board, what's the next chapter of your life look like? Can you paint a picture for me of what you've planned?"
    },
    {
      "speaker": "David",
      "time": "00:49:58",
      "upperBoundTime": "00:51:26",
      "content": "My wife's house is right next-door to my moms and its right down the road from my brothers. My wife's dad and my dad bought a property right next to each other. Built homes right next to each other, so, so going home to my wife is just like going next door to my mom. But, they're big properties, big properties. It's in the woods but Sheila and I have basically thought we'd like to go on missionary field and we just want to get away, go do gods work, go wherever, I think leave everything."
    },
    {
      "speaker": "David",
      "time": "00:49:58",
      "upperBoundTime": "00:51:26",
      "content": "My wife's well off she's inherited a lot of stuff from her mom and her stepdad and then from her dad, so we're good. We're good. My wife doesn't leave me money, I don't ask for money from her. Most guys do. I'm making, I'm very involved in the hobby shop."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:26",
      "upperBoundTime": "00:51:29",
      "content": "What do you make?"
    },
    {
      "speaker": "David",
      "time": "00:51:29",
      "upperBoundTime": "00:51:58",
      "content": "I make jewelry. My wife hates that I make jewelry, but I do a lot of turquoise and silver stuff and stuff like that. I don't deal with the stainless steel that the guys, most of the guys work with. I make bling bling stuff in the hobby shop, I've got a lot of first place ribbons make there for my jewelry over there on the way, but imp very involved with the rodeo and I have been for a long time. And gives me something to do in my spare time, a lot of spare time."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:58",
      "upperBoundTime": "00:52:00",
      "content": "Well you were right, this was a unique interview."
    },
    {
      "speaker": "David",
      "time": "00:52:00",
      "upperBoundTime": "00:52:02",
      "content": "I thought it would be."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:02",
      "upperBoundTime": "00:52:11",
      "content": "I have really enjoyed learning about you. Is there anything I should have asked you that I didn't?"
    },
    {
      "speaker": "David",
      "time": "00:52:11",
      "upperBoundTime": "00:52:19",
      "content": "Marcus what you think? I don't know, my"
    },
    {
      "speaker": "Marcus",
      "time": "00:52:19",
      "upperBoundTime": "00:52:22",
      "content": "We covered a lot."
    },
    {
      "speaker": "David",
      "time": "00:52:22",
      "upperBoundTime": "00:52:27",
      "content": "We covered a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:27",
      "upperBoundTime": "00:52:30",
      "content": "I think maybe."
    },
    {
      "speaker": "David",
      "time": "00:52:30",
      "upperBoundTime": "00:52:56",
      "content": "Good kid came to prison, came from a good, wells secure family, someone that made it through high school and college, made it through high school, started college. I'm not a druggy, I'm not a criminal. This is my first rip, my very first rip. I never been in juvenile hall or arrested. None of this."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:56",
      "content": "Yes that's a good place to stop actually. Dave it was a pleasure to meet you."
    }
  ]
}
