{"name":"","transcript":[{"content":"Donahue Smith Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Mr. Smith, you can start by stating, just for the record, your name, the crime of conviction, your age at the time of the crime and how much time you've served."},{"speaker":"Donahue","time":"00:00:15-8","content":"Okay. My name is Donahue Smith. I'm from New Orleans, Louisiana. I was convicted of second degree murder in Jefferson Parish. I was about 18, 19 years old. I came to Angola at 21. And thus far, come November 9th, I'll be incarcerated 27 years."},{"speaker":"Marcus","time":"00:00:37-3","content":"Okay and as I was explaining earlier, the whole purpose of this is to learn about your life, and I'm going to start with your life before coming to Angola. Let me ask you about your childhood. If you could tell me a little bit about the folks that raised you."},{"speaker":"Donahue","time":"00:00:57-9","content":"My grandfather raised me him and my great aunt. I used to enjoy going to the 17th ward, the Carrollton area to the Magnolia projects, which is in the 3rd ward between the two. My mother, she was there too, but I spend most of my time with my grandfather because I was his oldest grandchild. And he felt I needed to be under a man."},{"speaker":"Donahue","time":"00:00:57-9","content":"Now, my father, I knew of him, but I didn't actually get to meet him until years later, and that was like once before he went to prison in Texas. And I was very angry because I felt as a child that he didn't want me, so I grow up angry. There was a lot of fighting. My grandfather tried to do as best he could to stop that. There was a lot of principals he instilled into me. And I only recently in past years realized what my problem was through introspect, but I mean, the people that raised me, I feel, that they did what they did. They cared for me, they were there with me."},{"speaker":"Marcus","time":"00:02:42-6","content":"Right, so would you think then, of your grandfather as the primary parent in your life?"},{"speaker":"Donahue","time":"00:02:48-5","content":"Yeah, he was the number one."},{"speaker":"Marcus","time":"00:02:51-6","content":"Okay and tell me a little bit more about him. Is he still alive?"},{"speaker":"Donahue","time":"00:02:58-2","content":"Well no. He died in 1985. In fact, I was at his bedside when he died. We talked and he experienced, in his."},{"speaker":"Marcus","time":"00:03:11-2","content":"So, you're about 15 right? This is before you came right?"},{"speaker":"Donahue","time":"00:03:13-6","content":"Yeah. He used to live in Mississippi, what's called the 'Mississippi Delta area,' and from what I understand, his mother, my great-grandmother was a very beautiful woman but this was during like 1930 and up in that area, the great depression and one of the guys, an older white guy, he used to like her, and he approached her and when she didn't give him any attention, he whipped her with a bull, and he cut all her clothes off."},{"speaker":"Donahue","time":"00:03:13-6","content":"And my grandfather knocked him down, took the bull whip and whipped him with it. So, what happened during that time he was forced to leave Mississippi, and he went to the military and he traveled around the world. And he bought the house in the 17th ward, but a lot of people didn't understand him, and they said I have a lot of his ways because he was tagged as being mean. He didn't smile much, myself, I'm the same way. But he had a heart of gold. He'd give you the shirt off his back."},{"speaker":"Donahue","time":"00:03:13-6","content":"I remember the first time that he cried, it just blew me away. Because, this is a man, he didn't believe in crying, but he had a scar on his side, and he was laying in bed and I was asking I said, \"Where you get that scar?\" I'm thinking he was about to tell me a war story. And he just started crying and he said, \"Man, the woman I loved put that scar there.\" I'm like, \"Okay.\" And he said he used to drink a lot and he was a fighter when he drank. So he hit my grandmother and she cut him. And after she cut him, she laid him down and stitched him up."},{"speaker":"Donahue","time":"00:03:13-6","content":"So, it was rough. He was rough, but like I said, he cared for, I have a younger brother. One of my younger brothers his name is Kurt, I love him to death. That was my main man coming up, and my grandfather raised both of us, and he cared for both of us, and it was certain principals that I live by still today that he instilled."},{"speaker":"Marcus","time":"00:06:07-5","content":"Okay. So, you mentioned a younger brother. Do you have any other brothers and sisters?"},{"speaker":"Donahue","time":"00:06:11-3","content":"Oh yeah I have a total of 7 other brothers and sisters. Two older sisters and five younger brothers and sisters."},{"speaker":"Marcus","time":"00:06:21-9","content":"You're the oldest boy."},{"speaker":"Donahue","time":"00:06:24-0","content":"Yeah. I'm the oldest boy."},{"speaker":"Marcus","time":"00:06:26-3","content":"So when you're 15, your grandfather passes away which I imagine was a very significant loss to you given that he's your main, adult figure. What happens then?"},{"speaker":"Donahue","time":"00:06:37-1","content":"Well, my brother and I. We kind of fought for a minute to continue living on the East bank in the Carrollton side because that was my grandfather's house, but, being minors at the time, my mother moved us across the river in Gretna where she lived with her husband, John O'riley, and I was forced to go to West Jeff. So I played a little ball for West Jeff football music because I loved to sing, and I was a typical teenager."},{"speaker":"Marcus","time":"00:07:25-5","content":"So how was school for you, did you enjoy it?"},{"speaker":"Donahue","time":"00:07:27-6","content":"At times. Coming up, my early life in school, I'm from the third ward and it was a war zone so the school attached to it attached to Taylor Park, and the guys, the drug dealers and prostitutes would all come through the school yard at times. And then, I was a loner because my mother would, she had a thing you have a younger brothers and sisters, you want to play? You play with them."},{"speaker":"Donahue","time":"00:07:27-6","content":"And that was her way of protecting us from the outside, but so when I got to school I didn't have a lot of friends and so it would always be a fight, something, I would come up doing. And then I got two younger brothers and sisters at the school with me. They looked to me for protection, so you messed with them, I got to deal with you."},{"speaker":"Donahue","time":"00:07:27-6","content":"That's just how the way it was. So I end up going to Wilson. I'll forward a little bit, there's people like Ms. Fosse, Ms. Lang, Ms. George, Principal Ricks, Ms. Garns, Ms. Tuckerson I remember all of these people Ms. Warren, I remember and I have fond memories of them except when they was tearing my tail up for fighting. But I have fond memories of them. Ms. Barelle, Junior high that's one of my favorite teachers. High school I have a few Ms. Leneer, my coach, Coach Crosby. They all instilled something in me."},{"speaker":"Marcus","time":"00:09:32-5","content":"So what was the highest year of school that you completed?"},{"speaker":"Donahue","time":"00:09:34-5","content":"I actually left in the 11th grade. I had a real bad fight with some guys, they had crowded me, and I was a very unforgiving person in my youth and I came to school and I had a gun. And I didn't shoot anybody but I did pistol whip him. The instigator and so I got put out of school for that."},{"speaker":"Donahue","time":"00:09:34-5","content":"I tried to go to the Navy. I actually scored a 76 on the ASVAB which is high and recruiters were all for me, so I was supposed to get my GED, but for some reason, I don't remember, but for some reason I didn't. So that stopped me from going to the Navy."},{"speaker":"Donahue","time":"00:09:34-5","content":"I worked a little bit, Taco Bell, PA Manure, a few other places, and I just got discouraged. It looked like at one point in my younger life it was, the more I tried to strive forward, the more I'd get knocked back until I lost hope and I turned to the streets."},{"speaker":"Donahue","time":"00:09:34-5","content":"I sold drugs to keep money in my pocket initially to survive and then from there. The money itself. I never had a problem with drug abuse but the money itself was the drug in itself. And I got fond and addicted to having thousands of dollars in my pocket, being able to go as a please."},{"speaker":"Marcus","time":"00:11:44-0","content":"If you're going to be in that lifestyle anywhere, but certainly in New Orleans, you need to be armed. Somebody told me the other day that they go together like peanut butter and jelly."},{"speaker":"Donahue","time":"00:11:56-7","content":"Oh yeah he wasn't lying. He wasn't lying. This is man. I'm choosing my words carefully and truthfully. We don't give a lot of thought to it- coming up in the neighborhoods that most of us came up in, there are some good people. When my teacher's asking me what did I want to be when I grow up? I told her I want to be a police officer. That's Ironic."},{"speaker":"Donahue","time":"00:11:56-7","content":"No kid grows up and says that he wants to be a drug dealer, a pimp, or any of these other things that you see of people you find in prison. Something kills your aspiration. You lose hope. And when you lose hope, all of these things are easy to come into play."},{"speaker":"Donahue","time":"00:11:56-7","content":"For us, it was a part of it. For us, for a lot of us it was about surviving."},{"speaker":"Donahue","time":"00:11:56-7","content":"Earlier I told you about how many kids my mother had. It was about taking care of my family. I couldn't get a job, so the streets, I get money. I took care of my younger brothers and sisters and my mother, even though my mother was against it. She was against that."},{"speaker":"Donahue","time":"00:11:56-7","content":"But, this is what it came down to, and if you look at, you're from New Orleans area, you had the Magnolia Projects, the Calliope, and the Melpomene, and I stayed out between third and prep and these were the ghettos. You got guns over here, drugs over here, no jobs. You try to go get a job, you're getting a run-around. If you already have some type of prison stint or involvement with the law, that's a mark against you. A lot of people will say that's an excuse. It's a reality."},{"speaker":"Donahue","time":"00:11:56-7","content":"And until you have actually been there and seen it with your own two eyes, you'll never quite understand it and a lot of us, we make the bad decisions because they're uninformed decisions about life. I was one of them."},{"speaker":"Marcus","time":"00:15:07-7","content":"Yeah, you explained that very well and I think that that's the reality for many people who come to prison. The specific circumstances that brought you here, were they related to selling drugs?"},{"speaker":"Donahue","time":"00:15:31-9","content":"Partly yeah, partly."},{"speaker":"Marcus","time":"00:15:35-1","content":"Can you briefly summarize that?"},{"speaker":"Donahue","time":"00:15:36-9","content":"Well, a guy he owed my brother. And he had been on him and we got past that initially. Well, now he's in debt to me, if I would have never went there with the gun, it wouldn't have never happened."},{"speaker":"Marcus","time":"00:16:04-5","content":"So, and I want to get to when we start talking about your life here and some of the changes that you've gone through, I'd like to talk a little bit about the amount of time that you've spent here has allowed you to kind of put all of those experiences into perspective and have the type of wisdom that comes with age about those things but I've got a couple more questions before we get to there. So what about intimate relationships before you came to prison?"},{"speaker":"Donahue","time":"00:16:33-7","content":"Several but not all of them. I would go as far as, I have four children."},{"speaker":"Marcus","time":"00:16:41-8","content":"Tell me about them."},{"speaker":"Donahue","time":"00:16:43-2","content":"Well, I don't have much on them. Coming up, I knew them, but as they got older and being in prison, we grew at a distance. I have a set of twins, a son and a daughter. And then I have my youngest daughter, I cared about her mother, but my real love, her name was Anissa, and it feels funny that I'm admitting this right now, because I have a sister in-law, she always teases me about her. They knew it, anybody that was the one. But, that was my heart and I end up breaking her heart."},{"speaker":"Marcus","time":"00:17:37-7","content":"By coming to prison?"},{"speaker":"Donahue","time":"00:17:42-9","content":"Well, before prison I wronged her, I cheated on her one time, and we grow apart from that, but I'll never forget, she wrote me a letter back in '95, and I actually still have that letter. I stumbled upon that a few days ago, but she was admitting to me that I was right about keeping the parents out our relationship, her parents specifically. But, we're still friends."},{"speaker":"Marcus","time":"00:18:27-3","content":"That's good. But you haven't managed to stay in contact with your kids?"},{"speaker":"Donahue","time":"00:18:33-0","content":"No because they would move all around and then my case was kind of ridiculous as far as high profile at that time, and so their mothers. I was trying to find them at one time, and so I just put it in my mind that either they'll find me, or whenever I get out of this prison, if I'm blessed to have that opportunity, I will seek them out then."},{"speaker":"Marcus","time":"00:19:10-7","content":"Sure, do you remember the first time you were arrested?"},{"speaker":"Donahue","time":"00:19:13-3","content":"Actually, I do. I was about 14 or 15. I told you earlier that I was my brothers' and sisters' protector and I took that seriously. And we were living in the 17th ward with my grandfather and myself and a guy named Lloyd Patrick was getting ready to go play basketball, and my brother came up crying so initially I'm thinking, \"Oh my grandfather done caught him up the street doing something. He didn't have any business doing.\" And so he come back, he had a meat cleaver in his hand, I'm like \"Boy, what you doing with that?\" and he told me \"I'm going to kill him.\" I said \"Kill who?\""},{"speaker":"Donahue","time":"00:19:13-3","content":"He said, \"Big Chris and them held me down and let them beat me up.\" Well, Chris is my age Him, Sydney and Freddy. So I became infuriated and I told him to go put the meat cleaver up and I put my bike on the porch and I walked up the street, knocked on the door and his mother came to the door and I asked to see him and when he came, I done lit into him."},{"speaker":"Donahue","time":"00:19:13-3","content":"So that, from there, I went around the corner and caught Sydney and lit into him, so they called the police and, man, I'll never forget that officer he said, \"You act like you the Mike Tyson no, the Mohammed Ali of the neighborhood.\" I'm just looking at him because by that time we have this stigma when it comes to police, you can't trust them."},{"speaker":"Donahue","time":"00:19:13-3","content":"And when I looked out the back window of the patrol car, my grandpa was behind the patrol car, so that was the first time I was arrested but it was for protecting my brother or sticking up for him rather."},{"speaker":"Marcus","time":"00:21:37-3","content":"Sure, I get it. You said that, dealing drugs became this addictive thing in terms of getting money and stuff, were consuming drugs and alcohol ever a part of your life?"},{"speaker":"Donahue","time":"00:21:49-9","content":"Well, I drunk a little bit and as far as drugs, I actually only used, smoked weed one time in my whole life and that was when I was 16. But other than that, I've never used any type of drugs."},{"speaker":"Marcus","time":"00:22:08-9","content":"What drugs were you selling?"},{"speaker":"Donahue","time":"00:22:11-2","content":"Coke and rocks."},{"speaker":"Marcus","time":"00:22:13-2","content":"Okay, so let me ask you this. I'm sure you've thought about this a bit. Let's say this guy didn't owe you money, whatever it was, you didn't show up that day, or you just let it go or what have you and this incident did not happen, this particular one. How do you imagine the next few months and years would have rolled out for you? What kind of path were you on?"},{"speaker":"Donahue","time":"00:22:42-1","content":"Well, realistically, if I would have kept on the path of selling drugs, there's a possibility that I would have been in prison or dead. Most of us don't really expect to live past our 25th birthday and if we do, oh well. But as long as you stay in that life, the odds are that one of the two are going to happen. Because, you not only when you're in that life, it's a slight paranoia and I understand it because I lived it."},{"speaker":"Donahue","time":"00:22:42-1","content":"You always on the watch for the police, now you've got the Jackers are over here, and the Haters are over here and you always got to be conscious. And it's a really a hell of a life to live and when you stop and you think about it you wonder how could you possibly put yourself through that?"},{"speaker":"Marcus","time":"00:23:54-5","content":"Well like you said very few kids will tell you when they grow up, they want to be a drug dealer. I want to move on to Angola, but, before that, is there anything else about your childhood experiences or adolescence that really are important to shaping the person that you are now that we didn't get a chance to talk about or anything else about your childhood that you wanted to mention before we move on?"},{"speaker":"Donahue","time":"00:24:27-6","content":"Well, I can add this in there. I learned, it overlaps into my adulthood, but I learned a real lesson in forgiving and forgiveness because maybe three years ago, my father passed and like I told you, we didn't have much of a relationship, but I went for years believing a lie that he didn't want me, he didn't care for me."},{"speaker":"Donahue","time":"00:24:27-6","content":"And when I told my mother that he had passed because I had talked to my cousin, Elder, my mother told me the truth and several months went by, and I didn't talk to her. I didn't call her. And my brother came up. My brother said \"Man, when's the last time you talked to Mamma?\" I said, \"What, it's been about six months.\" He said, \"Bro, I think you better call her. She know why you haven't been calling, but I think you might want to call her.\""},{"speaker":"Donahue","time":"00:24:27-6","content":"And so of course, how can you not forgive the woman that brought you in the world. She made some bad decisions, true. But how can you not forgive her, and just one act negate everything else that she's done for you? So, I had the wrestle with that. Because I forgive, I hated my father unjustly, and I would tell anybody don't let that hate do what it did to me, because it ate away at me for years."},{"speaker":"Marcus","time":"00:26:37-2","content":"Yeah, and I mean, also growing up thinking that you've been essentially rejected and abandoned by your father leads to all kinds of other things. So it's bigger than just the single emotional thing I'm imagining, right? So we just got the power back?"},{"speaker":"Donahue","time":"00:27:02-9","content":"Yeah, it will probably click on once or twice."},{"speaker":"Marcus","time":"00:27:06-7","content":"So one of the reasons that I'm talking to you is that you are one of the many people found who came here at a very young age with a life sentence and in your case 27 years have passed and you're clearly not the same person that came here."},{"speaker":"Marcus","time":"00:27:06-7","content":"And I want to talk a little bit about some the transformations that have gone on in your life, but before that if you can take us back and describe the person Donahue Smith who came through the gates of Angola. What kind of a person is that?"},{"speaker":"Donahue","time":"00:27:58-6","content":"He was a real piece of work, now that I think about it, but I was never an unintelligent person. I loved education. But I was hard. I had a philosophy of if we couldn't get along, we were going to get it on. I loved working out at that time I was young. The iron power with my best friend."},{"speaker":"Donahue","time":"00:27:58-6","content":"I believed in staying prepared for battle because you never knew when it was going to come. When I came here, I caught like the last 12 years of madness, they had gangs and all kind of madness going on. I walked alone for the most part, but I had a lot of family up here too."},{"speaker":"Donahue","time":"00:27:58-6","content":"One of my cousins, Kenneth that was my main man and then Apochas, that's my partner. So we hung together a lot and when there was a problem, it got dealt with, which caused me other problems with administration. I did my time in the cell. I sold drugs up here for one time for about three years until I went to J in '97 and I did 8 months in Camp J, behind that another one at Jaguar and which are extended lock downs and then another 6 months in the working cell block behind that one incident."},{"speaker":"Marcus","time":"00:30:03-3","content":"What's Camp J like? Or how was it, I mean, how was it then?"},{"speaker":"Donahue","time":"00:30:09-4","content":"Then, it was a trip. What I learned because I observed people a lot that you had a lot of guys that were insecure in themselves there. You had guys who actually got trapped in Camp J for years because they were weak minded. What I mean is that they were afraid at what they would do if they hide in the cell and get caught up into that Camp J culture."},{"speaker":"Donahue","time":"00:30:09-4","content":"You had security on one hand which treats you like an animal, and so they would start to act an animal, men throwing human waste on each other. Calling it a Camp J, calling themselves Camp J warriors but what the reality of it was I met a guy named, called him Chili Red, and I'll never forget that. We heard his name being called he was getting transferred to our tier, and a guy heard that and it was on my hour, which I was young and I didn't know the different games that he played."},{"speaker":"Donahue","time":"00:30:09-4","content":"He called me, he said look give this to the free man, and I path led him to the officer but it was a check out letter, meaning that he felt like he couldn't live around this guy that was coming around there. So, when I realized, it was too late, and I'm looking at the guy within my cell, I'm looking at he's walking up and down the tier looking crazy, tattoos in his face, acting a fool, and he stopped in front my cell and he said, \"Respect my hour.\" And I said, \"What you mean.\" So he told me, \"Back up from the bar when I'm on the hall.\""},{"speaker":"Donahue","time":"00:30:09-4","content":"And I started laughing, and because now it's strange to him because most of these guys would get scared and I said, \"I thought I was looking for King Kong or Godzilla to come around right here but it's just you.\" So that struck him as odd. So we started talking and what I found out was that he was more afraid of those guys than they were of him. And what he did, it was, I know they got wolves over there so I'm going to act like I'm a bigger wolf to him to keep them at bay, and that's what that was. And I was like, \"Wow, he's really afraid.\""},{"speaker":"Donahue","time":"00:30:09-4","content":"And it blew my mind and now I'm paying more and more attention that all these guys are like this but on the flip side, you'd have guys that would go back there and they would study their Qurans. You wouldn't know they existed. They would study their Bibles or they would get off into a GED book or English book and or Law and just do their time. You also had those."},{"speaker":"Marcus","time":"00:33:50-0","content":"Right, the guys who maybe enjoyed their solitude."},{"speaker":"Donahue","time":"00:33:54-8","content":"Right, took advantage of it."},{"speaker":"Marcus","time":"00:33:58-7","content":"Sure, yeah. Interesting. So, in what particular ways have you changed? We all change but how have you changed?"},{"speaker":"Donahue","time":"00:34:07-4","content":"Well, I've grown to become more compassionate. At one point, man, like I said, I was very unforgiving. I had a low tolerance foolishness, if you got on my nerves, we were going to get into it, but now, there are times that I get frustrated, in fact, a few weeks ago, I got so frustrated that they had to rush me to the hospital, I couldn't breathe. I felt like somebody had my heart in his hands."},{"speaker":"Donahue","time":"00:34:07-4","content":"But, I have a lot of guys that look up to me. Like I told you, I'm the assistant pastor of our church, Ambassadors for Christ and I deal with a lot of younger guys, and sometimes it's frustrating but other times, it's just so fulfilling, because you get to pour yourself into them. The mistakes that you made, you're able to talk to these guys and get them to see that this don't make this mistake."},{"speaker":"Marcus","time":"00:35:39-8","content":"Most of the guys that you're talking to are serving lengthy sentences or are most of them in the re-entry program, leaving?"},{"speaker":"Donahue","time":"00:35:45-5","content":"I deal with more the lifers. The guys that are serving a life. Every now and then I have to deal with a guy that's in the re-entry. In fact I have a cousin and a nephew that's in the re-entry program and some time ago, I had to fuss with one because I'm like, \"Dude, you've got a chance to go home in two years versus 10, do the math. Chill out.\""},{"speaker":"Donahue","time":"00:35:45-5","content":""},{"speaker":"Donahue","time":"00:35:45-5","content":"A lot of guys have authority problems. When you're over them, they can't handle you telling them, this is what you do or this is what you don't do. So, that's an issue but it works itself out over time if you earn their respect."},{"speaker":"Marcus","time":"00:36:42-2","content":"Sure. So, aside from being the pastor, the assistant pastor of your church, are there other organizations that you've been a part of over the years here?"},{"speaker":"Donahue","time":"00:36:56-2","content":"Well, I started off I studied Islam for a time but I found out that it wasn't fulfilling to me. I also dealt with the lifers, but it didn't work out because it wasn't logic and what I mean is this here, every year, just before the legislative session these guys would get together and this is something that if you're going to work on it, you're going to work on throughout the year and make sure everything is everything and then you have to have an understanding of the law."},{"speaker":"Donahue","time":"00:36:56-2","content":"A lot of these guys, not all, but some of them, they take these offices in these clubs and they use it for their own personal party, this is me and my boys and we going to put this show on. I'm not about that. And lately I've been working on what I call the Offender Addiction Recovery Counselling. Every one of us that graduated from the NOBTS our level college, we graduated with a minor in Christian Counselling, and so I'm trying to put that to use to help some of these guys beat their addictions. And it is what it is."},{"speaker":"Marcus","time":"00:38:30-8","content":"Yeah, and it's great. Do you know so some people can identify a sort of turning point in their lives and for other people, I know, for a lot of people, you just kind of age out, just mature, but for a lot of people it's specific event or mentor? What was the changing point for you?"},{"speaker":"Donahue","time":"00:38:59-0","content":"I read that in the questions, and I had to give it some thought. And I had a friend up here named Arthur Ford. And he died. And he was like 60 years old. He died from cancer, and I used to visit him every day and watching him and the life he lived prior to he died and his life was negative. Let's get that straight. I said I didn't want to be like that, even though we were friends, I didn't want to be like that."},{"speaker":"Donahue","time":"00:38:59-0","content":"And so, watching him and certain other older guys like him that had been here for 30 40 years prior to me coming, and how they lived, I just didn't want to be like that. I wanted my life to have some type of meaning, some type of purpose, that when you mentioned my name, you don't just say, \"Oh well he had second degree murder but he also did this here.\""},{"speaker":"Marcus","time":"00:40:13-0","content":"Sure, that makes a lot of sense. So let me ask you a difficult question about that because when you see these other guys who've been here serving life sentences and they're getting older and some of them die, surely you must also think about that being a possibility for yourself."},{"speaker":"Donahue","time":"00:40:43-5","content":"Yes I do."},{"speaker":"Marcus","time":"00:40:47-6","content":"And one of the things that, we're trying to explore here is that how people cope with things very difficult situation. How do you cope?"},{"speaker":"Donahue","time":"00:40:56-8","content":"My coping mechanism is that I trust in God. I think it's in Chapter 10 of the 1st Corinthians, He said that He works within every problem or temptation that he would provide a rescue. I believe that, I don't know when but in His time that He is going to give me the rescue that I need."},{"speaker":"Marcus","time":"00:41:30-2","content":"Let me push back a little bit on that. Okay so, what about the guys that don't get rescued?"},{"speaker":"Donahue","time":"00:41:32-7","content":"Well, and it's interesting, it's a fair question. Some of these guys have never applied themselves. They trust in their own will. Some guys will never get out of prison, lets just face it. When the Israelites went into captivity under the Assyrians only a certain few came up. Others died when they were in captivity. And it's all about, I think, how much faith you have."},{"speaker":"Donahue","time":"00:41:32-7","content":"Some guys, their coping mechanism is drugs. They use it as an escape. I can't see it. I believe in facing reality for what it is, not running from it. If I have a problem, I'm going to run into it. Earlier, I told you, I was a fighter. I did boxing and everything. You don't run from the problem, because the problem is still going to be there. You have to figure out a way to move that problem, even if it's by force."},{"speaker":"Marcus","time":"00:43:06-1","content":"Right and of course this is a very difficult thing to live life without parole because you're unable to move it. There's this sort of powerlessness in the face of that."},{"speaker":"Donahue","time":"00:43:19-3","content":"And that is why so many of these guys lack hope but part of it is on them, I believe that we have the power but we don't know how to come together. A lot of it is not real unity. Someone said, \"The enemy of my enemy is my friend.\" If me and you are at odds with each other, but this enemy over here is going to take both of us out unless we come together."},{"speaker":"Donahue","time":"00:43:19-3","content":"These guys got families. Their families are voters. We can get the laws changed if we stop fighting each other and come together. Your organization or group has an agenda over here and he has an agenda and he has an agenda and we are pulling against each other, when all we have to do is come together, put our personal agendas aside and this is the target, this is the foe."},{"speaker":"Marcus","time":"00:44:33-3","content":"Okay that makes sense. Another difficult question, when you think back on the victim and the victim's family it's been 27 years, and I think that it's impossible to go through your life every day sort of punishing yourself for this. When you look back on it, how do you feel about it now, all this time later?"},{"speaker":"Donahue","time":"00:45:04-6","content":"At one time, very onset, I didn't feel any kind of way. But as I got older and I contemplated on what I had actually done and the causes behind it, I begged God for forgiveness first. I took another man's life. That wasn't mine to take. I believe now that every attack against a human being is actually an attack against God. Because we are created in his image, and if I had the opportunity to beg for forgiveness of his family, I would beg their forgiveness."},{"speaker":"Donahue","time":"00:45:04-6","content":"Like I said earlier, I accept full responsibility for my actions. I made a drastic mistake, one that not only affects his family, but affects my family."},{"speaker":"Marcus","time":"00:46:23-1","content":"Let's talk about your family. How has this whole thing impacted your family?"},{"speaker":"Donahue","time":"00:46:27-6","content":"Well, I was like the E. F. Hutton of my family. When I spoke, everybody listened. My brothers and sisters, when my mother had a problem with them, she wouldn't tell my stepfather. She wouldn't call their fathers. She would call me. That was like \"Boot coming.\""},{"speaker":"Donahue","time":"00:46:27-6","content":"And I have a younger sister, I love her. And I haven't seen her in a while because she chose to be a lesbian. And she never really gave me a chance to say anything because she knows I'm against that. I'll never forget that it was a Sunday in the main prison's visitor shed. I looked at her, \"Oh look what you did this, why you looking like a little boy?\""},{"speaker":"Donahue","time":"00:46:27-6","content":"But I didn't realize what I was seeing or saying. I saw a peculiar look on her face and I saw a peculiar look on my mother's face. And it wasn't until months later, I realized what really at play. And so once I found out, I knew because, I think because she thought I would reject her, she just stopped communicating with me. And so I deal with that. But my coming to prison has affected my brother and sisters and my mother traumatically."},{"speaker":"Marcus","time":"00:48:19-1","content":"Who do you think has taken it the worst?"},{"speaker":"Donahue","time":"00:48:25-7","content":"My younger sister and my younger brother. Because I was their father figure."},{"speaker":"Marcus","time":"00:48:38-7","content":"How are visits with them now? Do they still visit you?"},{"speaker":"Donahue","time":"00:48:44-5","content":"Well, the most I see my brother, my brother Kurt and his wife a lot. And my sister, Kim. But my younger brother and sister, I haven't seen them in a few years. I've talked to them occasionally on the phone, not a cell phone, on the phone. But I haven't seen them where I can sit down with them in a while."},{"speaker":"Marcus","time":"00:49:13-8","content":"Do visitors come to come to see you at the rodeo?"},{"speaker":"Donahue","time":"00:49:19-1","content":"Yeah, sometimes."},{"speaker":"Marcus","time":"00:49:21-7","content":"Is anyone coming this coming month?"},{"speaker":"Donahue","time":"00:49:24-0","content":"Well, no, not this month. They won't be coming but my nieces, for some reason, they love coming so they can sit down with me with the food and music and all the other stuff. They'll still come with their mother but those are the only ones that comes to the rodeo."},{"speaker":"Marcus","time":"00:49:47-4","content":"If you do get a chance to get out before that, they'll have your jacket and your record and all of that, you'll have a very short moment to tell them about yourself. What would you tell them?"},{"speaker":"Donahue","time":"00:49:41-7","content":"I really, it's hard to say, but I could tell them, I would tell them that I'm not the same man, and one of my goals, my aspirations is I helped tear the New Orleans area down because of my ignorance at that time and the lack of hope and I want to go back and be one of the guys to put some of the bricks back on the wall. The young people, they need guys like me that have been there, did that, went through prison and the change, have transformed our lives for the better to show them the way."},{"speaker":"Donahue","time":"00:49:41-7","content":"If you look at me, I'm not a soft type of guy and there's certain places that certain guys can't go but I can go. I can go into the projects and make a difference and show them that this is not the way. And but most of all, like I said, I would beg their forgiveness as a whole, not just the victim's family, but everybody because my one action not only affected my family, but it affected the victim's family, and it affected society as a whole and they didn't deserve that."},{"speaker":"Marcus","time":"00:51:48-8","content":"Sure, you told me about graduating from the seminary and all the various things you've been doing here. Of all of the things you've done here at Angola, what are you most proud of?"},{"speaker":"Donahue","time":"00:52:05-2","content":"Well, you just named it. The proudest thing that I finished the seminary. I wanted to go to college on the street but it didn't happen. I took advantage of the opportunity here. I actually have a paralegal degree. I got my GED while I was here about within six months and I finished seminary."},{"speaker":"Donahue","time":"00:52:05-2","content":"I love helping people, human beings as a whole, we've become massive beings of destruction. We know how to tear a person down. We take pride in it in some cases, but it's a whole other thing when you build that person up. It's more fulfilling when you build people up. And I get the opportunity to help a lot of guys at the Bible College and it fulfils."},{"speaker":"Marcus","time":"00:53:24-8","content":"I'm sure it does. I think about that too sometimes when I think about a lot of people have this desire to then go back and try to stop somebody else from going down the path they went down by using their own lives as an example. But the thing is, in all honesty, do you think you would have been receptive to a 50 year old man coming into your 18 year old life and telling, \"Don't do this, do this.\""},{"speaker":"Donahue","time":"00:53:56-9","content":"It's not so much telling a person anything. Sometimes the best message is through the way they live. Right now, I have guys who watch me in the dormitory, and I know they watch me and they'll coming to me. A preacher for instance there's nowhere in the Bible that says a preacher can't have swag. What I'm saying? And when these guys see you listening to rap music, they're looking, man look at old timer."},{"speaker":"Donahue","time":"00:53:56-9","content":"They see you playing ball with them, \"That dude's 50 years old almost.\" Or working out with them. It creates an opportunity for you to talk to them. They don't realize what's going on but it creates an opportunity, when they see you with your sneakers on, your jeans, your polo and maybe a baseball hat. You might even have a diamond in your ear and they look man look on. And so now they're curious."},{"speaker":"Marcus","time":"00:55:33-7","content":"Yeah, sure, that makes sense."},{"speaker":"Donahue","time":"00:55:39-2","content":"They see you, might have the gold chain with the cross hanging. Man. Old got swag. But they don't realize that you're actually baiting them in."},{"speaker":"Marcus","time":"00:55:53-3","content":"You're meeting them where they're at. Sure."},{"speaker":"Donahue","time":"00:55:57-4","content":"You have to speak their language. You have to spend time listening to them and they're going to tell you how to win them over."},{"speaker":"Marcus","time":"00:56:06-3","content":"Yeah, that's very smart, that makes a lot of sense. I've learned a lot about your life. I really enjoyed talking with you. I'm just trying to think if there's something I haven't asked you about that I should have. Is there something else that we should talk about?"},{"speaker":"Donahue","time":"00:56:25-9","content":"I can't really think of a whole lot."},{"speaker":"Marcus","time":"00:56:31-1","content":"I mean we covered a whole lot. Thank you very much for taking the time. I know that you had to run around a little bit too, so thanks for coming today. I appreciate."}]}