{"name":"","transcript":[{"content":"Edbert Simmons REDACTIONS FINAL"},{"speaker":"Edbert","time":"00:00:03-5","content":"Edbert Simmons. I was 18 years old when I come to prison. Second-degree I was charged with second-degree murder. Convicted of second-degree murder. I've been in prison 35 years. Locked up 35 years. I've been in prison proximately 33 years."},{"speaker":"Marcus","time":"00:00:27-7","content":"Much longer than you were out of prison."},{"speaker":"Edbert","time":"00:00:31-2","content":"Right."},{"speaker":"Marcus","time":"00:00:31-9","content":"Sure I'm going to start by asking you some questions about your childhood tell me a little bit about the folks who raised you. You were in Lafayette?"},{"speaker":"Edbert","time":"00:00:45-5","content":"Yes I was in Lafayette Louisiana."},{"speaker":"Marcus","time":"00:00:47-3","content":"Okay."},{"speaker":"Edbert","time":"00:00:48-0","content":"I was raised by my grandmother."},{"speaker":"Marcus","time":"00:00:52-2","content":"Tell me about her?"},{"speaker":"Edbert","time":"00:00:53-4","content":"Oh shit the vibe we called her the vibe special her name was Cecilia Christian but we all called her the vibe she raised me it was real close good friend taught me a lot he's always try to teach me the right way and I know. And when I was young well."},{"speaker":"Marcus","time":"00:01:15-9","content":"Did you have siblings?"},{"speaker":"Edbert","time":"00:01:17-3","content":"Yes I have Three Brothers."},{"speaker":"Marcus","time":"00:01:19-5","content":"But she's raising them also?"},{"speaker":"Edbert","time":"00:01:19-5","content":"No. They lived with my mom."},{"speaker":"Marcus","time":"00:01:24-8","content":"Why did she pick you?"},{"speaker":"Edbert","time":"00:01:27-4","content":"I was the first born I was her first grandson I'm at the time my mom was young and she my mom had me when she was about 15. My grandmother took me and raised me and then I end up moving in with my mom when I was about 11 or 12."},{"speaker":"Marcus","time":"00:01:46-8","content":"Is your grandmother still alive?"},{"speaker":"Edbert","time":"00:01:48-4","content":"No she died she died in 1995."},{"speaker":"Marcus","time":"00:01:51-6","content":"Okay while you were here."},{"speaker":"Edbert","time":"00:01:53-5","content":"Yeah while I was here."},{"speaker":"Marcus","time":"00:01:55-0","content":"Do you remember your last interaction with her?"},{"speaker":"Edbert","time":"00:01:55-0","content":"Yes I remember my last interaction I spoke to her and she told me she was in the hospital for a cyst. And I normally always call and check on her but for some strange Reason that day when I told her that I was just going to the hospital for a cyst I didn't call her back. And she ended up dying in the hospital."},{"speaker":"Marcus","time":"00:02:20-8","content":"Oh I'm sorry. What about your mom your mom still alive?"},{"speaker":"Edbert","time":"00:02:25-7","content":"Yeah my mom is still alive."},{"speaker":"Marcus","time":"00:02:29-8","content":"Who visits you're up here?"},{"speaker":"Edbert","time":"00:02:32-2","content":"My dad, my mother, my girlfriend, my sister, every now and then my brothers come."},{"speaker":"Marcus","time":"00:02:32-2","content":"Okay. Do they all come up for the rodeo?"},{"speaker":"Edbert","time":"00:02:48-6","content":"Yes."},{"speaker":"Marcus","time":"00:02:52-1","content":"Are they all living in Lafayette still?"},{"speaker":"Edbert","time":"00:02:54-6","content":"Yes."},{"speaker":"Marcus","time":"00:02:55-1","content":"Okay, what about your dad was involved in your childhood?"},{"speaker":"Edbert","time":"00:03:02-7","content":"No not really me and my dad We wouldn't he wasn't involved in my childhood at all my dad I seen him periodically but we wasn't closer or anything like that. But I had a great stepfather. I had a stepfather that was there for me."},{"speaker":"Marcus","time":"00:03:20-8","content":"Ok tell me about him."},{"speaker":"Edbert","time":"00:03:22-4","content":"His name is James Frank and he married my mom when I was a kid they've been together they're still together today and he try to teach me right from wrong. Try to keep me out of trouble."},{"speaker":"Edbert","time":"00:03:22-4","content":"Try to be there for me but I was missing something. I was young I was missing something. Every child wants his own dad what I always used to wonder why my dad would never be there for me and stuff like that. So that kind of made me stray away from the family and I felt out of place."},{"speaker":"Edbert","time":"00:03:22-4","content":"I felt out of place at home so I left. I went to live with my grandmother again and started hanging out with the fellas in the street and things of that nature. And I found a lot of love being with friends more than I found being with family because it was like they understood me the understood me better than the people that loved me."},{"speaker":"Marcus","time":"00:04:17-3","content":"Would it be fair to say that you were misunderstood but not mistreated by your family?"},{"speaker":"Edbert","time":"00:04:23-1","content":"Yeah I would say that would be fair yeah. I was definitely misunderstood. because I couldn't really talk to no one in my family I didn't know how to speak and tell them what was going on in my life what I was going through I didn't have no one that I couldn't really confide in"},{"speaker":"Edbert","time":"00:04:23-1","content":"I used to confide in my grandmother and she used to always say live your life don't worry about this don't worry about that but she didn't understand the effect that when I was a child you seeing certain things in the effect it has on you what I'm saying. A lot of things I didn't know who to talk to about it so I just live with it and acted out on it."},{"speaker":"Marcus","time":"00:05:05-1","content":"What were some of the things that were difficult for you to deal with?"},{"speaker":"Edbert","time":"00:05:08-8","content":"Not understanding why my father didn't want to be around me why he wouldn't want to have anything to do with me what I'm saying why was there someone else being my father instead of my real dad I didn't understand that."},{"speaker":"Edbert","time":"00:05:08-8","content":"And I was an athlete I used to go play football basketball you and I was real good at it and I used to see other parents there seeing their children excel and I used to always wonder why my parents weren't there what I'm saying so."},{"speaker":"Edbert","time":"00:05:08-8","content":"I used to get angry and I just stopped I quit and it didn't make no sense for me to do that if nobody really cheering me on or being there being supportive so I quit. …"},{"speaker":"Marcus","time":"00:05:55-0","content":"Prior to the charge that you're currently serving a sentence for, would it be fair to say that your life had already taken a turn down the wrong path?"},{"speaker":"Edbert","time":"00:06:06-3","content":"Yeah I would say that. I would say that. I'd say cause I had then really gave up on life I remember telling my little brother I used to say man look my life is over. And don't do what I do. What I'm saying try to be a better person than I am what I'm saying?"},{"speaker":"Marcus","time":"00:06:22-9","content":"What were you doing?"},{"speaker":"Edbert","time":"00:06:24-7","content":"I was in the street I was in the street I was doing drugs I was in the street doing drugs I was hustling and I was doing wrong. But I wouldn't really commit no serious violation I was stealing things of that nature. Doing drugs smoking weed snorting coke. I was out there."},{"speaker":"Marcus","time":"00:06:48-0","content":"Sure if you had to- and I'm sure you've thought back so much over the years about how could this have been avoided or- if there were to be one reason that you ended up in the situation that you are in what would it be?"},{"speaker":"Edbert","time":"00:07:14-9","content":"Probably drugs."},{"speaker":"Marcus","time":"00:07:16-2","content":"Ok. What was your drug of choice?"},{"speaker":"Edbert","time":"00:07:22-0","content":"Quaaludes and coke."},{"speaker":"Marcus","time":"00:07:28-3","content":"What was the highest year of school that you completed?"},{"speaker":"Edbert","time":"00:07:31-4","content":"9th grade."},{"speaker":"Marcus","time":"00:07:32-1","content":"Okay. Were you ever kicked out of school?"},{"speaker":"Edbert","time":"00:07:36-8","content":"Yes."},{"speaker":"Marcus","time":"00:07:37-2","content":"What for?"},{"speaker":"Edbert","time":"00:07:39-1","content":"Fighting the principal. Fighting the principal. He pushed me and we was at a game and I was hollering at some friends and kids they playing they laughing they high fiving everything and the principal called me and I said what's the problem and he said look get out of here and he pushed me and I just turned around and I hit him. And well I just hit him."},{"speaker":"Marcus","time":"00:08:07-3","content":"Was that in the 9th grade?"},{"speaker":"Edbert","time":"00:08:08-9","content":"No that was in the 8th grade. That's my last year in 8th."},{"speaker":"Marcus","time":"00:08:16-0","content":"What about relationships with girls is there one special person?"},{"speaker":"Edbert","time":"00:08:20-6","content":"Oh yeah I didn't- oh yeah I- special yes I had a good relationship with girls my childhood friend Gina Thomas she have always been good to me man we been since kids she's always been there for me matter of fact the last time- we just stopped really dealing with us in the last year or so she's always been we been friends even through my incarceration we had been friends."},{"speaker":"Marcus","time":"00:08:49-9","content":"What about children?"},{"speaker":"Edbert","time":"00:08:51-1","content":"I don't have any kids."},{"speaker":"Marcus","time":"00:08:52-6","content":"Okay. Why do you think you stopped interacting with your friend you were just telling me about?"},{"speaker":"Edbert","time":"00:09:00-4","content":"Well she moved on and met someone."},{"speaker":"Marcus","time":"00:09:06-0","content":"Sure."},{"speaker":"Edbert","time":"00:09:07-1","content":"Moved on."},{"speaker":"Marcus","time":"00:09:08-2","content":"People do move on."},{"speaker":"Edbert","time":"00:09:09-1","content":"It's true. Yeah and I understood that I'm incarcerated I understood that but I have another friend that my girl that God blessed me with name is Kendra Martins she's really special she have a son and we real close she's been a blessing to me she's been a real blessing in my life she's been there for me and I'm thankful real thankful."},{"speaker":"Marcus","time":"00:09:42-0","content":"Do you remember the very first time you got arrested?"},{"speaker":"Edbert","time":"00:09:45-7","content":"Yes."},{"speaker":"Marcus","time":"00:09:47-0","content":"What was it about?"},{"speaker":"Edbert","time":"00:09:49-1","content":"Stealing a bicycle man stealing a bicycle or accused of stealing a bicycle it didn't even have a thing to do with me I was the wrong person."},{"speaker":"Marcus","time":"00:10:03-3","content":"How old were you?"},{"speaker":"Edbert","time":"00:10:05-2","content":"Like 13."},{"speaker":"Marcus","time":"00:10:07-9","content":"And after that did you have future brushes with the law?"},{"speaker":"Edbert","time":"00:10:12-3","content":"Yeah I had another run in with the law meeting some friends I got caught with some weed one night well not me my friend that dropped some weed on the ground and the police just happened to seen it and just arrest us all. That was it."},{"speaker":"Marcus","time":"00:10:30-6","content":"Were you convicted of anything before this one?"},{"speaker":"Edbert","time":"00:10:33-2","content":"No never had been convicted. First time."},{"speaker":"Marcus","time":"00:10:35-4","content":"Sure. One of the reasons we wanted to talk with you and folks like you is that you committed your offense when you were very in your case very young. You served a long time in your case a very long time too."},{"speaker":"Marcus","time":"00:10:35-4","content":"And you are widely considered to be a trusted rehabilitated member of this community. But can you describe the young man who was brought through the gates of Angola all those years ago, more than three decades ago. What was that young man like?"},{"speaker":"Edbert","time":"00:11:27-9","content":"I think that he was more like. Egotistical confused wanting to be something that he wasn't wanting to be recognized wanting to be accepted as being a person. A person that's when he say something he mean it. but now looking at myself now and back then I- it was a lot of things I wish that I could've changed about myself at that time I wish I could've been a different person. Which I listened more to what people was saying but you live and you learn."},{"speaker":"Marcus","time":"00:12:12-9","content":"In the early 80s Angola was a very different place."},{"speaker":"Edbert","time":"00:12:21-2","content":"Right."},{"speaker":"Marcus","time":"00:12:25-6","content":"What was your typical day like when you first couple of year here?"},{"speaker":"Edbert","time":"00:12:30-7","content":"First couple years was real rough and frustrating it was real rough. Because its prison was different a lot of things was going on that I wasn't used to so it was it was touch and go you just have to flow with it sometime you have a good day sometime you end up in the hole it."},{"speaker":"Edbert","time":"00:12:30-7","content":"All depends on how security really was that morning that makes everything go right because they used to set the tone they blow the whistle in the morning and you get up it all depends on how you feel after you hear that whistle cause that whistle is like controlling mechanism they know when they blow that whistle it's time to get up."},{"speaker":"Edbert","time":"00:12:30-7","content":"And sometimes that whistle have you so frustrated you just say, okay to hell on it and don't even go, so I ain't going today and sometimes say man don't pay that no mind it's wrong"},{"speaker":"Marcus","time":"00:13:30-1","content":"Did you find yourself fighting a lot?"},{"speaker":"Edbert","time":"00:13:32-9","content":"Oh yeah I stayed in fights I stayed in fights up here because it was lacking respect and sometime a lot of time the fights could've been avoided but this was prison its prison if you don't stand up for the challenge it makes you look weak."},{"speaker":"Marcus","time":"00:13:57-4","content":"The culture has changed here."},{"speaker":"Edbert","time":"00:13:59-5","content":"Of course."},{"speaker":"Marcus","time":"00:14:00-9","content":"And you're an older man I expect you don't fight now"},{"speaker":"Edbert","time":"00:14:06-2","content":"No indeed no not anymore. Lately I been mentoring youngsters telling them because you got a lot of youngsters up here that are in camp J on lockdown and that I been at camp J a few times since"},{"speaker":"Edbert","time":"00:14:06-2","content":"I've been here and the warden asked me to go speak to a lot of the younger fellows back there at camp j and mentoring them and letting them know what it takes to make it through camp J and saying it takes dealing with yourself coming to learn yourself cause I stayed in the cell a long time 15 years and I did in and out of the cells. This is my longest staying in population."},{"speaker":"Marcus","time":"00:14:46-2","content":"Yeah you're when you look at those guys do you see yourself?"},{"speaker":"Edbert","time":"00:14:50-4","content":"Yes."},{"speaker":"Marcus","time":"00:14:50-6","content":"Your old self?"},{"speaker":"Edbert","time":"00:14:51-8","content":"Yeah and I understood I understood what they were going through. I understand them honestly cause I been there and I understand what a lot of us going through getting used to being alone with them self and how to deal with themselves. It wasn't a system it was just being able to deal with yourself learning yourself that what the cells help do it helps you be able to cope with yourself spend time with yourself."},{"speaker":"Marcus","time":"00:15:13-9","content":"Yeah without distractions."},{"speaker":"Edbert","time":"00:15:17-0","content":"Without distractions and a lot of people they not used to spending 23 hours in a cell by them self they always used to interacting with people. When you are forced to do that it's a different thing you have to really bring yourself down in order to make it through if not you can lose your mind. It's a lot of pressure."},{"speaker":"Marcus","time":"00:15:41-7","content":"Yeah. Everybody changes after 35 years no matter what it is whether it's for the better or the worse. How have you changed how are you different from the way you were when you were getting locked up in the cells?"},{"speaker":"Edbert","time":"00:16:04-5","content":"I think I come to understand about authority. I think I come to understand authority better I come to understand better that people are placed in different positions for different reasons here battles here battles you have to have with authority"},{"speaker":"Edbert","time":"00:16:04-5","content":"I've come to understand that everybody that's in position over you they're placed in authority for a reason and I've come to adapt to that and start understanding that. I think my change came when I was on lockdown."},{"speaker":"Edbert","time":"00:16:04-5","content":"And everybody they had come up with this new rule where if you had been in an aggravated fight on something you had to stay on lockdown for x amount of years until certain people cut you lose. And then I had to really humble myself because I didn't want to be on lockdown so I said I'm about to start following the rules and regulations in order to be among the people in population. And that's where my change came in."},{"speaker":"Marcus","time":"00:17:03-8","content":"But also not fighting when you might otherwise fight."},{"speaker":"Edbert","time":"00:17:08-4","content":"Right yeah."},{"speaker":"Marcus","time":"00:17:11-1","content":"Is that the main thing that people were getting locked up for is fighting?"},{"speaker":"Edbert","time":"00:17:15-0","content":"Fighting, defiance, cursing the free man, it just it just was frustrating being in prison being in prison is not a happy thing you can't wake up happy every day because it's a frustrating situation."},{"speaker":"Marcus","time":"00:17:34-8","content":"So you're many people- many people change in prison and that transformation sometimes is like a light bulb goes off or sometimes it's a mentor like you're mentoring these guys. For you was it just you just didn't want to be in lockdown? What was it?"},{"speaker":"Edbert","time":"00:17:57-0","content":"I think for me for me man. I was going through this situation to where I was contemplating taking my life. I even told I wrote letters to my family and everything I was ready to die. I had had enough I was at a breaking point in my life and a dude came by my cell he must have seen that something was wrong with me he said Simmons have you ever tried God?"},{"speaker":"Edbert","time":"00:17:57-0","content":"And I said man God ain't going to do anything for me I done too much wrong. I hurt people. I said God ain't gone listen to me. He said Simmons try praying. And I prayed that night and that's probably the most peaceful I've ever slept in this prison. And from that point on life for me has been different."},{"speaker":"Edbert","time":"00:17:57-0","content":"That was my change and I think it took God to really change me and I've been different ever since. Able to stay in population able to deal with security while without going off on them and stuff. So things have gotten real great for me."},{"speaker":"Marcus","time":"00:19:05-3","content":"How old were you?"},{"speaker":"Edbert","time":"00:19:06-9","content":"When I come here?"},{"speaker":"Marcus","time":"00:19:07-6","content":"No. when you went through that."},{"speaker":"Edbert","time":"00:19:11-3","content":"I was like about 40."},{"speaker":"Marcus","time":"00:19:17-1","content":"It took you a while."},{"speaker":"Edbert","time":"00:19:18-0","content":"Yeah. Cause I was under the impression that I'd never leave here I was you now I had a life sentence so it didn't matter what I did I'm in prison where they sent me it didn't matter and I did been in and out of every hole in this prison so it really didn't matter. I had an attitude where I didn't really care because I never thought I would be able to get I never thought I'd get out of prison."},{"speaker":"Marcus","time":"00:19:43-0","content":"Do you think you're going to get out of prison?"},{"speaker":"Edbert","time":"00:19:45-4","content":"Now? Now I think I have a good opportunity to get out I think I have great opportunity to get out of prison now. The laws is changing things are starting to open up. People are seeing things differently about people being in prison. I think I got a good shot at it. I'm hoping and I'm staying hopeful."},{"speaker":"Marcus","time":"00:20:12-0","content":"Me too. What's your typical day like now?"},{"speaker":"Edbert","time":"00:20:17-9","content":"Now?"},{"speaker":"Marcus","time":"00:20:18-9","content":"What you do what's your routine?"},{"speaker":"Edbert","time":"00:20:21-1","content":"Shit my routine now I go to work in the morning"},{"speaker":"Marcus","time":"00:20:25-1","content":"Where's that?"},{"speaker":"Edbert","time":"00:20:26-0","content":"At it's called a golf course line 38 and I go there work for a few hours then I come in"},{"speaker":"Marcus","time":"00:20:36-9","content":"You do yard work?"},{"speaker":"Edbert","time":"00:20:38-5","content":"Yeah I do yard work, tractor whatever cut trees do it all there's no certain thing we doing out there and I come in go on the yard do me a workout and at night I come to these little classes the classes they be having up here to teach you better ways like right now I'm doing financial peace they teach you a lot about finance and stuff like that things you need to know when you need to deal with financial issues in the world so it's good."},{"speaker":"Marcus","time":"00:21:15-4","content":"What other educational opportunities have you taken advantage of?"},{"speaker":"Edbert","time":"00:21:18-5","content":"GED yeah GED I took a lot of GED I've done self-help programs"},{"speaker":"Marcus","time":"00:21:28-0","content":"Like what?"},{"speaker":"Edbert","time":"00:21:29-9","content":"Like 100 hours and yeah I'm presently in battle off for anger management and I'm in the drug programs a few drug programs because I was on drugs and"},{"speaker":"Marcus","time":"00:21:48-9","content":"Here in prison?"},{"speaker":"Edbert","time":"00:21:49-7","content":"Yes."},{"speaker":"Marcus","time":"00:21:51-4","content":"How long have you been clean?"},{"speaker":"Edbert","time":"00:21:53-6","content":"Oh I've been clean I haven't done drugs in over 20 years."},{"speaker":"Marcus","time":"00:22:02-9","content":"Are there some other organizations that you're part of here?"},{"speaker":"Edbert","time":"00:22:06-5","content":"No. I just the church."},{"speaker":"Marcus","time":"00:22:08-8","content":"Yeah."},{"speaker":"Edbert","time":"00:22:09-2","content":"Yeah the church but 7th day Adventist there's that every Saturday I'm a part of that those are the only clubs I really affiliate myself with."},{"speaker":"Marcus","time":"00:22:21-2","content":"So not the Baptist seminary."},{"speaker":"Edbert","time":"00:22:22-6","content":"No. I'm not in the Baptist seminary."},{"speaker":"Marcus","time":"00:22:32-6","content":"Ok I'm going to ask you a couple of difficult questions. So when you look- its 35 years for me that's a lifetime and you were 18 years old. When you look back on the crime and the victims, do you see a sense of proportionality there? Do you feel like you should be serving this much time for this crime?"},{"speaker":"Edbert","time":"00:22:58-6","content":"Well honestly I mean a person life is taken a person life is taken so there's no really set amount of time that you do when a person life is taken. Because everybody deserve a chance at life and when it's no certain amount of time that I think that you should do. There's no set time because that person deserves life just as much as you do."},{"speaker":"Marcus","time":"00:23:21-0","content":"Ok so how much punishment is enough punishment? For taking a life"},{"speaker":"Edbert","time":"00:23:27-6","content":"I don't know. I really can't say. I don't know because a life has value. I couldn't really just put no set time on it I don't know."},{"speaker":"Marcus","time":"00:23:36-8","content":"Have you been punished enough?"},{"speaker":"Edbert","time":"00:23:38-8","content":"I feel like I have. I feel like 35 years of a man's life should be enough for anything for any type of crime. But it's not my decision. But I feel like I've done more than enough time."},{"speaker":"Marcus","time":"00:23:59-3","content":"Yeah. Do you still feel a sense of remorse about it after all this time?"},{"speaker":"Edbert","time":"00:24:08-5","content":"Of course of course yes man because I know that they have families loved ones just like I have. And in doing crime and falling into this type of predicament you hurt a lot of people you hurt the victim family you hurt your family everybody there's no winners in a situation like that everybody lose including yourself."},{"speaker":"Edbert","time":"00:24:08-5","content":"But every day I think about it I'm out there I live with that I'm' reliving that for the rest of my life and if I can take what I've done and use it to help someone else not make the same decision that I have made I will."},{"speaker":"Marcus","time":"00:24:47-7","content":"Was the victim somebody you knew?"},{"speaker":"Edbert","time":"00:24:50-1","content":"No."},{"speaker":"Marcus","time":"00:24:51-2","content":"This is an also a difficult question. When you you've served 35 years when you look at your future now you said you've got hope right? Things may be- and there is movement."},{"speaker":"Marcus","time":"00:24:51-2","content":"Especially your youth and how long you've already served for sure. But part of you also must think the way you used to think which is I'm never going to get out of here which is a hopeless feeling."},{"speaker":"Edbert","time":"00:25:28-4","content":"Yeah"},{"speaker":"Marcus","time":"00:25:28-8","content":"And the concept of life without parole is something I have trouble understanding how I would wrap my head around that. When you do think about the possibility of dying here, how do you cope with that?"},{"speaker":"Edbert","time":"00:25:46-1","content":"When I think about that."},{"speaker":"Marcus","time":"00:25:49-1","content":"There must be times when you think about that?"},{"speaker":"Edbert","time":"00:25:50-6","content":"I think about that a lot because sometimes that's one of my depressed moments when I'm thinking about if I never get out of here I'm real depressed. And I just pray. I really rely on prayer and ask God not to let me die here."},{"speaker":"Edbert","time":"00:25:50-6","content":"That the only way I'm able to cope with it if it wasn't for God I wouldn't even be here today I'd be gone. Because I'd been and took my life what I'm saying cause that's how depressed I get when I go to thinking about that but right now I been real positive I been staying praying for stay and pray I pray a lot I talk to God a lot I know that if anything can happen God can make it happen."},{"speaker":"Marcus","time":"00:26:37-9","content":"Ok. And I don't want to make you depressed but I have to ask you that question that's why it's a difficult question so I'm trying to understand this a little bit Edbert so one guy after another is talking about coping with prison by invoking God right? So turning to religion as a way of handling what is otherwise an impossibly difficult situation right?"},{"speaker":"Marcus","time":"00:26:37-9","content":"Which is- especially when it's so lengthy and so endless. It's different if you get a two year sentence. Do you think people in your situation genuinely believe something or they have no option but to believe it because the other the other choice is impossible?"},{"speaker":"Edbert","time":"00:27:36-4","content":"I think they have no other options. That's their only option. They don't have no other options they don't have anything other to look forward to but to believe and trust in God that's their only option there's nothing else. I mean the doors are closed everywhere else- God is the only way out. And the average person that is serving a life sentence that's all they have. If God don't do it for me it just ain't gone happen."},{"speaker":"Marcus","time":"00:28:06-7","content":"And so it's kind of a coping mechanism."},{"speaker":"Edbert","time":"00:28:09-0","content":"Yes. That's what it is. And that enables you to go on. Keeping that hope that God will change things that things will change through the grace of God."},{"speaker":"Marcus","time":"00:28:29-6","content":"Yeah. If you do get a an opportunity to go before a parole board the pardon board, what are you- you're going to have a short window to tell them who you are now and why they should take a chance on you what would you tell them?"},{"speaker":"Edbert","time":"00:28:50-1","content":"I would tell them I'm not the same 18 year old person I was. I'm 54 years old now I'm not 18 anymore and I did learn a valuable lesson from then to now. I understand that how to be more mindful of people with the decisions I'm making the things that we do the things that we do can hurt others."},{"speaker":"Edbert","time":"00:28:50-1","content":"And I want to be a more positive have more positive effect on people you if I can help any people with my story God knows I would love to help them because I see a lot of children come here and dudes that came here younger than I came here and a lot of them don't really know what they in for."},{"speaker":"Edbert","time":"00:28:50-1","content":"That life mean life in the state of Louisiana and when I be telling them I been here that long they find it hard to believe they don't believe that people be here that long. I didn't' believe that when I first met someone come here and he told me that he been here 33 years and I say man what happened? Because I never thought people be locked up that long and now I find myself in that same position."},{"speaker":"Marcus","time":"00:30:08-8","content":"Yeah. When you envision your life on the outside- this is again I'm sure you spend a lot of time thinking about it"},{"speaker":"Edbert","time":"00:30:18-1","content":"Oh I dream all the time"},{"speaker":"Marcus","time":"00:30:19-3","content":"Yeah of course what- how do you envision that? What do you how do you see yourself?"},{"speaker":"Edbert","time":"00:30:28-6","content":"I see myself with family. I surround myself around family, a beautiful lady a child having a job having a nice home someone feel good about me coming home and welcoming me home. I see that all the time."},{"speaker":"Marcus","time":"00:30:49-5","content":"What job? What job do you see yourself doing?"},{"speaker":"Edbert","time":"00:30:49-5","content":"I used to like I wanted to be a truck driver I love to drive I was fascinated about driving trucks 18 wheelers and I still would like to that I still feel inside myself with my own rig but if not I'd probably like to continue doing a little welding."},{"speaker":"Marcus","time":"00:31:12-6","content":"Okay did you get certified in welding here?"},{"speaker":"Edbert","time":"00:31:14-8","content":"I'm not all the way certified but I did it when I was in job corner. I didn't get a chance to do it here but I still do it."},{"speaker":"Marcus","time":"00:31:22-3","content":"Yeah they have a pretty good program here."},{"speaker":"Edbert","time":"00:31:23-7","content":"Yeah."},{"speaker":"Marcus","time":"00:31:26-9","content":"So are you a social mentor for the reentry guides?"},{"speaker":"Edbert","time":"00:31:30-2","content":"No I'm just for camp J."},{"speaker":"Marcus","time":"00:31:32-3","content":"Oh for camp J that's right. Is there a question that I should have asked you that I didn't? Something I didn't give you an opportunity to talk about something people should know whether the legislature should know something people should know about what is going on at Angola."},{"speaker":"Edbert","time":"00:31:49-6","content":"I think a question you should ask if people really change in here people really changing and I see yes you have a lot of people that done changed they life around here you have a lot of people that's here and been here years that's really ready for society and if given the opportunity they make the best of it they can be some help to people in society especially with the way things are going with children."},{"speaker":"Edbert","time":"00:31:49-6","content":"There can be a lot of mentorship they can probably be the one that touch people because people understand children understand better people that then been through things you what I'm saying Like when I go to camp J dudes know I done been in the system I been through a lot of stuff."},{"speaker":"Edbert","time":"00:31:49-6","content":"I can relate to them and they listen a lot of them stop cutting on them self-stop hanging them self through us going back there and speaking to them? And to give them a chance to open up to listen we listen to what they have to say you and just listening to them what I'm saying it helps them."},{"speaker":"Marcus","time":"00:32:55-7","content":"Yeah. Yeah. Okay, I think we'll stop there."}]}