{
  "name": "",
  "transcript": [
    { "upperBoundTime": "00:00:00", "content": "Eric Taylor REDACTIONS FINAL" },
    {
      "speaker": "Eric",
      "time": "00:00:00",
      "upperBoundTime": "00:00:16",
      "content": "My name is Eric Taylor I was convicted of second degree murder it's been 24 years now since the crime 24 years has passed."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:16",
      "upperBoundTime": "00:00:19",
      "content": "How old were you when this happened."
    },
    {
      "speaker": "Eric",
      "time": "00:00:19",
      "upperBoundTime": "00:00:27",
      "content": "I was 19 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:27",
      "upperBoundTime": "00:00:35",
      "content": "Okay alright. So I'd like to get to learn a little bit more about you and your experiences before that but also the majority of your life which has been here."
    },
    {
      "speaker": "Eric",
      "time": "00:00:35",
      "upperBoundTime": "00:00:35",
      "content": "Exactly."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:35",
      "upperBoundTime": "00:00:38",
      "content": "So let me start by asking you about your family can you tell me about the folks who raised you?"
    },
    {
      "speaker": "Eric",
      "time": "00:00:38",
      "upperBoundTime": "00:01:26",
      "content": "My grandmother and my mother did they co parented I live with my grandmother from the time I was 2 to probably till I was 16. I moved with my mother at the age of 16 but my mom was always there even when I lived with my grandmother. They raised me good being women they did they best always taught me right instilled religious values went to church every Sunday made sure I went to school I came up in a pretty good household."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:26",
      "upperBoundTime": "00:01:33",
      "content": "Were there men who came either into your grandmother's life or your mother's life who then came into your life."
    },
    {
      "speaker": "Eric",
      "time": "00:01:33",
      "upperBoundTime": "00:02:25",
      "content": "Yes my grandmother had she was married once that I could remember when I was younger. My grandfather which I call him my grandfather he passed I think when I was about 7 and after that she never remarried my mom was married and her husband which I call a father also he's been around."
    },
    {
      "speaker": "Eric",
      "time": "00:01:33",
      "upperBoundTime": "00:02:25",
      "content": "I mean ever since I could remember and he's a pretty decent man very funny very humorous but he was always around it's just I chose to take a different path hanging out and kind of just pushing those principles and values that I was taught to the side."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:25",
      "upperBoundTime": "00:02:28",
      "content": "How old were you when that started."
    },
    {
      "speaker": "Eric",
      "time": "00:02:28",
      "upperBoundTime": "00:02:34",
      "content": "I was about 15 if I'm not mistaken."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:34",
      "upperBoundTime": "00:02:38",
      "content": "Ok alright what about siblings do you have brothers and sisters."
    },
    {
      "speaker": "Eric",
      "time": "00:02:38",
      "upperBoundTime": "00:02:57",
      "content": "Yes I do I have brothers and sisters I hear from them now more now than in my early-ish days of incarceration they're living their life I'm the oldest child."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:57",
      "upperBoundTime": "00:02:59",
      "content": "Ok."
    },
    {
      "speaker": "Eric",
      "time": "00:02:59",
      "upperBoundTime": "00:03:14",
      "content": "They're living their life doing pretty good for themself I contact them here or there it's not a constant thing but I have I can contact them if I need to."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:14",
      "upperBoundTime": "00:03:17",
      "content": "Who visits you up here do you get regular visits not everybody does."
    },
    {
      "speaker": "Eric",
      "time": "00:03:17",
      "upperBoundTime": "00:03:27",
      "content": "Yeah I have my son mother which is my fiancée she been with me since I was 16."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:27",
      "upperBoundTime": "00:03:29",
      "content": "Wow."
    },
    {
      "speaker": "Eric",
      "time": "00:03:29",
      "upperBoundTime": "00:03:29",
      "content": "And we have a 26 year old son yeah she's man she's just one constant in my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:29",
      "upperBoundTime": "00:03:43",
      "content": "Tell me about her."
    },
    {
      "speaker": "Eric",
      "time": "00:03:43",
      "upperBoundTime": "00:04:04",
      "content": "She's a strong woman very smart very determined she's going to school for nursing back in school for nursing and she works like 16, 17 hours a day now she loves me she really do."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:04",
      "upperBoundTime": "00:04:08",
      "content": "She nice."
    },
    {
      "speaker": "Eric",
      "time": "00:04:08",
      "upperBoundTime": "00:04:27",
      "content": "Yeah she love me a lot I love her but she that constant she help me to focus when I'm losing it when I'm veering off she done always put me back on trap and I really thank god for her."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:27",
      "upperBoundTime": "00:04:30",
      "content": "Yeah what's her name?"
    },
    {
      "speaker": "Eric",
      "time": "00:04:30",
      "upperBoundTime": "00:04:32",
      "content": "Lakeisha."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:36",
      "content": "Okay and tell me about your son what's his name and what's your relationship like."
    },
    {
      "speaker": "Eric",
      "time": "00:04:36",
      "upperBoundTime": "00:05:16",
      "content": "My son his name is Desire by me not really being there for my son I was he was like 2 when I left and by him growing up without me he love me but it's not the son and father relationship that we're supposed to have he's just came back from phoenix Arizona he's presently residing in Shreveport right now he had his up and down but he's a good young man trying to find his path right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:16",
      "upperBoundTime": "00:05:19",
      "content": "Right."
    },
    {
      "speaker": "Eric",
      "time": "00:05:19",
      "upperBoundTime": "00:05:23",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:23",
      "upperBoundTime": "00:05:26",
      "content": "Have you been able to do some parenting from prison?"
    },
    {
      "speaker": "Eric",
      "time": "00:05:26",
      "upperBoundTime": "00:05:50",
      "content": "I have I have in his earlier stages the earlier stages always through his mom she made sure that we stayed in contact she was relentless at that but by me not being there physically I can talk and through letters it's just not the same as you being there physically."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:50",
      "upperBoundTime": "00:05:53",
      "content": "No I understand."
    },
    {
      "speaker": "Eric",
      "time": "00:05:53",
      "upperBoundTime": "00:05:58",
      "content": "That can only go so far letters and phone calls."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:58",
      "upperBoundTime": "00:06:01",
      "content": "Sure did you ever go through the Malachi dads program."
    },
    {
      "speaker": "Eric",
      "time": "00:06:01",
      "upperBoundTime": "00:06:05",
      "content": "No I haven't I haven't been there."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:05",
      "upperBoundTime": "00:06:19",
      "content": "So, I want to get back to your earlier childhood tell me a little bit about. So I understand that you've got you're with your grandmother your mothers present in your life and then you have a father figure in your life."
    },
    {
      "speaker": "Eric",
      "time": "00:06:19",
      "upperBoundTime": "00:06:22",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:22",
      "upperBoundTime": "00:06:33",
      "content": "Is it fair to which one of these is more accurate that you grew up in a loving caring home where adults were clearly taking care of you or did you kind of have to make it on your own."
    },
    {
      "speaker": "Eric",
      "time": "00:06:33",
      "upperBoundTime": "00:06:56",
      "content": "My grandma pretty much I was a mama's boy kind of I used to call her mama I grew up in a loving home to be honest with you my grandma loved me my mom loved me and I grew up in a decent home."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:56",
      "upperBoundTime": "00:06:59",
      "content": "Ok and is your grandmother still alive."
    },
    {
      "speaker": "Eric",
      "time": "00:06:59",
      "upperBoundTime": "00:07:04",
      "content": "She passed it'll be two years December."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:04",
      "upperBoundTime": "00:07:06",
      "content": "I'm sorry."
    },
    {
      "speaker": "Eric",
      "time": "00:07:06",
      "upperBoundTime": "00:07:08",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:08",
      "upperBoundTime": "00:07:11",
      "content": "Can you tell me about your last interaction with her?"
    },
    {
      "speaker": "Eric",
      "time": "00:07:11",
      "upperBoundTime": "00:07:17",
      "content": "My last interaction with her she was in the hospital and it was over the phone."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:17",
      "upperBoundTime": "00:07:21",
      "content": "Ok."
    },
    {
      "speaker": "Eric",
      "time": "00:07:21",
      "upperBoundTime": "00:07:58",
      "content": "I've called and spoke with her and she was her normal self I could tell she was sick I mean I knew she was in the hospital but she was trying to make me feel better like she always did since I was coming up. She just told me to stay focused because she's about to transition she told me that and all to be strong and I'm going to be ok and that was pretty much my last conversation with her telling her I love her and telling her telling me that she love me."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:58",
      "upperBoundTime": "00:08:01",
      "content": "Yeah it's great that you had that chance."
    },
    {
      "speaker": "Eric",
      "time": "00:08:01",
      "upperBoundTime": "00:08:03",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:03",
      "upperBoundTime": "00:08:06",
      "content": "How about your mother are you in regular contact with your mother still."
    },
    {
      "speaker": "Eric",
      "time": "00:08:06",
      "upperBoundTime": "00:08:32",
      "content": "Off and on I hadn't really been in too much in contact with my mom it's not a bad rift between us it's just we've somewhat lost contact now my son mom just sent me my mom new number about two days ago and she wanted me to call her she's presently residing in Tennessee."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:32",
      "upperBoundTime": "00:08:35",
      "content": "Okay your mother."
    },
    {
      "speaker": "Eric",
      "time": "00:08:35",
      "upperBoundTime": "00:08:37",
      "content": "My mom yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:37",
      "upperBoundTime": "00:08:40",
      "content": "So what about school how was school for you did you like school."
    },
    {
      "speaker": "Eric",
      "time": "00:08:40",
      "upperBoundTime": "00:09:06",
      "content": "Oh yeah school was pretty much young man growing up having fun with my friends I liked school it just was a matter of me connecting with the wrong individuals doing the wrong thing I mean they was pretty much young like I am and yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:06",
      "upperBoundTime": "00:09:16",
      "content": "Okay, well let's talk a little bit about that so you said that you started kind of moving away from the values that you grew up with when you're about 15 hanging with the wrong people."
    },
    {
      "speaker": "Eric",
      "time": "00:09:16",
      "upperBoundTime": "00:09:20",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:20",
      "upperBoundTime": "00:09:22",
      "content": "So paint me a picture about that what were you doing."
    },
    {
      "speaker": "Eric",
      "time": "00:09:22",
      "upperBoundTime": "00:10:50",
      "content": "I had a close friend he was like a brother to me and u my grandmother wind up moving we moved in a different area and before I moved it just used to just be me and him and school and clothes and girls that was our thing and planning for our future but when I left his names Richard and he's like a brother to me when I moved away from him I moved into a different area which I met new people and older cousins a few years older than me and started hanging out with them and they was I would say probably."
    },
    {
      "speaker": "Eric",
      "time": "00:09:22",
      "upperBoundTime": "00:10:50",
      "content": "A little more advanced than me and I started to take on what they were doing stepping outside of who I really was and it kind of took me fast and within months I was drinking something that I'd never had did I was drinking real heavy and it causes me to started getting into all types of trouble fighting and some stuff I never. I stayed away from and it I just started to go down and down from there."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:50",
      "upperBoundTime": "00:10:56",
      "content": "Sure did you ever get kicked out of school this time."
    },
    {
      "speaker": "Eric",
      "time": "00:10:56",
      "upperBoundTime": "00:11:14",
      "content": "I never had got kicked out I just when I started to hang with the older crowd I pretty much started shooting hooky and that led to me just eventually leaving school."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:14",
      "upperBoundTime": "00:11:16",
      "content": "Okay what was the highest year you finished?"
    },
    {
      "speaker": "Eric",
      "time": "00:11:16",
      "upperBoundTime": "00:11:19",
      "content": "11th grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:19",
      "upperBoundTime": "00:11:21",
      "content": "So you got close."
    },
    {
      "speaker": "Eric",
      "time": "00:11:21",
      "upperBoundTime": "00:11:23",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:23",
      "upperBoundTime": "00:11:24",
      "content": "Ok I assume that you've gotten your GED since being here."
    },
    {
      "speaker": "Eric",
      "time": "00:11:24",
      "upperBoundTime": "00:11:26",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:26",
      "upperBoundTime": "00:11:34",
      "content": "Alright so you stop going to school what about any brushes with the law prior to this charge."
    },
    {
      "speaker": "Eric",
      "time": "00:11:34",
      "upperBoundTime": "00:12:30",
      "content": "Yes many brushes like I said I started drinking real heavy and I really had become an addict not even knowing I had a drinking problem not really knowing and it caused me to come into that contact with the law in the wrong way DWIs and illegal uses of weapon started toting weapons and it started a whole chain of wrong and action on the wrong side with the law I had several brush ins nothing major but they was wrong with the law."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:30",
      "upperBoundTime": "00:12:33",
      "content": "Why did you feel the need to have a weapon?"
    },
    {
      "speaker": "Eric",
      "time": "00:12:33",
      "upperBoundTime": "00:13:03",
      "content": "The type of environment I had started to hang in different people well mostly everybody was toting a weapon I left a well anything can happen any way I left a safer environment and started to hang deeper into the streets into different areas where it's required to have weapons to survive."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:03",
      "upperBoundTime": "00:13:06",
      "content": "Ok what were you doing to support yourself?"
    },
    {
      "speaker": "Eric",
      "time": "00:13:06",
      "upperBoundTime": "00:13:18",
      "content": "I always would work but aside from that I started to do the street hitting drugs selling drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:18",
      "upperBoundTime": "00:13:27",
      "content": "Sure and almost everybody would say that if you're going to be dealing drugs you need a weapon."
    },
    {
      "speaker": "Eric",
      "time": "00:13:27",
      "upperBoundTime": "00:13:30",
      "content": "Right exactly."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:30",
      "upperBoundTime": "00:13:34",
      "content": "Somebody told me that they go together like peanut butter and jelly."
    },
    {
      "speaker": "Eric",
      "time": "00:13:34",
      "upperBoundTime": "00:13:39",
      "content": "Yeah right."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:39",
      "upperBoundTime": "00:14:03",
      "content": "So ok I get it so I'd like to learn a little bit about your neighborhood was can you paint a picture for me it looks like the two of us when you're 15, 16, 17. So this would be at your mom's house right so if we opened up the front door of your house to look out into the neighborhood what am I seeing and hearing what's going on here."
    },
    {
      "speaker": "Eric",
      "time": "00:14:03",
      "upperBoundTime": "00:14:34",
      "content": "You would see a lot of kids playing teenagers here and there it was a pretty quiet neighborhood that we lived in then it was an area called Highland and it was a pretty nice area you had your different u situations that happened from time to time but nothing just."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:34",
      "upperBoundTime": "00:14:36",
      "content": "Okay you felt safe."
    },
    {
      "speaker": "Eric",
      "time": "00:14:36",
      "upperBoundTime": "00:14:39",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:39",
      "upperBoundTime": "00:14:42",
      "content": "There wasn't a bunch of criminal activity gang activity going on right outside."
    },
    {
      "speaker": "Eric",
      "time": "00:14:42",
      "upperBoundTime": "00:14:48",
      "content": "Not too much like I said you would have different situations would probably happen here or there but it's wasn't just an ongoing."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:48",
      "upperBoundTime": "00:14:54",
      "content": "Sure so was fighting part of your experience coming up."
    },
    {
      "speaker": "Eric",
      "time": "00:14:54",
      "upperBoundTime": "00:14:56",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:56",
      "upperBoundTime": "00:14:59",
      "content": "Okay both in and out of school."
    },
    {
      "speaker": "Eric",
      "time": "00:14:59",
      "upperBoundTime": "00:15:15",
      "content": "Both yeah I fought in school especially when I started being in the wrong environment it's fighting gone take place disagreements leads to fighting lot of time."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:15",
      "upperBoundTime": "00:15:18",
      "content": "But nothing too serious that would involve a weapon."
    },
    {
      "speaker": "Eric",
      "time": "00:15:18",
      "upperBoundTime": "00:15:27",
      "content": "No we would fight and probably be back talking in just 2 or 3 days later yeah something like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:27",
      "upperBoundTime": "00:15:48",
      "content": "Ok aside from your grandmother and your mother and your stepfather was there another adult in your life than took an interest in you that you think back now that you have the time to think back on that that was important in your life or was it just your family."
    },
    {
      "speaker": "Eric",
      "time": "00:15:48",
      "upperBoundTime": "00:16:43",
      "content": "I had well he my family I had an uncle that my mom's younger brother. We called him junior his name was John he really just was there for me always telling me the right thing because this I watched him live like this and he really always just always back even when I grew up and he moved away moved into his house with his family he would always try to just put the right things in me. So my uncle was very important very instrumental in my life that's who I looked up to coming up before I moved into a different area I looked up to my uncle."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:43",
      "upperBoundTime": "00:16:49",
      "content": "Sure any teachers take a special interest in you that you remember?"
    },
    {
      "speaker": "Eric",
      "time": "00:16:49",
      "upperBoundTime": "00:17:12",
      "content": "I had a teacher names Mrs. Ms. Rogers because I loved I loved reading and writing and that was that's what she taught and she used to always tell me you could be a writer because I loved to read and write but yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:12",
      "upperBoundTime": "00:17:15",
      "content": "Do you write?"
    },
    {
      "speaker": "Eric",
      "time": "00:17:15",
      "upperBoundTime": "00:17:27",
      "content": "Not much now. But I used to write I read a lot I still love my reading I get a book and read it and devour the book."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:27",
      "upperBoundTime": "00:17:29",
      "content": "Sure what are you reading now?"
    },
    {
      "speaker": "Eric",
      "time": "00:17:29",
      "upperBoundTime": "00:17:33",
      "content": "It's called it's by Dr. Murphy it's called The Power Of The Subconscious Mind."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:33",
      "upperBoundTime": "00:17:39",
      "content": "Oh wow."
    },
    {
      "speaker": "Eric",
      "time": "00:17:39",
      "upperBoundTime": "00:17:42",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:42",
      "upperBoundTime": "00:17:55",
      "content": "So you told me about this woman who you've been who stuck beside you all these years were there any other intimate relationships that stick out in your mind or was it just this one."
    },
    {
      "speaker": "Eric",
      "time": "00:17:55",
      "upperBoundTime": "00:18:04",
      "content": "This the one that sticks out I've been involved in other relationships but that's what this the one that sticks out."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:04",
      "upperBoundTime": "00:18:06",
      "content": "Sure."
    },
    {
      "speaker": "Eric",
      "time": "00:18:06",
      "upperBoundTime": "00:18:15",
      "content": "She's all not just my companion she's my best friend."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:15",
      "upperBoundTime": "00:18:29",
      "content": "Sounds like that and so sometimes it's easy to do this and sometimes it not when you're trying to look back on your life and trying to think about why did I do this an what how did I get down this path."
    },
    {
      "speaker": "Eric",
      "time": "00:18:29",
      "upperBoundTime": "00:18:32",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:32",
      "upperBoundTime": "00:18:41",
      "content": "Is there some is there a specific sort of because that you would attribute to the because it sounded like outside of this even you were already kind of doing going down the wrong path."
    },
    {
      "speaker": "Eric",
      "time": "00:18:41",
      "upperBoundTime": "00:18:43",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:43",
      "upperBoundTime": "00:18:45",
      "content": "Is that fair to say."
    },
    {
      "speaker": "Eric",
      "time": "00:18:45",
      "upperBoundTime": "00:18:48",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:48",
      "upperBoundTime": "00:18:50",
      "content": "Right so what do you think led you there peer pressure."
    },
    {
      "speaker": "Eric",
      "time": "00:18:50",
      "upperBoundTime": "00:19:51",
      "content": "I could say about yeah about probably about 50% peer pressure and the rest was myself the rest was myself going into different depression stages because no one I always realize even when I was out there doing wrong this not what I had planned for myself."
    },
    {
      "speaker": "Eric",
      "time": "00:18:50",
      "upperBoundTime": "00:19:51",
      "content": "I always knew that in the back of my mind and it always bothered me because I had a greater I looked at myself in a different light and when I was out doing wrong that would always be in my mind knowing this is not what you this is not what you seen for yourself."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:51",
      "upperBoundTime": "00:20:05",
      "content": "Right sure, let me ask you this if this particular charge didn't happen how do you think your life would have unfolded for the next few months and years after this event."
    },
    {
      "speaker": "Eric",
      "time": "00:20:05",
      "upperBoundTime": "00:20:51",
      "content": "To be honest with you I had started drinking so much and I started ulcers develop and before I came before I caught this charge I was going to see specialists in the hospital. By me drinking so much and they told me I was killing myself and probably if I wouldn't have caught this charge because I always felt that I wasn't going to stop drinking I probably would have died I probably would have died yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:51",
      "upperBoundTime": "00:20:56",
      "content": "Do you think that you were medicating something by drinking so much alcohol?"
    },
    {
      "speaker": "Eric",
      "time": "00:20:56",
      "upperBoundTime": "00:21:11",
      "content": "Yes I yes I did yes I did like I say I seen myself different from actually what I was actually living and I would like try to cover it with alcohol and I knew that."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:11",
      "upperBoundTime": "00:21:14",
      "content": "Maybe depression."
    },
    {
      "speaker": "Eric",
      "time": "00:21:14",
      "upperBoundTime": "00:21:16",
      "content": "Yeah you could say something yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:16",
      "upperBoundTime": "00:21:21",
      "content": "I mean very often if someone's drinking excessively at that age it can be something like that yeah."
    },
    {
      "speaker": "Eric",
      "time": "00:21:21",
      "upperBoundTime": "00:21:24",
      "content": "Exactly."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:24",
      "upperBoundTime": "00:21:36",
      "content": "So I want to move on to after the charge but before I do is there anything else about your childhood and adolescence that is important that we should talk about that we haven't talked about."
    },
    {
      "speaker": "Eric",
      "time": "00:21:36",
      "upperBoundTime": "00:21:45",
      "content": "Let's see."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:45",
      "upperBoundTime": "00:21:52",
      "content": "Or a specific memory from childhood that's kind of still with you good or bad."
    },
    {
      "speaker": "Eric",
      "time": "00:21:52",
      "upperBoundTime": "00:22:11",
      "content": "My specific memory it's just I spent a lot of time with my grandma growing up that's that memory there that's some of the best memories I have just being with my grandmother talking with her."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:11",
      "upperBoundTime": "00:22:21",
      "content": "Yeah somebody told me that one of the ways to cope with a life sentence is to use his words he said you hold on to old memories."
    },
    {
      "speaker": "Eric",
      "time": "00:22:21",
      "upperBoundTime": "00:22:52",
      "content": "For me it's to the way to that I get through is first with god my relationship with god and back seeing myself where I want to be I visualize and see myself doing what I actually want to do and that that's what that prepares me each day god and that."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:52",
      "upperBoundTime": "00:22:55",
      "content": "Ok and I'm going to come back to that actually. So you go through the trail I suppose you're in the parish jail."
    },
    {
      "speaker": "Eric",
      "time": "00:22:55",
      "upperBoundTime": "00:22:58",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:58",
      "upperBoundTime": "00:23:04",
      "content": "Awaiting that."
    },
    {
      "speaker": "Eric",
      "time": "00:23:04",
      "upperBoundTime": "00:23:07",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:07",
      "upperBoundTime": "00:23:11",
      "content": "Did you at the time did you realize the seriousness of what you were facing when you were going through the trial."
    },
    {
      "speaker": "Eric",
      "time": "00:23:11",
      "upperBoundTime": "00:23:29",
      "content": "Yes I realized the instant it happened that it was serious and even more so during the trial I always took it serious from the beginning I knew man you in a serious situation your life on the line I knew it was serious from the beginning."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:29",
      "upperBoundTime": "00:23:40",
      "content": "Okay so do you remember the bus ride to Angola?"
    },
    {
      "speaker": "Eric",
      "time": "00:23:40",
      "upperBoundTime": "00:23:42",
      "content": "Yes I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:42",
      "upperBoundTime": "00:23:46",
      "content": "Can you tell me what's going on in your mind at that time?"
    },
    {
      "speaker": "Eric",
      "time": "00:23:46",
      "upperBoundTime": "00:24:04",
      "content": "This is the end I you threw your life away that was basically what I was thinking when I was coming here."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:04",
      "upperBoundTime": "00:24:11",
      "content": "Yeah how what were your first few weeks and months like here do you remember."
    },
    {
      "speaker": "Eric",
      "time": "00:24:11",
      "upperBoundTime": "00:25:07",
      "content": "I first came my first few weeks surprisingly you had men here that actually that had been here and steering me in the right direction man get in school get on your case get right on your case stay right on stay right on top of your case."
    },
    {
      "speaker": "Eric",
      "time": "00:24:11",
      "upperBoundTime": "00:25:07",
      "content": "It was still challenging because of knowing the situation I was in but the people that was around me was pretty positive people you had some that you going to have some that act up everywhere but the people that gravitated toward me was people that was pointing me in the right direction."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:07",
      "upperBoundTime": "00:25:10",
      "content": "Right from the beginning."
    },
    {
      "speaker": "Eric",
      "time": "00:25:10",
      "upperBoundTime": "00:25:11",
      "content": "Right from the beginning."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:11",
      "upperBoundTime": "00:25:13",
      "content": "Wow."
    },
    {
      "speaker": "Eric",
      "time": "00:25:13",
      "upperBoundTime": "00:25:15",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:15",
      "upperBoundTime": "00:25:18",
      "content": "That doesn't happen to everybody."
    },
    {
      "speaker": "Eric",
      "time": "00:25:18",
      "upperBoundTime": "00:25:42",
      "content": "Yeah it doesn't I had a guy I didn't know he was from home but it was I think it was kind of cool cold when I came here and he gave me brand new thermals and hood and he made it clear he said man no strings attached I know you probably heard about prison life prison and man we been friends since I been here yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:42",
      "upperBoundTime": "00:25:44",
      "content": "That's great."
    },
    {
      "speaker": "Eric",
      "time": "00:25:44",
      "upperBoundTime": "00:25:44",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:44",
      "upperBoundTime": "00:25:48",
      "content": "What was your first job I guess they put everybody in the field."
    },
    {
      "speaker": "Eric",
      "time": "00:25:48",
      "upperBoundTime": "00:25:51",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:51",
      "upperBoundTime": "00:25:53",
      "content": "So how was that experience?"
    },
    {
      "speaker": "Eric",
      "time": "00:25:53",
      "upperBoundTime": "00:26:14",
      "content": "It was an experience dealing with the different tools I never seen before it was he it was something I was like trying to like figure out what is what is this I mean like wow man look what you got yourself in you doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:14",
      "upperBoundTime": "00:26:17",
      "content": "Yeah."
    },
    {
      "speaker": "Eric",
      "time": "00:26:17",
      "upperBoundTime": "00:26:20",
      "content": "Yeah it was a mind blowing experience."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:20",
      "upperBoundTime": "00:26:23",
      "content": "How long did you spend out in the field."
    },
    {
      "speaker": "Eric",
      "time": "00:26:23",
      "upperBoundTime": "00:26:26",
      "content": "7 months."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:26",
      "upperBoundTime": "00:26:31",
      "content": "Ok alright and then what's your first job after that."
    },
    {
      "speaker": "Eric",
      "time": "00:26:31",
      "upperBoundTime": "00:27:00",
      "content": "After that this older guy that had been here he had been here like 20 something years and all I had come we was in the dorm together and he was asking me do you ever want a job I said yeah man I really get out of this field man he asked would you like to go in the kitchen and I was like yeah anything to get out of the field and my first job was in the kitchen."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:00",
      "upperBoundTime": "00:27:04",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:27:04",
      "upperBoundTime": "00:27:06",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:06",
      "upperBoundTime": "00:27:08",
      "content": "Do you still do."
    },
    {
      "speaker": "Eric",
      "time": "00:27:08",
      "upperBoundTime": "00:27:19",
      "content": "Off and on it turned out I found my gift in the kitchen I love to cook it gave me a gift in that I perfected it."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:19",
      "upperBoundTime": "00:27:26",
      "content": "Ok so what do you like to cook?"
    },
    {
      "speaker": "Eric",
      "time": "00:27:26",
      "upperBoundTime": "00:27:39",
      "content": "Spaghetti I could go with spaghetti, beans and rice of course I could I fry a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:39",
      "upperBoundTime": "00:27:44",
      "content": "If I was going to have the best thing that you make what would it be."
    },
    {
      "speaker": "Eric",
      "time": "00:27:44",
      "upperBoundTime": "00:27:52",
      "content": "What would it be that I make? Probably you probably love my potato salad and fish."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:52",
      "upperBoundTime": "00:27:55",
      "content": "Ok."
    },
    {
      "speaker": "Eric",
      "time": "00:27:55",
      "upperBoundTime": "00:28:00",
      "content": "Yeah I love fish. So I put 110 into that."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:00",
      "upperBoundTime": "00:28:06",
      "content": "All right and so you say you still do that on and off do you do that with any of the clubs or?"
    },
    {
      "speaker": "Eric",
      "time": "00:28:06",
      "upperBoundTime": "00:28:15",
      "content": "Yeah I'm a part of reentry here and manage the team down there."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:15",
      "upperBoundTime": "00:28:20",
      "content": "Ok are you involved do you sell concessions or anything at the rodeo."
    },
    {
      "speaker": "Eric",
      "time": "00:28:20",
      "upperBoundTime": "00:28:31",
      "content": "No I was telling them a little earlier before you came I hadn't been out there in like 8 years but that's what I used to do at the rodeo."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:31",
      "upperBoundTime": "00:28:33",
      "content": "Okay are you planning on going this year."
    },
    {
      "speaker": "Eric",
      "time": "00:28:33",
      "upperBoundTime": "00:28:36",
      "content": "No yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:36",
      "upperBoundTime": "00:28:44",
      "content": "Sure so can you can you walk me through your day what is your day look like when you get up in the morning."
    },
    {
      "speaker": "Eric",
      "time": "00:28:44",
      "upperBoundTime": "00:29:46",
      "content": "Well I get up in the morning I'm a talk with god get up get my hygiene together brush my teeth wash my face put my clothes on wait for the morning count to clear I leave out early because I put out the call to make sure we get where we supposed to go to the hospital and different place and when the count clear at quarter to 3 or quarter to 4."
    },
    {
      "speaker": "Eric",
      "time": "00:28:44",
      "upperBoundTime": "00:29:46",
      "content": "Whichever one I come out on I come up to this building to my work area and I put the call lots together for the main prison and after that I would go check in at the reentry and make sure everything is up and running for breakfast I will spend probably an hour in there and go back before the shift change to make sure I get the call out for shift."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:46",
      "upperBoundTime": "00:29:48",
      "content": "Back to your dorm."
    },
    {
      "speaker": "Eric",
      "time": "00:29:48",
      "upperBoundTime": "00:29:50",
      "content": "No back to my work area."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:50",
      "upperBoundTime": "00:29:53",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:29:53",
      "upperBoundTime": "00:30:18",
      "content": "I would go back there before shift change and send the call out for the shift change so they can grab the call outs to bring down the walk after that I would go back and check in on the guys see what they needing now if I can help we short I would take I would stay in there probably 45 minutes."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:18",
      "upperBoundTime": "00:30:20",
      "content": "Again with the food in the kitchen?"
    },
    {
      "speaker": "Eric",
      "time": "00:30:20",
      "upperBoundTime": "00:30:45",
      "content": "Yeah when I leave out of there the second time I would go back to the job because the job I'm on I have to get call outs signed either by the wardens or by the colonel and I would sit with them for a period of time and we would go through the call outs to make sure it's structured right."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:45",
      "upperBoundTime": "00:30:48",
      "content": "Okay are the call us mainly for the reentry guys?"
    },
    {
      "speaker": "Eric",
      "time": "00:30:48",
      "upperBoundTime": "00:31:19",
      "content": "Yeah we have a lot of reentry it's for the population but we have the reentry program here and we have call outs for those guys every day yeah so we go through them for a period that morning get them signed and I would go back and read reread make sure everything's is structured right to get ready put it together for the following day."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:19",
      "upperBoundTime": "00:31:24",
      "content": "Okay yeah and then after that what."
    },
    {
      "speaker": "Eric",
      "time": "00:31:24",
      "upperBoundTime": "00:31:24",
      "content": "I will basically be at the job basically all day when I leave I probably would go down there probably about 1. I probably lay down probably get me a nap in and come back out before they count to get ready to end the day on the job come back and get on the count and go back through the call outs it requires a lot of reading which I like to do and I been doing it."
    },
    {
      "speaker": "Eric",
      "time": "00:31:24",
      "upperBoundTime": "00:31:24",
      "content": "So long it just like second nature and probably about 4:30, 5:30 I would put the call outs together I have work partner also and we would go through everything and probably put it together and after we finish I would go in and shower and probably read till I got to fall asleep."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:24",
      "upperBoundTime": "00:32:31",
      "content": "Okay sure sounds like a pretty full day."
    },
    {
      "speaker": "Eric",
      "time": "00:32:31",
      "upperBoundTime": "00:32:36",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:36",
      "upperBoundTime": "00:32:47",
      "content": "When you first got here you were sounds like you were sort of mentored by some of the more positive guys some of the older guys."
    },
    {
      "speaker": "Eric",
      "time": "00:32:47",
      "upperBoundTime": "00:32:50",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:50",
      "upperBoundTime": "00:32:55",
      "content": "Do you find yourself mentoring some of the young guys now too?"
    },
    {
      "speaker": "Eric",
      "time": "00:32:55",
      "upperBoundTime": "00:33:18",
      "content": "Yeah all the time yeah because we surrounded by a whole lot of young guys way more than when I got here young and it's a joy to be able to give back there's sure a lot of things that helped me through and helped me look at life different now and helped me mature young guy."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:18",
      "upperBoundTime": "00:33:21",
      "content": "Right are you talking about the reentry guys or just anybody."
    },
    {
      "speaker": "Eric",
      "time": "00:33:21",
      "upperBoundTime": "00:33:27",
      "content": "Reentry any young guy yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:27",
      "upperBoundTime": "00:33:32",
      "content": "Sure when you see them do you see a little bit of your young self in some of the guys come in and face a life sentence so young"
    },
    {
      "speaker": "Eric",
      "time": "00:33:32",
      "upperBoundTime": "00:33:35",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:35",
      "upperBoundTime": "00:33:37",
      "content": "Do you think they really understand."
    },
    {
      "speaker": "Eric",
      "time": "00:33:37",
      "upperBoundTime": "00:34:03",
      "content": "Some of them do but a large percent of them really don't it haven't it haven't registered that this is a life or death situation that this is serious this serious every day you have some that are exceptional that that catch on tie they feet hit this ground yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:03",
      "upperBoundTime": "00:34:14",
      "content": "So can you tell me a little bit about some of the organizations that you've been part of since you've been here and some of the activities and clubs and certifications and things like that that you've done?"
    },
    {
      "speaker": "Eric",
      "time": "00:34:14",
      "upperBoundTime": "00:34:48",
      "content": "I've took different they have so many classes when I first came here CPR you have the JCs organization they offer. So many different type of classes that you can take public speaking it's just on and on you pretty much name it they have it even have created different classes."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:48",
      "upperBoundTime": "00:34:56",
      "content": "Sure anything stand out as particularly valuable to your experience here"
    },
    {
      "speaker": "Eric",
      "time": "00:34:56",
      "upperBoundTime": "00:35:07",
      "content": "That's valuable I would say the most valuable thing that stands out to me now is relationships."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:07",
      "upperBoundTime": "00:35:10",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:35:10",
      "upperBoundTime": "00:35:23",
      "content": "Relationships building relationships valuing human life that's what really stands out I value that now."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:23",
      "upperBoundTime": "00:35:27",
      "content": "Yeah and what programs that is discussed."
    },
    {
      "speaker": "Eric",
      "time": "00:35:27",
      "upperBoundTime": "00:35:31",
      "content": "That come through God."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:31",
      "upperBoundTime": "00:35:33",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:35:33",
      "upperBoundTime": "00:35:39",
      "content": "Through the church my affiliation with church yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:39",
      "upperBoundTime": "00:35:58",
      "content": "Ok so little bit more serious question so when you look back on what happened and that time in your life and you think back on the victim did you have codefendants in your case?"
    },
    {
      "speaker": "Eric",
      "time": "00:35:58",
      "upperBoundTime": "00:36:03",
      "content": "I had two guys but I took the charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:03",
      "upperBoundTime": "00:36:03",
      "content": "Okay so you're the only one that got the life sentence."
    },
    {
      "speaker": "Eric",
      "time": "00:36:03",
      "upperBoundTime": "00:36:06",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:06",
      "upperBoundTime": "00:36:13",
      "content": "So when you look back on what happened up and hindsight's 20/20."
    },
    {
      "speaker": "Eric",
      "time": "00:36:13",
      "upperBoundTime": "00:36:16",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:16",
      "upperBoundTime": "00:36:24",
      "content": "You also have this time where you've matured to look back on it how do you feel about what happened and about the victim now."
    },
    {
      "speaker": "Eric",
      "time": "00:36:24",
      "upperBoundTime": "00:36:52",
      "content": "I feel remorseful for the victim and his family my heart really goes out to him yeah it hurts when I look back and because he was a young man also and I think about his mom and his sister his family what was taken from him."
    },
    {
      "speaker": "Eric",
      "time": "00:36:52",
      "upperBoundTime": "00:36:56",
      "content": "That's right that's right."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:56",
      "upperBoundTime": "00:37:02",
      "content": "Tell me a little bit about the impact that this has had on your family."
    },
    {
      "speaker": "Eric",
      "time": "00:37:02",
      "upperBoundTime": "00:37:50",
      "content": "It was hard especially on my grandmother and my mom my son it really affected it really affected him he he's acted out a few times and he always mentioned my absence and even though he's 26 years old he that still bother him that I'm not I wasn't there and that I'm still not there he still looks for that father figure it's had a big impact on my family because I've lost a lot of contact with family members that I was close with yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:50",
      "upperBoundTime": "00:38:00",
      "content": "Who do you think in your family took it the worst."
    },
    {
      "speaker": "Eric",
      "time": "00:38:00",
      "upperBoundTime": "00:38:09",
      "content": "My grandmother, my son his mom and then my mom."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:09",
      "upperBoundTime": "00:38:12",
      "content": "So everyone in your family."
    },
    {
      "speaker": "Eric",
      "time": "00:38:12",
      "upperBoundTime": "00:38:16",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:16",
      "upperBoundTime": "00:38:23",
      "content": "So sometimes people can look back and think of a particular thing that changed the course of their lie right."
    },
    {
      "speaker": "Eric",
      "time": "00:38:23",
      "upperBoundTime": "00:38:25",
      "content": "Right"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:25",
      "upperBoundTime": "00:38:35",
      "content": "You have suggested that you were already going down the wrong path at that point and then you had these folks take an interest in you what if you look back what was what turned things around for you would you say you've transformed your life since you've been here."
    },
    {
      "speaker": "Eric",
      "time": "00:38:35",
      "upperBoundTime": "00:38:38",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:38",
      "upperBoundTime": "00:38:45",
      "content": "Okay so what's the source of that transformation?"
    },
    {
      "speaker": "Eric",
      "time": "00:38:45",
      "upperBoundTime": "00:39:33",
      "content": "I don't want to sound religious too religious or anything but everything every change that started with me it started from my relationship with god and building that relationship with him first because those reading his word that's when my mind really started to be renewed and I started to see myself like I saw myself even reading god's word and interacting with other men of god in this place watching their walk that's that when I really started to change."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:33",
      "upperBoundTime": "00:39:38",
      "content": "When was that in your incarceration period?"
    },
    {
      "speaker": "Eric",
      "time": "00:39:38",
      "upperBoundTime": "00:39:45",
      "content": "Probably as soon as I got here I that's what I turned to yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:45",
      "upperBoundTime": "00:39:47",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:39:47",
      "upperBoundTime": "00:39:51",
      "content": "Yeah that's what I turned to yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:51",
      "upperBoundTime": "00:39:54",
      "content": "Sure okay. If you get a chance to go before the pardon board what would you want them to know about you."
    },
    {
      "speaker": "Eric",
      "time": "00:39:54",
      "upperBoundTime": "00:39:59",
      "content": "What I stated earlier that."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:59",
      "upperBoundTime": "00:40:10",
      "content": "I guess let me ask you what they ask people a lot. They say ok the victim didn't get a second chance why should I give you another chance."
    },
    {
      "speaker": "Eric",
      "time": "00:40:10",
      "upperBoundTime": "00:40:42",
      "content": "Because I'm no longer the young boy that put this man that you're looking at that you're talking with here and I value human life I really value human life now that's the most important thing to me. I value that I never take that for granted or disrespect that again."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:42",
      "upperBoundTime": "00:40:57",
      "content": "Yeah so you had actually touched on this earlier talking about one of the ways that you cope is that you do it through religious through your relationship with god."
    },
    {
      "speaker": "Eric",
      "time": "00:40:57",
      "upperBoundTime": "00:41:00",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:00",
      "upperBoundTime": "00:41:18",
      "content": "It is also a lot of guys find that that's a source of comfort when they're dealing with a very difficult situation when you think of the possibility of never getting out of here which is a reality for a lot of men."
    },
    {
      "speaker": "Eric",
      "time": "00:41:18",
      "upperBoundTime": "00:41:24",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:24",
      "upperBoundTime": "00:41:27",
      "content": "How do you cope with that how have you been coping with that possibility."
    },
    {
      "speaker": "Eric",
      "time": "00:41:27",
      "upperBoundTime": "00:41:47",
      "content": "I stay right there I that's where I'm firm at that's where I stay and even though like you saying there's a possibility that's a thought that I don't just sit and dwell on."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:47",
      "upperBoundTime": "00:41:50",
      "content": "Ok sure."
    },
    {
      "speaker": "Eric",
      "time": "00:41:50",
      "upperBoundTime": "00:41:53",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:53",
      "upperBoundTime": "00:41:58",
      "content": "Sure so is it is it more avoiding thinking about it or denying the possibility of dying here when you think about it."
    },
    {
      "speaker": "Eric",
      "time": "00:41:58",
      "upperBoundTime": "00:42:10",
      "content": "I face it head up and I choose to believe the best that if it's possible for me to die here it's also possible for me to get out also."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:10",
      "upperBoundTime": "00:42:18",
      "content": "Ok sure because I mean some people distract themselves with things other people do drugs to escape it what I mean."
    },
    {
      "speaker": "Eric",
      "time": "00:42:18",
      "upperBoundTime": "00:42:21",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:21",
      "upperBoundTime": "00:42:24",
      "content": "Everybody has to get a coping mechanism of some kind."
    },
    {
      "speaker": "Eric",
      "time": "00:42:24",
      "upperBoundTime": "00:42:26",
      "content": "Exactly."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:26",
      "upperBoundTime": "00:42:43",
      "content": "That's part of what we're exploring in this project is how people deal with impossibly difficult situations. So do you see people just give up."
    },
    {
      "speaker": "Eric",
      "time": "00:42:43",
      "upperBoundTime": "00:43:08",
      "content": "Yes I have I've seen it many times it's an it's a hurting thing that to watch it really knock you off your, you'll just watch a person especially if to just give up."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:08",
      "upperBoundTime": "00:43:14",
      "content": "Yeah have you experienced that with somebody you were close you who just."
    },
    {
      "speaker": "Eric",
      "time": "00:43:14",
      "upperBoundTime": "00:43:33",
      "content": "If they hadn't just came out and told me that man I'm just going to die here but I've experienced death with a lot of men that I was close to here and watched them die here and watched them pass away here."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:33",
      "upperBoundTime": "00:43:36",
      "content": "After giving up."
    },
    {
      "speaker": "Eric",
      "time": "00:43:36",
      "upperBoundTime": "00:43:41",
      "content": "Possibly they it's possibly like I said they never voiced it to me."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:41",
      "upperBoundTime": "00:43:44",
      "content": "Ok I got it but you can tell that."
    },
    {
      "speaker": "Eric",
      "time": "00:43:44",
      "upperBoundTime": "00:43:46",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:46",
      "upperBoundTime": "00:44:07",
      "content": "Okay, so for you I think the hardest part about living in prison I would imagine changes as you're here over so many years so what might have been the hardest thing for you when you first came in may not be the thing that's hardest for so my question is what is the hardest thing for you now about being in prison."
    },
    {
      "speaker": "Eric",
      "time": "00:44:07",
      "upperBoundTime": "00:44:15",
      "content": "The hardest thing now is being here yeah that's the."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:15",
      "upperBoundTime": "00:44:18",
      "content": "I get it."
    },
    {
      "speaker": "Eric",
      "time": "00:44:18",
      "upperBoundTime": "00:44:46",
      "content": "Right that's a constant every day now the older you get you like you said about the possibility all of that you like the clock in your mind. So you constantly like you against time. So that's probably the most challenging things just constantly waking up here yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:46",
      "upperBoundTime": "00:44:59",
      "content": "You go either through the parole process or the pardon process and then the pardon process have you given a lot of thought to the next chapter in your life and what that would look like if you get."
    },
    {
      "speaker": "Eric",
      "time": "00:44:59",
      "upperBoundTime": "00:45:07",
      "content": "Life after prison?"
    },
    {
      "speaker": "Marcus",
      "time": "00:45:07",
      "upperBoundTime": "00:45:10",
      "content": "Yeah, tell me about that."
    },
    {
      "speaker": "Eric",
      "time": "00:45:10",
      "upperBoundTime": "00:45:45",
      "content": "The next chapter I believe I would marry my fiancé we plan on we always talk about moving to Texas she she's working on being a registered nurse and I would like to go into the cooking field that's my passion that's what I love to do and in hopes of even opening up my own restaurant once I get there and get settled in get my foundation down."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:45",
      "upperBoundTime": "00:45:51",
      "content": "Okay."
    },
    {
      "speaker": "Eric",
      "time": "00:45:51",
      "upperBoundTime": "00:46:25",
      "content": "I have a granddaughter spending time with her and just really reacquainting myself with my family and just basically living the life I always seen myself liking a successful live a blessed life being able to help others not only help my family but I like to be able to help others also."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:25",
      "upperBoundTime": "00:46:30",
      "content": "Yeah what are you most proud of?"
    },
    {
      "speaker": "Eric",
      "time": "00:46:30",
      "upperBoundTime": "00:47:00",
      "content": "What I'm most proud of the transformation that that took place in my life I was lost when I came wrong thinking just everything was wrong. So the transformation of how I think now how I care about people the way I live now yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:00",
      "upperBoundTime": "00:47:18",
      "content": "Sure so I mean I have enjoyed sitting with you and learning about your life and some of your experiences is there something that I should have asked you that I didn't ask you."
    },
    {
      "speaker": "Eric",
      "time": "00:47:18",
      "upperBoundTime": "00:47:28",
      "content": "No not unless you got something else."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:28",
      "upperBoundTime": "00:47:45",
      "content": "That's fine I do have something else actually. What I'd like for you to perhaps try to explain for people who are who don't really think about prison it's just not part of their lives they're just busy with whatever they're doing and they never see anything good or bad or anything else except what they see on television."
    },
    {
      "speaker": "Eric",
      "time": "00:47:45",
      "upperBoundTime": "00:47:49",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:49",
      "upperBoundTime": "00:47:52",
      "content": "Who haven't been personally affected by a loved one going to prison?"
    },
    {
      "speaker": "Eric",
      "time": "00:47:52",
      "upperBoundTime": "00:47:57",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:57",
      "upperBoundTime": "00:48:01",
      "content": "The sentence of life without parole is a particularly difficult thing I think than getting a fixed numbers."
    },
    {
      "speaker": "Eric",
      "time": "00:48:01",
      "upperBoundTime": "00:48:05",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:05",
      "upperBoundTime": "00:48:18",
      "content": "Can you explain to that person who really has never given it any thought what the reality of a life sentence is what that means to you."
    },
    {
      "speaker": "Eric",
      "time": "00:48:18",
      "upperBoundTime": "00:50:19",
      "content": "Yeah a person that haven't really given it a thought I would ask that person or persons to just think about if you had a loved one or even a friend that fell into a situation like this or life without the possibility of probation or parole situation knowing whatever got that person your friend or your family member into that situation you knowing that one incident that that don't define that person and think about should your loved one."
    },
    {
      "speaker": "Eric",
      "time": "00:48:18",
      "upperBoundTime": "00:50:19",
      "content": "A friend spend the rest of their life behind bars for that one mistake that they made which you've known that's not them that don't define them I would ask them to just to look at that look at the men and women who have made those different mistakes in their life and has caused them to be in this situation look at that and look at what got them there and fast forward to however many years they been in prison and take a look at that person."
    },
    {
      "speaker": "Eric",
      "time": "00:48:18",
      "upperBoundTime": "00:50:19",
      "content": "Now take a look at that person now and see what you see what you come up with I pretty much guarantee it's not just saying that the person that got them in that situation you looking at a totally different person."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:19",
      "content": "Yes okay, I think that's a good place to stop. Thank you very much."
    }
  ]
}
