{"name":"","transcript":[{"content":"Ernest McGee transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:03-0","content":"Can you tell me a little bit about your family, and the people you were close to coming up?"},{"speaker":"Ernest","time":"00:00:06-3","content":"Well I come, I had a good family coming up. My mother and my grandmother is the two that raised me. And we had a nice family we got along, I got along with my mother, I got along with my grandmother. Well my grandmother, that's who I stayed with, and that's where I went to school at."},{"speaker":"Ernest","time":"00:00:06-3","content":"I went to school at wherever my grandmother because I got put out of school in the school where I was going with my momma. My momma stayed in one district and my grandma stayed in another district. And when they put me out of school I had to leave that district and go to my grandmother and go to school from her district."},{"speaker":"Marcus","time":"00:00:45-8","content":"How old was that? How old were you then?"},{"speaker":"Ernest","time":"00:00:47-4","content":"I had to be around what, 9 to 10 years old because I was in the fourth grade. I had never failed so I was had to be 9 years, I think you're 9 years old when you're in the fourth grade."},{"speaker":"Marcus","time":"00:00:55-8","content":"Why were you put out of school?"},{"speaker":"Ernest","time":"00:00:57-5","content":"For fighting. At assembly me and a guy had a fight at school about food in the cafeteria. Two kids, I'm like hey I thought it was you, it was crazy to put out, both of us got put out of school and we got put out of all public school. My family had to go to the school board and talk and get them people to let me go back to school at 9 years old to another school."},{"speaker":"Ernest","time":"00:00:57-5","content":"And then the school I had gone to was McDonough number 7, which was an integrated school. But when they went talk with them they allowed me to go to another school but it was all black school, which was telling them reform and I'm in 4th grade."},{"speaker":"Marcus","time":"00:01:40-8","content":"Was there a lot of fighting in your life growing up?"},{"speaker":"Ernest","time":"00:01:43-2","content":"Well I had a lot of fights growing up. I think I had a, I had an anger management problem because I would fight about anything. I guess that come from the neighborhoods I lived in."},{"speaker":"Ernest","time":"00:01:43-2","content":"You had to be, if you didn't show you was strong, you wasn't strong, they would mess over you them neighbors. Especially when we moved in the projects, when we moved in the projects it was kind of rough for us."},{"speaker":"Marcus","time":"00:02:11-3","content":"Which project?"},{"speaker":"Ernest","time":"00:02:13-4","content":"St. Thomas, Irish Channel, up there."},{"speaker":"Marcus","time":"00:02:13-9","content":"It doesn't exist anymore"},{"speaker":"Ernest","time":"00:02:13-7","content":"Right it don't exist no more, right. I got pictures of it, every time they was tearing it down I got pictures of that project."},{"speaker":"Marcus","time":"00:02:27-0","content":"For the most part do you think that there were adults, I know your grandmother you said you were close to, do you feel like there were adults who took an interest in you and cared for you coming up?"},{"speaker":"Ernest","time":"00:02:38-6","content":"Well my momma and my grandmother, they cared for me. I could go to them with anything, any problems I had. They really cared."},{"speaker":"Marcus","time":"00:02:42-1","content":"Were there men in your mom's life or men in your grandmother's life that you came into contact with?"},{"speaker":"Ernest","time":"00:02:57-1","content":"Well my mother's life have a man, which I had a step-dad he stayed with my mom. And he was like my dad, he took care of me like my dad would have take care of me."},{"speaker":"Marcus","time":"00:03:08-1","content":"Would you, were you mistreated as a child?"},{"speaker":"Ernest","time":"00:03:17-4","content":"Never, not by family no."},{"speaker":"Marcus","time":"00:03:20-8","content":"It was just the other guys in the neighborhood?"},{"speaker":"Ernest","time":"00:03:27-8","content":"Guys in the neighborhoods yeah."},{"speaker":"Marcus","time":"00:03:29-3","content":"So try to take me back there to see so I can get a sense of what it was like. So if I was standing right outside the door of your house, looking out, what would I smell and hear and see? What would it look like, like maybe when you were a teenager?"},{"speaker":"Ernest","time":"00:03:47-5","content":"Well smell, somebody's always cooking, you'll smell some food being cooked. And you'll probably see a happy family. I came from a good family. Me and my sister, brothers, and all us, we all, we got along well."},{"speaker":"Ernest","time":"00:03:47-5","content":"We would look out for each other. And you would hear a lot of joyful stuff. We got along, you write about a family, you going to hear a lot of good stuff. But we got along real well coming up."},{"speaker":"Marcus","time":"00:04:17-4","content":"What about looking outside?"},{"speaker":"Ernest","time":"00:04:18-4","content":"Outside? Well outside, it was trouble outside. Once you come outside it was trouble. Like we had always stayed in the projects, my momma kids when we stayed outside the projects, we were good kids. Whatever you told us, he told us, to do, we would do. But once we move out from out the house into the projects, oh it was rough. Well it look like we changed it the projects change you."},{"speaker":"Ernest","time":"00:04:18-4","content":"People might not admit that but the projects change you. You become a different person because you in a different atmosphere and that's the way you have to live in that atmosphere."},{"speaker":"Marcus","time":"00:05:01-4","content":"Would you say it's the same for boys as it is for girls?"},{"speaker":"Ernest","time":"00:05:04-0","content":"The same?"},{"speaker":"Marcus","time":"00:05:06-0","content":"In the same way when you move the whole family?"},{"speaker":"Ernest","time":"00:05:07-9","content":"No, it wasn't the same way for girls. It wasn't. It was just like for boys, it was that way for girls. Girls could get around and stuff that kind of stuff."},{"speaker":"Marcus","time":"00:05:21-1","content":"So tell me about your closest friends."},{"speaker":"Ernest","time":"00:05:23-3","content":"Well when I was a kid coming up my closest friend was me and a white guy. We was, named David, we was real close. Me and him had like we had little paper routes. We used to do our little paper routes together. And anywhere his mother would take him, she would make sure he go asked my mother and find out could I go with them. I used to go everywhere they went. And that was my best friend."},{"speaker":"Ernest","time":"00:05:23-3","content":"When I started going to prison we kind of like start separating, they went their way, I went my way. Because I went to reform school like in the early 80s and that kind of like separated it, whole lot of separating between me, and him, because he wasn't in this thing."},{"speaker":"Ernest","time":"00:05:23-3","content":"I don't think he ever got in any trouble. I know he hadn't got in trouble when I had knew him. When I stopped, when I stopped seeing him I don't know have he ever got into trouble because I haven't heard from him in a long time."},{"speaker":"Marcus","time":"00:06:24-5","content":"What was it that got you into reform school?"},{"speaker":"Ernest","time":"00:06:28-1","content":"I went to reform school for, remember the fighting? When I was in the 6th grade, I got into another fight in the 6th grade and I went to reform school for that."},{"speaker":"Marcus","time":"00:06:37-1","content":"And you stayed in that reform school until how old?"},{"speaker":"Ernest","time":"00:06:39-9","content":"Oh you only stay there, I stayed there like 6 months, 7 months something like that. It's at that place where they got the women there right now."},{"speaker":"Marcus","time":"00:06:49-9","content":"Okay. So what was the highest grade of school that you completed?"},{"speaker":"Ernest","time":"00:06:55-3","content":"9th grade."},{"speaker":"Marcus","time":"00:07:00-2","content":"Since you've been at Angola, I assume you've had more education"},{"speaker":"Ernest","time":"00:07:04-7","content":"Yeah I got my GED."},{"speaker":"Marcus","time":"00:07:09-4","content":"Do you have any children?"},{"speaker":"Ernest","time":"00:07:10-5","content":"Two."},{"speaker":"Marcus","time":"00:07:11-9","content":"Tell me about them."},{"speaker":"Ernest","time":"00:07:13-8","content":"Well I got two sons. They all they come here like twice a month to visit since they been old enough. And when I left the street, both of my kids they was real young. One of them was just born, the other one was like about maybe 11 months or 12 months, maybe just made a year old."},{"speaker":"Ernest","time":"00:07:13-8","content":"And since they grew they momma always brought them here to visit me. Which they momma been coming to visit me since I been in prisons. She never gave up on me, she still come today, to this day."},{"speaker":"Marcus","time":"00:07:45-7","content":"That's remarkable."},{"speaker":"Ernest","time":"00:07:48-6","content":"Yeah Calvin knows her. She never miss a rodeo, she come to every rodeo, she come to visit twice a month."},{"speaker":"Marcus","time":"00:07:54-7","content":"From New Orleans?"},{"speaker":"Ernest","time":"00:07:57-9","content":"Yes?"},{"speaker":"Marcus","time":"00:07:59-6","content":"From New Orleans?"},{"speaker":"Ernest","time":"00:08:01-4","content":"From New Orleans."},{"speaker":"Marcus","time":"00:08:02-7","content":"That's a long drive."},{"speaker":"Ernest","time":"00:08:04-5","content":"Yeah. Oh I get visit my family, she come, my brothers, they all come, they come twice a month and visit."},{"speaker":"Marcus","time":"00:08:12-3","content":"Well then I think you're luckier than most people then. After 39 years people stop visiting. Do you remember the first time you got arrested?"},{"speaker":"Ernest","time":"00:08:25-3","content":"The first time I got arrested had to been, what had to been 6th grade, when I went to reform that first time. Had to been, that's about 11 years old, I had to been about 11 years old then."},{"speaker":"Marcus","time":"00:08:37-2","content":"Were drugs or alcohol a big part of your life?"},{"speaker":"Ernest","time":"00:08:45-4","content":"Well alcohol never been a part of my life cause I, I don't drink. To this day I never drunk. But I have used marijuana when coming up. I never used no hard drugs because drugs never was, never was my thing drugs. I used marijuana occasionally but since I been in prison I haven't used drugs, I don't even care for drugs today."},{"speaker":"Marcus","time":"00:09:08-1","content":"Well one of the reasons that we wanted to talk to you and learn about your experience is that you're one of several people who've been identified as trusted members of the community, who have really turned their lives around, and maybe should have a second chance."},{"speaker":"Marcus","time":"00:09:08-1","content":"But I want to take you back to that person that was driven through those front gates there. You were a little older then because you had spent some time in parish prison. How old were you when you came to Angola?"},{"speaker":"Ernest","time":"00:09:44-5","content":"When I came here I stayed in the parish like about 4 years so I had to be 23 when I got here."},{"speaker":"Marcus","time":"00:09:49-9","content":"Why don't you describe that person for me?"},{"speaker":"Ernest","time":"00:09:52-5","content":"Well that person that was, man. I was something then, I wasn't a good person, I ain't going to say I'm because improving you in prison. Prison make you have to be the way you live to survive in prison. You have to be a certain way."},{"speaker":"Ernest","time":"00:09:52-5","content":"But I wasn't a person that would initiate anything. I would give you your space and I be wanting my space. Once you come in my world and I think you're violating, then I'm going to be that person you got to be. But today all that that done wore out on me."},{"speaker":"Ernest","time":"00:09:52-5","content":"I'm not that person today because as you get as you age stuff like that you don't even want to participate in that no more. I'm like if I see a person doing wrong over here and I might be standing there, I'm going to walk off, I just walk off because I don't want to be around that no more. That part of my life is over with."},{"speaker":"Marcus","time":"00:10:59-4","content":"So you obviously, nobody stays the same for 39 years. If you think back to that person, that 23-year-old, and now you're, you're older, what advice would you give that person?"},{"speaker":"Ernest","time":"00:11:18-0","content":"What advice I would give, I would give that person advice that I would try to see that he don't make the same mistakes that I made that helped me, to land me to be right here in this here place here."},{"speaker":"Ernest","time":"00:11:18-0","content":"Because what I experiencing to me it just, it would just waste of your life. It would, in my eyes it was a waste of my life. I waste all my 20s, 30s, 40s, and I'm in my 50s, that's a waste of life for something that could have been avoided."},{"speaker":"Marcus","time":"00:11:52-3","content":"You were convicted of second-degree murder. That's not the whole story."},{"speaker":"Ernest","time":"00:11:56-4","content":"Well like I convicted of second degree murder, it was kind of, if I had knew the law back then what I know now, I would never been convicted of no second-degree murder, I didn't kill nobody. When I was young and I was told that to be charged with second-degree murder, then you had to kill somebody. If you didn't kill nobody I shouldn't have been charged with no second-degree murder."},{"speaker":"Ernest","time":"00:11:56-4","content":"And a principal, being a principal of second-degree murder, there should be a sentencing guideline with principal. Because if I'm a principal of a crime that mean I didn't actually do the crime. So I should be sentenced under different sentencing guidelines."},{"speaker":"Marcus","time":"00:12:46-9","content":"You have the same sentence as the person who did commit the crime, did commit the murder?"},{"speaker":"Ernest","time":"00:12:55-4","content":"Yes I do, the same sentence. We both have like, the only difference was he was convicted of first-degree murder and I was convicted of second-degree murder but once you sentence a person of first-degree murder, sentence a person of second-degree murder, it's the same sentence. Because there's no out on either one there's no parole eligibility on either one. Life is life in the state of Louisiana."},{"speaker":"Marcus","time":"00:13:19-8","content":"Can you tell me what it's like, I think it's almost inconceivable to me to think about spending as many years as you have here, but can you tell me in general what is it, what does it mean to have a life sentence without parole?"},{"speaker":"Ernest","time":"00:13:40-3","content":"Well it means that for years and years it was like there was no out, you had no hope. You didn't see no way of getting out of here. You could go to law library and you can study and try to find laws that would help you to get out of here but then after years of coming, they kill that when they come out."},{"speaker":"Ernest","time":"00:13:40-3","content":"There was no out for them, you just like hope as you didn't really care about nothing. If you ain't getting out of prison what sense, what you going to have to care about? You care about nothing. You didn't care about getting wrote up, you didn't care about this. You didn't care about nothing. Life mean life that means no getting out."},{"speaker":"Marcus","time":"00:14:32-2","content":"The Supreme Court's ruling for juveniles has made some of them eligible after 25 years, and you were a juvenile. You were 19, but had it happened a few months earlier you would be in a completely different position."},{"speaker":"Ernest","time":"00:14:55-5","content":"Well me and my, even at 19 years old I think some people don't at 19 years old still haven't grew up. 19 to me is no different than 17 years old. Because you could still have the same frame of mind at 19 or 17 year or a 16-year-old have."},{"speaker":"Ernest","time":"00:14:55-5","content":"Since I been here educations, if you ain't got education at 19 and you ain't got it at 17, you still you got the same frame, mind frame, the same mind frame."},{"speaker":"Marcus","time":"00:15:39-0","content":"So I think that what you were describing to me earlier on is that you sort of aged out of that. When you were saying that you came here, you were fighting, and you're a different person and you just don't have time for that anymore."},{"speaker":"Marcus","time":"00:15:39-0","content":"And that's generally what you also see outside with criminal offending, right. Criminal offending peaks in the late teens and it just declines through the life course."},{"speaker":"Ernest","time":"00:15:59-2","content":"You get, see you take, you outgrow that stuff, and you just don't care for it no more. Like me, I don't like now I mostly I read I sit down in my bed I'm going to read something. I'm going to go watch the news and I just like even TV I don't even care like a lot of guys like watching movies. And I don't care for all that kind of stuff no more."},{"speaker":"Ernest","time":"00:15:59-2","content":"All I want to do is get out of prison. I'm trying everything to get out of here and I read a lot. I look at the news and watch what's going on. I try to keep up with what's going on in the world out there because one day I'm almost certain I'm going to make it out there one day. I always tell guys here that if we live long enough, we going to make it out of here."},{"speaker":"Ernest","time":"00:15:59-2","content":"Some of my good friends I always think about this now, some of my good friends here, they didn't live here to see this here day. I'm like one especially my ten slim I always think about him because he was a good guy and I thought he should make it out, like I'm going to make it out here. And some of them didn't live to make it to see this here day."},{"speaker":"Ernest","time":"00:15:59-2","content":"It's the best government we had and they doing a lot of things to help us that's been in here incarcerated a long time to get out of here."},{"speaker":"Marcus","time":"00:17:20-1","content":"How do you envision your life when you do leave here?"},{"speaker":"Ernest","time":"00:17:26-3","content":"When I leave here, I'm gone, I got a lot of things I got to do, especially getting to know my, I got 32 nieces and nephews since I been in prison and I got to do a lot of things to get to know them and do a lot things with them."},{"speaker":"Ernest","time":"00:17:26-3","content":"I'm going to get me a job and I'm going to spend time with my family, spend time with my nieces, nephews and my grandkids. I got 5 grandkids now, you and I'm going to still spend a lot of time with them. But I know one thing, once I walk across that door, I never come back Angola as an inmate. I might come back here to visit some guys here in jail, but I'll never be an inmate again."},{"speaker":"Marcus","time":"00:18:17-2","content":"Do you have, what kinds of certifications that you've gotten over the years from the programs?"},{"speaker":"Ernest","time":"00:18:26-4","content":"Yes."},{"speaker":"Marcus","time":"00:18:27-5","content":"What kind of job could you see yourself doing?"},{"speaker":"Ernest","time":"00:18:29-5","content":"What kind of job? Well for years here, I graduated out of meat cutting school then cooking school here. For years I was the butcher here. I stayed the butcher for about 20 years, I just gave that job up last year, for a job cleaning, I clean buses now."},{"speaker":"Ernest","time":"00:18:29-5","content":"That's what I do now and I took that job only because it is a one day a week job. And I think I had put in, I done put in enough work all them years that I been here. It's time for me to get me a job that's just one day a week. Because it give me time enough to do other things I need to do."},{"speaker":"Marcus","time":"00:19:06-5","content":"So what kind of job do you envision doing?"},{"speaker":"Ernest","time":"00:19:09-7","content":"On the street?"},{"speaker":"Marcus","time":"00:19:10-9","content":"On the street"},{"speaker":"Ernest","time":"00:19:12-3","content":"Well on the street I was going to my brother have a company, my little brother, he lay carpet, he do people floors, he lay carpet on the floors, he do the walls, and he do the roof. And that's the job I was going to be, I'm going to be working with him when I get out."},{"speaker":"Marcus","time":"00:19:27-5","content":"Okay. What do you, what are you most proud of?"},{"speaker":"Ernest","time":"00:19:31-3","content":"Well I'm most proud of that I changed, I'm a changed person today. That's the most thing I'm proud of, because proud that I changed because to change, you have to want to change. And I wanted to change, I didn't want to be the same person that I was back then."},{"speaker":"Ernest","time":"00:19:31-3","content":"The person I am now a person you could feel safer being around me. I'm not going to be no, you won't have a problem with me. Before, back then I wouldn't walk away from something. Right now I walk away. I'm proud of myself for being that person today."},{"speaker":"Marcus","time":"00:20:17-1","content":"So I thought I'd ask you this too. I know you were principal to it and I think there's a difference. But when you look back on the crime you were involved with, and the victims, and the effect it's had on you and your family, how do you feel about it? It's 39 years later, I mean is that something you can even think about anymore?"},{"speaker":"Ernest","time":"00:20:48-5","content":"Well I know I think about my crime every day. I thought about mine I don't there's been a day passed yet I didn't think about the crime I committed. And for the victims, like I said just last month I was sorry that a person lost their life. In my life coming up I might have did wrong but I ain't never killed nobody, it take, for me back then, it takes a hell of a person, they take a gun and really shoot an innocent person."},{"speaker":"Ernest","time":"00:20:48-5","content":"And that just wasn't me. I ain't, you have to do me something for me to do something like that. You had to really do something serious. It couldn't be no nothing."},{"speaker":"Ernest","time":"00:20:48-5","content":"Some things you could just to let go but it had to be something really serious for me to take your life. It had to be my life or yours. Something like that but I wouldn't just kill nobody. That wasn't my thing. Because I valued human life back then and I value human being life today."},{"speaker":"Marcus","time":"00:21:54-5","content":"Can you tell me a little bit about the changes that have happened at Angola? There aren't that many folks who have seen it for four decades."},{"speaker":"Ernest","time":"00:22:03-3","content":"The changes, well now from back then when I first come in, when I first come here, they had killing at Angola, shit, just about every month. Today Angola is safer today, it's safer. You can go, they got, and you got women working in the dormitories today. Back then you wouldn't have women working in no dormitories. Women work in the dormitory, they walk down the wall, and it's safe. It's safer now at Angola than it ever been."},{"speaker":"Marcus","time":"00:22:42-8","content":"Are all the camps safe?"},{"speaker":"Ernest","time":"00:22:44-8","content":"Everywhere, the whole prison is safe today. Angola is not the place that a lot of people think it is. You have to come here to really see. You could walk, you could leave right out here right now walk straight down the walk and no one would bother you. And you have to come here to see that. A lot of people out there, they've heard stories about Angola, this and that there, but Angola's not like people think it is."},{"speaker":"Marcus","time":"00:23:14-5","content":"But it used to be"},{"speaker":"Ernest","time":"00:23:16-7","content":"Right like it used to be. Anyway today you got the rodeo. We go, we have all these people come to the rodeo, all us that's out there are lifers. All those up in there, kill, murderers, only ones that they probably don't have out on the rodeo grounds is guys that rape charge because when Jindal was in office he killed I mean he didn't want them on the rodeo grounds."},{"speaker":"Ernest","time":"00:23:16-7","content":"But everybody's out there is lifers and I'm saying you got all these people that's come, I'm talking thousands of people that's come from the street and they make them right there with us. And they have no incidents out there. So it got to be safe."},{"speaker":"Marcus","time":"00:23:53-1","content":"I feel safe. I always have felt safe. Are there some organizations that you're part of here?"},{"speaker":"Ernest","time":"00:24:03-6","content":"Well I don't get too much get off into the club stuff here. I ain't ever been a person, I don't too much care, and I don't too much care for those clubs. That's just me, I think clubs just wasn't my thing."},{"speaker":"Ernest","time":"00:24:03-6","content":"One of my things, if it was somewhere a club was helping me getting out, I'd be a part of it. I'm trying, all I been for 30 something years is trying to get out of prison. If it wasn't nothing that was trying to help me get out of prison, I wouldn't try to be a part of it. If it was something helping me to get out of prison or could help me get out of prison, I would try to be a part of it."},{"speaker":"Marcus","time":"00:24:45-4","content":"So let me ask you a little bit about that change you made, you're talk about changed, being a changed man. Sometimes that happens gradually you just kind of, you just figure it out. Other times that transformation that happens is, can be because of a specific thing you can point to like a specific event or person, some experience you had that kind of turns a light bulb on. How was it for you?"},{"speaker":"Ernest","time":"00:25:14-9","content":"Well, I was like, I had to change really my family, my son mother, these people been with me all these years and I was like Ernest, you got to change man. I'm saying the people they stuck with you for 30 something years and you can't get out of here and go do the same thing and thinking these people going to be there for you all them years again. They stuck with me, really my family helped me."},{"speaker":"Ernest","time":"00:25:14-9","content":"See when you got your family coming here, like I had my family coming here, it helps you. It helps you do this here time in here. It makes it makes your time much easier. It made mine much easier. Although you're still here but it's easier. It help you mentally and that was a big help for me."},{"speaker":"Marcus","time":"00:26:14-1","content":"So how far into your sentence do you think you just kind of, all right I'm going to do something different. How far into your sentence did that happen?"},{"speaker":"Ernest","time":"00:26:26-1","content":"Oh how far, ooh man, it's shit, I would far as go about 20 something years ago, I had to like I say from the day I come to Angola to now, I'm always trying to get out. I'm always trying, that's been my thing since I been in prison, getting out, getting out of here. That's been my biggest focus."},{"speaker":"Marcus","time":"00:26:51-6","content":"Right, and what do you see those things as being? When you say \"I'll do anything to help me get out.\" What does that include?"},{"speaker":"Ernest","time":"00:27:02-5","content":"Well that includes if I have to change or I have to get into programs and stuff like that, then I would have to do that. I get in certain programs, like right now I'm still in certain, I still do like CPR, I still go to CPR class. I'm in an anger management class. I just got out of 100 hour classes."},{"speaker":"Ernest","time":"00:27:02-5","content":"I participate in programs, it's just that I just don't want to be like a member of no clubs, I ain't no member of them clubs. I don't, I participate in they programs and get the certificates that I can get but being a member, no. I ain't, I didn't want to be a part of that."},{"speaker":"Marcus","time":"00:27:49-3","content":"When you were on the parole, when you came up for the pardon board last month, what did they ask you?"},{"speaker":"Ernest","time":"00:28:06-4","content":"Well I didn't have a serious adult record but I have an extensive juvenile record. The most things that they did is brought up they ask me questions about juvenile stuff. And when I was a juvenile I did, I had a battery charge on a police officer here, I had a battery charge this year on a police officer, I had three battery charges on police officers three times."},{"speaker":"Ernest","time":"00:28:06-4","content":"And that was as a juvenile, they questioned me about those things there. And that was about all they could really question me about because I didn't, my adult, I been here so I don't have no record."},{"speaker":"Marcus","time":"00:28:50-5","content":"But did they ask you about your life here and what you've done at Angola?"},{"speaker":"Ernest","time":"00:28:55-5","content":"Well I had did a, they had my, I had sent them everything I did here. And they didn't question me about because they had all of it like sitting right in front of them, because I sent five copies, each person that was sitting on the board, they had a copy of it. And it had everything that's sitting right there, they didn't ask too many questions about that."},{"speaker":"Ernest","time":"00:28:55-5","content":"All they was like that I need to be in an anger management class because of my juvenile. I'm like my juvenile? I'm saying I'm way past juvenile. But I didn't tell them that because you know. And that's why, I'm just getting back and I've been in anger management class but I've got to get back in anger management class. They want me to be in anger management class for the people that teach anger management come here from LSU. And they want me in that kind, that class."},{"speaker":"Marcus","time":"00:29:46-5","content":"So you're going to do it"},{"speaker":"Ernest","time":"00:29:49-5","content":"Oh I'm going to. I been signing the papers to get in that class already. They said I'm supposed to get in it next week, and I'm just waiting."},{"speaker":"Marcus","time":"00:29:57-7","content":"So I think that there's a strange thing that happens where the folks who serve the longest time and have the longest sentences tend to have an easier time turning their lives around than the ones that come here for short sentences."},{"speaker":"Ernest","time":"00:30:16-8","content":"Right"},{"speaker":"Marcus","time":"00:30:21-1","content":"Why do you think that is?"},{"speaker":"Ernest","time":"00:30:24-8","content":"Well because when you come here with a short sentence, you don't really, you know that you're going home for one thing. And you don't get a chance to really see the big picture here, the big picture. And they don't get a chance to experience some of the things that people experience that have longer sentences."},{"speaker":"Ernest","time":"00:30:24-8","content":"See when you come here with a short sentence, in your mind already I'm going home. When you come here with a life sentence, in your mind, you already know you don't see no out. And you got to try to figure it out. And it's a big difference. The frame of mind you're in."},{"speaker":"Marcus","time":"00:31:04-6","content":"What do you think prison administrators could do to help people turn their lives around in a short period of time?"},{"speaker":"Ernest","time":"00:31:20-9","content":"Well prison you see I'm going to say at Angola, see if you want to change or want to turn your life around, you can. But you got to want to do it. If you don't, if it ain't in your mind or in your heart to want to do that, it ain't going to happen. You got to want to do that and you can change here."},{"speaker":"Ernest","time":"00:31:20-9","content":"Angola has a lot of programs that you can, you can get into and you can better yourself here but you have to want to do that."},{"speaker":"Marcus","time":"00:31:46-8","content":"What do you think prison administrators could do to help that?"},{"speaker":"Ernest","time":"00:31:51-8","content":"Can do to help that? I don't know."},{"speaker":"Marcus","time":"00:31:55-3","content":"It's got to be something in the person"},{"speaker":"Ernest","time":"00:32:00-7","content":"Yeah."},{"speaker":"Marcus","time":"00:32:02-9","content":"Okay. Is there something that you think a project like this should be asking that I didn't ask? Is there something you want me to ask that I didn't ask or something you want to tell me that you think is important about this that I didn't, that we didn't talk about?"},{"speaker":"Ernest","time":"00:32:29-1","content":"Well legislators need to, people need to get legislators here. And let them see for themselves that they got a lot of people here in Angola that deserve a second chance, that people done reached the age now where they can go back into society and there's not going to be no problem in society."},{"speaker":"Ernest","time":"00:32:29-1","content":"Because they got a lot of guys I know I'm one of guys and they got a lot of them that's still that's down that walk that can go back out there and be productive citizens out there and not get in no trouble."},{"speaker":"Marcus","time":"00:33:07-6","content":"Well thank you very much for you time."},{"speaker":"Ernest","time":"00:33:09-5","content":"Thank you for coming."}]}