{"name":"","transcript":[{"content":"Everett Offray Transcription REDACTIONS FINAL"},{"content":"Anika Ellis"},{"content":"Transcription for Everett Offray"},{"speaker":"Resp:Everett","time":"00:00:00-0","content":"My name is Everett Offray. I've been convicted of second degree jail. I got sent to jail when I was 18 years old and I'm now 41 years old. I've been here 23 years."},{"speaker":"Intvr:Marcus","time":"00:00:13-9","content":"Interviewer: I'm going to by asking you a few questions about your life growing up here in New Orleans. Can you start by telling me a little bit about your family and the folks who were close to you who, who raised you?"},{"speaker":"Resp:Everett","time":"00:00:26-3","content":"Offray Well my mother raised me. My mother has 7 children and all of us grew up in a house together. We were raised in the projects, in the Florida projects, in the 9th ward in New Orleans. My mother was a single-parent, she raised me. I saw my dad occasionally, but he didn't live with us."},{"speaker":"Intvr:Marcus","time":"00:00:45-4","content":"Interviewer: Were there men in your mother's life that you came in contact with?"},{"speaker":"Resp:Everett","time":"00:00:49-9","content":"Offray Not in a fatherly kind of fashion. You know… I saw them coming, and going but we never had no relationship on the father other than in that extent."},{"speaker":"Intvr:Marcus","time":"00:00:59-5","content":"Interviewer: Was there a lot of fighting in the house?"},{"speaker":"Resp:Everett","time":"00:01:04-3","content":"Offray Not in the house. Mom bickered a lot. But as far as us fist fighting, not in the house. We never did that in the house."},{"speaker":"Intvr:Marcus","time":"00:01:14-4","content":"Interviewer: Do you think it's accurate to say that you came up in a loving, caring home?"},{"speaker":"Resp:Everett","time":"00:01:20-7","content":"Offray Yes. Of course. Of course, I did."},{"speaker":"Intvr:Marcus","time":"00:01:28-2","content":"Interviewer: Are in touch with any of your siblings or your mother?"},{"speaker":"Resp:Everett","time":"00:01:29-7","content":"Offray All of them. My mom, my brother. My dad, he passed. He's the only one that passed. But I'm in constant contact with the rest of them."},{"speaker":"Intvr:Marcus","time":"00:01:38-4","content":"I'm familiar with where you grew up. But 25 years ago… it was probably different. If I was standing outside your door, looking out into in your the neighborhood, what would I see and hear?"},{"speaker":"Resp:Everett","time":"00:02:03-0","content":"You'd probably see people passing through. You're going to gon hear a lot of gun shots, fighting, arguing, fussing, kids playing right, there… a lot of different things you'd probably see standing on my porch during thenthat time."},{"speaker":"Intvr:Marcus","time":"00:02:21-8","content":"Do you have any specific memories of school?"},{"speaker":"Resp:Everett","time":"00:02:26-9","content":"I always enjoyed going to school from elementary to high school. I really enjoyed going to sSchool. wasSchool was always easy for me, it was never hard. It's seems like it just came natural. Learning things was just came natural. I... I never had a hard time in at school."},{"speaker":"Intvr:Marcus","time":"00:02:49-6","content":"Did you finish school?"},{"speaker":"Resp:Everett","time":"00:02:51-7","content":"No, I got incarcerated before I could finish school. I was in the 12th grade when I got incarcerated. I was supposed to graduate that year but then I got incarcerated. I was going to start back at school but I was already incarcerated prior to school started."},{"speaker":"Intvr:Marcus","time":"00:03:16-1","content":"What about best friends? Did you have any close friends you came up with?"},{"speaker":"Resp:Everett","time":"00:03:20-7","content":"Well bBeing raised in the project, I had several guys my age. I only had like one person who I actually hung out with, but a group of us would hang out on different levels —from going to school and being together so much through theall day it was like, . They go bybeing at my house, I go by their house, different houses. It was like a whole group of us."},{"speaker":"Intvr:Marcus","time":"00:03:49-9","content":"Did any of them end up getting in trouble?"},{"speaker":"Resp:Everett","time":"00:03:53-2","content":"For the most part, they got in trouble, but not enough trouble to be in here. Because now, almost all the guys I grew up with, they are working or have some business of their own.that they own or something like that. They probably might have a few brush-ins with the law but it got them together, got them' right real fast."},{"speaker":"Intvr:Marcus","time":"00:04:23-5","content":"Do you remember the first time you were arrested?"},{"speaker":"Resp:Everett","time":"00:04:27-3","content":"Of course, I do. I was 17. I was arrested the first time, I was arrest for murder when I was 17. I was instayed in jail for two months then I was released."},{"speaker":"Intvr:Marcus","time":"00:04:39-8","content":"In OPP?"},{"speaker":"Resp:Everett","time":"00:04:43-1","content":"Yeah. I was in Orleans the Old Parish Prison."},{"speaker":"Intvr:Marcus","time":"00:04:51-9","content":"Did you ever get kicked out of school?"},{"speaker":"Resp:Everett","time":"00:04:54-0","content":"Yeah, I got kicked out of school twice. I got kicked out of school, iIn the 7th grade"},{"speaker":"Resp:Everett","time":"00:04:54-0","content":"5:00"},{"speaker":"Resp:Everett","time":"00:04:54-0","content":"I had got expelled from school for fighting, but then ...I went to, …they sent me to another school and then I ended up going back to the same school. Then in high school, in the 10th grade, no... 11th grade, then in an eggshellI got kicked out of school, but went to another school and ended up going back to the same school."},{"speaker":"Intvr:Marcus","time":"00:05:26-9","content":"Do you have any children?"},{"speaker":"Resp:Everett","time":"00:05:28-6","content":"I have one kid, my son. My son is about to make 23, he makes 23, August, in August 26th, that's when he makes 23. We have communication. We have constant communication. We have a pretty good relationship."},{"speaker":"Intvr:Marcus","time":"00:05:48-9","content":"What's his name?"},{"speaker":"Resp:Everett","time":"00:05:50-1","content":"His name is EdwardEverett. We have the same name."},{"speaker":"Intvr:Marcus","time":"00:05:51-4","content":"Besides the crime you've been convicted, is it accurate to say that you just headed down the wrong road?"},{"speaker":"Resp:Everett","time":"00:06:08-7","content":"Yeah, it's accurate to say. It's accurate, it's accurate. Knowing now, as oppose to then, I believe it's kind of more like the environment and the association circle. I'm not going to say for everybody, but for the majority of the guys that I know, it's kind of like, ; it's what they were around that kind of had an influence ond them where they are today, today or where they ended up today. being."},{"speaker":"Resp:Everett","time":"00:06:08-7","content":"JJust being around because like I say, … I was raised in the projects."},{"speaker":"Resp:Everett","time":"00:06:08-7","content":"There was a bunch of negativity in the projects so it was so easy to go down to the wrong path. in the projects. It was like the norm, to do these things, which I later grew to knowo learn was abnormal really but it was just the norm at during thosethe times, to do this or do that. It's just what it was."},{"speaker":"Intvr:Marcus","time":"00:06:58-8","content":"Were you mistreated as a child at all?"},{"speaker":"Resp:Everett","time":"00:07:08-7","content":"No, no. I can't say that."},{"speaker":"Intvr:Marcus","time":"00:07:11-9","content":"Ass you know, one of the reasons we wanted to talk to you is that you had more than 20 years to prove yourself as a very trusted member in this community and held in higher regard as inmate counsel. And I'm going to talk to you a little bit about your life now, but if you can take me back to the Everett Offray that came through the gates of Angola and describe that person for me."},{"speaker":"Resp:Everett","time":"00:07:51-0","content":"I was young. I was $$ in transition of finding myself, finding out who I was. I think that happened in the Parish prior to me coming, because I had a lot of time to think about things in the parish, that I never thought about before so I was kind of in a transition in that time."},{"speaker":"Resp:Everett","time":"00:07:51-0","content":"And when I came to this prison, they had some guys in here prior to coming here from the neighborhood and I kind of saw them and saw something was different about them on a positive time because I came into prison expecting one thing after hearing so many stories.,"},{"speaker":"Resp:Everett","time":"00:07:51-0","content":"So I came here expecting a lot of violence and foolishness, I was able to see different. I was seeing guys, I was always inquisitive, I was asking the guys, howand how they start living like this and just started asking a lot of questions. That's kind of where I was then."},{"speaker":"Intvr:Marcus","time":"00:09:10-9","content":"So, you had already started thinking about making changes to your life in the Parish Prison?"},{"speaker":"Resp:Everett","time":"00:09:15-0","content":"Yes, yes, I did."},{"speaker":"Intvr:Marcus","time":"00:09:17-2","content":"How many years passed between when you were arrested and when you arrived in Angola?"},{"speaker":"Resp:Everett","time":"00:09:20-3","content":"I got arrested at 18 and arrived at Angola when I was 20. So, it was like a 2-year time frame. Like I said being in the Parish, I was exposed to a lot of different literature. And different kind of literature, just different kind, even reading the Bible and guys who has some understanding of the Bible and different things that I was being exposed to."},{"speaker":"Resp:Everett","time":"00:09:20-3","content":"—And I started seeing a world wider than the small world that I was accustomed to, it started to open my mind up for real and understand the things I'm reading and the things that I'm seeing. Watching the news, you know…"},{"speaker":"Resp:Everett","time":"00:09:20-3","content":"10:00m"},{"speaker":"Resp:Everett","time":"00:09:20-3","content":"My mind just started to open up more."},{"speaker":"Intvr:Marcus","time":"00:10:05-7","content":"What advice, if you could go back in time and visit the 20-year-old you, what advice would you give that person?"},{"speaker":"Resp:Everett","time":"00:10:17-5","content":"Always pay attention, to always listen. You want to pay attention, that's kind of the key things. I've noticed, not with myself, but with a lot of guys who I've encountered since I've been in prison, the mistakes came from things they just didn't know."},{"speaker":"Resp:Everett","time":"00:10:17-5","content":"A lot of people always say, had I known and that's kind of like a whole lot of people, had I known this, had I known that. I always give guys that advice, just pay attention man. And try to understand where you at, where you trying to go, and the things you need. I feel like everybody understands some of the things they need, like where they're lacking at, so that's kind of wow. like $$"},{"speaker":"Intvr:Marcus","time":"00:11:13-1","content":"So, you're clearly a different person, we're all different 23 years later. How are you different?"},{"speaker":"Resp:Everett","time":"00:11:23-5","content":"I'm different because now, I am more responsible for the decisions that I make. I can really make a decision, I'm a man now, as oppose to then, I was a kid. I was easily influenced by things I didn't know I was influenced by. But now as a man I'm responsible."},{"speaker":"Resp:Everett","time":"00:11:23-5","content":"I really understand that I'm responsible for all my actions, for the things I did… I can't blame nobody for the things I do, I have to take responsibility. So, every decision, I really have to think about it and the consequences of these decisions, not only for me but for who it is going to effect."},{"speaker":"Intvr:Marcus","time":"00:12:09-6","content":"What kinds of activities have you participated in over the years here in Angola, what organizations are you part of?"},{"speaker":"Resp:Everett","time":"00:12:16-7","content":"Oh, plenty. Malachi Dads, $$ Faith Based Program, $$ The Lifers Association.… We had a new development inside of the Lifers Association,… the Law Class... I've been teaching the Law class since Calvin left, so Law. So many different things. We had a class called Critical Thinking and Transaction Analysis that we taught for a long time to guys. Anything I can kind of do to help, I'm always for it."},{"speaker":"Intvr:Marcus","time":"00:13:00-4","content":"What was a typical day like for you when you first came here?"},{"speaker":"Resp:Everett","time":"00:13:04-2","content":"My first day was like really just trying to get adjusted to things because in the Parish you're really just isolated, unless you're going to court or to medical but in this environment, people are constantly coming and going and just getting adjusted. So, what's going on, the things that I need to do, or need to know to move forward, that's what the typical day was like then."},{"speaker":"Intvr:Marcus","time":"00:13:31-5","content":"And you're typical day now…?"},{"speaker":"Resp:Everett","time":"00:13:34-9","content":"And my typical day now... in the Law library …I'm like encounter, man there's no telling what I might encounter. I've learned that doing Law and having people come to you for things, they come to you for more than just the law. You have to listen, you have to do different things, so my days vary."},{"speaker":"Resp:Everett","time":"00:13:34-9","content":"There's no telling who I might encounter throughout the day and I'm kind of like really learning to listen to people, man, because most people just need someone to listen to them so now I just do a lot of listening and if I could give them advice, I do, if I can't then I'll let a brother know, like I really can't help you. I will try and send you somewhere where you can get some help —that's really kind of like my day now."},{"speaker":"Intvr:Marcus","time":"00:14:27-3","content":"Yeah, because people really want to tell their story."},{"speaker":"Resp:Everett","time":"00:14:34-3","content":"Yeah, yeah, I leaned that."},{"speaker":"Intvr:Marcus","time":"00:14:42-6","content":"Sometimes, a lot of people make positive changes because of people they meet. Their teachers, they read something, or they come to a gradual state and age into a wiser state. How's it happened for you?"},{"speaker":"Intvr:Marcus","time":"00:14:42-6","content":"15:00"},{"speaker":"Resp:Everett","time":"00:15:00-7","content":"I think my experiences with people, like $$ Calvin for instance. Calvin had a profound effect on me because some of the things he taught me and not by literally saying look bruh do this, but by showing me, and looking at his life, and seeing it and not just him, there were a lot of guys inside this prison Norris before he left. Jimmy, a lot of guys I've looked at their lives, and just asked them, \"Man what's your story, tell me your story,\" things like that because I always wanted to know what made people change. Like I said, I'm curious, I'm inquisitive. So I asked a lot of questions. A lot of guys may have done a lot of things that I read also. It was a lot of different things, it wasn't just one thing, but I can say Calvin for sure had a big influence on how I went about doing things."},{"speaker":"Intvr:Marcus","time":"00:16:07-5","content":"If you're able to get in front of a Parole//Pardon board, what do you want them to know about you?"},{"speaker":"Resp:Everett","time":"00:16:18-5","content":"I want them to know I'm a changed person, I'm not the person I was back then. And I want them to know that I can actually have an impact on society because my whole vision, the way I see it is this, like they say the children are the future and I believe the things you put inside of the children is how they're really going to turn out. So I really want to not only tell them my story but help them learn better and do better in any way I can. So I feel like I will be an asset in society to that degree right there."},{"speaker":"Intvr:Marcus","time":"00:17:02-7","content":"I want to talk a little bit about the reality about what it means to come to terms with the meaning of life without parole. How do you make sense of that?"},{"speaker":"Resp:Everett","time":"00:17:19-9","content":"I look at it, like, all right you say life but that's not what it means for me because I'm constantly trying to find something to help me regain my freedom, or put myself in a position to regain my freedom. So I never look at it like I'll never get it out of prison. I don't look at that way, just because they say it doesn't mean it's true because I have seen it happen before."},{"speaker":"Resp:Everett","time":"00:17:19-9","content":"I've got plenty examples in front of me of guys that were here has all kind of different crimes, and if you look at the crime, you will be like, all right, but then when you see the person and you see the things the person accomplished, then you will be like, oh all right. So that's the kind of mindset I have and I try to give dudes, it is not over for real just because somebody may have said it's over, that doesn't mean it is over. There's always a chance. There's always going to be a possibility for you, you're going to get out, so that's the way I look at it."},{"speaker":"Intvr:Marcus","time":"00:18:21-4","content":"Some people give up hope."},{"speaker":"Resp:Everett","time":"00:18:24-7","content":"Some people do, some people do. And I try to encourage guys to never be that person. And if you are that person, anything that I can do to help a person regain that hope, I try to do also. Like I did Calvin did mostly for me, led by example, show a brother man you never give up, because they got several examples, $$ that been cast away but then they came to prison and really find themselves, really show, this this is who I really am and I can overcome all kinds of obstacles. I feel like —if he can do it then I can do it also, you can do it, none of us are more special then the next … all of us are equal."},{"speaker":"Intvr:Marcus","time":"00:19:15-7","content":"So ... one of the things that we know is that there is an enormous amount of attention in criminal justice on the crime, the conviction, and the sentencing and then a person is sent to prison and the rest of that person's life is for the most part, invisible. So, we've got thousands of people serving life without parole, and its just kind of tucked away out here. What would you want people to know about life without parole here?"},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"Life without parole… here.…"},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"20:00"},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"I feel is something that shouldn't be, it shouldn't be life without parole because if you look at these guys, if you have a chance to encounter these guys, then you'd see their different. Saying life without parole and saying they have these many lifers but when you have the chance to encounter some of these guys, you'll wonder …wow… how this guy or these guys will never get out of prison because he's a changed man."},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"A lot of guys never cease to amaze me, this prison is running by guys like that… they help, and they not looking for nothing for that help, they help because they could help. You never know who you encounter, but they tell you the same thing, that's what they would want someone to do for me. And then look at that person, does that look like a cold, heartless person that never deserves to get out of prison."},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"I'm not saying that if a guy may have committed a crime, not saying anything is right about committing no crime… it's never right to commit a crime, there are consequences you have to pay, but do I have to pay my whole life or never get a chance to show society I'm a different person, I'm a changed man. I thought that mistakes happened in life, everybody makes them."},{"speaker":"Resp:Everett","time":"00:19:52-2","content":"So I don't get no chance to show that I regret that and I'm sorry for that and that this is who I am and this is what I can contribute for doing right here, no way making up for it but at the same time."},{"speaker":"Intvr:Marcus","time":"00:21:58-5","content":"So, we're in a state where a conviction of 2nd degree murder means you're sentenced to die in prison. You can also be a principal to 2nd degree murder and you're sentenced to die in prison. You can do the most Haynes thing imaginable and be sentenced to die in prison, there isn't much variation."},{"speaker":"Resp:Everett","time":"00:21:58-5","content":"They are all the same, no matter what you did. Out of the scenarios, we group them all the same. Being in the law librarian and dealing with the law, and reading cases from all over the United States. A lot of time I'll read cases and may read the facts and I may be like damn, this is what he did and this is where he got sentenced to."},{"speaker":"Resp:Everett","time":"00:21:58-5","content":"I can know that the guy maybe sleeping next to me might have just been in the car and something happened and he got more harsher time then this guy who actually. I be like I mean these brothers, may be glad they're not in Louisiana, they not commit no crimes like that in Louisiana because like you said… they don't differentiate between, they treat them all the same. It's not like that nowhere else, and it's kind of different and they seems to amaze me, and I'd be like damn."},{"speaker":"Intvr:Marcus","time":"00:23:33-1","content":"I feel the same way. So, you know there are good things that happen in prison. But it's also prison. What's the worst part about it for you?"},{"speaker":"Resp:Everett","time":"00:23:53-0","content":"Just being in prison generally that's the main thing. The fact about me being in prison I feel like there ain't nothing good about being in prison because I'm not free so everything that come with prison life, I kind of take it how it come because you got to look at it, it's a prison it's got rules and things that have to be done in prison and they're being done but in this prison, things are way more relaxed than in other prisons I've heard."},{"speaker":"Resp:Everett","time":"00:23:53-0","content":"And I've heard a lot of dudes talk about. But that's one of the things I like about it, it allows opportunities to better yourself but the individual kind of has to embrace that idea because the prison can seem all bad to somebody who doesn't want to embrace those kinds of things."},{"speaker":"Resp:Everett","time":"00:23:53-0","content":"25:00"},{"speaker":"Resp:Everett","time":"00:23:53-0","content":"I guess it's more about the person not really about the prison because the prison is a prison, it's a maximum security prison, you got life."},{"speaker":"Intvr:Marcus","time":"00:25:16-9","content":"What are proudest of in your life?"},{"speaker":"Resp:Everett","time":"00:25:27-2","content":"Me being able to give something back, not only to the younger guys that come to this prison but also to my family because I communicate with my family a lot and we talk a lot and me being able to talk to them about anything, there's no subject we can't talk about and me give them advice, and at the same time take advice, just being available to people, my people and the people that come to prison."},{"speaker":"Resp:Everett","time":"00:25:27-2","content":"Now there are lot of younger guys come to prison. You got guys who have been here 40 years. You got guys who just come here who wasn't even been born. So it's kind of like, when you're mixing those two types of people, there's a big gap. I'm like right in between them."},{"speaker":"Resp:Everett","time":"00:25:27-2","content":"A lot of times in the law library when those guys come to the law library, they will aim them at me, like go talk to him because now I can bridge the gap between this person and that person… just anything… anything I can give, being able to visit, be that person, being able understand that I can talk you and give you something, or give my opinion, be able give something, that's kind of the thing I'm the proudest of because I know at one time I wasn't that type of person."},{"speaker":"Intvr:Marcus","time":"00:26:56-3","content":"When you see 17, 18, and 19-year-olds come in with life sentences, do you think they understand?"},{"speaker":"Resp:Everett","time":"00:27:08-4","content":"I know they don't understand. I know they don't understand. I get a chance to encounter these guys and actually talk to them, —like do you understand the trouble you in, do you understand the situation and they don't understand. I always tell them they are in prison and they are responsible for themselves now and the have a lot to learn and they have to grow up real fast inside of this prison, because people are not interested in you being a kid or nothing like that."},{"speaker":"Resp:Everett","time":"00:27:08-4","content":"They're not interested on that. So you have to grow up real fast and you have to learn that you are not on the streets no more, your mamas not here, you're in prison for real. So you've got to grow up for real and start thinking about some things to better yourself and get yourself out of prison but I know a lot of these young guys don't understand, I didn't understand and I know they don't, just talking to them. And like I said, most guys are here because they didn't understand a whole lot of things, they just didn't know."},{"speaker":"Intvr:Marcus","time":"00:28:26-6","content":"I can only imagine that for an 18-year-old, a life sentence without parole, this must be an inconceivable idea, I don't know how you wrap your head around that."},{"speaker":"Resp:Everett","time":"00:28:39-2","content":"You really can't. You see because first you think, there's no way in the world that I'll be here for the rest of my life. Every guy that you meet will tell you, I'm going to get this life sentence back on appeal —that's the kind of thinking you have, because this is kind of like a new reality, and you're not trying to cope with that reality. Life without parole.… I'm not looking at saying that I'll probably never get out.… Off the dump I'm thinking that I'm going to get out… 2 years 3 years I'm going to get out."},{"speaker":"Resp:Everett","time":"00:28:39-2","content":"Then when the appeal process is over, you see a letdown and you're like man,… and someone tells, don't worry about it, we've got post-conviction. We're going to make something happen on post –conviction, and that kind of gives them a little more hope like how long you think I'm going to be one that. I don't think they digest the whole thing at one time. And be like, man I'm never getting out of prison. I don't think they approach it that way from talking to people talking to people. It's not looked upon that way."},{"speaker":"Intvr:Marcus","time":"00:29:55-6","content":"It's too much at one time."},{"speaker":"Everett","time":"00:29:58-1","content":"Thats a whole bunch."},{"speaker":"Marcus","time":"00:30:01-8","content":"It's too much at one time."},{"speaker":"Resp:Everett","time":"00:30:05-8","content":"Yeah, yeah."},{"speaker":"Resp:Everett","time":"00:30:05-8","content":"30:00"},{"speaker":"Resp:Everett","time":"00:30:05-8","content":"Sso, your mind Isis automatically going to process it's you can handle it. —It automatically happens. Yeah."},{"speaker":"Intvr:Marcus","time":"00:30:36-5","content":"So, is there something that I should've asked you that I didn't ask you? Something I didn't give you an opportunity to talk about? About you, your story, prison?"},{"speaker":"Resp:Everett","time":"00:30:44-0","content":"Not really, no. Not to me. You kind of touched everything in relation to what you came to touch."},{"speaker":"Intvr:Marcus","time":"00:30:44-0","content":"Thank you very much."},{"speaker":"Everett","time":"00:30:53-4","content":"Thank ya'll, I appreciate that. I appreciate this for sure. Thank you."}]}