{"name":"","transcript":[{"content":"Frank Green Transcription REDACTIONS FINAL"},{"speaker":"Frank","time":"00:00:00-0","content":"My name is Frank Green I'm 49 years old, I committed the crime of second degree murder in 1989. I've been incarcerated since I did 29 years, it'd be 30 years May 29th, 30 years I've been incarcerated."},{"speaker":"Marcus","time":"00:00:19-7","content":"Okay and how old were you when this happened?"},{"speaker":"Frank","time":"00:00:22-8","content":"19 going on 20 it happened in May 25th I made 20 in September the 20th."},{"speaker":"Marcus","time":"00:00:32-3","content":"So I'd like to learn about your life and I'm going to start by asking you some questions about your childhood and we'll just work from there. So could you start by telling me a little bit about the folks who raised you?"},{"speaker":"Frank","time":"00:00:48-3","content":"Growing up, at first it was my father, his name was Frank Green he's deceased now, and my mother Shirleen Taylor. She's still alive. I think at the age of 3 or 4 he wound up coming to prison. So we moved around from one project area to another one."},{"speaker":"Frank","time":"00:00:48-3","content":""},{"speaker":"Frank","time":"00:00:48-3","content":"My step daddy came into play at the age of 5 I believe he's still living I love and respect him now, but during those years it was kind of hard for me. I wouldn't say that he was a bad person or that my mother was bad, I just was I guess a kid so used to being with his father and then to hear that he's in prison. He is gone and you really don't know what it is with jail and not being able to see him and don't have that male bond that I guess I saw other kids have with their biological father, kind of made me I guess shy and rebel against certain things coming up."},{"speaker":"Marcus","time":"00:01:47-2","content":"Was this, where did you grow up."},{"speaker":"Frank","time":"00:01:51-0","content":"I grew up in New Orleans uptown area St. Thomas projects, we moved to the Magnolia, then moved again to Dupree Street."},{"speaker":"Marcus","time":"00:02:07-7","content":"So aside from your stepfather did your stepfather stay with your mother for a long time."},{"speaker":"Frank","time":"00:02:13-1","content":"Yeah they still together."},{"speaker":"Marcus","time":"00:02:09-6","content":"Okay great. So there weren't other men who came into your live because they came into your mother's life."},{"speaker":"Frank","time":"00:02:18-9","content":"No he was the only one."},{"speaker":"Marcus","time":"00:02:17-9","content":"What about siblings, do you have siblings?"},{"speaker":"Frank","time":"00:02:23-6","content":"Yeah I have two brothers and two sisters outside of that my dad I have a sister that died in 2010. I have a brother that I met I think two years ago here. He is up here. So I come to find out that I been knowing him since '98 and then to find out 2 years ago that you're my biological brother through my dad, it was kind of shocking."},{"speaker":"Marcus","time":"00:02:55-0","content":"Wow is he up here serving a life sentence."},{"speaker":"Frank","time":"00:02:59-7","content":"Yeah he has a life sentence too."},{"speaker":"Marcus","time":"00:03:03-2","content":"Where are you in the birth order? Where are you in the birth order of your siblings are you the oldest the youngest."},{"speaker":"Frank","time":"00:03:10-8","content":"No I'm the oldest boy."},{"speaker":"Marcus","time":"00:03:13-1","content":"You're the oldest boy."},{"speaker":"Frank","time":"00:03:13-1","content":"My sister Angela, she's the oldest, then me and my brother Mark he's 45 and my sister Shy I think she's 42, and my little brother the baby kid has 41 or 40."},{"speaker":"Marcus","time":"00:03:28-7","content":"So were you did your mother work outside the home?"},{"speaker":"Frank","time":"00:03:31-7","content":"Yeah she worked at the, it's kind of strange she worked at the New Orleans police department. She was a supervisor over the records and it was fun to know that until I started took a bad turn in my life man, how can I do this and know my mom worked but it was crazy."},{"speaker":"Marcus","time":"00:03:51-6","content":"What about your stepdad."},{"speaker":"Frank","time":"00:03:54-8","content":"He worked down on the Coal front. Coming up I think that the love that I had for my dad it kind of made me not want to accept him. I mean now I can look back on it and wish I would have cherished those days and times with him. Like some people just got to understand you're blessed to have your biological father that helped made you, but another man that's going to help raise you and I wasn't ready for that then."},{"speaker":"Marcus","time":"00:04:29-4","content":"Yeah sure well let me say this did you, for the most part when you look back did you feel that you were in a secure, nurturing, loving home or did you feel like you kind of had to make it on your own."},{"speaker":"Frank","time":"00:04:45-7","content":"I felt like, I know my mom loved me but the bad the constant run-ins with me and my stepfather I guess teenager years testosterone and we went to clashing, because I mean I'm not your child. I'm going to respect you. I'm not gone never call you dad because I only have one I'm going to call you Mr. Tony."},{"speaker":"Frank","time":"00:04:45-7","content":""},{"speaker":"Frank","time":"00:04:45-7","content":"And I wish I could go back and relive those times and give him that respect that he deserve. I wouldn't let him chastise my brother. Which I thought my sister my baby sister was his daughter but is really my dad. So I didn't want you to chastise them and we used to just clash. I mean got to a point to where at the age I think 14 it got so bad, he told my mom we had to choose. Two men couldn't live in the house."},{"speaker":"Frank","time":"00:04:45-7","content":"She was about to make that choice and I know it would really crush me and made me resent her in the long run I just told her no it's time for me to go. So I left at 14 and I been here and out on the streets since then."},{"speaker":"Marcus","time":"00:05:56-2","content":"Where did you go? Where did you put your head down?"},{"speaker":"Frank","time":"00:05:58-6","content":"I wound up going to my auntie house for a while. But she is kind of strict so stayed there and then I think when I made 15 or going to 16, I wound up meeting an older woman and I lived with her."},{"speaker":"Marcus","time":"00:06:11-1","content":"What about school tell me about school? Tell me about school?"},{"speaker":"Frank","time":"00:06:16-3","content":"School was great but it was good. I dropped out in the 10th grade something I regret."},{"speaker":"Marcus","time":"00:06:24-0","content":"Which school tell me?"},{"speaker":"Frank","time":"00:06:22-2","content":"John McDonogh. I grew up when, my first school elementary I went to Tom reform, from Tom reform, I went to Carter G Woodson, from Carter G Woodson I got kept back for the first time in the 28th grade because I missed too many days I had to stay home with my little brother and sister when they was sick my mom was working."},{"speaker":"Frank","time":"00:06:22-2","content":"So I missed too many days and they kept me back and I wound up going to St. Peter's I completed 8th grade."},{"speaker":"Frank","time":"00:06:22-2","content":"From that went to Walter L. Cohen High. By being in the St. Thomas project, and other projects there was a lot of fights in class and I wound up getting put out because of too many fights got put out in the beginning of the 3rd semester which kept me back because I didn't get a slip to come back until the last week of school."},{"speaker":"Frank","time":"00:06:22-2","content":"So I got from there, I went to Andrew J. Bell, I completed 9th grade, went to John McDonogh. From John McDonogh my activity during that time was kind of like deep in the streets, and for one day a teacher told me because I do my work but it wasn't like I was giving my all, if I make a C or D it was cool. I should have pushed for better grades but I didn't because the lifestyle I was going through."},{"speaker":"Frank","time":"00:06:22-2","content":"And a teacher one day told me that you ought to just quit and I was like I was looking for an excuse, my age at that time, when she say it was like, well this is the opportunity and I did and regret it but I told her that's something a teacher should never tell her students but thank you anyway and I left."},{"speaker":"Marcus","time":"00:08:11-5","content":"Sports did you have did you play sports or was it more streets."},{"speaker":"Frank","time":"00:08:16-2","content":"It was more streets I wasn't growing up we played football in the courtyard but after that I think I first started doing drugs and smoking marijuana was like at in the 7th grade and from there sports was no."},{"speaker":"Marcus","time":"00:08:32-3","content":"Yeah, were drugs and alcohol a big part of your life by the time you caught this charge?"},{"speaker":"Frank","time":"00:08:40-1","content":"Yeah pretty much and marijuana I started like I said young I watched my father smoke weed I was introduced to it when I was about like 4 years old because he liked to smoke marijuana and I used to see him jump on my mama back then and I kind of hated that because I couldn't defend her."},{"speaker":"Frank","time":"00:08:40-1","content":"And I always made a vow when I got to an age where I could defend her I'm not going to let no man put his hands on her, and that's how me and my stepfather used to clash, if they get into it. I know that's your wife but that's my mother, I'm just not going to let you handle her. And it was wrong because sooner they gone be back together not me and you."},{"speaker":"Frank","time":"00:08:40-1","content":"But coming up my mom she used to drink beer she never smoked but my daddy he smoked up until he was in prison and I smoked and from weed it went to I never did trust cocaine, but I wound up using it a while, never shot drugs. So as age progressed and got older drinking I wasn't too much a drinker but I tried heroin and stuff like that but yeah."},{"speaker":"Marcus","time":"00:09:53-5","content":"So nothing else stuck just weed."},{"speaker":"Frank","time":"00:09:56-4","content":"Well heroin and weed yeah."},{"speaker":"Marcus","time":"00:09:56-4","content":"Heroin stuck."},{"speaker":"Frank","time":"00:09:54-2","content":"It just I never shot it, it was something that I'd do in a timeframe it was a high that I'd never experienced, I regret it looking back on it. I thank God I'm still alive. I never saw the fix that it had on me then. That I could really look back to now and relate to it by going through the drug substance abuse class and identifying."},{"speaker":"Marcus","time":"00:10:23-6","content":"So were you snorting it?"},{"speaker":"Frank","time":"00:10:23-5","content":"Yeah I snorted it or put it in the marijuana."},{"speaker":"Marcus","time":"00:10:26-3","content":"Yeah sure. When you look back is there one person who stands out from everybody else as somebody who really took an extra interest in you, you were close to, who you felt you might be able to go to and talk to about your problems? Or were you out there by yourself?"},{"speaker":"Frank","time":"00:10:49-1","content":"I was kind of like out there by myself. I had in my family I know they cared about me, they loved me. It's just that I resented my dad for just leaving. I never could understand why because he took me everywhere with him. Then I wouldn't get the chance to see him and then when I would talk to him the question that kids always ask their father, when are you coming home? He used to tell me soon and every time I hear that soon. I got tired because it went to be years and years soon, how soon is soon."},{"speaker":"Frank","time":"00:10:49-1","content":"So when he would call I wouldn't want to talk to him, and I just would clash out but my mom's my heart, and it don't matter what wrong I did. If she tell me they do this come here I'm going to come and when I leave from her she's not just transforming something that I regretted just do anything crazy. I mean I never really intent to harm anybody but so far as when you hustling out there trying to provide from yourself rob and stealing or whatever, but I never intended to hurt nobody as far as killing. I wasn't with that."},{"speaker":"Marcus","time":"00:12:02-3","content":"So if you had to say somebody who was close it would be your mother?"},{"speaker":"Frank","time":"00:12:05-1","content":"Yeah she had a way of breaking me down. She know that she can set you off and then break me down. She know my heart. She knows that, she always told me, Frank downfall of your life will be your friends and back then to me that's the one that kind of showed me love. It was hard for me to separate it then, because you I got shot went to jail, and all this type of stuff ,and she used to always telling me your friends, your friends are going to be your downfall in life, you'll wind up in prison or dead."},{"speaker":"Marcus","time":"00:12:34-4","content":"Right so let's talk a little bit about that then. So you remember the first time you were arrested?"},{"speaker":"Frank","time":"00:12:42-1","content":"I got arrested as a juvenile I don't know if it was for stealing or fighting. But I was young but as an adult I got arrested one time as a juvenile for a separate robbery, armed robbery but separate but I had to turn myself in and at the time I was like 16. So when I made 17, 2 months later they couldn't charge me as a juvenile but they still gave me probation."},{"speaker":"Frank","time":"00:12:42-1","content":"Then I got out of jail which is sad at 7:30, that day as a juvenile at 17 and by 11 o'clock at night I was in jail, as an adult, with my friends stealing a car which we shouldn't have pocket money in my pocket, but I just could never break away from my friends and always trying to I wouldn't say be accepted, but just this is my family. So whenever they want to get into I'm going to get into it with you, but I had I'm going to draw the line at certain things."},{"speaker":"Marcus","time":"00:13:51-4","content":"Right sure a lot of peer pressure is what's around you."},{"speaker":"Frank","time":"00:13:55-2","content":"Yeah probably peer pressure."},{"speaker":"Marcus","time":"00:13:57-4","content":"Any physical abuse in your history?"},{"speaker":"Frank","time":"00:14:02-8","content":"I got whooped a lot, I wouldn't say it was physical abuse because I was a bad kid, and I mean got it and that's why I used to run away from home."},{"speaker":"Marcus","time":"00:14:13-2","content":"Who would be doing that?"},{"speaker":"Frank","time":"00:14:10-6","content":"My mom wouldn't let my stepdad whoop me. So if you ain't my dad you ain't gone put your hands on me. So one day he did whoop me when I was younger and I said whenever I get to size, he ain't gone do that again because I accidentally broke my little brother arm because he was a baby and I wasn't trying to pick him up not really intentional because like I said I love my siblings. I love them."},{"speaker":"Frank","time":"00:14:10-6","content":"I'm family oriented we family no matter what happen we love each other disagree but we love each other and I accidentally broke his arm and I ain't scared I told him what happened and boy he licked me up and I made a vow I said whenever I get the chance he ain't gone never do that again."},{"speaker":"Marcus","time":"00:14:55-3","content":"Right. Can you tell me anything about some intimate relationships you might have had girlfriends you might have had before."},{"speaker":"Frank","time":"00:15:12-5","content":"Man I had yeah I had a lot of them. Most of them was older women I never did like girls my age because it was like I guess being in the street had me so advanced to where it was like you can't show me nothing I think because these mixed emotions as a kid because I went to dealing."},{"speaker":"Frank","time":"00:15:12-5","content":"I thought I was a man by me sleeping with older women so stuff that I learned from them if I go mess with a girl younger than me or my age it was like she was lost or slow, I was like I ain't got time."},{"speaker":"Marcus","time":"00:15:48-1","content":"So anybody stand out from the crowd in your memory now?"},{"speaker":"Frank","time":"00:15:52-3","content":"Well I remember everybody I ever been with a lot of them a few of them died throughout the years. I wish that everybody that I ever did bad too, I've wronged since, I've been incarcerated I contact people and told them man I apologize if I ever offended you, because it was never my intention I just wasn't a man growing up, I was immature. I was a kid but trying to be somebody that I wasn't so through my conversation."},{"speaker":"Frank","time":"00:15:52-3","content":"I kind of saw the different side of me and it was shocking when a girl named Debra she told me she knew it was a risk messing with me, because I was oh amongst or whatever I was like wow, but it kind of hurt me, but the truth hurts. So I was being I accept it. As I say, what you dish out it comes back to you, so you got to man up and embrace it"},{"speaker":"Marcus","time":"00:16:51-1","content":"Sure. Any children?"},{"speaker":"Frank","time":"00:16:54-2","content":"Well I'm told I got one but that happened in '89 when I left she was pregnant her name Monica and she had the baby august of '89 and I never seen the kid yet."},{"speaker":"Marcus","time":"00:17:10-7","content":"Do you remember some of the other brushes with the law you might have had? You've explained a couple of times coming in and out of the system as a juvenile and an adult."},{"speaker":"Frank","time":"00:17:26-1","content":"Yeah I can remember all of them. After that time the first time I got a run in with the law as an adult was criminal trespassing, that was when I got out from juvenile. The second time was that I got a simple robbery then I got shot in 86 December 20th."},{"speaker":"Marcus","time":"00:17:45-0","content":"Where'd you get shot?"},{"speaker":"Frank","time":"00:17:48-8","content":"In the face right here so they took it out of my neck I got shot December 20th and I woke up New Year's. So then I stayed out of trouble for a year and after that I wound up getting, I got arrested for I think another criminal trespassing. No in '88 I got arrested for falsifying documents some stolen jury stuff I had pawned at a pawn shop that's what I got probation from and after that I never had a violent crime until this one here in '89."},{"speaker":"Marcus","time":"00:18:22-9","content":"So it's safe to say and I'm saying this based on the conversation we had before we started rolling here but your life had definitely gone down the wrong path. And so when you think back on it had you not been arrested for this particular charge, how do you anticipate the rest of your life would have gone?"},{"speaker":"Frank","time":"00:18:48-5","content":"If I wouldn't have got arrested for this charge here there's not a doubt in my mind I wouldn't be here today. I'd have been got killed because the environment of New Orleans uptown area and the lifestyle that I was living I wanted out but when you done did so much I don't think I might forgive."},{"speaker":"Frank","time":"00:18:48-5","content":"But you might not forget, and it just could be a spur of the moment a person could say I might be shot at my friend or did this or that or he was with him he might know about it and it just a lot of senseless killings. I'd have been a statistic of the senseless killing. It probably affected somebody it my past or known somebody that it affected them"},{"speaker":"Frank","time":"00:18:48-5","content":"Marcus #00:19:38-4# Sure did you find that you had very easy access to firearms?"},{"speaker":"Frank","time":"00:19:43-3","content":"Out there? Yeah I mean it's so easy to get I mean it's like whatever neighborhood you living in if a person that's having drug war turf war they gone try to supply anybody with a means to a weapon. So it's easy to find weapons."},{"speaker":"Marcus","time":"00:20:06-4","content":"Yeah and I'm going to assume that because you were living the lifestyle everybody else everyone is carrying a gun."},{"speaker":"Frank","time":"00:20:13-6","content":"Yeah it's just like an ID."},{"speaker":"Marcus","time":"00:20:19-9","content":"So is there anything else, I want to switch gears to your life after this charge here in a second. Can you very briefly summarize what the charge was?"},{"speaker":"Frank","time":"00:20:41-4","content":"Second degree murder, I killed a guy I went to school with Mr. Daniel Jackson. It should have never happened it was a lot of cross drawing. So it's either in certain areas you either kill or be killed."},{"speaker":"Marcus","time":"00:21:01-8","content":"I think I'm very familiar with that and I don't think, I think that I'm not sure how many people understand how real that was for some people and actually still is."},{"speaker":"Frank","time":"00:21:14-5","content":"It is it's scary."},{"speaker":"Marcus","time":"00:21:19-8","content":"So I want to move on past that anything else about your experiences before this charge that I should have asked about that is important shaping who you are."},{"speaker":"Frank","time":"00:21:19-8","content":"Yeah when I had got shot in '86, '87 before that like say a friend of mind is shot a spiritual had prayed she was saying, I had a curse on me and when you're young and my granny is, \"You're tripping.\" And I never could understand I used to go to girls that she I guess knew voodoo like I said New Orleans voodoo. I'm like, \"No I don't believe in none of that then.\""},{"speaker":"Frank","time":"00:21:19-8","content":"But in one day of life if I really was cursed by people, I got, everybody knew I was a good person but everybody that's a good person can sometimes make a wrong turn and become a bad person."},{"speaker":"Marcus","time":"00:22:08-1","content":"How much time did you do in the parish before coming here?"},{"speaker":"Frank","time":"00:22:12-5","content":"I got me I went to parish I got busted on the 29th I come up here September the 17th of '90. So I was in the parish from May 29 of '89 to September '90. So I did all my time, I did all my life in prison I didn't get to live on the street long."},{"speaker":"Marcus","time":"00:22:38-1","content":"Okay, and I'm sure you went at hunt."},{"speaker":"Frank","time":"00:22:40-8","content":"That's the ARDC for a few weeks."},{"speaker":"Marcus","time":"00:22:45-4","content":"Ok and then do you remember the bus ride coming up here to Angola?"},{"speaker":"Frank","time":"00:22:53-2","content":"Yeah I remember that."},{"speaker":"Marcus","time":"00:22:52-4","content":"What's going through your mind?"},{"speaker":"Frank","time":"00:22:54-7","content":"I'm entering a world that I'm not gone never leave from. They had this thing they said about Angola I mean it was a bloody place you either going to be prey or you gone be you gone fight and there was no way I would want to be no man's woman. So I wasn't afraid to fight."},{"speaker":"Frank","time":"00:22:54-7","content":"I know I did wrong to come here hopefully if I'm here I could find a change it took me a while to get to the point I am today."},{"speaker":"Marcus","time":"00:23:33-3","content":"Sure but at the beginning there."},{"speaker":"Frank","time":"00:23:36-3","content":"No the beginning was like you don't know what to expect because when we came on that bus row he was like you see all the prison movies they get off fresh meat this and that there yeah it was still happening I could stay honest. I think of the 20 people I think that came on that bus with us only 5 made it. 2 of them I know are dead, I know died one died of a heart attack one died he died of aids. Everybody else some of them insane, but I only know 3 of them that's of sole mind."},{"speaker":"Marcus","time":"00:24:13-4","content":"Wow. Where are most of them now in the cell blocks?"},{"speaker":"Frank","time":"00:24:20-2","content":"We got one he's in Ash unit with me, the other one he's in Hunts. Out of everybody that I took the bus ride those the two that I can say we all look for change we all through the mind of bumps in the road to prison, but those are the two that are in the same cause, and I'm trying to find out when can we be released. How can we really respect our family?"},{"speaker":"Marcus","time":"00:24:48-9","content":"Yeah can so when you say that you're that, they're the three that managed to stay sane."},{"speaker":"Frank","time":"00:24:54-6","content":"Because everybody else was either into drugs or just you get caught up in the prison, just what I want to say the penitentiary lifestyle you're just trapped. You got some people that been locked up 20 something years still ain't got their GED. I didn't have my GED when I first come here. I was so proud of myself when I accomplished that, and I said why I had to come to prison. I had to come to prison to be a better man than I was when I was out of there."},{"speaker":"Marcus","time":"00:25:31-6","content":"Yeah. So again I assume that you were put in a work working cell block, are you in the field?"},{"speaker":"Frank","time":"00:25:40-1","content":"Yeah I'm still in the field now, cutting grass around the main prison. So it's something to keep in shape. I've never been afraid of work that's what's crazy. We work for 4 cent 20 cent 70 cent now but in the streets never want a job man, it's just crazy."},{"speaker":"Marcus","time":"00:26:02-4","content":"Sure well one of the reasons that I wanted to talk with you is that you're one of the many guys who came here really young and kind of transformed your life turned your life around."},{"speaker":"Frank","time":"00:26:16-0","content":"It's time for change."},{"speaker":"Marcus","time":"00:26:17-7","content":"Yeah sure so for you would the reason for that change be like for so many others, it's just aging, was it just time?"},{"speaker":"Frank","time":"00:26:27-9","content":"I know I had a better purpose and calling. Anybody can be in prison. I mean just I don't think God made man to be in prison. I understand that we did wrong and you want to try to correct and chastise. I'm all for that, but it comes a time that how much is enough? How long does a person have to constantly try to better yourself?"},{"speaker":"Frank","time":"00:26:27-9","content":"They say about rehabilitating, you come to prison. If you come to prison you don't have a GED or none of this here stuff. You come in you achieve the GED, have a trade. You did community work helping somebody in the community anything you look at the person you was like from a when you first came from B where you are now from C where would you like to go."},{"speaker":"Frank","time":"00:26:27-9","content":"If a person is in A and he still here he hasn't changed. He don't want change but you got some people that will change and constantly trying to change to be better for society, really for themselves, that person should be given a second chance but I can't make you give me that. I can ask you, would you please give me that chance."},{"speaker":"Marcus","time":"00:27:42-4","content":"Can you tell me can you describe the Frank Green, the 21 year old Frank Green coming through the gates of Angola? What was that person like?"},{"speaker":"Frank","time":"00:27:53-3","content":"Man he was at the edge of the unknown. I had said, I had my two uncles here and my dad, and I'm like this is where all the family male subjects are supposed to come and go through, and when that cycle gone break. Like I said earlier I met a brother and he here if it isn't the family curse."},{"speaker":"Frank","time":"00:27:53-3","content":"I think it's that 20 year old person got like I said I made 21 years old. I remember on a Wednesday picking potatoes. I told my little friend I said man, I was thinking at 21 years old, I'm supposed to be getting a driving license and we're going to a strip club celebrating. But look where I'm at picking potatoes. Man if you know what I mean. Can't cry over spilled milk because I know what I did to be able to be here."},{"speaker":"Marcus","time":"00:28:59-3","content":"Well how are you different from that man now?"},{"speaker":"Frank","time":"00:29:03-1","content":"Man different I think clearer. I think I used to tell a person when you under the influence of any type of substance you're not thinking rationally at all. If you can think clearly your mind frame you think before you act I think when I was young if something happened out of respect I had and now I can think if it takes a man to walk away from something."},{"speaker":"Frank","time":"00:29:03-1","content":"And I see many men that I thought was cowards but really was men because they walked away from it. I think I took the coward route to use violence to prove my manhood it just wasn't nothing. And now I can really think on it if a person say, I can pretty much see it if my life is going straight and my friends, 'you're going this way. You go that way, I'm steady going the other way. I love you but you in another I'm going here. If you coming then we really we can talk but you going there I pray for you but I'm going here.\""},{"speaker":"Marcus","time":"00:30:13-0","content":"Sure. Tell me a little bit about some of the organization that you've been a part of what and certifications trades you told me about the GED, what else have you done?"},{"speaker":"Frank","time":"00:30:26-0","content":"Well I got my GED when in me think '94, got my GED in '97. I got a culinary arts trade as well. I've been involved in AA, alcoholics anonymous substance abuse that was one of the best programs, besides I'm involved in hospice as well and I love hospice and that's every day but substance abuse was really what mold me into being a better person the family structure there that we had. We used to do Transactional analysis , TA."},{"speaker":"Frank","time":"00:30:26-0","content":"We used to have group therapy every Tuesday and Friday. I was the group coordinator on Friday we have a thing we call the hot seat meaning, you get to tell your life story on this seat and we gone sit around and the chairs gone be around and you gone be right where I'm at and you're going be having everything thrown at you and you got to answer."},{"speaker":"Frank","time":"00:30:26-0","content":"You can't get an attitude, you can't get mad, there's no fighting, if you fight you're getting out the club. I mean it was they ask you questions that tear you apart. But then they try to build you back up they make you a better person. They ask you to go look and evaluate yourself. How can you see yourself if you look in a mirror when you're under the influence of drugs then look in the mirror when you're not who's the better person. I've been to substance abuse, did a 100 hours, I also said the hospices."},{"speaker":"Marcus","time":"00:32:03-1","content":"So tell me about that because it takes a in my opinion a really remarkable person to do hospice work."},{"speaker":"Frank","time":"00:32:11-2","content":"Yeah it is."},{"speaker":"Marcus","time":"00:32:09-6","content":"How did you get into that?"},{"speaker":"Frank","time":"00:32:12-4","content":"Well before hospice I always wanted to work in a hospital on the street they had the women there pretty girls in hospital uniforms. So I wanted to get into scrubs but in here I wound up in the yard or something and kept getting into it, with job we call never satisfied."},{"speaker":"Frank","time":"00:32:12-4","content":"But a job that came on the ward a major buddy said, \"Man you want it.\" I said, \"I don't know man what I got to do. I got to clean a person.\" He said, \"No you ain't got to do nothing but just mop and sweep.\" I said, \"All right.\" That was in like 98, I said \"Okay I could do that.\" But when I got on the ward and I saw the condition of some of the older guys I'm like, \"Man I ain't bathing no man that's nothing.\""},{"speaker":"Frank","time":"00:32:12-4","content":"But they had the older guy Eugene Scott, wound up having to take care of him because he had a stroke, he kept peeing on himself. So I'd get in the shower make him wash up but my first patient was a guy dying of aids his name was Grassley Algado. And this would be before hospice came about, and when I'm looking at a man weighing sixty something pounds like, man can't do nothing."},{"speaker":"Frank","time":"00:32:12-4","content":"So I just pick him up out the bed, put him in the wheelchair bring him to the bathroom, help him bathe him up, tease him mess with him, but by bring things for him I think me seeing this here firsthand you but then being able to when I first was able to help a person I just felt different and from that moment on I said, well I stayed on the ward like 3 years and I wound up making a trustee and they moved me off but hospice then came about."},{"speaker":"Frank","time":"00:32:12-4","content":"Norris and Chico, they were trying to get me to become a part of that. I said, \"I don't know that's political I ain't with the political.\" They said, \"No man you already doing it.\" I didn't know what it was, so I think I was afraid of it, but when I knew and they said, \"Man I want you to be my volunteer.\" I wound up coming and it's been fun because."},{"speaker":"Marcus","time":"00:34:38-2","content":"You been doing it all that time?"},{"speaker":"Frank","time":"00:34:40-5","content":"Yeah and when you helping somebody can't help yourself. I tell a lot of guys you can be strong, I had some friends that then died that I know from the street Big Bruce, he died, he told me he had six months to live. I cried. He chopped on me he called me a girl everything because I know you from the streets."},{"speaker":"Frank","time":"00:34:40-5","content":"He had prostate cancer man. I cried. He said look at you, said you're like a little girl crying. But I respect him because he was older than me and to hear him tell me that and when it started affecting him bad and his wife called me to let me know that's kind of hard to call, and during all this time I'm thinking about how did my victims family felt. I asked God to forgive me I'm sorry for what I have done. So I just try to find ways to give back, help somebody that can't help thyself and it's fun."},{"speaker":"Marcus","time":"00:35:37-2","content":"Yeah so let me ask you a difficult question of because when you are doing hospice work you are so directly confronted with men who came here as young men and who are now you are now helping them with the end of their lives. And that must surely remind you of the very real possibility that could be you."},{"speaker":"Frank","time":"00:36:05-9","content":"Yeah man I'm looking at me I could make the situation so who going to help somebody that I might be in that position and we have a thing we tell everybody in our group I would want you to take care of me like I'm going to take care of that patient if you can't take care of that patient and be loyal to the purpose you in it for the wrong reason you need to go."},{"speaker":"Frank","time":"00:36:05-9","content":"But if you gone sit there you have a different type of patience, no matter what you covered in whatever your life walk might have been, you become my patient. I'm going to give you my all. I'm be there with you because I could be there where you at now."},{"speaker":"Frank","time":"00:36:05-9","content":"So I mean you got to have some patients that man I say, I think I'm about to kill you but you try to make them forget about what they going through, to make them laugh I could make someone laugh but some of them I go to I'm seeking advice, its a give and take."},{"speaker":"Marcus","time":"00:37:01-8","content":"Yeah no I can see all of that. What are your coping mechanisms for dealing with the possibility of not getting out?"},{"speaker":"Frank","time":"00:37:10-7","content":"I understand I took another human's life. I said going during my life I been troubled always have never did really count on no one I said whatever's your will man if it's me to go to prison then well and every day I think about that you say now that I've been in the I can relate to certain things, I ain't the one that could say I'm a minister of the Lord."},{"speaker":"Frank","time":"00:37:10-7","content":"But I love the Lord. I know that everything in life happen for a reason."},{"speaker":"Frank","time":"00:37:10-7","content":"Now it's kind of strange I committed the crime May 25th '89 I got sentenced to life May 25th '90, I'm like man this is the whole Bible, tooth for tooth. I said man, well I guess Lord this is your word and ain't nothing I can do when you say for whatever going to happen gone happen. It's always in a book what's going to take place. I guess when he have his time to let me out I get out."},{"speaker":"Frank","time":"00:37:10-7","content":"If I happen to die here in prison that's not something that I want but I have to think about and take into consideration. I took another human's life a young man Damien I went to school with him I knew him we want friends but I knew him he still was somebody's son his mama name was Diane."},{"speaker":"Frank","time":"00:37:10-7","content":"I wish I could trade places with him, if I could go back in time and redo that, that would have never happened it shouldn't happen. I met his uncle up here. I met his cousin that happened to visit him. He was on he was a patient of mine, and I didn't know they was related until he told me. He said, he was dying. His name is Larry. He said, \"Frank I got something to tell you.\" I said, \"What you want Larry. Want me to get you some fruits.\" He said, \"No but really come sit down.\""},{"speaker":"Frank","time":"00:37:10-7","content":"So I'm he a really a real big dude. I said, \"What's up.\" He said, \"Bruh I know why you up here.\" I said, \"Huh?\" He said, \"About your charge the guy you're here for, bruh that was my cousin.\" I said, \"Why didn't you say. He said, \"Bruh all this time I've known you but I wanted to tell you but I just couldn't see you as that person.\" So he asked me what happened. So I explained it to him."},{"speaker":"Frank","time":"00:37:10-7","content":"But I met a nephew of 4 years ago, he wasn't even born but he had wanted to meet me. He was on the west shore. So he had asked me, I'm looking him in his eye I'm like yeah they probably want to kill me because hadn't been alive, but not since 98 they got no regards for us."},{"speaker":"Frank","time":"00:37:10-7","content":"So I talked to him. He was up here for murder and they wanted to kill him I think but we sat down and we talked and I want to say, \"Bruh I'm just going to tell you what happened man to man.\" And when I was finished I said, \"Now put yourself in my shoes how would you respond.\" So he told me, he told his mama that man that's the different dude but it happened I'm sorry for it."},{"speaker":"Frank","time":"00:37:10-7","content":"I regret it but if there's any way I can help you better yourself I said but you got to get your life together bruh. Because I'm here and people out there want to kill you and you need to either relocate, and change your lifestyle and he said well if I can help you in any kind of way my mom but I never called him or nothing. I just pray that he okay out there I guess"},{"speaker":"Marcus","time":"00:41:01-6","content":"What about your own family? How have your own family been watching you go through this?"},{"speaker":"Frank","time":"00:41:08-3","content":"Well she don't tell me my mom but at one time she thought I hated her because she was the one that had called the police that led to my arrest, and I didn't know until I got my DA files, when I saw it and I'm like wow. And we had a little, I was hurting bad I didn't want to see her for some months."},{"speaker":"Frank","time":"00:41:08-3","content":"And through substance abuse TA, when they finally they grilled me about it, and the guy had to tell me, a parent gone do what's best for our child whether you like it or not a mother is going protect her child and older dudes sat me down, cuss me out regularly talked to me."},{"speaker":"Frank","time":"00:41:08-3","content":"It showed me that she did what she thought was best for her and they asked me and I said they said you wouldn't have been in prison, frank do you think you'd be alive I said no they said your mama would rather see you in prison alive than dead and I understood I had when I did contact her back and talk to her. I said, \"man I'm sorry that I acted and felt that way but I just was hurt I said I love you and I would never disrespect you. I understand now I didn't but now I understand the reasons why.\""},{"speaker":"Frank","time":"00:41:08-3","content":"A lot of the time when we do stuff and like we don't really look at the whole picture because it's affecting his family first as well as my family."},{"speaker":"Marcus","time":"00:42:41-0","content":"Sure so it's been hardest on your mum you think."},{"speaker":"Frank","time":"00:42:43-3","content":"Yeah it's hard on her it's hard for my little brother like my baby brother came to visit me like 2 months ago. Man he grown up man. He got a beard and everything man I'm looking at him and so much I want to just say, and we visit before but I really want to talk but I'm looking at a totally stranger, me and my baby sister talk every week."},{"speaker":"Frank","time":"00:42:43-3","content":"We email my mom every week, my brother on every other week or two we get talking, but my baby brother I kind of let him do his little thing. They got two kids like I told him, man I'm sorry. I choked up at the visit and I explained to him I'm looking at you not as my brother because I'm kind of like estranged."},{"speaker":"Frank","time":"00:42:43-3","content":"Because I love you but man you a grown man bruh you're 40. So I can't I don't know what to tell you I been gone since you been ten. He said but I'm good man. I said, \"Bruh I love you.\" He said, \"Bruh I love you.\" Bruh I'm proud of you because you live your own life don't ever be like me, so I always used to tell him be different from me."},{"speaker":"Marcus","time":"00:43:52-3","content":"Yeah how do you make sense of life without parole?"},{"speaker":"Frank","time":"00:43:58-6","content":"Its hard. I never thought, I be honest live to see to see 50, I'll be 50 next month. So life without parole is something like in all other states around the world a person that committed murder might do 17 years. Up in Mississippi 15, or for California 14, 15 what's different between the crime they committed and a crime a person did in Louisiana."},{"speaker":"Frank","time":"00:43:58-6","content":"I think that the legislature here really look at our culture I mean I can't say that if I was brought up in an area that was provided, and I'm not making excuses, but provided for a better education or a structured background. When you got a struggle, your family on food stamps, you got five siblings in the household, you just on welfare, it just hard to have to deal with it as a kid."},{"speaker":"Frank","time":"00:43:58-6","content":"So at some time it makes you toughen up for the wrong reasons, what if I could have put all of that negative stuff I did as a child positive but then to look at it and see that life without parole there's two movies that I told you I saw kind of reflects Angola. The Shawshank Redemption because at the parole board they kept telling about the charges he did when he was young and Life."},{"speaker":"Frank","time":"00:43:58-6","content":"The movie Life reminds me of Angola in hospice. Because everybody you see in that movie are dying off, that's what we doing here, they're dying off. I've had so many people I come to love and respect die on my watch. I'm sitting with them back to back, holding his hand, dying with his sister and I'm in the room with me I'm crying because he was like me. He was either Spanish or something."},{"speaker":"Frank","time":"00:43:58-6","content":"And back then it was just beginning hospice, his sister cried and grabbed me and crying and I'm scared I don't know what to do. Because this is a woman from the free world and we not supposed to have contact like that but the freeman said, I know frank and I said man I need you to get me out this room because it's a bunch of women crying and it's kind of hard because I understand you all just lost your brother."},{"speaker":"Frank","time":"00:43:58-6","content":"So when we think about now with the parole eligibility that's I'm blessed that some people make it I thank God for that I know all of us not gone make it. So whoever able to make it use it be blessed. I wish that they could just really the proposal they trying to come up with a person did 30 years and over 50 he should be considered for parole."},{"speaker":"Frank","time":"00:43:58-6","content":"I mean how much longer you want a man to do, they got a man named Clifton Hamilton I called him my uncle back there in camp he been around 50 something years. I got a guy in my dorm he been there 40 something and they just denied them."},{"speaker":"Frank","time":"00:43:58-6","content":"So I look at my age and time I say well if I'm granted am blessed to go before the parole board I'm going to be dealt the same hand."},{"speaker":"Frank","time":"00:43:58-6","content":"I mean you want to be positive but when you see a lot of negative things it reminds makes you just wonder whether what we'd be missing to be different from other countries."},{"speaker":"Marcus","time":"00:47:55-0","content":"Yeah you've dealt with so much stuff over the years and it's a different life for you now than it was when you first came in because you're at a different stage in your life but what would you say is the worst part of living here right now for you at this point in your life."},{"speaker":"Frank","time":"00:48:19-4","content":"I mean for right now, it's when you've been used to seeing something happen, I guess you become immune to it. This system is constantly changing. It's not that you're trying to get relaxed or comfortable because you got I tell guys this it's security got to do the job I don't get mad at them for doing the job. I'm mad that I put myself in a position for them to do their job."},{"speaker":"Frank","time":"00:48:19-4","content":"If we never did what we did they wouldn't be able to be where they are today. So you got to break through the cycle of thinking about its us against them. It's not we got to try to get our people to vote for the people that's going to try to help us but first you got to help yourself you got to change. I mean if you can't change how you expect somebody else to change?"},{"speaker":"Frank","time":"00:48:19-4","content":"They got so much be happening around here it's like you don't know what tomorrow gone bring but one thing about it gone come they gone feed what happen between those you don't know because they could suddenly just shut the whole prison down because somebody tried to escape or something happened, the county messed up shut it down."},{"speaker":"Frank","time":"00:48:19-4","content":"And through the course of years me being it's like a repetition just saying things over and over so when guys get mad when it happen I be mad because I allow myself to do something, that put me in this environment."},{"speaker":"Marcus","time":"00:49:56-6","content":"Yeah so let's say that you go before the pardon board and you get the second chance."},{"speaker":"Frank","time":"00:50:00-3","content":"Oh man I will probably start crying."},{"speaker":"Marcus","time":"00:50:00-6","content":"Well sure. I mean I'm sure you've thought about what you would do. Can you tell me what your vision would be? Let's say you go are you going up in November or December?"},{"speaker":"Frank","time":"00:50:11-4","content":"I don't know I'm waiting on a day I never been able to find out when it is."},{"speaker":"Marcus","time":"00:50:17-1","content":"Yeah it is you're you have a date."},{"speaker":"Frank","time":"00:50:20-5","content":"I don't know nothing about it."},{"speaker":"Marcus","time":"00:50:16-7","content":"Well we'll talk about it when we finish, but let's say you get that day, what's your vision for the future, what do you want to do?"},{"speaker":"Frank","time":"00:50:36-5","content":"Man you messed my heart up right now pumping fast. I always thought about what would I do if given a second chance first and foremost I would love to thank God for giving me this opportunity or the people that my record the jacket or whatever speaks to me."},{"speaker":"Frank","time":"00:50:36-5","content":""},{"speaker":"Frank","time":"00:50:36-5","content":"People find me strange because I talked to a friend of mine I would like to me like I said, I'm different I would like to probably visit the grave of Mr. Jackson and let him know I'm sorry. I apologize I wish it would have never happened. And hopefully whatever work a friend of mine had a job planned out for me but work that would just look at like I see life different now. I can't see me making a bad turn or decision."},{"speaker":"Frank","time":"00:50:36-5","content":"And I tell friends of mine that I email contact that's out that left I say, \"Bruh whenever you get that thought that you think you bout to do something stupid always have something from Angola written on there on a board put it in the room, and specifically say if I'm looking at this board right now. It means I'm contemplating doing something stupid, remember where you came from you don't want to come back here.\""},{"speaker":"Frank","time":"00:50:36-5","content":"But it's just the, like I said family, started family it's gone I'll be 50, but to live out my life to the best. I would love to be where I could really still do hospice better because I think I got so much experience with it, but just to find a way to get that even though I'm working in the job but I still have extra leisure hours to do something positive I think that would be good."},{"speaker":"Marcus","time":"00:52:26-9","content":"Yeah hospice would be great. Is there, I really enjoyed talking to you is there something else I should have asked you."},{"speaker":"Frank","time":"00:52:38-7","content":"Man I don't know man you got the questions. I mean my life like I tell a person my life is an open book. I don't have secrets."},{"speaker":"Marcus","time":"00:52:48-0","content":"Right."},{"speaker":"Frank","time":"00:52:51-4","content":"I mean I'm not the proud of the person I was back then but I'm proud of the person I am today."},{"speaker":"Marcus","time":"00:52:58-3","content":"Right yeah sure. All right well thank you very much for sitting with us was that ok for you?"}]}