{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:17",
      "content": "George Crawford_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:17",
      "upperBoundTime": "00:00:18",
      "content": "And just have you state your name, the crime of conviction, how old you were, and how much time you've served. Go ahead."
    },
    {
      "speaker": "George",
      "time": "00:00:18",
      "upperBoundTime": "00:00:23",
      "content": "My name is George Crawford. I'm 43 years of age. I was convicted of first degree murder. I'm from Louisiana, I mean, excuse me, I'm from New Orleans, Louisiana. I been up here for a little over 23 and ½ years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:23",
      "upperBoundTime": "00:00:24",
      "content": "Okay. And you were how old when this occurred?"
    },
    {
      "speaker": "George",
      "time": "00:00:24",
      "upperBoundTime": "00:00:30",
      "content": "19 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:30",
      "upperBoundTime": "00:00:38",
      "content": "Alright. In my record, I think it's 18, but you were probably right on the cusp of 18. So, I want to start with your years before coming here. Let's start with your family. Tell me about the people who raised you."
    },
    {
      "speaker": "George",
      "time": "00:00:38",
      "upperBoundTime": "00:01:33",
      "content": "I come from a great family, great family. I lived with my mom, which I'm the youngest of five kids from my mom. I'm the only one from my father. I lived with my mom up until like I was eight years old in the Desire Project. We lived good everything was good. I had wanted to go live with my dad. I moved to Marrero when I was eight. That was like moving to Bel Aire. It was a step up yes. I few steps up, it was real good. I moved in with my grandma and my dad and mother and life was pretty good. I was offered, better education, schools, everything was better."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:33",
      "upperBoundTime": "00:01:35",
      "content": "Yeah, and getting out of the projects."
    },
    {
      "speaker": "George",
      "time": "00:01:35",
      "upperBoundTime": "00:01:41",
      "content": "Yeah. Everything, it was way better."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:41",
      "upperBoundTime": "00:01:44",
      "content": "Must have been a big change. Did the rest of your siblings stay?"
    },
    {
      "speaker": "George",
      "time": "00:01:44",
      "upperBoundTime": "00:01:52",
      "content": "Yes, they still with my mom. I had wanted to go. I had wanted to go. I chose to go live."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:52",
      "upperBoundTime": "00:01:54",
      "content": "And did you ever go back to live with your mom?"
    },
    {
      "speaker": "George",
      "time": "00:01:54",
      "upperBoundTime": "00:01:56",
      "content": "With my mom? Yes sir, a few times."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:56",
      "upperBoundTime": "00:02:01",
      "content": "So you kind of went back and forth. I got it. What about grandparents. Any grandparents?"
    },
    {
      "speaker": "George",
      "time": "00:02:01",
      "upperBoundTime": "00:02:03",
      "content": "I love them. My grandmother was my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:03",
      "upperBoundTime": "00:02:07",
      "content": "Okay, tell me a little about her."
    },
    {
      "speaker": "George",
      "time": "00:02:07",
      "upperBoundTime": "00:02:09",
      "content": "That's the most amazing woman, person, human being I have ever known in my life. And she passed. She passed on Mother's Day 2008, she passed away at the age of 84, but she was sweet."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:09",
      "upperBoundTime": "00:02:21",
      "content": "Was she your mother's mother or?"
    },
    {
      "speaker": "George",
      "time": "00:02:21",
      "upperBoundTime": "00:02:43",
      "content": "My daddy. My daddy's mom. She taught me everything. She taught me manners. She taught me everything. She gave me strength, taught me how to protect myself. She had a zero tolerance to it, it was another side. I got in line she put me in the line. But yeah, that was my heart there."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:43",
      "upperBoundTime": "00:02:45",
      "content": "She was in Marrero also?"
    },
    {
      "speaker": "George",
      "time": "00:02:45",
      "upperBoundTime": "00:02:47",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:47",
      "upperBoundTime": "00:02:50",
      "content": "Do you remember your last interaction with her?"
    },
    {
      "speaker": "George",
      "time": "00:02:50",
      "upperBoundTime": "00:04:02",
      "content": "I do. And this something I never ever share with nobody. My very last interaction with my grandmother was in 2008. I had actually gave up. I actually gave up. I was, during this time I was in a cell block for a fight."
    },
    {
      "speaker": "George",
      "time": "00:02:50",
      "upperBoundTime": "00:04:02",
      "content": "I was in a cell block for a simple fight up here and I just felt hopeless just felt alone which I had never been alone since I been incarcerated. But I wrote my grandmother and I told her I appreciated everything she ever did for me, how she loved me, how she raised me, but that I gave up how I'm not never coming home."
    },
    {
      "speaker": "George",
      "time": "00:02:50",
      "upperBoundTime": "00:04:02",
      "content": "And she come up here. She come up here that same weekend and got on me. She got on me so tight and told me don't you ever write me no letter like that send me no letter like that nor think like that because you going to come home. Said, I may not be alive to see it but you going to come home. And my last interaction with her."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:02",
      "upperBoundTime": "00:04:04",
      "content": "It sounds like at your lowest point."
    },
    {
      "speaker": "George",
      "time": "00:04:04",
      "upperBoundTime": "00:04:06",
      "content": "That's what it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:06",
      "upperBoundTime": "00:04:12",
      "content": "Yeah. And she's probably one of the very few people who could pick you up out of that."
    },
    {
      "speaker": "George",
      "time": "00:04:12",
      "upperBoundTime": "00:04:32",
      "content": "In she happened, to this day, I carry it with me. I carry that last visit with me. Each and every day, I carry that last visit with me. I don't go into depth details, but I always tell people that. What my grandmother told me."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:35",
      "content": "Any other family that comes to mind as somebody that took a special interest in you, I mean other than your grandmother?"
    },
    {
      "speaker": "George",
      "time": "00:04:35",
      "upperBoundTime": "00:04:37",
      "content": "My mom, my mom been there. My mom, my mom been there from worst."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:37",
      "upperBoundTime": "00:04:39",
      "content": "Is she still living?"
    },
    {
      "speaker": "George",
      "time": "00:04:39",
      "upperBoundTime": "00:04:48",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:48",
      "upperBoundTime": "00:04:58",
      "content": "Okay, and is she still able to come and visit you?"
    },
    {
      "speaker": "George",
      "time": "00:04:58",
      "upperBoundTime": "00:05:05",
      "content": "Oh yes. She come. She can't come as much, really, I don't want her to come as much 72 years old. And I feel like she done just as much time as I have. She's done this time with me. She been there all the way."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:05",
      "upperBoundTime": "00:05:08",
      "content": "Yeah. Of all of the people who been impacted by you getting a life sentence as such a young, child really, who's it been hardest on?"
    },
    {
      "speaker": "George",
      "time": "00:05:08",
      "upperBoundTime": "00:05:57",
      "content": "I came I say my mom. I would have to say my mom, my grandmother, my daddy, which he passed away, and my aunts' my daddy's sisters. But it's several people because we are family oriented. See, on my daddy's side, that side of the family, very family oriented."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:57",
      "upperBoundTime": "00:06:06",
      "content": "Right a lot of guys have said that, your family does time with you, just the way you said it."
    },
    {
      "speaker": "George",
      "time": "00:06:06",
      "upperBoundTime": "00:06:08",
      "content": "That's a fact."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:08",
      "upperBoundTime": "00:06:27",
      "content": "Okay, so let's do this. Maybe you can describe, if I'm standing on the front doorstep of your mom's house in the Desire project, some like seven at night, paint that picture for me and then I want you to paint a picture outside your dad's house in Marrero."
    },
    {
      "speaker": "George",
      "time": "00:06:27",
      "upperBoundTime": "00:07:20",
      "content": "Outside my mom's house, in the projects of Desire is dark. It's down on Pleasant Street it's dark in the hallway it's dark, it's quiet, it's scary because something is always going on. During that time, something always going on. The only thing you want, is to hurry up and go inside open the door up and get in there?"
    },
    {
      "speaker": "George",
      "time": "00:06:27",
      "upperBoundTime": "00:07:20",
      "content": "Now, my daddy's side on the other hand, is confident, because you're in the better neighborhood, in the quiet neighborhood. It's more like, more like a rural neighborhood subdivision, no gunshots, no nothing? It's just peaceful and you can feel it."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:20",
      "upperBoundTime": "00:07:26",
      "content": "Did you feel safe in the desire projects?"
    },
    {
      "speaker": "George",
      "time": "00:07:26",
      "upperBoundTime": "00:07:38",
      "content": "Actually, I did considering that's where I lived up until I was eight. Maybe eight, nine, I did. I did. A lot of family members around there, I didn't know any better we kids. Really."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:38",
      "upperBoundTime": "00:07:56",
      "content": "I think probably, going to Marrero made you see the different style of life and also made you look at where you were."
    },
    {
      "speaker": "George",
      "time": "00:07:56",
      "upperBoundTime": "00:07:58",
      "content": "Right, it was a whole lot better. It was better."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:58",
      "upperBoundTime": "00:08:01",
      "content": "Right. Tell me about school. Where were you in school?"
    },
    {
      "speaker": "George",
      "time": "00:08:01",
      "upperBoundTime": "00:08:27",
      "content": "I always been smart. Always been good in school. My only problem in school both when I was living with my mom, moved with my dad with my grandmother, was that I liked to laugh- I always liked to laugh. Just love to make people laugh so that was always my thing, my behavior. My grades was kept up."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:27",
      "upperBoundTime": "00:08:30",
      "content": "Clowning around?"
    },
    {
      "speaker": "George",
      "time": "00:08:30",
      "upperBoundTime": "00:08:38",
      "content": "Yes indeed, yes, all the time. Always, always, that's all I wanted to do, play. But I did my work, did my work."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:38",
      "upperBoundTime": "00:08:40",
      "content": "Did you play sports in school?"
    },
    {
      "speaker": "George",
      "time": "00:08:40",
      "upperBoundTime": "00:08:49",
      "content": "Yeah I played basketball. I played basketball."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:49",
      "upperBoundTime": "00:08:51",
      "content": "So where were you in high school?"
    },
    {
      "speaker": "George",
      "time": "00:08:51",
      "upperBoundTime": "00:09:02",
      "content": "In ninth grade, I went to L. W. Higgins which is in Marrero. And I went to ninth grade. I didn't get to finish. I had stopped. I just dropped out because and that was I chose that."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:02",
      "upperBoundTime": "00:09:26",
      "content": "Tell me about that decision."
    },
    {
      "speaker": "George",
      "time": "00:09:26",
      "upperBoundTime": "00:09:29",
      "content": "I just wanted to do things my way. I just tried to live my way. I mean my people cared for me up until that point. I was 15, 16. But, I just wanted to be, just fit in like the other kids my age. I wanted to."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:29",
      "upperBoundTime": "00:09:31",
      "content": "The kids in Marrero or the kids in New Orleans."
    },
    {
      "speaker": "George",
      "time": "00:09:31",
      "upperBoundTime": "00:09:39",
      "content": "Period in Marrero. You had kids during that time had their own cars, they were living in the streets and then so I chose the latter. And instead of just taking like my allowance, which I would get a steady allowance, I would go on the streets, drugs, and just hang out with the wild bunch."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:39",
      "upperBoundTime": "00:09:57",
      "content": "Sure, so after ninth grade, was ninth grade the last grade of school?"
    },
    {
      "speaker": "George",
      "time": "00:09:57",
      "upperBoundTime": "00:09:58",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:58",
      "upperBoundTime": "00:10:03",
      "content": "What about fighting? Was there a lot of fighting in your life coming up?"
    },
    {
      "speaker": "George",
      "time": "00:10:03",
      "upperBoundTime": "00:10:07",
      "content": "Yeah. Talking about like?"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:07",
      "upperBoundTime": "00:10:09",
      "content": "Like in school and on the street?"
    },
    {
      "speaker": "George",
      "time": "00:10:09",
      "upperBoundTime": "00:10:48",
      "content": "Yeah, I used to always, again I would always be big for my age. Always been big for my age and like always wanted to be down and, I hung guys certain guys hung with me, but because I was big, we would get in fights with other neighborhood kids, and this in school. But when we weren't in school, we'd still go to other neighborhoods and fight go to parties and just fight, try to impress the girls."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:48",
      "upperBoundTime": "00:10:53",
      "content": "But I'm judging from everything you said that inside your home was a very loving peaceful place right? Was there any fighting in that home?"
    },
    {
      "speaker": "George",
      "time": "00:10:53",
      "upperBoundTime": "00:11:03",
      "content": "No, arguing, yeah. There was a lot of arguing, but among me and my siblings, yeah there was a lot of arguing about nothing. Just crazy stuff."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:03",
      "upperBoundTime": "00:11:08",
      "content": "Were there other men who came into your mother's life who then came into your life?"
    },
    {
      "speaker": "George",
      "time": "00:11:08",
      "upperBoundTime": "00:11:35",
      "content": "Her husband, yes. One, yeah, that's her only husband after my dad. After my mom and dad divorced yeah. And that was as reason too that I decide to go move in with my daddy and my grandma because I'd never acknowledge another man being my father, step father, you only have one father and mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:35",
      "upperBoundTime": "00:11:37",
      "content": "How old were you when that man came into your life?"
    },
    {
      "speaker": "George",
      "time": "00:11:37",
      "upperBoundTime": "00:11:40",
      "content": "Maybe 7, 8."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:40",
      "upperBoundTime": "00:11:55",
      "content": "Okay, and then you moved at 8. So I'm also going to assume because of the way you've said these things that you wouldn't have considered yourself to be abused as child."
    },
    {
      "speaker": "George",
      "time": "00:11:55",
      "upperBoundTime": "00:11:59",
      "content": "No. I got them whippings though. When I got out of line, it got bad."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:59",
      "upperBoundTime": "00:12:03",
      "content": "Who was the disciplinarian for most of those whippings?"
    },
    {
      "speaker": "George",
      "time": "00:12:03",
      "upperBoundTime": "00:12:19",
      "content": "Well, my daddy, my daddy the majority because my mommy never whipped me. My daddy, when I went moved with my daddy, he didn't whip me when I got out of line, it was my grandma. My grandmother."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:19",
      "upperBoundTime": "00:12:24",
      "content": "Alright, what about intimate relationships. I know you were so young when you got…"
    },
    {
      "speaker": "George",
      "time": "00:12:24",
      "upperBoundTime": "00:12:39",
      "content": "Right, well I never had I didn't have serious relationships because, for one I didn't know what it was. I had flings, I dealt with young ladies. I have two sons."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:39",
      "upperBoundTime": "00:12:41",
      "content": "Okay, tell me about them."
    },
    {
      "speaker": "George",
      "time": "00:12:41",
      "upperBoundTime": "00:14:08",
      "content": "I had two sons. Two adult sons now, my oldest son is 25 and my youngest one is 24. They by two different women. My oldest son, me and him have a pretty great relationship. He's in college, will graduate out of college. Me and his mother, we respect one another. We never was like really on the verge of marrying, anything like that. But, my youngest son, I don't communicate with him because this here situation that I'm in. It's unusual circumstances, me being in prison."
    },
    {
      "speaker": "George",
      "time": "00:12:41",
      "upperBoundTime": "00:14:08",
      "content": "He was born while I was in the parish on this charge. He was and his mother, she went on to marry a guy, another guy and they raised him together. I've seen him, they come up here and we talk. We had out disagreement because he's the opposite of me, and I think and my older son thinks, his brother, he's like agrees with this term, step-dad, which I don't and it was this whole big deal. So it kind of killed our contact but he does stay in contact with his brother, my oldest son."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:08",
      "upperBoundTime": "00:14:15",
      "content": "Now, the challenges of maintaining any kind of relationship from prison, are great, but do you think you've been able to parent your oldest son?"
    },
    {
      "speaker": "George",
      "time": "00:14:15",
      "upperBoundTime": "00:14:53",
      "content": "I feel indirectly, I feel I have, just through my experience because every time I talk to him and I see him, the only thing I tell him is Daquan, be better than me. Be better than me, don't ever try to walk in the footsteps I walk in, I mean, be better than me. And I believe, to answer your question, yes, because he's exceeded everybody expectation of him because all his life he always heard that you're going to be just like your daddy. You're going to follow the footsteps of your daddy."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:53",
      "upperBoundTime": "00:15:02",
      "content": "I mean, I think a lot of that it does seem it has to do with the mother's willingness to facilitate a relationship between them."
    },
    {
      "speaker": "George",
      "time": "00:15:02",
      "upperBoundTime": "00:15:43",
      "content": "I agree and like with my oldest son, I've- and which his mom don't have any say so now because he's a man. But, when he was real younger, my mom my older sister, they made sure that he remained a part of my life. They made sure that he knew who I were. And then he had an aunt, his sister, his mama sister."
    },
    {
      "speaker": "George",
      "time": "00:15:02",
      "upperBoundTime": "00:15:43",
      "content": "She always made sure he knew who I was. Like, my younger son, like I said, his mom married, and the guy she married too and that's a big thing because he never wanted her to remain in contact with me and with my son."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:43",
      "upperBoundTime": "00:15:48",
      "content": "Right, which those things you have no control over. So, did you say Daquan is your oldest?"
    },
    {
      "speaker": "George",
      "time": "00:15:48",
      "upperBoundTime": "00:15:53",
      "content": "Daquan, Daquan Gruffin."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:53",
      "upperBoundTime": "00:15:55",
      "content": "What's your youngest son's name?"
    },
    {
      "speaker": "George",
      "time": "00:15:55",
      "upperBoundTime": "00:15:55",
      "content": "George, George Johnson."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:55",
      "upperBoundTime": "00:16:00",
      "content": "Named after you."
    },
    {
      "speaker": "George",
      "time": "00:16:00",
      "upperBoundTime": "00:16:02",
      "content": "Named after me."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:02",
      "upperBoundTime": "00:16:15",
      "content": "Alright, so, up to ninth grade, you mentioned that you're getting a, going around in school, getting in a little bit of trouble. So, what, do you remember the first time you were ever arrested?"
    },
    {
      "speaker": "George",
      "time": "00:16:15",
      "upperBoundTime": "00:16:31",
      "content": "Oh first time I was ever arrested? No, I don't, not the first time. I don't."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:31",
      "upperBoundTime": "00:16:34",
      "content": "Okay, well do you, prior to this charge, did you have other arrests?"
    },
    {
      "speaker": "George",
      "time": "00:16:34",
      "upperBoundTime": "00:16:44",
      "content": "Yeah, misdemeanor, stolen vehicle. Stole it right out of the store, under 500 dollars, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:44",
      "upperBoundTime": "00:16:49",
      "content": "Okay, so, but nothing that landed you up in prison."
    },
    {
      "speaker": "George",
      "time": "00:16:49",
      "upperBoundTime": "00:16:51",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:51",
      "upperBoundTime": "00:16:54",
      "content": "Okay, so it was just like what? Probation?"
    },
    {
      "speaker": "George",
      "time": "00:16:54",
      "upperBoundTime": "00:16:56",
      "content": "Yeah, that's all."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:56",
      "upperBoundTime": "00:17:12",
      "content": "George, if you had to identify the single most important cause, which there's many causes to things, that took you down this particular path, what would you say it is?"
    },
    {
      "speaker": "George",
      "time": "00:17:12",
      "upperBoundTime": "00:18:01",
      "content": "Being a bad judge of character. Being a bad judge of character and having a big, soft heart. And that was a problem an always had. My mom always used to tell me, you're too nice, you're too quick to say this person's your friend you don't know nothing about them."
    },
    {
      "speaker": "George",
      "time": "00:17:12",
      "upperBoundTime": "00:18:01",
      "content": "But that's that was a problem I had and up until this point here, sitting in this chair, I realize that and understand that she was right. Because sometimes, it takes a life time to learn people. You can't get to know anyone, from asking them questions or just living next door to them or sometimes it takes forever."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:01",
      "upperBoundTime": "00:18:02",
      "content": "So would you, in other words saying that you got in with the wrong group of friends?"
    },
    {
      "speaker": "George",
      "time": "00:18:02",
      "upperBoundTime": "00:18:05",
      "content": "Wrong group. The wrong group."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:05",
      "upperBoundTime": "00:18:16",
      "content": "Sure and when it comes to criminal offending in Louisiana, as you know, they don't make any distinction between principals and everybody who was there is guilty, so were drugs and alcohol part of your own lifestyle?"
    },
    {
      "speaker": "George",
      "time": "00:18:16",
      "upperBoundTime": "00:18:41",
      "content": "I would say yeah. Both drugs and the alcohol. I used to like to drink occasionally. And I used to dip and dab and coke."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:41",
      "upperBoundTime": "00:19:10",
      "content": "Okay, alright. So let me ask you this is a question that I don't think nobody knows the answer to but, let's say this particular charge did not happen, you weren't there, you were in another neighborhood or something. How do imagine that the rest of your let's say the next few months and years, how would they have gone for you do you think?"
    },
    {
      "speaker": "George",
      "time": "00:19:10",
      "upperBoundTime": "00:19:36",
      "content": "I would have been dead. I know I would have been. I know for a fact- I know for a fact I would have been dead. I was big headed. I was like a arrogant, I was young. I was arrogant and I didn't have any type of directions, no codes, no nothing, I mean, I was flamboyant. I had attitude out of this world. I would have been dead."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:36",
      "upperBoundTime": "00:19:44",
      "content": "So in some strange way, what happened possibly saved your life? In a cruel way."
    },
    {
      "speaker": "George",
      "time": "00:19:44",
      "upperBoundTime": "00:20:05",
      "content": "I believe it have. At first, I didn't want to agree because like, my mom said it, my dad said it, my grandma never said it. She didn't want to hear that? But, as I've gotten older and mature, yeah. Yeah I would have been dead."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:05",
      "upperBoundTime": "00:20:06",
      "content": "Yeah, when you look back on the person that you were as an 18 year old, how- what are the major ways in which you've changed? Everybody changes."
    },
    {
      "speaker": "George",
      "time": "00:20:06",
      "upperBoundTime": "00:20:59",
      "content": "I can actually think. I can do some thinking now. I'm forgiving. I don't forget as much, let alone at all, but I'm forgiving. I can think and I have. I have come to the point to where I can own up where I'm able to own up to my responsibilities. If I do something- if I do harm or say something out of the way to hurt somebody, I can own up. I'm going to own up to that and apologize. I'm grown here, I mean this, I've really grown here."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:59",
      "upperBoundTime": "00:21:02",
      "content": "Yeah. More time here than outside."
    },
    {
      "speaker": "George",
      "time": "00:21:02",
      "upperBoundTime": "00:21:13",
      "content": "Now I always say that. Like, lately, the past few weeks, that's what I've been saying. I've been incarcerated longer than I've actually had a chance to live."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:13",
      "upperBoundTime": "00:21:19",
      "content": "In terms of your perspective on things, I mean Angola raised you in many ways."
    },
    {
      "speaker": "George",
      "time": "00:21:19",
      "upperBoundTime": "00:21:24",
      "content": "It really has."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:24",
      "upperBoundTime": "00:21:45",
      "content": "So I want to switch gears to coming to Angola, but before I do, is there anything about your first 18 years of your life that is kind of crucial as to understanding who you are that we didn't talk about that I didn't ask you about?"
    },
    {
      "speaker": "George",
      "time": "00:21:45",
      "upperBoundTime": "00:22:32",
      "content": "I think the only thing about the first 18 years in life, I regret that I didn't achieve the things that my family set out for me to achieve because I come from an outstanding, I'm talking about a great family, great family. Professionals, doctors, military people. Officers, police officers. And now, I feel, I feel more hurt for them then I do myself because I let them down."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:32",
      "upperBoundTime": "00:22:53",
      "content": "So, you're in the parish, get through the trial. So tell me about the bus ride to Angola. I think the think the where we started with that."
    },
    {
      "speaker": "George",
      "time": "00:22:53",
      "upperBoundTime": "00:23:52",
      "content": "Right, I pretty much, pretty much, ain't no disrespect, but, on the bus, I had the mindset, like whatever happen going to happen because I'm going to be the same way as I was in the parish. I've heard all these stories, everybody heard all these stories about how Angola this, Angola that. So I'm a come up with it on my mind and that's the attitude I had. Unfortunately, it wasn't like that. Angola wasn't like that which in like, within the first year, I did. I got stabbed in my sleep. Within the first year I got stabbed in my sleep like 7 times, 6, 7, times."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:52",
      "upperBoundTime": "00:23:54",
      "content": "Oh my God."
    },
    {
      "speaker": "George",
      "time": "00:23:54",
      "upperBoundTime": "00:23:55",
      "content": "Yeah, that's within the first year."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:55",
      "upperBoundTime": "00:23:56",
      "content": "That was one incident?"
    },
    {
      "speaker": "George",
      "time": "00:23:56",
      "upperBoundTime": "00:24:01",
      "content": "Yeah, that's again, because me being the weight that I am every I've been flamboyant. I've always been big."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:01",
      "upperBoundTime": "00:24:18",
      "content": "Sometimes, when someone wants to make a point, they pick the biggest guy in the room. Now, tell me how, as an example, how did that stabbing get resolved? Did you retaliate? Did that person get in trouble?"
    },
    {
      "speaker": "George",
      "time": "00:24:18",
      "upperBoundTime": "00:24:22",
      "content": "No, I couldn't I was asleep. I was asleep. I got stabbed in my sleep. Yup. 7 times."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:22",
      "upperBoundTime": "00:24:25",
      "content": "And, whatever happened to that person?"
    },
    {
      "speaker": "George",
      "time": "00:24:25",
      "upperBoundTime": "00:24:32",
      "content": "I hadn't seen him since. I don't even know him. I hadn't seen him since that happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:32",
      "upperBoundTime": "00:24:35",
      "content": "Wow. But you know who it is?"
    },
    {
      "speaker": "George",
      "time": "00:24:35",
      "upperBoundTime": "00:24:41",
      "content": "No. That's why I'm saying I didn't even know him and that's been like over 20- 22 years. 22 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:41",
      "upperBoundTime": "00:24:46",
      "content": "Did someone get you to the hospital?"
    },
    {
      "speaker": "George",
      "time": "00:24:46",
      "upperBoundTime": "00:24:58",
      "content": "Yeah, they brought me to the hospital. It wasn't nothing serious. I got stabbed twice in my chest, a few times my shoulder."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:58",
      "upperBoundTime": "00:25:01",
      "content": "Yeah, somebody is doing this to you and you don't even know who it is."
    },
    {
      "speaker": "George",
      "time": "00:25:01",
      "upperBoundTime": "00:25:03",
      "content": "Lights off."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:03",
      "upperBoundTime": "00:25:05",
      "content": "Crazy. Did they put you in the field?"
    },
    {
      "speaker": "George",
      "time": "00:25:05",
      "upperBoundTime": "00:25:07",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:07",
      "upperBoundTime": "00:25:09",
      "content": "Tell me about that experience."
    },
    {
      "speaker": "George",
      "time": "00:25:09",
      "upperBoundTime": "00:25:41",
      "content": "It was new to me. The field was new to me because I ain't ever had a job in my life. I didn't know how to work. The only work I knew how to do was cut grass and wash dishes and help clean up the house things my grandmother taught me. I've never worked. So they put me out there, I was messing up everything. They had to show me the proper way how to pull and plant, but, yep."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:41",
      "upperBoundTime": "00:25:43",
      "content": "So you were in a working cell block?"
    },
    {
      "speaker": "George",
      "time": "00:25:43",
      "upperBoundTime": "00:25:50",
      "content": "Yes, I was in a cell block during that time. I had to do ninety days, before I go to a dormitory."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:50",
      "upperBoundTime": "00:25:54",
      "content": "Right. So you said that, that you were butting your head up against the wall a little, getting into some trouble. Did you go in and out of the cell blocks for the first few years that you were here?"
    },
    {
      "speaker": "George",
      "time": "00:25:54",
      "upperBoundTime": "00:26:12",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:12",
      "upperBoundTime": "00:26:15",
      "content": "So about how far into your time at Angola did that stop?"
    },
    {
      "speaker": "George",
      "time": "00:26:15",
      "upperBoundTime": "00:26:23",
      "content": "The cell block? I'm a say maybe about like about 17 years. You know off and on, not just."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:23",
      "upperBoundTime": "00:26:49",
      "content": "When I ask you, I realize that going into the cell block sometimes is because you did a smart thing. It's not always- I mean it's complicated, but… So would you say that that's also the amount of time that it's taken you to just kind of change your life around?"
    },
    {
      "speaker": "George",
      "time": "00:26:49",
      "upperBoundTime": "00:27:08",
      "content": "Yeah, I say the change came with me, the change, honestly, the change came for me when my grandmother passed away. That it just took everything out of me? 2008. And then right behind that, I lost my dad, so it's been, yup."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:08",
      "upperBoundTime": "00:27:10",
      "content": "Yeah, that changes things for sure. Can you tell me what your typical day is like now? I mean, it was very different then."
    },
    {
      "speaker": "George",
      "time": "00:27:10",
      "upperBoundTime": "00:27:12",
      "content": "Right. Now it's more laid back."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:12",
      "upperBoundTime": "00:27:15",
      "content": "So tell me, walk me through your day."
    },
    {
      "speaker": "George",
      "time": "00:27:15",
      "upperBoundTime": "00:27:22",
      "content": "Alright, a typical day for me, I get up each morning, clean my area, make my bed, take care of my hygiene, put some clothes on. My job assignment is the windows. So like the camp I'm at, I'm at Camp C, so my job assignment is to clean our side of the windows just clean the windows. And I make sure that's done, then I go back in. They have like kiosk machines, get on there, and I write my fiancé. I write her, correspond with her."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:22",
      "upperBoundTime": "00:28:09",
      "content": "Okay, I want to come back and talk a little bit about her."
    },
    {
      "speaker": "George",
      "time": "00:28:09",
      "upperBoundTime": "00:28:26",
      "content": "Okay yeah, my baby. I correspond with her. Then I play chess. I love to play chess and sports. This the time, college games on games so, that's pretty much my day. I don't do no hanging or mingling. I really don't."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:26",
      "upperBoundTime": "00:28:29",
      "content": "Sure, so tell me about the fiancé."
    },
    {
      "speaker": "George",
      "time": "00:28:29",
      "upperBoundTime": "00:28:56",
      "content": "Oh, my baby. That's my baby, Sonja Garret. She's humbling. She's a good woman, virtuous woman. Sometimes I have bad days, that, I mean, I'm incarcerated. I call her when I be down, she lifts me up, just with words alone, I mean. She's everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:56",
      "upperBoundTime": "00:28:57",
      "content": "How did you meet her?"
    },
    {
      "speaker": "George",
      "time": "00:28:57",
      "upperBoundTime": "00:29:11",
      "content": "Actually, through the documentary. Through the documentary. She kind of tagged me we started corresponding and what not."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:11",
      "upperBoundTime": "00:29:13",
      "content": "Did that happen a fair bit?"
    },
    {
      "speaker": "George",
      "time": "00:29:13",
      "upperBoundTime": "00:29:14",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:14",
      "upperBoundTime": "00:29:17",
      "content": "For different reasons, did different people-"
    },
    {
      "speaker": "George",
      "time": "00:29:17",
      "upperBoundTime": "00:29:47",
      "content": "And that's what I'm about to get into. Right. Because some people contacted me knowing my situation, but instead of extending a helping hand or whatever, my looks, how you look or just different reasons. But yeah, I have met some good people. I met some genuine people outside my family. I have. But, yeah, she the best."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:47",
      "upperBoundTime": "00:29:49",
      "content": "So you've actually known her for a long time then."
    },
    {
      "speaker": "George",
      "time": "00:29:49",
      "upperBoundTime": "00:29:50",
      "content": "Yeah, we got right, we got almost two years."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:50",
      "upperBoundTime": "00:29:52",
      "content": "Oh, well so after which documentary then?"
    },
    {
      "speaker": "George",
      "time": "00:29:52",
      "upperBoundTime": "00:29:55",
      "content": "The first one."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:55",
      "upperBoundTime": "00:29:59",
      "content": "So, she only waited this long to contact you?"
    },
    {
      "speaker": "George",
      "time": "00:29:59",
      "upperBoundTime": "00:30:02",
      "content": "They kind of show it."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:02",
      "upperBoundTime": "00:30:10",
      "content": "Oh I see, so she only saw it recently. Okay. That makes sense. Yeah, something about it inspired her. I can see that, yeah. Are there some people kind of keep to themselves here and others join every organization club do every certificate and everything. What have you done in terms of those types of things?"
    },
    {
      "speaker": "George",
      "time": "00:30:10",
      "upperBoundTime": "00:30:37",
      "content": "Since being here, I've been a part of clubs, I've gotten trained/trade, I've got my GED."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:37",
      "upperBoundTime": "00:30:39",
      "content": "What's your trade?"
    },
    {
      "speaker": "George",
      "time": "00:30:39",
      "upperBoundTime": "00:31:01",
      "content": "In the cooking school. I love to cook. I love to cook. I got that. I participated in a lot of other program, many other program. From substance abuse, anger management- a hundred others. Everything that's offered, almost everything, I've participated in."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:01",
      "upperBoundTime": "00:31:04",
      "content": "Is there any other trade that you're interested in doing?"
    },
    {
      "speaker": "George",
      "time": "00:31:04",
      "upperBoundTime": "00:31:13",
      "content": "Yes. I want to finish the plumbing. I want to get the plumbing because that's something I like to do too, that's a money maker there. When I was trustee, that's, I was working at the plumbing shop, and the old guy I was working for, on his truck, he taught me a great bit."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:13",
      "upperBoundTime": "00:32:12",
      "content": "Sure, so let me ask you let's get into slightly more difficult territory. It's been so long since the charge that since you were 18. And I think that when people look back and we like to talk about remorse in a very black and white way. We want you to be 100% remorseful and we don't want. I think that that is not always realistic. Some, I've heard guys tell me like, you got to let go of it, otherwise you'll turn crazy. How do you feel about things when you look back on the victim's family?"
    },
    {
      "speaker": "George",
      "time": "00:32:12",
      "upperBoundTime": "00:33:19",
      "content": "I understand, I mean, I understand their bitterness. The emptiness now because you here you lost a child, which I have never lost a child. Both my son's still alive, but I have lost two sons, to the system. I've been here, but, I can only imagine the hurt, and the anger in which they feel. I look at and I look at my mother since she been coming up here, so I can know just by looking at my mother, my father, my grandmother, everybody that come up here."
    },
    {
      "speaker": "George",
      "time": "00:32:12",
      "upperBoundTime": "00:33:19",
      "content": "And it's the same way like I mean, it's a different between death and just my being incarcerated. It's a difference, but it's that same, I guess it's that same emptiness, because they can't touch or hold their loved one or kiss them and tell them they love them. And the slight difference, which is big to the victim's family, all the victim's family that our family can tell us that. So I do understand."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:19",
      "upperBoundTime": "00:33:22",
      "content": "There are, I think, very strong parallels between the, certainly, the families of the victims and perpetrators. I mean, they both lose."
    },
    {
      "speaker": "George",
      "time": "00:33:22",
      "upperBoundTime": "00:33:26",
      "content": "Right, both ways. But it's still that, like I said. Still that slight advantage and I feel."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:26",
      "upperBoundTime": "00:33:29",
      "content": "Right. They can still tell you that they love you I'm sure. So let's look to the future a little bit so, I'd like to think that. I'd like to think that nobody's going to die here and yet you, we have point look out, and hospice. People on the wards, daily reminders of the fact that it's a possibility. I remember reading Bill Cane saying that \"85% of people are going to die\" When you are confronted by that possibility, how do you cope?"
    },
    {
      "speaker": "George",
      "time": "00:33:29",
      "upperBoundTime": "00:35:50",
      "content": "It doesn't bother me because even when the guy said that, he was proven wrong. He was proven wrong, I mean, I understand, I understand his opinion to that the possibility, but he was proven wrong because so much is happening. Not everybody into prison is guilty. Not everybody into here is guilty, but, to me, it don't bother me because I look, now what I do and what I have been doing for the past few years is I look at guys."
    },
    {
      "speaker": "George",
      "time": "00:33:29",
      "upperBoundTime": "00:35:50",
      "content": "I look at guys that have given up I'm surrounded around. I look at guys that got a lot of hope. I'm surrounded around them. And that what keep me grounded. It keep me balanced because I know that it be like I know not to ever get in there in that shape. So I just give up, again, and I have, like I told you I have but no. It's more. It's more often inside here."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:50",
      "upperBoundTime": "00:35:52",
      "content": "I think what, maybe you're talking about, a blind hope, a false sense of hope. You don't want to do that either."
    },
    {
      "speaker": "George",
      "time": "00:35:52",
      "upperBoundTime": "00:35:56",
      "content": "Yeah, no I don't either."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:56",
      "upperBoundTime": "00:36:08",
      "content": "Yeah, sure. Well, and like I said, at some point, it would make sense for you to go before the pardon board. I mean, that's one path out."
    },
    {
      "speaker": "George",
      "time": "00:36:08",
      "upperBoundTime": "00:36:18",
      "content": "Yeah, well, it's a possibility which, I don't have no type of parole eligibility or whatever, but I could request like a, after so long."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:18",
      "upperBoundTime": "00:36:48",
      "content": "Yeah, sure, right, and I've been following guys through the pardon process and getting a sense of how it works but after a certain amount of time you put an application together and then you become parole eligible that's the goal. Right. So, if you go before a pardon-parole board, you have a very short amount of time to sort of let them know who you are outside of your jacket and all of the records that they have. What would you want to communicate to them?"
    },
    {
      "speaker": "George",
      "time": "00:36:48",
      "upperBoundTime": "00:37:08",
      "content": "I would like to let them know that I'm not any longer that child. That wasn't able to think that didn't have no type of vision by them self, that couldn't do nothing for them self or anyone else. I could be productive in society. I could be better, and I know how to create opportunities."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:08",
      "upperBoundTime": "00:37:29",
      "content": "Sure, so what's along this path that you've been on, what's the worst part of it? What the people that don't really think about prison or life sentences or anything like that or Angola, what's been the worst part of this for you?"
    },
    {
      "speaker": "George",
      "time": "00:37:29",
      "upperBoundTime": "00:37:38",
      "content": "This being here? Security, being told what to do, how to do, when to do security."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:38",
      "upperBoundTime": "00:37:43",
      "content": "Okay, so tell me this, of all the things that you've accomplished, what are you most proud of?"
    },
    {
      "speaker": "George",
      "time": "00:37:43",
      "upperBoundTime": "00:38:12",
      "content": "My maturity, how far I've come. I think that's me, my character, my maturity. Because when I first got here, again, I had this chip, this arrogance about myself where I just didn't want nobody anybody tell me anything. So I'm most proud of that, my growth. That's what I'm most proud of, my growth."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:12",
      "upperBoundTime": "00:38:16",
      "content": "Staying sane."
    },
    {
      "speaker": "George",
      "time": "00:38:16",
      "upperBoundTime": "00:38:23",
      "content": "That's it and it's not hard, I mean, it's not easy. It's not, but I'm managing it."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:23",
      "upperBoundTime": "00:38:33",
      "content": "Sure, so, if you get parole eligibility down the road, do you have a vision for what the next chapter of your life would be if you were released?"
    },
    {
      "speaker": "George",
      "time": "00:38:33",
      "upperBoundTime": "00:39:40",
      "content": "Oh man, I have so much I would love to do. The first thing I want to do is like you can't save everybody. You can't change no one unless they want to be changed. But, you can only do what's best for you and I would like to do something, not just for the you, but for anybody out in the society that feels lost, just set something up for them, where they want to vent, where they want to come vent, need somebody to vent before they make the wrong decisions."
    },
    {
      "speaker": "George",
      "time": "00:38:33",
      "upperBoundTime": "00:39:40",
      "content": "They need somebody to, just somewhere to house, anything, because these are the things that lead to destruction don't have nobody to talk to, don't have nowhere to live, don't have no food to eat. And that's what I would like to do, just to have something set up for those type of people."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:40",
      "upperBoundTime": "00:40:20",
      "content": "Sure, so I really enjoyed talking to you and learning more about your life. Is there something I should have asked you or something you would like the opportunity to talk about? Again, the point of this is to sort of reach people such so they understand what this experience is like, and I think that we covered a lot of things, but is there something that you wanted to talk about that we didn't get a chance to?"
    },
    {
      "speaker": "George",
      "time": "00:40:20",
      "upperBoundTime": "00:40:23",
      "content": "Man, you covered everything, but you managed to cover everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:23",
      "upperBoundTime": "00:40:25",
      "content": "I think that's probably a good place to stop. Thank you very much."
    },
    { "speaker": "George", "time": "00:40:25", "content": "All right." }
  ]
}
