{"name":"","transcript":[{"content":"Gordon Newman REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Okay. So would you mind starting by setting the record for the interview by stating your name, the crime of conviction, how old you were, and how much time you've served."},{"speaker":"Gordon","time":"00:00:12-7","content":"My name is Gordon Newman Jr. I was 18 years old when I was convicted of first degree murder and what was the other one?"},{"speaker":"Marcus","time":"00:00:21-6","content":"How long have you served?"},{"speaker":"Gordon","time":"00:00:23-9","content":"Life sentence. I was given a life sentence"},{"speaker":"Marcus","time":"00:00:25-3","content":"Okay and how much of that have you served?"},{"speaker":"Gordon","time":"00:00:27-7","content":"23 years now close to 24."},{"speaker":"Marcus","time":"00:00:30-4","content":"23. So the purpose of this as I tried to explain earlier is just to learn about who you are and your life and your experiences both before this and what's been most of your life which has been here. So I'd like to start off with learning about your family, can you tell me a bit about the folks who raised you?"},{"speaker":"Gordon","time":"00:00:49-8","content":"Grew up my mom and dad were married, when I was younger but they was kind of young when they had me and I think they was ill prepared to bring a child into this world, so they got divorced when I was real little, bickering and fighting in the house. So I can remember from an early age and I was sent to live with the woman that raised my mom my aunt Alma. Real terrible neighborhood and it was, I grew up and I was the only child."},{"speaker":"Marcus","time":"00:01:18-6","content":"Where do you grow up?"},{"speaker":"Gordon","time":"00:01:19-9","content":"7th ward New Orleans close to round the fairgrounds where the jazz fest every year and it was a pretty rough neighborhood so I had a pretty rough early childhood."},{"speaker":"Marcus","time":"00:01:32-5","content":"Sure and you said you were an only child? So you said this was the lady who raised you mother."},{"speaker":"Gordon","time":"00:01:40-1","content":"Yes."},{"speaker":"Marcus","time":"00:01:40-4","content":"Aunt what?"},{"speaker":"Gordon","time":"00:01:42-0","content":"Alma."},{"speaker":"Marcus","time":"00:01:43-6","content":"Alma tell me about her."},{"speaker":"Gordon","time":"00:01:51-0","content":"She was a good woman. She was poor, my dad would pay her I think every week whatever every month to take care of me and her house was infested with roaches and rats, at the time, you were a child and you didn't know any better but looking back I could see it was a bad environment. She had a card game going every night of the week to I guess supplement her income. She was on government assistance and she was a good lady though. She genuinely loved me."},{"speaker":"Marcus","time":"00:02:18-5","content":"So from a very early age then you kind felt like you kind of had to make it on your own or did you feel that there was a stable sort of loving environment to be in?"},{"speaker":"Gordon","time":"00:02:18-5","content":"Well at the time I think as a child I couldn't really, I didn't know the difference but looking back at it yeah, I think now some of the issues that probably affected me, being abandoned and neglected by my parents you now being sent to live there, and like I said it was a bad environment. Because I suffered from being bullied, terribly like maybe by the time I was 11 years old I'm pretty sure I had over a hundred fights and I didn't win none of them probably so yeah it was pretty rough."},{"speaker":"Marcus","time":"00:02:54-1","content":"What were the fights about was it about when you look back on it what was it?"},{"speaker":"Gordon","time":"00:03:06-7","content":"Kids will be cruel. I was born handicapped. I don't have toes on my feet, so that was one thing I get ridiculed about, and just it was like I was always the lightest guy in class I always went to all black schools and just being the way I was looked that, just you the pretty boy you subject to all kind of."},{"speaker":"Marcus","time":"00:03:31-9","content":"Sure how do you identify race wise."},{"speaker":"Gordon","time":"00:03:34-5","content":"Race wise how do I identify well I'm African American. Well I actually got my genealogy done on ancestry.com and I'm mixed with everything."},{"speaker":"Marcus","time":"00:03:46-6","content":"You're global."},{"speaker":"Gordon","time":"00:03:49-7","content":"Yeah everything there's like 20 different things in Europe and 15 African tribes, areas, it's a mix of things."},{"speaker":"Marcus","time":"00:03:57-1","content":"Okay, but you identify as African American."},{"speaker":"Gordon","time":"00:03:56-6","content":"Yes personally I would say so."},{"speaker":"Marcus","time":"00:04:04-4","content":"So a lot of race based types of conflict as well about belonging and you are you're the lightest skinned person in the class."},{"speaker":"Gordon","time":"00:04:10-8","content":"Yeah that was the subject of it was like a lot of just based I guess derived from envy or jealousy and stuff like that."},{"speaker":"Marcus","time":"00:04:18-9","content":"Yeah kids can be cruel."},{"speaker":"Gordon","time":"00:04:18-4","content":"Yes."},{"speaker":"Marcus","time":"00:04:20-9","content":"School then probably was not a safe haven for you."},{"speaker":"Gordon","time":"00:04:25-8","content":"No, it was terror. I had like five or six different, two of them actually up here now serving life with me that used to be guys that bullied me. And yeah it was going home every day and coming back it was, I used to live in terror growing up."},{"speaker":"Marcus","time":"00:04:41-3","content":"Right I'm sorry that's not a nice way to think of your childhood."},{"speaker":"Gordon","time":"00:04:45-6","content":"No it isn't."},{"speaker":"Marcus","time":"00:04:47-4","content":"What school were you in?"},{"speaker":"Gordon","time":"00:04:49-1","content":"I originally went to a school called Edward Douglas White (E.D. White) around on the fairgrounds racetrack, then my dad he sent me to a private school Our Lady the Rosary on esplanade avenue, catholic school, and went on from that, I got kicked out of a lot schools. Most of them I went to I had behavioral problems."},{"speaker":"Marcus","time":"00:05:08-8","content":"What was the, did the bullying stop when you went to the private school?"},{"speaker":"Gordon","time":"00:05:13-5","content":"It was like the bullying stopped when I overcame my first bully maybe at around 9 or 10 years old, and I don't understand the psychology behind it, but I became I started just acting out in school and always getting cut up and getting in a lot of fights later on and I got kicked out of the majority of schools I went to from hence forward."},{"speaker":"Marcus","time":"00:05:36-8","content":"Okay and so did you get kicked out of private school?"},{"speaker":"Gordon","time":"00:05:40-3","content":"Yes I went to St Augustine private school and I got kicked out of there too."},{"speaker":"Marcus","time":"00:05:45-1","content":"Okay what was the highest grade of school that you completed?"},{"speaker":"Gordon","time":"00:05:47-6","content":"12th."},{"speaker":"Marcus","time":"00:05:49-4","content":"So you have a high school degree?"},{"speaker":"Gordon","time":"00:05:51-0","content":"Yes I went, I moved to Georgia. I have an uncle and his wife and they came and they rescued me like when I was like 16 and took me off the streets, and moved me with them. They actually wanted, my uncle got a promotion early on and maybe like when I was around that time 10."},{"speaker":"Gordon","time":"00:05:51-0","content":"He wanted to take me with him when he moved to Marietta, Georgia but my parents wouldn't let him take me so he I moved with him later on and I went to Lassiter High School out there in Marietta to complete school."},{"speaker":"Marcus","time":"00:06:19-5","content":"Okay and so you finished school and then did you moved back to New Orleans."},{"speaker":"Gordon","time":"00:06:24-1","content":"Yes well from there we moved, my mom went to Augustus Georgia finished at a high school called Josie and from there yes I moved back to New Orleans when I was 18."},{"speaker":"Marcus","time":"00:06:33-5","content":"That's when this charge happened?"},{"speaker":"Gordon","time":"00:06:36-7","content":"Yes."},{"speaker":"Marcus","time":"00:06:42-4","content":"You said obviously that you were bullied quite a bit. Did you also have a group of friends that you could kind of trust and rely on coming up?"},{"speaker":"Gordon","time":"00:06:52-8","content":"Trust and rely on. Yeah I always had a lot of friends. I always had a lot of, I guess my uncle used to tell me they were really nothing bad associates, but yeah I had a good deal of friends growing up, family on both sides we had really small close family, so I had a good little support system."},{"speaker":"Marcus","time":"00:07:15-4","content":"Okay that's good and what's your relationship like now with these family folks."},{"speaker":"Gordon","time":"00:07:20-7","content":"It's pretty strong. My dad, he's my rock. He came around later on. He shipped back and I went to move with him when Alma died, when I was maybe 10 or 11. So I moved with him to another bad neighborhood. He's a great guy, he's a good provider."},{"speaker":"Gordon","time":"00:07:20-7","content":"He's real good and I never heard him tell one lie in his life. But as far as understanding how a parent supposed to be a teacher, he wasn't very good at teaching me lessons. So he wasn't a great influence, so also the influence I received from my culture that's basically what taught me."},{"speaker":"Marcus","time":"00:07:54-9","content":"Sure who visits you up here on this day?"},{"speaker":"Gordon","time":"00:07:59-0","content":"My dad family friends."},{"speaker":"Marcus","time":"00:08:02-9","content":"Okay alright and with the rodeo coming up do they come up for the rodeo"},{"speaker":"Gordon","time":"00:08:10-5","content":"They used to yes but now I don't really go to the rodeo, it way too much."},{"speaker":"Marcus","time":"00:08:18-0","content":"Oh so you were in quite a few different neighborhoods quite a few different schools and homes is there one of those homes that stands out to you more than any of the others in your memories."},{"speaker":"Gordon","time":"00:08:18-0","content":"All of them stand out but I've probably would have to say that it was my dad's house when between that the ten days like when you start junior high school when things really start to spiral downhill."},{"speaker":"Marcus","time":"00:08:47-3","content":"Okay explain that to me."},{"speaker":"Gordon","time":"00:08:52-1","content":"How I understand it now I'll explain it to you. Like I just was talking about the influence of the culture, I didn't understand it all during the time and developing and building on an understanding of it now, but media, Hollywood, the music industry. To this day I'm 43 years old and I can still remember every gangster rap lyric of every song from my childhood. I actually have a tattoo from an artist Tupac thug life tattooed across my chest."},{"speaker":"Gordon","time":"00:08:52-1","content":"I look back I was a good kid till about 11, 12, 13 I think but that's the point when you really start trying to find your identity, especially when you go to these public schools and it's like little gladiator schools well you have to be tough. It's almost like a prison, and I came I think some kind of way when I was but I think stuff in front of bullying."},{"speaker":"Gordon","time":"00:08:52-1","content":"And when I, all right, I'll explain it to you like this. I was going to St. Aug."},{"speaker":"Gordon","time":"00:08:52-1","content":"I was hanging in the neighborhood and I was hanging with these. One day I was in a dice game, and I think more than anything I just wanted to be accepted. And I started hanging with these real bad group of guy I'm talking man unlike anything I've ever seen I had never seen anybody get killed in my life I hadn't."},{"speaker":"Gordon","time":"00:08:52-1","content":"But I started hanging with these guys and they were like little recruiters they'd try to find little guys, they I guess I mean manipulate and I saw them and that's what they used to rob and kill people. And I started hanging with them and that's overnight it's like they showed me another side and you would think that normal teenager would be like man let me get out of here but for some reason. I look back at it and it had actually appealed to me everybody that was scared of them."},{"speaker":"Gordon","time":"00:08:52-1","content":"I don't know you're the professor but in some kind of way it appealed to me at that time at an early age, and I continued to hang with them until ultimately I came to my senses, and that's when my uncle came and got me but some bad seeds were planted and it ultimately led to me coming here."},{"speaker":"Marcus","time":"00:10:47-2","content":"Sure did you say you were kicked out of school a fair bit did you get arrested a few times before this conviction?"},{"speaker":"Gordon","time":"00:10:54-3","content":"Yes."},{"speaker":"Marcus","time":"00:10:56-0","content":"What was your first arrest?"},{"speaker":"Gordon","time":"00:10:57-8","content":"I think maybe trespassing on another school property and fighting a lot of stuff like that but it was never nothing serious."},{"speaker":"Marcus","time":"00:11:07-3","content":"All right any convictions prior to this one."},{"speaker":"Gordon","time":"00:11:10-7","content":"Juvenile but it was a misdemeanor. It was a gun charge."},{"speaker":"Marcus","time":"00:11:17-0","content":"It was a gun charge, did you feel the need to carry a weapon?"},{"speaker":"Gordon","time":"00:11:20-8","content":"Yes."},{"speaker":"Marcus","time":"00:11:23-0","content":"Ok at what age."},{"speaker":"Gordon","time":"00:11:25-9","content":"I think the first time I actually ever possessed a weapon I was maybe like 13 years old. They had a group of guys out at a junior high school I went to Gregory they had the St Bernard housing projects was close by and they had a group of guys they was in the teens or early 20s and they used to come rob us out of our jackets and tennis shoes."},{"speaker":"Gordon","time":"00:11:25-9","content":"So they used to just prowl and we 11, 12 years old and they come so I got a gun from a guy around a house just to try to protect us, but it was a little bitty 22, it didn't work and that was the only time until like I said later on in life when I think I was maybe 17 when I started hanging with the guys I was just telling you about."},{"speaker":"Marcus","time":"00:12:02-8","content":"Sure was there any physical abuse or sexual abuse in your life?"},{"speaker":"Gordon","time":"00:12:13-7","content":"No nothing other than bullying. I probably should have been more disciplined but my mom and dad were pretty give me a full ride."},{"speaker":"Marcus","time":"00:12:19-5","content":"Okay alright so it was just being bullied by other kids but nothing in the home."},{"speaker":"Gordon","time":"00:12:24-3","content":"Yes."},{"speaker":"Marcus","time":"00:12:26-9","content":"What about, you're so young when you got arrested for this but prior to that did you have any significant relationships with girls."},{"speaker":"Gordon","time":"00:12:35-7","content":"Yes."},{"speaker":"Marcus","time":"00:12:38-4","content":"Tell me about the most significant one."},{"speaker":"Gordon","time":"00:12:40-7","content":"Well the most significant one probably was the one that the girl I was with prior to catching this charge I'm on now. I was pretty good with the ladies. I started late like maybe 15 and I used to get a lot of attention from girls and I had a rule."},{"speaker":"Gordon","time":"00:12:40-7","content":"I didn't mess with girls that had any kids but she actually had 3 kids. I started dating her and for some reason she, I was smitten and she had 3 kids, and I was raising the three kids like they were my own, and one of them she was deaf the oldest one and there's no justification but the charge I'm on now was a robbery. I was, I take ownership for my change now."},{"speaker":"Gordon","time":"00:12:40-7","content":"Not saying that, I saw one of the questions, do you think your life would have ended up other than? No probably something else would have happened, because I was on a bad track."},{"speaker":"Marcus","time":"00:13:31-6","content":"Okay well then let me ask you that question now if this hasn't happened how do you think your life would have unfolded."},{"speaker":"Gordon","time":"00:13:39-3","content":"Something else would have happened that's why I don't really have too many bad days here from a spiritual aspect. I know that God saved my life like he did many others here there's no doubt about that because evidence is everybody I knew, all the people I'm talking about right now they not living anymore."},{"speaker":"Gordon","time":"00:13:39-3","content":"I'm talking about my whole generation almost everybody much age up here they all either dead or up here. They decided some kind of way God intervened they got on the right track and got their life together but the path I was on, on that road I don't I needed to come here."},{"speaker":"Marcus","time":"00:14:16-9","content":"Right yeah I know and you're not alone as you've said a lot of the guys that I've met on this project a lot of them say yeah if I wasn't arrested for this I'd probably be dead."},{"speaker":"Gordon","time":"00:14:32-2","content":"Or on another crime."},{"speaker":"Marcus","time":"00:14:40-2","content":"Yeah do you have any children of your own?"},{"speaker":"Gordon","time":"00:14:42-0","content":"One daughter."},{"speaker":"Marcus","time":"00:14:43-4","content":"Okay, tell me something about her, what's her name?"},{"speaker":"Gordon","time":"00:14:44-8","content":"Antonia she's amazing. She's 24 years old in nursing school right now no credit of mine, her mom did a great job with her the same lady that had the three kids. We have a beautiful lady."},{"speaker":"Marcus","time":"00:14:55-4","content":"Ok so she had a fourth, the fourth one was your daughter."},{"speaker":"Gordon","time":"00:15:00-6","content":"Yes."},{"speaker":"Marcus","time":"00:15:02-2","content":"Yeah tell me."},{"speaker":"Gordon","time":"00:15:04-5","content":"I mean while I was here we never spent any time with her she was born while I was in prison."},{"speaker":"Marcus","time":"00:15:07-4","content":"Yeah have you been able to parent from behind bars?"},{"speaker":"Gordon","time":"00:15:11-5","content":"Yes."},{"speaker":"Marcus","time":"00:15:13-4","content":"Ok tell me about that how does that work."},{"speaker":"Gordon","time":"00:15:17-5","content":"Well strangely enough I feel that I played a pivotal role I came in late but I learned a lot about parenting my first job in Angola was as PREP, life skills coach and that's been my passion since I been here. And I think for the most part I learned a lot about parenting from my mentor he has six sons he just recently went home Robert Richardson. You know him?"},{"speaker":"Marcus","time":"00:15:40-3","content":"Well I know of him."},{"speaker":"Gordon","time":"00:15:42-6","content":"Yeah and that's the guy that really taught me for like I've known him for 14 years and I learned a lot of what I know from him and he did an amazing job raising those kids from here and was hands on throughout the entire process so."},{"speaker":"Marcus","time":"00:15:56-3","content":"Exactly. So if you had to identify one factor that got you on the path that you were going down and didn't get you diverted to somewhere else, what do you think that would be if there's one?"},{"speaker":"Gordon","time":"00:16:18-3","content":"As I say it's the culture that that played I think the most pivotal role me not understanding. I'll give you an example well you a sociology professor you understand that. Especially they had a movie came out called Menace To Society and a lot of theaters across America had to get shut down after the movie, and old dog had a character in that and he used to hold his gun like that, if you ask anybody my age, across urban America everybody was holding his guns like that."},{"speaker":"Gordon","time":"00:16:18-3","content":"And I could go on and on about the subliminal and suggestive powers of media and the music, but it really that culture and I didn't understand I thought I was a leader growing up but looking back I was just a follower, just following the trends. And I really feel, once I came to understand I felt played like I was brainwashed but everybody wants to be the tough guy in our culture they want to be the bad guy I kind of fell in love with being the good guy now though."},{"speaker":"Marcus","time":"00:17:22-3","content":"Yeah and I think that that's a very common experience right, you take in your surroundings. Were drugs and alcohol a part of your life?"},{"speaker":"Gordon","time":"00:17:31-5","content":"Yes I'm glad you said that that's what I should have said in answer to the last question yes drugs. My mom and dad both got high early on and almost my entire life I have also the stepping stone story held true. I started off with marijuana from an early age stealing pot from my parents, and one thing led to another and I started snorting cocaine."},{"speaker":"Gordon","time":"00:17:31-5","content":"I hate cocaine too. I believed the movie Scarface I watched that a thousand times and some kind of way that played a hell of a role Al Pacino's character. Because I just was doing it just to do it, I don't even like how it makes you feel and I started doing heroin up here over the years and that lasted for a while, and I was finally was able to break free so I been clean for a while now."},{"speaker":"Marcus","time":"00:18:13-6","content":"Sure and have you gone through the AA and NA programs here the Angola substance abuse programs?"},{"speaker":"Gordon","time":"00:18:17-6","content":"I've actually taught some."},{"speaker":"Marcus","time":"00:18:23-0","content":"Yeah sure so I actually would like to switch gears and start talking a little bit about your time here from your early experiences up to now but is there something about your life before you were incarcerated that it's important to understand to who you are now that I didn't get a chance to ask you about?"},{"speaker":"Gordon","time":"00:18:46-3","content":"Something about my life before I was incarcerated. Even though a lot of the answers I've been giving are coming from a worldly perspective I'm a firm believer in God. So I could probably give you all different answers in the spiritual perspective on how I believe I ended up to the point I am now it was like if you look back it kind of make no sense."},{"speaker":"Gordon","time":"00:18:46-3","content":"Because I'm the only person really on both sides of my family to ever really get in trouble ever come to jail like the Newman's. They're great everybody, all my grandmothers children I've never heard one of them to even tell a single lie they're great people. And I always wonder how growing up I had a read black cloud that seemed like it followed me and I would always."},{"speaker":"Gordon","time":"00:18:46-3","content":"And now that the way I look at it I like to say I pretty much dedicated my entire life to God now that's all I want to do is serve and help people that came down similar paths that I did, and help them avoid the pitfall that I fell into. That's what I'm planning on doing for the rest of my life doing service it's the thing that the only thing that brings me happiness and joy now."},{"speaker":"Gordon","time":"00:18:46-3","content":"So I look now and honestly I could say that in retrospect everything I went through I had to go through I needed to equip me to be able to do the job that I feel God has ordained for my life. So even on the charge I'm on now in the death penalty phase of the trial, all the victims got up and they told them I don't want him to die."},{"speaker":"Gordon","time":"00:18:46-3","content":"One of the cousins actually got up there and she said when I came to court I was expecting to see some ferocious killer and when I saw that little boy I don't know what to think. So she said she had to call her pastor later that night when she got back to her hotel room. So she said her pastor said, maybe some things about God, going to understand maybe your cousin had to die, so that many more could live, and I didn't understand that at the time."},{"speaker":"Gordon","time":"00:18:46-3","content":"But I stayed in OPP for like almost 9 years before I came to Angola straight and I was always the tier rep on the juvenile tiers and I really realized the effect I had on a lot of those guys later on in life. I have a stack of letters this big from guys they write me to tell me the effect I had helping in the life and stuff. So I'm just that's all I plan on doing so much so if I had to do life I think hopefully my faith would be strong enough to accept that mission because yeah."},{"speaker":"Marcus","time":"00:21:05-2","content":"So let me clear up a couple of things so why were you at OPP for 9 years?"},{"speaker":"Gordon","time":"00:21:11-1","content":"In legal aspects I got convicted in 1998 but you can't come up here until you're formally sentenced, so I filed a motion for a new trial and it took years it was pending for years and years and years so I was never formally sentenced so I got sentenced in 2003 and so they just dragged it out."},{"speaker":"Marcus","time":"00:21:34-8","content":"Okay and you were charged with first degree murder and were they seeking the death penalty you said something about that."},{"speaker":"Gordon","time":"00:21:40-5","content":"Yes."},{"speaker":"Marcus","time":"00:21:41-6","content":"Okay and did they seek the death penalty."},{"speaker":"Gordon","time":"00:21:44-0","content":"Yes I got found guilty of first degree murder and went to the death penalty phase the next day."},{"speaker":"Marcus","time":"00:21:45-1","content":"What came of that?"},{"speaker":"Gordon","time":"00:21:50-4","content":"Life they gave me life."},{"speaker":"Marcus","time":"00:21:52-1","content":"They gave your life. Obviously one of the things we're exploring in this project is this transformation right the very thing you just told me about and in your case through a spiritual lens. How would you describe the person who came to Angola in other I'm trying to say did some of these changes happen for you in OPP or was it really the changes that have happened since you've been in Angola that have shaped who you are today."},{"speaker":"Gordon","time":"00:22:26-6","content":"It was I think a gradual thing over a long period of time it didn't happen overnight I can say that yeah it took some years, and I'm still learning more and more and more as I go along this journey but when I came up here in 2003, I was still pretty much a mess."},{"speaker":"Marcus","time":"00:22:50-5","content":"Well, OPP doesn't do good things for anybody."},{"speaker":"Gordon","time":"00:22:53-7","content":"You there's nothing constructive, no kind of you couldn't even get a book in there there's no kind of religious people that come in there. It's terrible. It was terrible environment you actually come out worse than what you went in most times."},{"speaker":"Gordon","time":"00:22:53-7","content":"So when I came up here I still was in that the culture still had me where I wanted to be a gangster"},{"speaker":"Gordon","time":"00:22:53-7","content":"And it's crazy because not just me if you look upon most of the people you interview they're actually real good dudes, they're not killers they not they just got ran got into believing that's what they were but they not man they got some real beautiful dudes here."},{"speaker":"Gordon","time":"00:22:53-7","content":"I can't even tell you one evil dude that I met on this journey I'm sure they have some just that I guess life done hit them so hard where they just can't turn back but I don't think nobody is irredeemable but these guy especially the juvenile ones a lot of the ones going home they really ready to go home. They beautiful people."},{"speaker":"Gordon","time":"00:22:53-7","content":"But when I first came up like I said everything was divine like I first went and I got a job as a mentor and one thing led to another and I just throughout the pastors going step by step by step by step over the years, George just called me and told me that they going to approve a program that I've been praying on a program, a mentor program for the west shore right now. So everything has been beautiful."},{"speaker":"Marcus","time":"00:24:12-1","content":"Yeah and sounds to me like you found your calling here."},{"speaker":"Gordon","time":"00:24:13-3","content":"Yes."},{"speaker":"Marcus","time":"00:24:14-6","content":"So, tell me a little bit about specific ways in which you experience your life differently now from when you first came here I mean how are you a different person from that person I mean it's 15 years everybody changes, but what specifically are those changes for you."},{"speaker":"Gordon","time":"00:24:39-0","content":"Well the thing I use another question I remember you had on there to answer that question when you said if there's one thing you could tell your younger self."},{"speaker":"Marcus","time":"00:24:49-5","content":"Yeah what advice would you give?"},{"speaker":"Gordon","time":"00:24:51-8","content":"I grew up deep into the catholic church I was even an altar boy for a few years but I never actually felt that connection with God and I would just tell myself to really trust and believe in god and it's not nothing that just clicks but now that I have that faith and that belief in God."},{"speaker":"Gordon","time":"00:24:51-8","content":"Yeah I would tell myself to do that that's the change is when I came here I didn't have god in my life and when you truly have a deep relationship with god that will change anybody you can't stay the same."},{"speaker":"Marcus","time":"00:25:22-5","content":"Okay and how long have you had that relationship?"},{"speaker":"Gordon","time":"00:25:29-5","content":"Like I said like everything else it's been a of and on thing but where I'm at strong right now with it it's been over a year now but this relationship where I been fighting to get there since I've been in Angola. I went from the day I came here. Because when I came I realized soon as I got off the bus I was like whoa, where am I like I got kidnapped and placed on a plantation or something."},{"speaker":"Gordon","time":"00:25:29-5","content":"I had one thing Albert Einstein it's a quote a lot of people like to use where they say insanity is the same thing expecting a different result. There's one that says that the significant problems we face cannot be solved at the same level of thinking at which they were created."},{"speaker":"Gordon","time":"00:25:29-5","content":"So I realized that man I got to change the way I think it's not working I realized like I said one of the hardest things is for a man to be able to look into the mirror and see thyself the way they really are and I thought I was really a hell of a dude back then when I was like, got to make some corrections."},{"speaker":"Gordon","time":"00:25:29-5","content":"So I think once that journey starts and you get on that path it's only a matter of time but every individual case is going to be different because God has a different plan for each of our life, and different lessons that we have to learn, different trials we go through. So it's beautiful struggle actually I wake up with a smile in the face of it."},{"speaker":"Marcus","time":"00:27:01-4","content":"Yeah so they say that everybody comes to Angola works in the field but that's usually when they're young you were a little bit older when you came in than the your average young 18."},{"speaker":"Gordon","time":"00:27:15-8","content":"Everybody works in the field if they have a strong back. I have to do this because of my handicap."},{"speaker":"Marcus","time":"00:27:22-6","content":"Okay alright so that's how you got into mentoring and life skills."},{"speaker":"Gordon","time":"00:27:25-0","content":"Actually that was that was unexplainable too. One day at the dorm where they had the prep us 03 and the only people that could be in that dormitory were people that was in the prep program or the mentors and I just got moved out the blue to the dorm. The first day a lady named Ms. King I was over in the program, just called me out the blue and gave me an interview and hired me no reason. And then that's when I hooked up with Robert and a guy named Kurt Davis you may know him too."},{"speaker":"Marcus","time":"00:27:57-9","content":"Okay, so can you describe your typical day here like walk me through your routine from when you get up to when you go to bed."},{"speaker":"Gordon","time":"00:28:04-5","content":"First thing I do when I get up in the morning is to get on my knees and pray and thank God for another day and glorify him and I work I always try to keep body and soul. I watch the news, workout, might get a cup of coffee I don't hang with nothing but guys in their early 20s all day long and for some reason I just have a strong impact on them they all flock to me."},{"speaker":"Gordon","time":"00:28:04-5","content":"So you see me with just a bunch of little like I have a little 19 year old guy just came up here and we together all day. I just I just do whatever I can to teach them from my mistakes and that's what I do every day. I spend time in church every day come up here with Ron Olivier every night we pray and do whatever I just try to keep it mainly as productive as possible because it's true that idle mind is the devils playground, so I try to stay busy and stay on that vein."},{"speaker":"Marcus","time":"00:29:04-0","content":"Sure did you find that OPP spending that time trying to find your way and deal with personalities and so forth prepared you to deal with Angola. So that it wasn't a culture shock when you were here because you did say that you were like where am I being on a plantation?"},{"speaker":"Marcus","time":"00:29:04-0","content":"And I get that part but in terms of the daily interaction with in in prison did you feel that it was ok a little bit different but it's not culture shock because of OPP."},{"speaker":"Gordon","time":"00:29:34-3","content":"Well it was culture shock when I first went to OPP because I had never been to jail like that before so then looking the way I look jail was pretty rough back then but I stayed in OPP so long that I practically knew everybody when I came up here and said like in OPP I always been a pretty known guy. Pretty influential figure within jail."},{"speaker":"Gordon","time":"00:29:34-3","content":"I'll give you an example when I first I left OPP in 2003 I think maybe the bullying thing also they always made me on the juvenile tiers for some reason I always was a for the underdog like I always protected the younger guys all that rape stuff I hated it. Never went on in any tier I ever been on that's why they always put me over the tiers."},{"speaker":"Gordon","time":"00:29:34-3","content":"And when I left in OPP I actually stabbed a guy in 2003 in defense of another younger guy and on the way they put me in the back of an SID car and drove me over to Hunt and SID that's special investigation division in Orleans Parish he turned around and tell me I had no idea this man had any type of connection with God they called me Flash."},{"speaker":"Gordon","time":"00:29:34-3","content":"He said flash he said I got it in my heart to tell you something he said, \"Man you been getting in more problems since you been here than anybody else since I been working here,\" it was mainly with the drug thing. I always like I said had a problem with that and he was like, \"But I never met a man more intelligent with more influence. God gave you that power, you have a duty and a responsibility to lead people in the right direction. You've been leading the wrong way. I want you to go up to Angola and think about this.\""},{"speaker":"Gordon","time":"00:29:34-3","content":"And it didn't make much sense there but it stuck we me so when I came up here I remember another question was like your first day in here man I remember my first day I like I said I wish I would have been rehabilitated then I wish I could sit here and tell you that it soon as I got in the police car, I was a changed man but no it didn't happen like that."},{"speaker":"Marcus","time":"00:31:38-3","content":"What was your first day couple of weeks here?"},{"speaker":"Gordon","time":"00:31:41-5","content":"Embarrassing but I'm going to be honest with you my first day I got high like 5 minutes was like a search a little convoy came to help me with my property I got high I played poker I did everything that you're probably not supposed to do the first day here and the dudes were saying, I heard a group of dudes saying yesterday it was like almost like when I came here,"},{"speaker":"Gordon","time":"00:31:41-5","content":"I was like a celebrity everybody knew me and just welcomed me with open arms and I'm Flash this image I done built up all these years but he Flash is gone now, I keep him resting in peace but yeah it was it wasn't a typical day in prison when I first came here."},{"speaker":"Marcus","time":"00:32:22-3","content":"Yeah sure it doesn't sound like it do you still go by Flash."},{"speaker":"Gordon","time":"00:32:28-2","content":"No I try not to but something you can't sit there and correct them, and a lot of people call me Gordon or Newman."},{"speaker":"Marcus","time":"00:32:33-3","content":"Right yeah so I know that you've gone down a very spiritual path here are there other organizations that you've been involved with since you've got here, trades that you've picked up or clubs that you're active with"},{"speaker":"Gordon","time":"00:32:52-4","content":"I was in the seminary I'm getting back into seminary next semester in January. I have a graphic arts degree and I tutor GED and literacy and been involved in the education process throughout my entire incarceration."},{"speaker":"Marcus","time":"00:33:07-1","content":"Okay wow. So when you look back at what happened and I know you explained it to me briefly that you were motivated by getting money. When you look back at the victim and you think about the victim's family that I guess you got a peek into that through the trial, how do you feel about it so long after the fact?"},{"speaker":"Gordon","time":"00:33:40-3","content":"Once again I have to be honest with you, I was actually just talking about this with a guy the other night, a real good friend of mine my best friend she's a clinical psychologist she lives in Atlanta and she asked me a question one time in e visit she was like, \"Do you feel any remorse?\" And I was like, \"Yeah.\" And she was like, \"How do you know.\" And I said, \"Man I been in here all this time such and such.\" And she was like, \"You don't feel remorse you still thinking about yourself you not thinking about the victim.\""},{"speaker":"Gordon","time":"00:33:40-3","content":"So we had like a two year debate about remorse and I didn't. I'm ashamed to say that but I can't remember even that trial, and that just shows you how quickly a culture you can go from being one person to being influenced to being a person who can take a human life, and not feel anything, and but one day it hit me like maybe 5 years ago. I just cried like a baby, and I was like wow."},{"speaker":"Gordon","time":"00:33:40-3","content":"And yeah I feel remorse I feel terrible now everything in me would like to just hug the victim's family reach out to them and just tell them I'm sorry. And the thing that keeps me kind of at a balance with it is the fact that I believe really that God sent me through even the stuff I was just telling you about my bad behavior over the years because I'm sure you understand that the guys that I mentor right now, the reason they look up to me is because of Flash. If I wouldn't have been that person, they wouldn't really respect me, wouldn't listen."},{"speaker":"Marcus","time":"00:35:06-7","content":"You wouldn't have any credibility."},{"speaker":"Gordon","time":"00:35:14-6","content":"I wouldn't have no type of. And so I can see it in that sense with what his cousin said on the stand made sense because I can't understand how God worked but in some way all that was necessary in order for me to do the things that I'm trying to do with my life. So I try not to dwell on it, just try to do the best I can for the rest."},{"speaker":"Marcus","time":"00:35:32-4","content":"Yeah and I can tell that you're very genuine about that feeling. What was it? What was the catalyst for you coming to this awareness about the victim, and the victim's family, was there a specific thing?"},{"speaker":"Gordon","time":"00:35:49-1","content":"Was there a specific event that happened? I think just I can't right now, I'm going to write you and tell you if I could search and pinpoint the specifics because normally I can always trace something to the one root of everything, but maybe to just when I started examining just as a whole all of us, and start seeing how as a people, how the culture just have it to where we just be killing each other senselessly and like it's every day, but that's not normal, and I think I'm trying to teach others it kind of."},{"speaker":"Marcus","time":"00:36:34-2","content":"Forced you to look at yourself."},{"speaker":"Gordon","time":"00:36:36-1","content":"Yeah I looked at myself like wow man we're tripping, and it was that, and maybe God came around and touched me in a way but I don't know I'm going to have to think on that."},{"speaker":"Marcus","time":"00:36:47-9","content":"Yeah. Well you know sometimes it's just a gradual process and perspective but I was just curious if there was something."},{"speaker":"Gordon","time":"00:36:54-2","content":"Yeah like you said none of us is the same, we were 10, 5 years ago."},{"speaker":"Marcus","time":"00:36:58-5","content":"Absolutely the other part of this when something like this happens it's not just the victim or the victim's family but it's also your whole family that has to go through this and in some ways it also affects the community. So can you tell me a little bit about how this has impacted your family and your loved ones."},{"speaker":"Gordon","time":"00:37:22-5","content":"Well like I said thankfully, God looked out for my daughter in my absence. I'm her dad, I missed out on everything. So it affected her, my mom I'm an only child and I'm pretty sure I could have been there. It devastated my family to a degree but the way I look at it now, especially one side of my family a lot of dissention in it and I believe I'm going to be the one to put everything together."},{"speaker":"Gordon","time":"00:37:22-5","content":"So I don't even, I know I'm kind of really optimistic in my thinking like I had to really think about it. I try to look at the bright side of everything and even though it might be a bad thing that happened, I can kind see the future, and I can tell in the end it's all gone make sense, and I'm there to bring it all together and really be a powerful positive impact on my community to a much larger degree, than I actually hurt it, I believe that."},{"speaker":"Marcus","time":"00:38:27-3","content":"I can understand how it would impact your mother but who in your family do you think has had the hardest time watching you go through all this."},{"speaker":"Gordon","time":"00:38:38-4","content":"I don't know about my family I'm pretty good at I always all my life I kind of always as long as everybody else like is straight, I'm good. So I do a good job at keeping it together from here."},{"speaker":"Gordon","time":"00:38:38-4","content":"More than anything the victim's family. I always think about the impact that I had on him, his mom I can only imagine if my son or my daughter got killed how that would affect me. So I'm pretty sure whatever impact it had on my family, I could see if I had a lot of kids out there maybe I was a child myself."},{"speaker":"Gordon","time":"00:38:38-4","content":"So besides the little hurts and pains that my parents probably experienced as far as with me about it I didn't have nowhere near the impact that it had on his family and taking his life that was when I can only imagine he was a real loved guy he had a lot of people and I could look at back at them crying in trial and it wasn't no comparison."},{"speaker":"Marcus","time":"00:39:40-2","content":"Did you know the victim?"},{"speaker":"Gordon","time":"00:39:41-7","content":"Yes."},{"speaker":"Marcus","time":"00:39:44-4","content":"So I know that you've said that you've kind of come to terms with the idea that if this is God's plan for you then you're ok with that."},{"speaker":"Gordon","time":"00:39:59-7","content":"Not a hundred percent but that's what I'm trying to get at my freedom."},{"speaker":"Marcus","time":"00:39:58-9","content":"Yeah I understand."},{"speaker":"Gordon","time":"00:40:00-9","content":"I'm trying to get that rock solid faith, and that's also a process."},{"speaker":"Marcus","time":"00:40:04-7","content":"What for you today is the worst part of the prison experience of being here with a life sentence?"},{"speaker":"Gordon","time":"00:40:13-0","content":"The worst part. You asked me a question how I feel today, I probably be a bad interviewee to ask that question to I'm a pretty happy guy and I don't have too many bad days but if I had to just draw from another day in the past when I may have been down, that's I really believe this is my purpose with all my heart 100% with every fiber of my being."},{"speaker":"Gordon","time":"00:40:13-0","content":"So in my mind it's actually just place the universe and I just learn I really think it's the training ground for me to get equipped with the necessary tools, to go out there."},{"speaker":"Gordon","time":"00:40:13-0","content":"I've been working on a program for the last 15 years to Stop The Killing In New Orleans I developed a program called The Orleans Human Transformation at the rodeo they about to let me implement it on the west shore that's the only thing I just think towards those goals."},{"speaker":"Marcus","time":"00:41:14-5","content":"Yeah you're an excellent interviewee and I really appreciate the way you're experiencing this which is that I'm making the best of making a meaningful existence out of this so that's the way I take it from what you're saying. If you were to seek a pardon at some point in your life what would you want the pardon board to know about you, what would you want to tell them."},{"speaker":"Gordon","time":"00:41:49-2","content":"Well whatever words I would choose to say I would just basically want them to know the truth about me. You now I was a work in progress and I was a lost little boy that I had to learn how to become a man and I'm ready now, like I said just the truth."},{"speaker":"Marcus","time":"00:42:10-5","content":"Do you feel ready?"},{"speaker":"Gordon","time":"00:42:13-1","content":"Yes and no I know this is crazy to say but I believe I'm ready, but for what I'm doing it don't even bother me as far as the time frame. I really I think I would before I want to complete my seminary degree before I go home and I would like to get this program, this is my life's work get it off the ground here because I'm using it as a small model for here to take to the streets."},{"speaker":"Gordon","time":"00:42:13-1","content":"So personally talking about if I'm ever going to commit another crime in my life. No indeed. No I wouldn't be. No that's over, that person's dead. if that but just ready for what I want to do in my life I could easily say yeah, but I've given my time back twice here my conviction overturned and both times I felt like I was ready. I just knew I was at the time, and in retrospect I look back, I'm glad you didn't let me go thank God."},{"speaker":"Gordon","time":"00:42:13-1","content":"So now I kind of I'm real honest with myself and how you look back on every year and you realize how much you've learned from that year to that year. So I know I'm still growing and I know but I think even when George called me for an interview out the blue today and telling me that they going to the wardens are going to back the programs that I proposed to them. I know I still have."},{"speaker":"Marcus","time":"00:43:38-4","content":"Yeah can you tell me a little bit about this program?"},{"speaker":"Gordon","time":"00:43:43-2","content":"Sure it's see if I can give you the short version it's based on just basic laws of physics like sir Isaac Newton said, 'one force an only be replaced by an equal or greater force.' It was negative influence that got us in the state the culture the media got us thinking we gangsters, and just all that as a whole we going through the science of, you understand it."},{"speaker":"Gordon","time":"00:43:43-2","content":"Only a positive force that is greater than that can so what I'm doing is right now within prison the administration is starting to understand that guys like us that were the worst ones are the only ones with the power to change the younger generation because they are so I'm talking about it's a lot worse and it's constantly deteriorating as it goes on with the culture and but the problem is a lot of guys that been through that."},{"speaker":"Gordon","time":"00:43:43-2","content":"I've been through haven't learned their lesson all the way yet and they some of the ones that the administration trusts the least because they trying to figure out how best to use us, because if you even though they listen to you if you not a good example not doing the right things don't know the right things to teach them you no god to them possibly even worse."},{"speaker":"Gordon","time":"00:43:43-2","content":"And I've developed a program to gather all the guys of influence and have a mentor training course that's the human transformation course that I developed."},{"speaker":"Marcus","time":"00:45:07-0","content":"Is to train the mentors."},{"speaker":"Gordon","time":"00:45:08-9","content":"Yes. It's to train them. I used to just do a lot of individual mentoring around the prison but it kind of drains my energy so I came up with a way to train all the guys of influence to be effective mentors and it really works because a lot of guys that around my age up here all of us are starting to realize the same way."},{"speaker":"Gordon","time":"00:45:08-9","content":"I'm saying that this is my purpose in life you would be I'm pretty sure a lot of the guys you've interviewed already were saying the same things and along the same lines all of us realize that we the answer we the answer curing a lot of guys are eager and ready."},{"speaker":"Gordon","time":"00:45:08-9","content":"I think God is like raising an army for us around here and with me I just want to be a servant I don't care about the credit I just want to really do the work I don't care about money at all but."},{"speaker":"Marcus","time":"00:45:57-0","content":"Yeah I actually think that maybe you've thought about this as well but that training somebody to be a mentor is also a way of mentoring them."},{"speaker":"Gordon","time":"00:46:03-3","content":"Yes."},{"speaker":"Marcus","time":"00:46:04-4","content":"Once you realize that that's a responsibility that's something that helps you, right so I don't see a downside anywhere."},{"speaker":"Gordon","time":"00:46:13-1","content":"Yeah it's the same thing like a mentor. It's like this the same thing alright once a dude got a hundred guys around here that gather together and put them through a 8 week course just teach basic life skills communications dynamics decision making conflict, resolution money management, time management, career planning substance, abuse parenting."},{"speaker":"Gordon","time":"00:46:13-1","content":"I have a manhood class that I teach and a mentorship and just teach them how to best use harness their powers of influence and be in and it's like an incentive laced package that the administration is going to where I believe it's going to inspire all of them enough because some of them you can't just you got to really give them something to believe in and that'll be enough to make them want to do the right thing and same thing that I plan on doing when I get back to New Orleans."},{"speaker":"Gordon","time":"00:46:13-1","content":"It's the same principles. I'm going to start off from the 7th ward and all the guys around the neighborhood that's doing the wrong thing it's going to be a little it had to be a little more souped up out there you can't just pull up on a drug dealer, I had to show him another alternative, so I'm pretty astute in business too."},{"speaker":"Gordon","time":"00:46:13-1","content":"Show them another way to live their life and teach them the same thing. I told colonel carpenter told me that you a guy of influence but with that comes a responsibility and I believe if I can effectively convert guys like that when I go home they can go back into they own neighborhoods because they look up to them you would be surprised at how easy it is when those guys look up to you tell them something that it'll change and go in another course, just like that."},{"speaker":"Gordon","time":"00:46:13-1","content":"To answer your earlier question that's what happened to me when I first met Robert and Curtis. They were the ones that really spent time with me and showed me the same thing I'm talking about doing they did it to me."},{"speaker":"Marcus","time":"00:47:59-6","content":"Sure so of all of the things that you've accomplished and the changes that you've gone through, what are you the most proud of?"},{"speaker":"Gordon","time":"00:48:12-6","content":"The most proud of, I probably mm I want to point to just certain little accomplishments I've made in here as far as I've written a book that I have yet to publish because I'm always adding to it but it's ready to be published now self-titled my last name new man it's basically along the lines of what I'm already saying developing I have developed all of the human transformation program."},{"speaker":"Gordon","time":"00:48:12-6","content":"But that's not what I'm the most proud of thing that bring me the most joy I wish I would have brought my letters like when you affect a guy's life and they write you and they tell you like a guy just wrote me two days ago this little guy he was 21 and was next door to me in the cell like a year ago."},{"speaker":"Gordon","time":"00:48:12-6","content":"And the first line he said man when I first met you the first thought in my mind was man I want to be just like this guy that's what man that just I wouldn't trade any of it for a trillion dollars so that's what I'm most proud of stuff like that."},{"speaker":"Marcus","time":"00:49:17-8","content":"Yeah no that makes sense to me."},{"speaker":"Gordon","time":"00:49:16-2","content":"Helping people yeah when you have that real effect on them and you're able to change yeah."},{"speaker":"Marcus","time":"00:49:21-0","content":"Yeah no that makes a lot of sense to me well I appreciate you doing this with me I have learned a lot about you I'd like to learn a bit more about you and follow you down the road a bit on your journey."},{"speaker":"Gordon","time":"00:49:36-2","content":"No problem."},{"speaker":"Marcus","time":"00:49:38-1","content":"Is there something that I should have asked you in this interview that I didn't or something that you would like feel to know about what this experience really is"},{"speaker":"Gordon","time":"00:49:50-4","content":"Well if that is the case it I can't think anything but it would be your fault because you're the interviewer because I don't care what questions you ask I will answer. This is the first time I've actually publicly said I'm guilty of my crime."},{"speaker":"Gordon","time":"00:49:50-4","content":"For years all of us nobody you come to jail, I didn't do it but the day I made up the decision God I prayed on it and he's like man like they say the truth will set you free and I'm like and a lot of guys like man you I don't care I'm just going to leave it in God's hands, but so you could ask me anything. If you think of anything else. I'll answer it come on."},{"speaker":"Marcus","time":"00:50:27-1","content":"Yeah I'd like to know why I'm what your thoughts are on why somebody who is living out their very conventional life who doesn't really think about prison or what goes on in prison why should they care about men who are serving life without parole why should they care about trying to change that."},{"speaker":"Gordon","time":"00:50:53-5","content":"Well I believe that in a Godly sense we should all care about each other in this world, but I guess you could just go back to the Bible and Jesus said he is without sin cast the first stone. I think I never met a perfect human being, and any person of understanding could understand the situation, I'm pretty sure how you understand when I showed you how life took turns and got me the way I am right now, and everybody else."},{"speaker":"Gordon","time":"00:50:53-5","content":"I don't think that none of these people once they understand the science behind it, the psychology, which is in there all the evidence is clear why they even passed the first juvenile bill because they showing that it really a lot of people, it wasn't their fault, especially some people. I had a choice. I come from good people but a lot of the guys out there man you listen I know you've heard some of the stories where they actually had to steal to just eat and support their families."},{"speaker":"Gordon","time":"00:50:53-5","content":"How they say, when you're born with fire furnace, just like you don't have no chance. So if people understand that and understand that everybody's not the same that they were people do change, people do transform we have some great here that have left from out here. Calvin one of them and Calvin is a beautiful dude."},{"speaker":"Marcus","time":"00:52:05-9","content":"Yeah he is."},{"speaker":"Gordon","time":"00:52:08-1","content":"I'm talking about he is like role model for me. I just wrote him a letter and his integrity that's like mind, that's just all, if you just put integrity on my tombstone, if I could be a trustworthy, credible guy I'm cool with that but that wasn't nothing of value before but any sensible person is going to understand that, can understand that."},{"speaker":"Gordon","time":"00:52:08-1","content":"They will also understand that a lot of these guys up here they want to be part of the solution. So if a guy wants to be a part of the solution and the truly are changed then everybody know people can change because they change themselves. And they should want to let people that change go not just anybody because a lot of people not ready that's why the recidivism rate for guys that 20 years on murder is so low because all the guys."},{"speaker":"Marcus","time":"00:52:56-3","content":"Sure zero."},{"speaker":"Gordon","time":"00:52:58-1","content":"It's zero they not coming back and they going to stop a lot of people from coming here trust me. so in that regard anybody else who thinks otherwise I believe something wrong with them."},{"speaker":"Marcus","time":"00:53:08-3","content":"Ok that's a good place to stop."}]}