{"name":"","transcript":[{"content":"Hannibal Stanfield REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Can you just tell me a little bit about your childhood about your family folks that you grew up with?"},{"speaker":"Hannibal","time":"00:00:06-9","content":"I was born in Alexandria Louisiana, actually my grandmother on my mother's side had a lot of children ten girls and six boys so I had a lot of first cousins growing up and we're real close knit on my father's side of the family they educators my father was a coach and a teacher at the high school in my neighborhood and his sister was a teacher at the elementary school I went to."},{"speaker":"Hannibal","time":"00:00:06-9","content":"And it was a normal life church on Sundays out of bed early in the morning got to make up the bed clean the bathroom do all my household chores things of that nature. We was expected basically to always be a good reflection of the family not do anything that was a bad reflection on our family our community."},{"speaker":"Marcus","time":"00:01:05-1","content":"Was there a lot of fighting in the house?"},{"speaker":"Hannibal","time":"00:01:08-2","content":"No not in the house we were actually my parents and grandparents were strict on that that was like prohibited."},{"speaker":"Marcus","time":"00:01:17-4","content":"Would you say you were in a loving household?"},{"speaker":"Hannibal","time":"00:01:19-5","content":"Yes"},{"speaker":"Marcus","time":"00:01:21-1","content":"And that you had adults that were taking interest in you and making sure that you were ok?"},{"speaker":"Hannibal","time":"00:01:25-3","content":"Yes sir"},{"speaker":"Marcus","time":"00:01:27-7","content":"So was there one particular person that you might've been particularly close with?"},{"speaker":"Hannibal","time":"00:01:33-6","content":"My aunt now my father's sister. She was a teacher at the elementary school I think as a kid she's the one who actually- by the time I went to kindergarten I could write certain things like my name my address my phone number in the event"},{"speaker":"Hannibal","time":"00:01:33-6","content":"I got lost she'd always want me to be able to write down my name and my address and my phone number and remember certain things and maybe like at an early age she taught me the lord's prayer and certain psalms by member so she was kind instrumental in my life she always felt like education made you unfit for oppression."},{"speaker":"Marcus","time":"00:02:16-9","content":"Sure. If I was- you were talking earlier on about some of your specific memories of elementary school and the teachers and so forth if I was standing right outside your house just looking around in the neighborhood back when you were a kid what would I see?"},{"speaker":"Hannibal","time":"00:02:36-2","content":"Probably my little cousin Audrey and Chorine they always jump rope played jacks I mean like grasshoppers chirping older ladies down the street hanging clothes on the clothesline."},{"speaker":"Marcus","time":"00:03:01-6","content":"I can imagine it. What about your school do you have a specific memory of your school? Your elementary school is there a memory that stands out for you from elementary school?"},{"speaker":"Hannibal","time":"00:03:18-5","content":"Yeah basically I can kind of remember like when my mother first took me to school first she took me to the health clinic to get a shot. I had to have certain shots and stuff before your went to school and she walked me to school she was like look go in here and tell the principal and give all the teachers permission to discipline you saying don't you do anything bad that might be a bad reflection on your upbringing anything that wouldn't look good on the family."},{"speaker":"Hannibal","time":"00:03:18-5","content":"She said like always remember to say excuse me, thank you and please and then she told all the teacher that if they ever saw me do anything wrong that they had her permission to chastise me."},{"speaker":"Marcus","time":"00:04:09-3","content":"Did you have a particularly close friend?"},{"speaker":"Hannibal","time":"00:04:12-0","content":"Yeah"},{"speaker":"Marcus","time":"00:04:14-5","content":"Growing up?"},{"speaker":"Hannibal","time":"00:04:15-4","content":"Yeah I had a best friend growing up"},{"speaker":"Marcus","time":"00:04:18-4","content":"Tell me about him"},{"speaker":"Hannibal","time":"00:04:21-0","content":"Rick and I were kind of like inseparable growing up he lived on the next street over and if he got up before me when I got up in the morning he'd be in the living room watching television waiting on me and if I got up and he wasn't in my living room I go to his house and kind of like wait on him and we were always real close and his mother was like a maid or a nanny and as we got older she continued to have children and he kinda like dropped out of school somewhere around the ninth or the tenth grade and he turned to the streets and started distributing drugs and our life kinda took 2 different paths then."},{"speaker":"Marcus","time":"00:05:14-3","content":"When was the last time you saw him?"},{"speaker":"Hannibal","time":"00:05:16-9","content":"We were together the night I…"},{"speaker":"Marcus","time":"00:05:19-9","content":"Okay."},{"speaker":"Hannibal","time":"00:05:20-3","content":"…committed this crime"},{"speaker":"Marcus","time":"00:05:21-4","content":"Okay and you haven't seen him since that day?"},{"speaker":"Hannibal","time":"00:05:26-7","content":"No actually while I was in jail on this crime he wound up coming and we were on the same cell block he was on another charge."},{"speaker":"Marcus","time":"00:05:36-6","content":"Were there any fights outside the house?"},{"speaker":"Hannibal","time":"00:05:40-1","content":"Well like I said earlier my father was a coach at the high school so I kinda grew up playing sports I always played like baseball and basketball and football whatever was in season so I've always had like a soft heart for like what they consider nerds or misfits when we was growing up and basically a lot of fights I had with bullies for I was protecting other kids who wasn't able to defend themselves."},{"speaker":"Hannibal","time":"00:05:40-1","content":"So I didn't really fight very much in fact I think I ever got into very many fights but it was always basically a result of me defending somebody else."},{"speaker":"Marcus","time":"00:06:23-7","content":"Were you ever kicked out of school?"},{"speaker":"Hannibal","time":"00:06:24-7","content":"No sir."},{"speaker":"Marcus","time":"00:06:26-4","content":"So you graduated from high school."},{"speaker":"Hannibal","time":"00:06:28-4","content":"Yes sir."},{"speaker":"Marcus","time":"00:06:28-9","content":"And you did a little bit of college right?"},{"speaker":"Hannibal","time":"00:06:31-4","content":"Yes sir."},{"speaker":"Marcus","time":"00:06:35-3","content":"How old were you when you committed this crime?"},{"speaker":"Hannibal","time":"00:06:37-5","content":"When I committed this crime I was 19 years old. I graduated from Peabody magnet, a magnet school in Alexandria and I attended Louisiana state university for one year and my girlfriend unexpectedly got pregnant so I went to the national guard's basic training and advance training to get a GI bill and it was actually homecoming night when I went back to get my best friend I was telling you about Ricky I went back to get him to bring him to the homecoming festivities which was the night prior when I got arrested on this charge."},{"speaker":"Marcus","time":"00:07:23-6","content":"Do you I think you so you have a son or a daughter?"},{"speaker":"Hannibal","time":"00:07:27-4","content":"Yes sir."},{"speaker":"Marcus","time":"00:07:28-2","content":"Just one?"},{"speaker":"Hannibal","time":"00:07:29-2","content":"One son."},{"speaker":"Marcus","time":"00:07:31-6","content":"Have you stayed in contact with him?"},{"speaker":"Hannibal","time":"00:07:33-4","content":"Oh yes we email back and forth they have a kiosk in the dormitory J so prior to the kiosks being in dormitory I basically stayed active in his life through writing and telephone conversations but we have a good relationship."},{"speaker":"Marcus","time":"00:07:55-0","content":"Do you have visitors that come and see you?"},{"speaker":"Hannibal","time":"00:07:56-8","content":"Yes I'm my nephew comes to see me a lot my mother used to come see me a lot but she got Alzheimer's and she's not in really good condition so my brother told me I won't bring her anymore."},{"speaker":"Marcus","time":"00:08:19-0","content":"I'm sorry to hear that. Was this the first time you were arrested?"},{"speaker":"Hannibal","time":"00:08:25-2","content":"Yes sir."},{"speaker":"Marcus","time":"00:08:29-3","content":"Were drugs and alcohol a major part of your life?"},{"speaker":"Hannibal","time":"00:08:33-0","content":"No sir I guess you could say at best maybe experimented off and on like I said I was always an athlete sports was always my passion in fact drugs the night of this crime kinda like resulted in me being incarcerated so I got to take a hands off approach with them that experience was a bad experience. But other than that maybe socially at parties but I don't really like drinking or getting high but I did here and there at parties things of that nature."},{"speaker":"Marcus","time":"00:09:10-3","content":"So one of the reason we've asked to speak with you is that you are considered a trusted member of this community and as somebody who has really turned their lives around since you've been here. When you look back on the past you who was driven through those gates you think back to that person how would you describe that person?"},{"speaker":"Hannibal","time":"00:09:36-3","content":"Well when I first arrived here my mind I felt like I was victimized by society and I felt like I didn't deserve to be judged by the worst event that had ever taken place in my life and I had a lot of bitterness and everything and after performing introspect and making a determination that I wanted to basically still live in my vision and above my condition so over the course of time it's just something inside of me."},{"speaker":"Hannibal","time":"00:09:36-3","content":"I never wanted to be remembered for a bad act so even in this system initially giving into peer pressure and kinda like it was like everybody was operating a certain way and me being like the preppy school kid I didn't wanna be an outcast but the older I got the more I was like well."},{"speaker":"Hannibal","time":"00:09:36-3","content":"I'm not gone conform to this environment and change to fit the environment if I know better I should do better and try and get the environment to change to me. Maybe if I had better manners or I was better educated maybe I should be a better example to the others who weren't so. I basically just started to every day starting to have desire to be a better person than I was the day before. So I started to move so evolving to my full potential I guess you could say growth and development starting thinking."},{"speaker":"Hannibal","time":"00:09:36-3","content":"I realized I was having the same problem maybe was- I don't make excuses and say that it was my youth it was just that my perception the way I saw myself the way I saw others and the way I saw God started to change. And I was like well I'm not going to see myself as a victim. I'm going to refuse to be victimized regardless to where I am. I'm going to continue to elevate my living standards and my quality of life over the course of time."},{"speaker":"Hannibal","time":"00:09:36-3","content":"I just started to change. I made a conscious decision that regardless to where I am I'm still gone everyday just try to be a better man than I was the day before."},{"speaker":"Marcus","time":"00:11:58-1","content":"And over 27 years. a lot of things change we age out of a lot of things as well but did you say a little something about the extent to which being in this prison environment helps with that transformation or hinders that transformation I mean what helps and what hinders people's ability to change?"},{"speaker":"Hannibal","time":"00:12:24-1","content":"What helps is in a controlled environment if you have the determination to become a better person you can control what you expose yourself to. Once they started to implement rehabilitation programs, vocational programs and other type of programs I made a conscious decision that I'm not going to expose myself to the gang I'm not going to expose myself to this or that."},{"speaker":"Hannibal","time":"00:12:24-1","content":"Anything that might hinder me from elevating myself to where I could act in a capacity of a responsible adult or a civilized human being I just stopped exposing myself to it and in society sometimes you really don't have you from certain communities in certain environments you really don't have a choice what you exposed to even though you try not to allow it to influence you."},{"speaker":"Hannibal","time":"00:12:24-1","content":"But sometimes it doesn't always happen that way because things move so fast and one bad decision and you can fall from glory and here it's like you basically you have a lot of time to think about wherever you go you gone be there so you sitting there and be like man do I really want my life to be defined"},{"speaker":"Hannibal","time":"00:12:24-1","content":"I really won't be remembered as a prisoner wherever I am I really want to be- I mean at the end of the day nobody really wants to be a bad person so in here your conscience is always there with you. it convicts you the older you get your conscience starts to convict you might try to walk around in certain environments and add a macho image but at the end of the day when you lay down your conscience starts to convict you about everything you did wrong and the older you get the more you start to want to be right want to just power of peace and mind."},{"speaker":"Marcus","time":"00:14:40-9","content":"Yeah. Can you describe what your typical day is here? Everybody at Angola has a job what's your day like?"},{"speaker":"Hannibal","time":"00:14:51-3","content":"Now I get up like about 4 in the morning even though the lights don't come on until five but I like to kind of get up prison is almost like being in a house with a bunch of children so you have to get up if you really want To have access to like the clean face bowl so I try to get up early and clean the face bowls sweep and mop the bathroom so that I can have bathroom clean and wash my face brush my teeth and before everybody gets up and rushes in."},{"speaker":"Hannibal","time":"00:14:51-3","content":"And when the lights come on I normally watch a segment of the local news and then the world news and basically its breakfast now I graduated from concrete finishing school and Louisiana technical college system like last year and after that I got a job for groundskeeper but for the last like 4 or 5 years I've been involved in educational programs so it always be like to school at 7 out of school at 3 well lately since I've been a groundskeeper what I do at 7 o'clock I go outside and I get in the area I'm responsible for I go and get like some gardening tools."},{"speaker":"Hannibal","time":"00:14:51-3","content":"Its kind of therapy where I can stand out there and get some peace at mind and think and what I try to do even though I'm incarcerated with life without the benefit of parole. I try to stay prepared I try to have me a one year goal I always like in my mind what I wanna be one year from now what I wanna be 5 years from now and I try to do things to position myself to be able to accomplish those goals. I prepare as if I'm going home tomorrow."},{"speaker":"Hannibal","time":"00:14:51-3","content":"Even though I have a life without parole I try to prepare as if I'm going home tomorrow because who knows what might happen I'd rather go prepared than go unprepared like in the military we have a saying that proper preparation prevents poor performance. So I try to keep a one year goal and a five year goal at all times. But like I said I got a diploma from culinary arts school from Baton Rouge community college and three certifications from the national center for construction education and research."},{"speaker":"Hannibal","time":"00:14:51-3","content":"And how I went about picking those is I went to the library a lot and read the newspapers in free time and I was reading that the largest industries in America are transportation number 1 food service and the hospitality industry number 2 and the construction industry number 3. I figure food clothes and shelter that's something that everybody needs if I wanted to be- have job skills in those fields in the event that I ever went home I could be an asset to society and not a liability."},{"speaker":"Marcus","time":"00:18:02-0","content":"Yeah and one of the things that I struggle with thinking about is the fact that Angola has some of the highest quality educational vocational programming in the prison system in Louisiana and yet the vast majority of people here who have access to those programs have life sentences."},{"speaker":"Hannibal","time":"00:18:27-5","content":"Yeah. Like maybe like 4 or 5 years ago they implemented a reentry program and yeah I think I'm a firm believer in God and I think that God has a purpose and plan for everything and coincidentally when I was in culinary arts school they started the reentry program."},{"speaker":"Hannibal","time":"00:18:27-5","content":"So even though I have the life without benefit of parole suspension of sentence the guys in reentry actually have a sentence like they might have ten years or five years but what happens is once they get a GED and complete a vocational program they get to go home."},{"speaker":"Hannibal","time":"00:18:27-5","content":"So a lot of them in there wasn't good as far as academics. It did them a whole lot of good to help them, they were struggling with certain things and I was available to help them and a lot of them I mean it made me feel just as good as I was going. when we graduated and they got to go home and they was like man thank you I've never finished anything in my life so just those contributions made it kind of."},{"speaker":"Marcus","time":"00:19:45-0","content":"Yeah and I understand that this is also a community and so those skills that you get can improve this community for sure. so I don't want to discuss the actual details of the crime but when you look back on that and I know you had said that like all of us we don't want to be judged by the worst thing we've ever done but when you think back on that and the victims involved and the 27 years that have passed such that it perhaps even might be a distant memory how do you feel about that?"},{"speaker":"Hannibal","time":"00:20:33-0","content":"I feel like my actions victimized not only the family of the guy who lost his life but my family as well. I assume full responsibility because I feel like disobedience is actually caused everything because my grandmother used to tell me. I was telling you about my best friend, our lives took different paths and when I graduated high school and went to college"},{"speaker":"Hannibal","time":"00:20:33-0","content":"I'd always come home on Fridays just to spend the weekend with him and then go back to school on Sundays and my grandmother she asked me one days she said why do you continue to come back and hang around Ricky and I was like well he's my best friend."},{"speaker":"Hannibal","time":"00:20:33-0","content":"And she was like y'all going in two different directions baby. she was like Ricky shows another life and I was like he's still my friend but I'm not doing anything and she told me she said you don't always have to be doing anything she said sometime you can be in the wrong place at the wrong time with the wrong people and you gone be just as accountable as them."},{"speaker":"Hannibal","time":"00:20:33-0","content":"When I think about that over the years I realize that I would've taken her advice, I would never been in the hotel room with them that night this happened and what I said when I first got here I felt kind of victimized because I mean I don't even carry arms I was unarmed I couldn't even say I went somewhere with the intentions specific intent to kill I didn't even have a weapon."},{"speaker":"Hannibal","time":"00:20:33-0","content":"But I look back and sometimes experience is a good teacher. sometimes you have to look back on the bad things and the good things that happen to your life and a combination of them both kinda like it builds character like adversity doesn't always define who you are sometime it refines who you are. and even though I wouldn't choose this path I mean I don't think that I would've become the person that I am today if I hadn't gone through this experience."},{"speaker":"Hannibal","time":"00:20:33-0","content":"There's a lot of things that I'm grateful for now that I used to take for granted I mean even though I'm incarcerated the constitution that I live by in other words in society when I was younger it was like maybe laws, rules and regulations that I really didn't have regard for now I take pride in living by my own constitution and the constitution that I live by is kinda like stricter it keeps me within the guidelines."},{"speaker":"Hannibal","time":"00:20:33-0","content":"So I take pride in basically being a good person doing things that I know I'm supposed to do without having to be told and the person who arrived here wasn't that person. I guess maybe I don't basically to make a long story short the conditions of my heart has changed the way I think and."},{"speaker":"Marcus","time":"00:24:00-8","content":"We're hoping that people serving life sentences will increasingly gain parole eligibility and should that day come what would you want a parole board to know about you?"},{"speaker":"Hannibal","time":"00:24:23-6","content":"I want them to know that I'm no longer. Well I'm still the same person I was at 19 that the nature of the offense is never gone change but I no longer think or act the same way that I did when I was 19. I've started practicing what you call metacognition where you think about what you thinking about I'm a firm believer for that the thoughts that you allow to process in your mind basically determines your actions and I'm confident that society my community would be a better place with me than it would without me because I want to be involved in community outreach to enrich children."},{"speaker":"Hannibal","time":"00:24:23-6","content":"I want to serve things that exist in society. I've been separated from a society for November this year make 29 years. They affect me I want kind of like bridge the gap with the community and law enforcement and that's another thing I learned from being in here. And it took years for me to understand that that see in here even though we prisoners and the correction officer are correction officers that we're all forced to function as one community what we call a gated community at Angola. But even though we from different ends of the spectrum we are all forced to function as one and a lot of times"},{"speaker":"Hannibal","time":"00:24:23-6","content":"I look at the news and see where now the police on one end and the community on the other end and through sports I want to like the children. I wanna participate in coaching and mentoring the youth and I want the law enforcement I wanna be a part of that with them."},{"speaker":"Marcus","time":"00:26:19-1","content":"Tell me what the worst thing is about being here?"},{"speaker":"Hannibal","time":"00:26:23-7","content":"I guess the worst thing being here is being stereotyped being treated like an animal at the circus. people always popping the whip or they're not being judgmental but you may have people whose morals and living standards are not quite as high as yours always popping the whip at you and just being mean and like poking poking but I've learned to use that as fuel just keep peace."},{"speaker":"Hannibal","time":"00:26:23-7","content":"After I got a certain age I started to like I'd be in the field and I'm like man you know something? If you can't put up with the man on the horse constantly yelling speed up speed up then you might get a chance to go home and you might have a boss that's always yelling so I try to learn something good."},{"speaker":"Hannibal","time":"00:26:23-7","content":"And I learned that sometime it ain't always life or your conditions that might be as messed up as the way you look at it. I started to be more optimistic start looking for the good in everything and even though they might yell and scream at it might instill discipline in me or it might be a test to see how much I can hold my composure or try to just.. Not respond the way they want but respond the way that a person should"},{"speaker":"Marcus","time":"00:28:01-1","content":"I understand. What do you think you are most proud of over the last 29 years?"},{"speaker":"Hannibal","time":"00:28:11-4","content":"Probably the impact that I made on some of the younger guys who are younger than my son my son will be thirty on the 16th of august and I think what made me feel better than anything when I was in culinary arts school right after Katrina a lot of the people who had been displaced from the storm from new Orleans judge Hunter and judge white had started a reentry program and a lot of young guys who had been first admitted initially"},{"speaker":"Hannibal","time":"00:28:11-4","content":"I was trying to keep a hands off approach from them, because most of them were like rude and belligerent but me being forced to be there around a lot of them made me realize that they wasn't bad people they just didn't know any better and for me to help them transition from where they came and to see them graduating evolve into better people. Because a couple of them I realize that they don't mean harm they just couldn't read and write."},{"speaker":"Hannibal","time":"00:28:11-4","content":"So for me to be part of helping them learn how to read and write and me seeing how proud they was when they passed tests or when they got their GEDs and seeing them actually go home and one of them he was in my class he was in welding he sent pictures back be like man I didn't hustle no more."},{"speaker":"Hannibal","time":"00:28:11-4","content":"I'm welding look I got the house and just seeing that and realizing that I actually did something to make other people see me as something other than just a number and impact somebody else lives and give them something to help them succeed well, I couldn't apply anything I had acquired just to be able to pass it on. I think that was the best thing I think that I ever did."},{"speaker":"Marcus","time":"00:30:18-1","content":"Is there something that I should have asked you that I didn't? Something else you want to tell me about?"},{"speaker":"Hannibal","time":"00:30:30-6","content":"Let me see…"},{"speaker":"Marcus","time":"00:30:42-4","content":"Maybe something you think we should know about what it is to serve a life sentence what that means or anything else that you wished I had asked you"},{"speaker":"Hannibal","time":"00:30:50-8","content":"I mean it's a lot of pressure and stress being in a hopeless situation waking up every day not knowing whether you'll die in prison but on the same token you sit there and wonder is actually a justice system what if its really an injustice to a human being basically and just take the worst decision he ever made and hold him responsible for it for the rest of his entire life and not even consider that he may have changed"},{"speaker":"Hannibal","time":"00:30:50-8","content":"I mean the department of corrections I think correct is the root word too it seems like if you had any intentions on correcting a person you could at least evaluate him and see if he's been corrected and then return him back to where you actually captured him from. the question I ask is, do the legislators actually believe in rehabilitation do they think that a person can change and if so then how could you take a 19 person and just.. Its actually a death sentence it's the slow death I mean its like I'm going to put you here and you just stay there until you die."}]}