{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:18",
      "content": "Hayward Jones REDACTIONS FINAL"
    },
    {
      "speaker": "Hayward",
      "time": "00:00:18",
      "upperBoundTime": "00:00:38",
      "content": "My name is Hayward Jones I was convicted of second degree murder when I was 23 years old. I've been incarcerated for 20 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:38",
      "upperBoundTime": "00:00:42",
      "content": "So I'm going to start by asking you some questions about your childhood and you can look at me"
    },
    {
      "speaker": "Hayward",
      "time": "00:00:42",
      "upperBoundTime": "00:00:45",
      "content": "All right I didn't know."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:45",
      "upperBoundTime": "00:00:50",
      "content": "Yeah no that's cool. So I want to know a little bit about where did you grow up?"
    },
    {
      "speaker": "Hayward",
      "time": "00:00:50",
      "upperBoundTime": "00:00:55",
      "content": "I grew up in Slidell, Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:55",
      "upperBoundTime": "00:00:55",
      "content": "Okay can you tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Hayward",
      "time": "00:00:55",
      "upperBoundTime": "00:02:03",
      "content": "I was pretty much raised in a single parent home. My mom and dad separated when I was very young probably when I was about 4 or 5. My childhood was very unique and different than most."
    },
    {
      "speaker": "Hayward",
      "time": "00:00:55",
      "upperBoundTime": "00:02:03",
      "content": "I grew up a very angry personality because we had to deal with me and my siblings who I live with five other siblings 3 girls and 2 other guys' males we lived with initially in my early childhood we lived with going back and forth through different \"stepdads or moms boyfriends.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:00:55",
      "upperBoundTime": "00:02:03",
      "content": "My mom was trying to do the best she could, neither of those never stayed. So we didn't have a positive role model or figure. I was angry at both my parents because they never explained nothing to us and that was one of the directions I took, I just I was bitter. Young angry no direction."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:03",
      "upperBoundTime": "00:02:05",
      "content": "Where are you in the birth order?"
    },
    {
      "speaker": "Hayward",
      "time": "00:02:05",
      "upperBoundTime": "00:02:28",
      "content": "Right in the middle. All the girls are older and then me and then my two brothers with my mom and then I do have some other brothers and sisters outside of that with my dad and I have one other brother, and three other sisters with my dad."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:28",
      "upperBoundTime": "00:02:32",
      "content": "So when was the last time you saw your dad?"
    },
    {
      "speaker": "Hayward",
      "time": "00:02:32",
      "upperBoundTime": "00:03:23",
      "content": "My dad passed away about 4 years ago to brain cancer and lung cancer. Me and my dad always had like this kind of weird relationship. It was like I knew he was my dad but he wasn't a very affectionate person. He was a very more or less hard guy. It was like we had a business agreement relationship."
    },
    {
      "speaker": "Hayward",
      "time": "00:02:32",
      "upperBoundTime": "00:03:23",
      "content": "I never heard my dad say he loved me until I was an adult and incarcerated already."
    },
    {
      "speaker": "Hayward",
      "time": "00:02:32",
      "upperBoundTime": "00:03:23",
      "content": "So but through time and I guess just maturity me and my dad made amends definitely before he left, and we had a way better relationship as I was incarcerated than when I was growing up."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:23",
      "upperBoundTime": "00:03:26",
      "content": "Sure."
    },
    {
      "speaker": "Hayward",
      "time": "00:03:26",
      "upperBoundTime": "00:03:47",
      "content": "But very when my dad passed away I was, I went to his funeral it was more of a celebration because I know my dad was in a good place with God. I knew my dad was me and him were we had a decent relationship before he passed away so that was good for me."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:47",
      "upperBoundTime": "00:03:56",
      "content": "Oh yeah sure. So was there, so I'm taking that you didn't have a very good relationship with the men who came into your mother's life."
    },
    {
      "speaker": "Hayward",
      "time": "00:03:56",
      "upperBoundTime": "00:04:32",
      "content": "Oh absolutely not we had made pacts we used to we didn't want our mom to be with anybody. We used to do some very mischievous things like put sugar in the gas tank bust windows, flatten tires whatever, so he ain't coming around here. So it's just very I grew up like I said and my mom was like being a single parent she was probably more abusive physically but we were neglected on a personal level. We just never had a lot of family time."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:37",
      "content": "Did you feel some responsibility, you are the oldest boy?"
    },
    {
      "speaker": "Hayward",
      "time": "00:04:37",
      "upperBoundTime": "00:04:39",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:39",
      "upperBoundTime": "00:04:43",
      "content": "So some of that responsibility in terms of looking after the family and your mother must have fallen squarely on your shoulders."
    },
    {
      "speaker": "Hayward",
      "time": "00:04:43",
      "upperBoundTime": "00:05:22",
      "content": "Yeah I mean I worked since I could probably since 8 years old, cutting grass and doing all that stuff and just trying to make sure that my younger brothers, any of my sisters were straight. I took, I was like the kid who had to grow up quick, even though my sisters that were older than me they kind of took care of us when we were younger like really younger but it was just like I said it was some more or less. I think my mom took out her frustrations on us a lot of times, and just the whole scenario of not having our dad in our lives."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:22",
      "upperBoundTime": "00:05:31",
      "content": "Yeah. So would it be fair to say that you didn't really growing up in a loving nurturing home and that you were mistreated as a child."
    },
    {
      "speaker": "Hayward",
      "time": "00:05:31",
      "upperBoundTime": "00:07:01",
      "content": "Absolutely just and even one of my mom's boyfriends molested one of my sisters. I mean he was put in prison. I felt like he should have died back then but it was just hard for us to deal with that kind of emotional trauma and stress."
    },
    {
      "speaker": "Hayward",
      "time": "00:05:31",
      "upperBoundTime": "00:07:01",
      "content": "So, it was difficult now the kids as far as me, and my siblings we were close till we started getting older, and going our separate ways. I kind of got out on my own when I was 16 you now just started having, I wanted to do things my way and I was very adamant about not listening. I had a job. I was working. I did my own thing and you know at that point I was kind of getting a little bit out of control."
    },
    {
      "speaker": "Hayward",
      "time": "00:05:31",
      "upperBoundTime": "00:07:01",
      "content": "Now in school I can say that I always was a good student but I dropped out in the 9th grade in school. I felt like work was just more prominent for me, and just doing what I wanted to do, which is basically running the streets, and getting involved in whatever, but I got out on my own when I was 16 my mom put me out I was just being too much of me and was hard to deal with at that time."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:01",
      "upperBoundTime": "00:07:03",
      "content": "Where did you stay?"
    },
    {
      "speaker": "Hayward",
      "time": "00:07:03",
      "upperBoundTime": "00:07:11",
      "content": "I actually I stayed with friends and then I eventually got my own place and I started going from there."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:11",
      "upperBoundTime": "00:07:13",
      "content": "Sure. What was your job?"
    },
    {
      "speaker": "Hayward",
      "time": "00:07:13",
      "upperBoundTime": "00:07:38",
      "content": "Well I worked several jobs but probably the thing on the outside that I excelled in was working in the restaurant business I've worked at several restaurants I worked at Copeland's, Applebee's in my hometown a place called Southside cafe Cracker Barrel just you name it, but I always had."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:38",
      "upperBoundTime": "00:07:42",
      "content": "In the front of the house or the back of the house? In the kitchen or out front."
    },
    {
      "speaker": "Hayward",
      "time": "00:07:42",
      "upperBoundTime": "00:07:43",
      "content": "Both"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:43",
      "upperBoundTime": "00:07:42",
      "content": "Okay."
    },
    {
      "speaker": "Hayward",
      "time": "00:07:42",
      "upperBoundTime": "00:08:22",
      "content": "Well I worked I knew the whole business. I actually I was the assistant kitchen manager for Applebee's but I could just about do anything as far as the business goes in the restaurant business but I had several jobs like that, plus I worked like labor jobs contract jobs from construction. I used to cut trees with a friend of mine he had his own business. So, I'd do that."
    },
    {
      "speaker": "Hayward",
      "time": "00:07:42",
      "upperBoundTime": "00:08:22",
      "content": "We'd make a lot of good money doing that I mean real good money. But I always been a very hard worker because I liked taking care of myself. I like being self-sufficient."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:22",
      "upperBoundTime": "00:08:35",
      "content": "Sure. Did you did you also support yourself by getting in trouble? I mean doing things you weren't supposed to be doing?"
    },
    {
      "speaker": "Hayward",
      "time": "00:08:35",
      "upperBoundTime": "00:10:30",
      "content": "When the first time when I was 16 and I was, I remember that was the first time I actually drank when I was 16, where I got really sick, because I was at Christmas party. Christmas party at a couple different stores together and we're at this big like mansion and I was young and I wanted to be in people that knew me knew I never drank but that turned out bad."
    },
    {
      "speaker": "Hayward",
      "time": "00:08:35",
      "upperBoundTime": "00:10:30",
      "content": "You know what I'm saying, and then I didn't touch anything until I was 18. When I was 18 I was kind of this spark under me that spiraled my life really quickly down the tubes, but when I was 18 I started drinking and smoking a little weed, and doing some cocaine and other stuff. Just trying stuff out."
    },
    {
      "speaker": "Hayward",
      "time": "00:08:35",
      "upperBoundTime": "00:10:30",
      "content": "I was more into the coke scene going out partying and stuff like that. Yes I was kind of a, and I used to get in fights regularly that was kind of my exit, my exhale. I was known in my home town for just being a person that could, I kind of just lived two different lives."
    },
    {
      "speaker": "Hayward",
      "time": "00:08:35",
      "upperBoundTime": "00:10:30",
      "content": "I had in my workplace and just my personal life I had a lot of friends who were more upscale business people this and that and then I had, I couldn't get away from some of the friends I had met just the party lifestyle, just getting into the craziness."
    },
    {
      "speaker": "Hayward",
      "time": "00:08:35",
      "upperBoundTime": "00:10:30",
      "content": "So I kind of lived two different lives, like even when I got arrested there was one side of people that were like, \"Oh that couldn't have been Hayward.\" They just didn't believe that I could even be involved in such a thing. So I kind of lived 2 different lives at one time."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:30",
      "upperBoundTime": "00:10:33",
      "content": "Sure"
    },
    {
      "speaker": "Hayward",
      "time": "00:10:33",
      "upperBoundTime": "00:10:52",
      "content": "So and just and growing up like I said and I was always a hard worker. I always had multiple jobs but I was angry I was bitter and I didn't want to become what, I didn't want to become my dad. I didn't want to be a deadbeat dad. I ended up having a son when I was 20."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:52",
      "upperBoundTime": "00:10:57",
      "content": "Can you tell me about him?"
    },
    {
      "speaker": "Hayward",
      "time": "00:10:57",
      "upperBoundTime": "00:13:11",
      "content": "Yeah his names Tyler. When I had my son I was, it was one of those processes of me being very proud that I had a son me and his mom had just we separated but that was like my heartbeat. Its one of the things that kind of promoted me to change my life."
    },
    {
      "speaker": "Hayward",
      "time": "00:10:57",
      "upperBoundTime": "00:13:11",
      "content": "But at this particular time when I had my kid, I kind of was trying to move into a different direction be a better role model, and dad and just out of nowhere my baby sister, my youngest sister out of the three, she ended up having a cervical cancer when I was 21. So she passed away and just suddenly."
    },
    {
      "speaker": "Hayward",
      "time": "00:10:57",
      "upperBoundTime": "00:13:11",
      "content": "Me and her were close that was the one who actually got molested and I ended up taking the brunt of that because I knew and found out and I was trying to get the dude, the guy that did it."
    },
    {
      "speaker": "Hayward",
      "time": "00:10:57",
      "upperBoundTime": "00:13:11",
      "content": "So anyway we were very close I was working. I was working at Applebee's making pretty good money. I was making decent money for there but I had several jobs like I said I always had more than one job. It was a part of who I was that's one good thing I learned, but anyway my sister ended up getting sick with cervical cancer. She was in the hospital and I was really worried about it. She never let me see her down. She was always upbeat very strong but she was, me and her were the closest 2 out of the rest of my siblings."
    },
    {
      "speaker": "Hayward",
      "time": "00:10:57",
      "upperBoundTime": "00:13:11",
      "content": "And she had 2 cervix on her, she had 2 tumors on her cervix but like they were doing radiation, and all that and they were shrinking. Just say like today is Monday, another week and they're going to do surgery to remove them, and just say Wednesday one erupts, and she probably lived two and a half weeks after that, and so that crushed me."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:12",
      "content": "Oh yeah. So young."
    },
    {
      "speaker": "Hayward",
      "time": "00:13:12",
      "upperBoundTime": "00:14:17",
      "content": "It actually is as a young man it crushed me. I didn't want to live I didn't want to do nothing. I just started I quit my job just everything. I couldn't take the weight of it matter of fact when I was at her funeral nobody knew this I just couldn't cry it was hard, it just numbed me. So that kind of started a quick down spiral for me. I used to go out partying drinking every night going to her grave and just sitting there all night just crying. Nobody knew this was going on."
    },
    {
      "speaker": "Hayward",
      "time": "00:13:12",
      "upperBoundTime": "00:14:17",
      "content": "I didn't have anybody I could confide in or talk to so that kind of put me in a position where I was just doing bad. I was just in need. I was in a bad place and ended up catching the charge that I caught and coming to prison still bitter, still angry, but it was hard for me, that transition right there was very difficult but."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:17",
      "upperBoundTime": "00:14:20",
      "content": "Is that the first time you were arrested?"
    },
    {
      "speaker": "Hayward",
      "time": "00:14:20",
      "upperBoundTime": "00:14:53",
      "content": "It wasn't the first time. I've never had a charge. I'm a first offended but I've been arrested before, but just once before that and those charges were thrown out. So that that you know time period, I was, it was when you're in Rome you live like the Romans kind of so say, but when I first got incarcerated by me never being in prison and I've never had to stay a couple day in jail or whatever."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:53",
      "upperBoundTime": "00:14:51",
      "content": "Way it is parish in the Parish jail in Slidell?"
    },
    {
      "speaker": "Hayward",
      "time": "00:14:51",
      "upperBoundTime": "00:15:48",
      "content": "Yeah. Well Covington was our yeah. So that's where, that's St. Tammany Parish, it's all the same thing well. So the big jails in Covington, Louisiana so that's where I was."
    },
    {
      "speaker": "Hayward",
      "time": "00:14:51",
      "upperBoundTime": "00:15:48",
      "content": "My time in the parish, I just still I was in a numb place. I didn't really understand what was going on definitely didn't understand law and this and that. And so I got in a lot of fights in the parish, just a lot of craziness trying to find my way. So even there are articles when I was convicted of me just being just nutty man. Out of my mind just saying is that all? Is that all you going to give me? Just that kind of, in that kind of place."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:48",
      "upperBoundTime": "00:15:52",
      "content": "Real defiant."
    },
    {
      "speaker": "Hayward",
      "time": "00:15:52",
      "upperBoundTime": "00:16:26",
      "content": "Yeah very defiant not giving a crap. So I lost basically everything. My son's mother like disconnected me from his life, and he was 2 at the time. I didn't know where he was for like 6 and a half years. She had gotten remarried and by being all girls they all had different names. Her mom had gotten married, so we couldn't find them."
    },
    {
      "speaker": "Hayward",
      "time": "00:15:52",
      "upperBoundTime": "00:16:26",
      "content": "And that was tragic for me because the one thing I didn't want was that disconnect with my kid, that's the only thing that really held me together."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:26",
      "upperBoundTime": "00:16:28",
      "content": "Tell me more about Tyler now is he still now."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:28",
      "upperBoundTime": "00:16:26",
      "content": "Okay well."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:26",
      "upperBoundTime": "00:16:30",
      "content": "Are you still in touch with him?"
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "Well my son like I said I wasn't in contact with him for what six and a half years but he was my heartbeat. I was kind of growing up a little bit in prison, maturing probably took me a couple years to get my head on straight and start just trying to evaluation my life and trying to move in a different direction in my life."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "But Tyler was always a central part of it and by me not knowing where he was, I had people, a matter in fact a friend that I met being incarcerated from my hometown just ministers and everybody they would ask me, \"Man what do you need? What do you want?\" I would always be like, \"I need to find my kid. That's the only that's what I want to do.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "And several matter of fact I have a DVD just about that a friend of mine it just like it's an 8 minute DVD, it's about return of hearts. But I'll get to that later but I just wanted to know where my kid was."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "Well we eventually tracked him down it was a God thing, because he got in a situation where his babysitters boyfriend whooped him and he was like 8 and a half then, and he went next door and called the cops. Well they get in touch with the paternal parents and saying that, \"Okay well you need to appear in court because you neglected your child, you left him in incapable hands.\" That's how I found out where he was. I get a subpoena in the mail."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "For me it was life. It was just something. So that ended up allowing me to gain custody of my kid when he was 8 and a half years old. His mom was dealing with some addiction issues, and other stuff that she had been through, and that was me and my oldest sister actually have full, got full custody of my kid."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "So through that process we still had some lingering things to deal with. He had grown up traumatized in some ways because mom was just living a very unfruitful life. So we're dealing with all that kind of stuff and behavioral issues he's been, he's grown up under me. I've built, when I first connected back to him after the 8.5 years he we hit it off really good we connected and we bonded really tight."
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "His mom had initially told him that I'd passed away. So but he ended up finding out that I wasn't like right before we found him, before the situation occurred to where I could get in touch with him. His aunt slipped and said something about me. And he was mad. And I have letters about it. He say he told his mom, came home and he's like, \"Look I want to know where is my dad. I know he is not dead. Auntie slipped up and said something and she didn't want to talk about. She told me to ask you I know he's not dead so.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:16:30",
      "upperBoundTime": "00:20:11",
      "content": "She had made these rumors about I didn't want to have anything to do with my kid to her mom and because me and her mom used to be all right. So all that drama I dealt with and she come clean through court and all and so we got custody of my kid and through that we've had some ups and downs but he's doing okay now, but it's one of those working things but we do have a very good working relationship right now. So he's a young man he's 21."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:11",
      "upperBoundTime": "00:20:10",
      "content": "When was the last time you saw your son?"
    },
    {
      "speaker": "Hayward",
      "time": "00:20:10",
      "upperBoundTime": "00:20:15",
      "content": "It's been about 6 months now so because he got in some trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:15",
      "upperBoundTime": "00:20:31",
      "content": "Ok. Yeah ups and downs are common when you have all the advantages you could possibly have I can't imagine how much more challenging that would be to parent from prison."
    },
    {
      "speaker": "Hayward",
      "time": "00:20:31",
      "upperBoundTime": "00:20:33",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:33",
      "upperBoundTime": "00:20:58",
      "content": "So let's go back for a minute I want to talk with you now about what you've been up to in the last 20 years, but let's go back for a minute to the Hayward Jones that was driven through those Angola gates there. Your first few weeks here at Angola can you describe that person?"
    },
    {
      "speaker": "Hayward",
      "time": "00:20:58",
      "upperBoundTime": "00:22:37",
      "content": "The person I was when I first got to Angola like I said was still trying to figure out who I was. I was still trying to go through some identity issues. I was not the guy to play with. I was a very, the only way I found to deal with the situations was through my anger, through violence. And my name actually beat me here, people knew who I was."
    },
    {
      "speaker": "Hayward",
      "time": "00:20:58",
      "upperBoundTime": "00:22:37",
      "content": ""
    },
    {
      "speaker": "Hayward",
      "time": "00:20:58",
      "upperBoundTime": "00:22:37",
      "content": "So from guys that were either in the parish or I mean news travels just like there's a great bond in prison just like anywhere else. So when I came, I mean I wasn't getting in, I wasn't the let's see, I guess the better way to express it was I just was wild."
    },
    {
      "speaker": "Hayward",
      "time": "00:20:58",
      "upperBoundTime": "00:22:37",
      "content": "I was a kind of wild man and I was like, \"Whatever I'm going to, I'm here. So I'm going to make the.\" I was always a person also that did my own thing. I didn't react well to being told anything or being just challenged on any front."
    },
    {
      "speaker": "Hayward",
      "time": "00:20:58",
      "upperBoundTime": "00:22:37",
      "content": "So my first couple weeks, months here was I was still doing drugs, doing stuff I wasn't supposed to do, getting like I said getting into fights, just being a very not a good person to be around."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:37",
      "upperBoundTime": "00:22:55",
      "content": "So clearly you are a very different man today you are held in extremely high regard in this community, trusted considered rehabilitators leader. So how does that happen?"
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "How does the transformation happen? Oh well first I guess the initial thing was my faith. I'd say in, I can't remember it, but 2001, I had an experience that really challenged me to just look at myself a little bit deeper. It challenged me to search myself. I had guys here in the prison, several guys in the prison I had one guy who serves as my inmate pastor right now."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "He pulled me over one day and I don't know him at all. He's like, \"Hey young man look I want to invite you to church come out this and that,\" and I really wasn't trying to hear all that, but this dude kept agitating me. He's like, \"You're a leader.\" He said, \"But you're running round here people are scared of you.\" And he said it's not a good thing, but he said you're a leader and you need to lead. He said, \"You've got great potential, you're smart you're not an idiot but you're not living into your full potential.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "Well anyway through the process of me kind of getting out, doing some different stuff, doing some more constructive stuff, getting engaged in some programming here in the prison like anger management substance abuse. Getting involved in just going to church."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": ""
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "And by me, one good thing like I said my work ethic kind of transferred over like they would have like stuff like tent, revivals on the yard I would go and help them put up tents and I would go help them set up the boxing ring or if they had work to do I was always one who would volunteer for it."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "But what happened was I think not just being challenged by other men the me wanting the desire to be better I think the want to for anybody has to click on, but I was definitely challenged by the men in the prison to, man look come out of the place I was at. Like I said I wasn't really taking that to heart at first, but like I said I was growing, and I was maturing as a young man trying to find my own personal identity. What did I want out of life? What was I going to do with what I had been given which was a life sentence, which wasn't cool at all."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "So I think it was a pretty instant but gradual which is a progressive thing but when I say pretty instant I can't one day I just shut down everything. I just shut down all the negative things I was doing like gambling drugs this and that I just didn't want to do it anymore. I wanted to be more focused on me, and what I had to do to make me a better person."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "So like I said one of those things was the dealing with my son. The other thing was just being challenged by other men already in the prison, \"Look dude you need to get involved in this. You need to do this. If you ever get an opportunity to go home you need to do this.\" Some of it was by time and chance."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "Some of it was by, we had one of our chaplains who just passed away recently Chaplain Robert Tony he came to the prison at the same time I did and he really was very instrumental in helping me to make some changes I had to make in my life. And when I wasn't even doing the right things, this guy just took a liking to me."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "He was aiding me and helping me with being in contact with my son. So that was a good thing but he used to want me to go volunteer to go pass out like soap and toothpaste to just different inmate who were maybe on lockdown or on hospice. Let's go pass out some food here, and I'm like, \"Why this dude keep calling me.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": ""
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "But it was people like that, love like that that kind of helped me see a little bit of a better way. So I ended up, we and like I said I just thought getting involved in different stuff, like with my church, I serve as the chairman of the deacon board at my church right now."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "Malachi Dads started in 2006. I'm the vice president but I started that ministry as well with about 6 other guys. So that was like kind of my heartbeat because it dealt with parenting. It dealt with children so and that was like some a fabric of my life at the time definitely. And those things just I just it just building."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "So I can say that my transformation was kind of instant, because I stopped and start looking in the mirror and I separated myself from people that were just not doing what I was involved in and I was just telling my friends look I'm on a journey and I got to do it by myself."
    },
    {
      "speaker": "Hayward",
      "time": "00:22:55",
      "upperBoundTime": "00:28:12",
      "content": "So that's kind of because I've always been that kind of person I've always been the kind of person that wasn't, I was the bad influence instead of being pressured by other guys."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:12",
      "upperBoundTime": "00:28:13",
      "content": "Sure what can you briefly summarize the other activities that you are involved with?"
    },
    {
      "speaker": "Hayward",
      "time": "00:28:13",
      "upperBoundTime": "00:28:15",
      "content": "Okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:15",
      "upperBoundTime": "00:28:17",
      "content": "Maybe it'll be easier for you to think of it like what is your typical day like?"
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "My typical day is because I'm a reentry mentor we have a program reentry program. I serve as a lead social mentor. I coordinate one of our dormitories. We don't have normal days, but and this is all just process to getting to being in reentry I was doing other stuff before our reentry came along. We been doing this for 7 years I've been here since day one."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "What I do is challenge young men to be better men to go out and be able to build healthy relationships when they go out as a social mentor. My job is attitude personality behavior issues what's going to keep you on the outside. What's going to help you be a better parent? What's going to help you be a better brother, husband whatever?"
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "How do you transfer, I help in building men giving them transferrable skills, where they can go on the outside and be productive citizens. Such as we teach parenting, victim awareness, anger management, substance abuse classes, all the therapeutic classes that's going to help engage them to the next phase of their life."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "But the bigger part of it is we every mentor like myself has between 3 and 5 guys that we that's like our case load everybody's different. So I have to I have to build a plan for each and every one of those guys to go out there. Like I had one guy who had to go through anger management 8 times. But I very much so relate I understand where he's at but until we get past this because this is your Achilles this is what's going to hurt you. So we try to find those underlying factors why you came to prison."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "So a lot and definitely I can relate, but a normal day for me, we get up from Monday through Friday. I get up at about five o'clock just prepare for my day, get up we have a morning motivational meeting with our guys from 7:00 to like 7:30."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "Then our guys shift and go off to work I will either, well two days a week I got to go meet with Monday and Thursdays I meet with all the vocational mentors, and our on site proctor and I just stand there for the social aspect of it, like if we need to address needs. That our vocational counterparts might have, or just things that's going on in the program upcoming stuff."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "I work in several club organizations one is the Reentry Club which the Reentry Club was instituted we built a way to generate money because we don't have a budget but we generate money to pay for our guys uniforms their they have to be distinguished between the rest of the general population. We pay for like equipment for the different trades that the state doesn't have the money to budget for we also pay for materials for our education department and our programming where we're helping our guys get their GEDs and so forth. So it's a big job."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "So I do that, and those things we sell food, and we deliver food to all the staff or inmates who have money and it goes back into the program, it goes back into creating."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "So also I'm the vice president of Malachi Dads. Malachi dads started in 2006, we partner with Awana which is the largest children's ministry in the world. I actually sat on the national and international board of advisors as an inmate for Awana Lifeline which is an awesome responsibility."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "But initially when we started this program it was because we wanted to raise awareness with men that you're not negating your responsibility as a father just because you're in prison. You have a responsibility to speak life into your children. You have a responsibility to tell them this isn't a place that they want to be."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "You have a responsibility to give them wise counsel and to be an example for them and be a role model regardless of your circumstances or situation."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "Some guy everybody is different, some guys just have but you're going to come in contact with some young person who you need to establish something, and you're going to have an opportunity to help somebody out."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "So ultimately we're about, initially Malachi dads would come from the bible Malachi 4:6, 'and He shall turn the hearts of the fathers back the children and hearts of the children back to their fathers.' But initially we wanted to break the cycle of crime and incarceration that so often ran in families."
    },
    {
      "speaker": "Hayward",
      "time": "00:28:17",
      "upperBoundTime": "00:33:28",
      "content": "So ultimately our ultimate goal is we want to raise multigenerational faith. We want to build a fabric and a community of faith in our children and in our families. And so this particular ministry we started here with over 30 states in the United States and about 11 countries outside of the US."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:28",
      "upperBoundTime": "00:33:30",
      "content": "That's amazing."
    },
    {
      "speaker": "Hayward",
      "time": "00:33:30",
      "upperBoundTime": "00:34:48",
      "content": "Several local churches we got like 6 women's ministries that have come from us. That's what you can do in prison. So I know what I can do if I wasn't in prison but I also, I volunteer and do services for our point lookout project where bury men in the prison."
    },
    {
      "speaker": "Hayward",
      "time": "00:33:30",
      "upperBoundTime": "00:34:48",
      "content": "I'm a part of, and we started an organization called High Ground I'm on the board of directors and it's on the website www.highground high ground is an initiative we started its a two day project where we bring in NFL players because we're connected to some people that work in the NFL."
    },
    {
      "speaker": "Hayward",
      "time": "00:33:30",
      "upperBoundTime": "00:34:48",
      "content": "We bring in NFL players to kind of get our guys in get engaged we basically want them to connect. We want to bring them out give an evangelistic message. We want the guys to just be able to just have a kind of different day."
    },
    {
      "speaker": "Hayward",
      "time": "00:33:30",
      "upperBoundTime": "00:34:48",
      "content": "We do unique stuff like on we might do like we had Darryl Eugene Strawberry last time that came in and do like a home run derby this and that, just fun stuff to help build community with people, make people feel, not just give them something spiritual but have something that's very natural, and build the community here."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:48",
      "upperBoundTime": "00:34:52",
      "content": "Yeah"
    },
    {
      "speaker": "Hayward",
      "time": "00:34:52",
      "upperBoundTime": "00:34:59",
      "content": "Those things also draw people that wouldn't actually go to church what I'm saying."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:59",
      "upperBoundTime": "00:35:31",
      "content": "Yeah absolutely. So I'm actually doing an evaluation of Judge White's Reentry Court and so I see the guys that you have mentored here about once a month. I'm kind of interested in and they all their paper always shows a vocational mentor and a social mentor and I'm kind of interested in when you see these guys I'm sure you recognize a bit of yourself when you were at that age because they tend to be young."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:31",
      "upperBoundTime": "00:35:34",
      "content": "Oh absolutely, you definitely have to have compassion..."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:34",
      "upperBoundTime": "00:35:31",
      "content": "Yeah."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:31",
      "upperBoundTime": "00:35:36",
      "content": "...for where they are."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:36",
      "upperBoundTime": "00:35:49",
      "content": "They haven't had time to age out. What is it that makes a successful reentrant as opposed to one that's probably not going to succeed? Because they're probably not all going to succeed."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "I would say this is probably what's going to make a successful reentrant is one who is it's almost like when they get, and they're in school and they get it, the light comes on and that light comes on at different intervals in people's lives."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "So what I mean when the light comes on, you have somebody that's proactive and that they are surrounded with other people that are proactive. A lot of times it's the same fabric you could be doing well while you're here, while you're under structure."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "But if you don't transfer that well, that you've been in then, you're going to probably most likely at some point fall of the radar."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "And I know they don't have mentors per se when they get out and they don't have as much structure as far as somebody being right there accessible. But they need people that are accessible in their lives, and we try to do that with community support when they get on the outside, they're always welcome to call back here, contact our guys. I have got guys all time that I call, \"look, man I need to talk to my mentor about various issues and problems.\""
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "That's one good thing but the thing is when I say turn on the light, it's kind of like an addict. Some addicts need a push to where they need to get so that light comes on. But most of the time if they want to get fixed, and they just don't want to do it anymore, and I've seen it in my own life, and in the life of so many people when they get what I called tired."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "When they get tired they don't need, substance abuse they don't need nobody telling them nothing they don't need no medication, they're just done with it and that doesn't happen but on probably in the whole scope of things rare occasions. But if you have somebody you have to stay connected to your to your sources that help you maintain your sobriety, that help you maintain your morale, before you get out."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "So what I mean by that a lot of guys they think when they get out of I'm free and they lose sight real quick of where they were. That's something that we try to preach to them, don't lose sight of this place. Don't forget about where you came from, you got an opportunity when you get on the outside. But I think what makes a successful reentrant is when you see one out there, that's constantly being proactive, that's constantly working on himself, and you see it some of the guys they help each other they got."
    },
    {
      "speaker": "Hayward",
      "time": "00:35:49",
      "upperBoundTime": "00:38:51",
      "content": "So that's what we try to transfer to them. You need people in your life because I think that's one of the things that I didn't have. I didn't have people in my life that would keep me entrenched in what I need to be in, or talk to or whatever you need people in your life so."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:51",
      "upperBoundTime": "00:39:27",
      "content": "Yeah. I'm going to ask I didn't want to I don't want to get into the details of crimes of conviction with any of the guys we're talking to, but I do want to George Gillum actually said that when he, I had him look over the questions and give me some feedback. And he said you got to ask these guys how they feel about the crime. You got to give them a chance to talk about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:51",
      "upperBoundTime": "00:39:27",
      "content": "So I added a question about that. It's been 20 years."
    },
    {
      "speaker": "Hayward",
      "time": "00:39:27",
      "upperBoundTime": "00:39:29",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:29",
      "upperBoundTime": "00:39:45",
      "content": "When you look back on the crime and the victim, the victim's family. I don't know anything about the crime actually, after 20 years is it? Do you still feel like deep remorse I mean what is it that you feel at this point?"
    },
    {
      "speaker": "Hayward",
      "time": "00:39:45",
      "upperBoundTime": "00:42:32",
      "content": "I just went up for a clemency hearing on February the 8th, it was the first time that I actually saw the victims, their families matter of fact and it was therapeutic and they were still hurt rightly so. Of course I definitely feel remorse, but hindsight is always 20/20 would, could, should, would, doesn't heal their pain. And it doesn't get that person to where they need to be at to start moving forward in their lives."
    },
    {
      "speaker": "Hayward",
      "time": "00:39:45",
      "upperBoundTime": "00:42:32",
      "content": "I think that's a really good question. It was, me personally I just wanted to go and embrace them like love on them and say I'm sorry which I of course I said I'm sorry. But sometimes just words isn't going to cut it when it comes to people's hearts and so there's always a deeper place and I think that I personally gotten to that place. But I want to help other people get to that place, because we always think about, we deal with the sometimes only the anger part of it, and we deal with only the hurt, but what about the mending part?"
    },
    {
      "speaker": "Hayward",
      "time": "00:39:45",
      "upperBoundTime": "00:42:32",
      "content": "I can never give them back what I took from them, but I think I have something to offer them. That is I understand what they're going through though I haven't I know what it feels like to lose, but I also know the power of real redemption and real forgiveness. So that is what I seek from my victims is real forgiveness from their families, and not to say that they forget, not to say that they cast over what happened, but I don't want to leave them with an open wound and that's all they have."
    },
    {
      "speaker": "Hayward",
      "time": "00:39:45",
      "upperBoundTime": "00:42:32",
      "content": "I think sometimes that's what happens when we, because I didn't feel like I felt like they left with something maybe not enough but I know they left with something just for them to even acknowledge what I've done since I've been in prison I know they left with something but there is always more. There is always more that you can give."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:32",
      "upperBoundTime": "00:42:36",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "Hayward",
      "time": "00:42:36",
      "upperBoundTime": "00:44:27",
      "content": "I'm not the same person. I think you have to forgive yourself. You have to come to a place where I can't hold to that part of my life as much as I don't want anybody else to hold onto their hatred or forgiveness of me. What I can do is I mean that's always going to be a soft spot, a sore spot for my life, but that's not going to be the controlling basis of my life."
    },
    {
      "speaker": "Hayward",
      "time": "00:42:36",
      "upperBoundTime": "00:44:27",
      "content": "So I don't let that control me. I have moved beyond that process, and my life is what I make of it right now. I can't change anything that happened in the past. So yes I've forgiven myself a long time ago. And I've even forgiven people who may not like me because hate breeds hate, hurt people, hurt people, and I don't want anybody hurt. I don't want I definitely don't want to live in hurt. I know what it's like, and I've done the same painful process has happened to my family as well."
    },
    {
      "speaker": "Hayward",
      "time": "00:42:36",
      "upperBoundTime": "00:44:27",
      "content": "So I've had to work on that, and getting, healing from just being thinking about myself and being selfish and committing a crime in the first place and being away from my son, and not being able to go watch his games, not being able to go. But also that family not being able to experience different things with their loved one. So I think it's a compassion that you have to see, and a place that you have to get for yourself."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:27",
      "upperBoundTime": "00:44:43",
      "content": "Makes sense yeah. So this may be, I already sense it's a strange thing to ask, but what is the do you think, I mean for what is the worst part of being here?"
    },
    {
      "speaker": "Hayward",
      "time": "00:44:43",
      "upperBoundTime": "00:46:23",
      "content": "The worst part of being in prison for me is not I would probably say just not being able to experience the life that I know I could on the outside. There's always and like I said there's always more. I keep pressing on the inside, because I know there's always more. I don't let where I am dictate who I am."
    },
    {
      "speaker": "Hayward",
      "time": "00:44:43",
      "upperBoundTime": "00:46:23",
      "content": "And so I've always sought to be better like I was telling have a very highly competitive nature, that's what keeps me in the spiral of staying where I am fighting so hard for people that are less fortunate."
    },
    {
      "speaker": "Hayward",
      "time": "00:44:43",
      "upperBoundTime": "00:46:23",
      "content": "I just think that not being able to experience a different phase of my life, with my family, with my friends, the people that love me and who just impart their lives, its a unique position. But I think that's the worst thing. I think that the worst thing is when you look at the human part of it but also I do believe in fair and just punishment for all."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:23",
      "upperBoundTime": "00:46:45",
      "content": "Okay. So I have a lot of trouble wrapping my head around life without parole. It's unconstitutional in Europe for example. It's inhumane how much punishment is enough punishment?"
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "I think well 1 I don't think that everybody should be put in the same bubble I think that every situation needs to be dealt with specifically and not in under one umbrella but I'm a, I'd say this. Enough is enough when not when I say or feel for myself but when it's when evidence proves that this person has changed."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "And what I'm talking about evidence of course the one thing I can't do and won't is go back to the person I was. Not only does it speak that in my life here in prison where of course I could just be mad, bitter at the world angry at people. But I'm not but I think when a person is truly shown."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "I'm going to say this I think if a person after and it just depends, if it we're talking about like a capital offense I'd say 15 years and evaluate, and which I think they have that process they just don't. I mean not for second degree murder like my charge but I think 15 years is enough to see whether a person, you can't fake it for 15 years."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "You can't fake like I have one write up in 20 years, technically it was for leaving something hanging out on my bed when I went out to work. So if I was this monster, then I would have continued to be that monster. So I think that the proof is always in the pudding and I can guarantee you there is that's not easy to do after 20 years or let alone 5."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "But the other thing is judge people for who they are not what they were. And nobody wants to be judged or only known for the worst day that they had in their lives. So if I was going to say how much is enough? I would say let 15 be a mark and start looking at every situation."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "I mean and that's look if a guy is not gotten a write up in 15 year, do the number on it you don't have a whole lot of those, and you don't have a whole lot of people just in general that who you are on the inside is going to always pop out on the outside. So just like when you want forgiveness or when you want to be forgiven or you want people to judge you by I made a mistake I just got drunk and wrecked a car."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "You don't want to always be known just for that, but that's sometimes our normal tendency is to only look at that part of it. Okay what has he done after that? What has happened in this person's life he or she? What has done what has happened after that point? Who are they right now? Nobody wants to be judged like that because nobody can hold up hold themselves to that kind of a spectrum."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "So it's a weight to carry when you have to be number 1; an example number 2 you have to carry the weight of other people on your shoulders like I do every single day."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "I'm a role model in this prison. I'm a role model for the young men that I mentor. I can't afford to fall or fail because then it gives them, it gives not only them to say well he did it or this but it gives skeptics a finger to point."
    },
    {
      "speaker": "Hayward",
      "time": "00:46:45",
      "upperBoundTime": "00:50:47",
      "content": "I can tell you think there's not many skeptics that get to impact thousands and thousands of people all over the country, let alone from in prison, so that's what I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:47",
      "upperBoundTime": "00:51:46",
      "content": "I mean the thing is that you're extraordinary as opposed to what the what prison produces, in that you've found a way to lead a very meaningful life here and have a really positive impact on a lot of guys."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:47",
      "upperBoundTime": "00:51:46",
      "content": "But this is a difficult question I'm sorry I have to ask it but it's what we're here to talk about. When you think things through, you have all these goals and ambitions you think about the life that you could have had on the outside."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:47",
      "upperBoundTime": "00:51:46",
      "content": "All of that is natural. There have to be long moments when you have to confront the possibility of spending the rest of your life here ending up in hospice care even. How do you how do you cope with that?"
    },
    {
      "speaker": "Hayward",
      "time": "00:51:46",
      "upperBoundTime": "00:53:07",
      "content": "Well when you think about the potential or possibility and yes I'm probably a very unique person because I hope against hope in spite of my circumstances, and I continue to fight the fight for freedom, but if I was to just say have to spend the rest of my life in prison I've made peace with that on this note."
    },
    {
      "speaker": "Hayward",
      "time": "00:51:46",
      "upperBoundTime": "00:53:07",
      "content": "That I will leave a legacy behind that I know God has placed in my heart. I will leave a legacy behind of faith, of my commitment to humanity, of my commitment to the men that I've been privileged to lead here in this prison, and of my commitment to be better than my worst mistake, and be better than what everybody else might have thought."
    },
    {
      "speaker": "Hayward",
      "time": "00:51:46",
      "upperBoundTime": "00:53:07",
      "content": "So that those are the things that I take refuge in, but definitely it has crossed my mind before, because you always have to think that because of the way that things are, because of the way our laws are, I potentially could be here for the rest of my life, but I'm not going to let that be a waste if that be the case."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:07",
      "upperBoundTime": "00:53:34",
      "content": "Yeah. You and I talked about early, this is a very hopeful time so I think there's some movement. Anyway so what are your, well let me ask you this you've done a lot of stuff, what are you most proud of?"
    },
    {
      "speaker": "Hayward",
      "time": "00:53:34",
      "upperBoundTime": "00:54:59",
      "content": "I'm most proud of probably being the best and most involved father of a child while in prison, but in general because what I have I give every resource that's available to me I've made available to help him. And so as a dad as a role model I think just my life in general I think speaks to what I think is my most prominent moments."
    },
    {
      "speaker": "Hayward",
      "time": "00:53:34",
      "upperBoundTime": "00:54:59",
      "content": "I'm not going to let anything deter me from doing what I know is the right thing to do. So I think that it's not one thing but I think it's the evolution of everything and I continue to learn, continue to grow, I continue to teach, and I'm very passionate about what I do in the prison. I teach a lot of different things. I continue working on myself. I continue to learn and educate myself so."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:59",
      "upperBoundTime": "00:55:24",
      "content": "Sure so let's visit a scenario where you do get a positive decision from a clemency board. You want to start planning what you're doing when you get out. How do you what's the vision that you have for that?"
    },
    {
      "speaker": "Hayward",
      "time": "00:55:24",
      "upperBoundTime": "00:56:52",
      "content": "Well like I said before you when whatever you are whatever you're passionate about if you really know what you're passionate about that's what you're going to do. So I definitely would be doing some motivational speaking I do it here I definitely would be engaged in the ministry especially Malachi Dads. One of our leadership team guys has gotten out he's traveling the country right now his name's Troy Delone."
    },
    {
      "speaker": "Hayward",
      "time": "00:55:24",
      "upperBoundTime": "00:56:52",
      "content": "He's travelling the country. He's one of the guys that I've watched grow and that I had the privilege of working with. It gives us hope. We just had, we just engaged in what we call GLS global leadership summit a two day event I helped program it from this end of the spectrum but our sponsors Awana, and some of our other partners, people that we've been able to engage with have just offered those possibilities."
    },
    {
      "speaker": "Hayward",
      "time": "00:55:24",
      "upperBoundTime": "00:56:52",
      "content": "But I'm definitely going to work with kids. I'm definitely going to continue to do some speaking. I mean I got a lot of ambitions. I also want to start up a few nonprofits, because I think I'm guru now at learning how to, I think I can build some avenues to where we can generate revenue to help our lost children in this state."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:52",
      "upperBoundTime": "00:57:10",
      "content": "Yeah it seems to me that people who are fortunate enough to get out of a life sentence end up like you're saying they end up doing what they were passionate about while they were inside I think Calvin Duncan is an excellent example of that."
    },
    {
      "speaker": "Hayward",
      "time": "00:57:10",
      "upperBoundTime": "00:57:28",
      "content": "Absolutely we have plenty of Norris Henderson, Calvin Duncan, all those guys were Norris was my football coach here all those guys are doing what they were passionate about in here. So I know those are transferrable things you're not going to go out and be something that you weren't already."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:28",
      "upperBoundTime": "00:58:12",
      "content": "I genuinely feel very privileged to have been able to talk with you about all of this, and you've given me a lot of valuable things to think about and incorporate into this project."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:28",
      "upperBoundTime": "00:58:12",
      "content": "So I'm very grateful, but I also want to ask you if there is something that I should have asked you that's important about this experience that I didn't, or that you didn't have an opportunity to talk about that you would want people to know. Whether it's the legislature or if it's just people who just are totally unfamiliar with what it's like to live in prison with a life sentence."
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "Well you talked a little bit about empathy. Empathy is walk in, you now when you can feel walk in someone else's shoes for a day, just think about Louisiana incarcerates more people per capita than anywhere in the world. Think about your loved one have to deal with sometimes very non-conducive to growing things, or now number one, being separated from you, having to endure just different hardships. How long would you want them to be there?"
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "So if you want to empathize not to say that you did anything but just look at things from a different perspective. There's always 2 sides to every story, and the side to this story is that I've met some of the greatest people that I've ever met in life right here in prison, because they've had time to change. And I know sometimes like we look at things in grades, short term, and long terms."
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "The one thing I learned about guys who don't spend a lot of time in prison they may get 18 months 2, 3 years it's hard for them to make that adjustment the first time, and it's because they know that number 1), they know they're getting out, number 2), they haven't had time to mature. They haven't had time to make that decision because people are going to make a decision one way or another at some point in their lives some people it takes longer than others."
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "I will say that the longer term guys are a lot more subtle because they've had that time to think they've had that time to definitely see what they missed. So it's just those little things that you miss, like being able to take a bath, going out just walking in the park, being out with your family doing stuff like that the things that you would normally take for granted you learn how to appreciate while you're in prison. And those things are very difficult and hard. And also just there are children and family members who miss their loved ones also."
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "The other thing is we make laws sometimes governed on fear and bias because of maybe the way we see things. I hope that people will look at this and just see that people are people anyway they are and you got good and bad people outside of prison and inside of prison. But I definitely can say that my life has been extraordinarily changed by some extraordinary people from in prison, and everybody's not bad that goes to prison, and there is hope. There is always hope. There's hope for people. There's hope for change. People do change and so that's one thing."
    },
    {
      "speaker": "Hayward",
      "time": "00:58:12",
      "upperBoundTime": "01:02:18",
      "content": "The other thing is I think that in regards just being in prison this particular prison is very different in the total spectrum because they give us opportunities to be people and they treat us like people but that's not the case everywhere. So I think that if you look at people like that could be your brother, your sister that's going through the same thing and this is for anybody in politics, or corrections, you want somebody to treat them like a person regardless of why they're there."
    },
    {
      "speaker": "Marcus",
      "time": "01:02:18",
      "content": "Absolutely. That's a good place to stop. Thank you very much."
    }
  ]
}
