{"name":"","transcript":[{"content":"Isaiah Diggs REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:02-7","content":"Isaiah can we start by you stating your name, the crime that you are convicted of, how old you were at the time and how much time you've served?"},{"speaker":"Isaiah","time":"00:00:11-5","content":"My name is Isaiah Diggs. I was convicted of first degree murder. I've served 26, almost going on 27 years."},{"speaker":"Marcus","time":"00:00:27-4","content":"How old were you at the time?"},{"speaker":"Isaiah","time":"00:00:31-1","content":"I was 19."},{"speaker":"Marcus","time":"00:00:33-1","content":"So, I'm going to start by asking you some questions about your childhood. Then we will lead up to where we get to circumstances of bringing you here to Angola. Then we will talk about what you have been up to for most of your life, which has been here. Why don't we start by, tell me a little about your family, the folks who raised you."},{"speaker":"Isaiah","time":"00:01:03-2","content":"My mother raised me. She was a strong woman. Determined for her kids to be successful in life. The opportunities was afforded to me. I just I guess I was more or less wanted to be a part of the, in-crowd. So I went away from the neighborhood into other neighborhoods and hung with other people. You know, and I guess that was one of the things that defined how I started coming up."},{"speaker":"Marcus","time":"00:01:44-5","content":"Were there men in your mother's life who came into your life?"},{"speaker":"Isaiah","time":"00:01:49-4","content":"Yes."},{"speaker":"Marcus","time":"00:01:50-3","content":"Tell me a little bit about them."},{"speaker":"Isaiah","time":"00:01:54-0","content":"A man named \"Steel,\" he raised us. He was a provider. He was never a disciplinary person. He was never a disciplinary person. He never actually physically whopped us. He would say \"Okay you're not getting your allowance\" or \"You're punished.\" But as far as the physical part of the aspect of it, he was never that type of person. He was always there. He's actually still there right now and he was a good guy."},{"speaker":"Marcus","time":"00:02:34-4","content":"So, he was the father to you?"},{"speaker":"Isaiah","time":"00:02:37-4","content":"Yes, he was the father to me, my sisters, and my brother."},{"speaker":"Marcus","time":"00:02:45-1","content":"Where are you in the birth order of your siblings?"},{"speaker":"Isaiah","time":"00:02:46-9","content":"I am the third. Actually the last, my mother adopted my cousin. My mother adopted my cousin so she's the youngest now. But I am the last of her children, her kids there's four of us."},{"speaker":"Marcus","time":"00:03:06-4","content":"What's your relationship like now with your siblings?"},{"speaker":"Isaiah","time":"00:03:09-9","content":"Well, my sister. Both of my sisters our relationship is kind of strange, but I guess it is maybe because one lives in California and the other one is here and she is constantly traveling and doing different things. She is a city council woman in New Orleans and my brother is here. Our relationship is beautiful, me and my brother. We see each other every day. Basically we check on each other and this and that."},{"speaker":"Marcus","time":"00:03:46-9","content":"How much older is he than you?"},{"speaker":"Isaiah","time":"00:03:49-3","content":"My brother is 51 so he is like 5 years older than me."},{"speaker":"Marcus","time":"00:03:55-8","content":"Is he serving a life sentence?"},{"speaker":"Isaiah","time":"00:03:57-2","content":"Yes."},{"speaker":"Marcus","time":"00:03:58-9","content":"For first or second degree murder?"},{"speaker":"Isaiah","time":"00:04:00-6","content":"Second degree."},{"speaker":"Marcus","time":"00:04:03-2","content":"Was he incarcerated before you?"},{"speaker":"Isaiah","time":"00:04:05-2","content":"No after me?"},{"speaker":"Marcus","time":"00:04:06-9","content":"So he was quite a bit older when he was convicted of that crime than you were"},{"speaker":"Isaiah","time":"00:04:11-5","content":"Yes he was."},{"speaker":"Marcus","time":"00:04:13-9","content":"I imagine that there is something bitter sweet about that. That you have a brother here who maybe was able to kind of look out for you as you first came here as a young man, but then you've also got a brother here."},{"speaker":"Isaiah","time":"00:04:27-5","content":"Yeah obviously I had to make sure that he was okay. But it is more or less, he always tried to do the right thing towards me. He stayed on me, and I can't never say that he did not try, because my brother worked. He did all the different things. He made sure that I had nice clothes to go to school with."},{"speaker":"Marcus","time":"00:05:02-6","content":"Tell me more about school. You were raised in New Orleans. Where?"},{"speaker":"Isaiah","time":"00:05:07-5","content":"Yes New Orleans, I came up in the Tremé area."},{"speaker":"Marcus","time":"00:05:11-9","content":"What street in New Orleans?"},{"speaker":"Isaiah","time":"00:05:14-3","content":"I stayed on Palmyra. We originally was on Palmyra Street. They call that \"Jabbs Alley.\" It is around the parish prison and all that. So it is a neighborhood that, they got violence and got all different kind of stuff in that neighborhood really. To describe it, it would be crazy, because you got so much going on there. Because you are in the middle of the business district. And also you got, you just got everything going on."},{"speaker":"Marcus","time":"00:05:50-3","content":"When you were around 18 years old, roughly that age, let's say two of us were sitting on the stoop of your house, right by the front door on a typical Saturday afternoon looking at out the neighborhood. Paint a picture for me. What am I hearing and smelling and seeing?"},{"speaker":"Isaiah","time":"00:06:09-7","content":"18 sitting on the steps. You're going to probably see a dice game over by Mr. Whitley. You're going see the \"snips\" sitting out, on the corner drinking, working on cars. Probably somebody sitting under the tree, smoking weed, probably would be us sitting under the tree smoking weed. And people dealing drugs. That's the norm. That is just the area."},{"speaker":"Marcus","time":"00:06:50-8","content":"Were most of your friends armed?"},{"speaker":"Isaiah","time":"00:06:55-5","content":"We did not start getting armed until we got older. We basically carried knives and stuff when we were older. When we got to the age of like 18, we started actually carrying guns and different things like that."},{"speaker":"Marcus","time":"00:07:14-5","content":"We're going to come back to that. So tell me a little about school. I was asking you where you were living to get a sense were you in public school. Where was your elementary, middle and high school?"},{"speaker":"Isaiah","time":"00:07:29-1","content":"I went to Albert Wicker Elementary School, which is on Bienville. I went to Peter's, Samuel S.J Peters, which is on Broad Street across the street from the police station. I went to Philips Junior High, which is in the 7th ward. I had got relocated way back there because I started getting into fights in school and different disciplinary actions."},{"speaker":"Isaiah","time":"00:07:29-1","content":"So, I went to Philips. Philips kicked me out because I got into a fight there. I ended up going to Presley. They expelled me because someone called and said they were going to kill me in the school. So, they expelled me out of public school. They expelled."},{"speaker":"Marcus","time":"00:08:16-4","content":"How old were you?"},{"speaker":"Isaiah","time":"00:08:18-6","content":"I was like 15. I ended up going to John Mac."},{"speaker":"Marcus","time":"00:08:27-4","content":"What was your highest year of school that you completed?"},{"speaker":"Isaiah","time":"00:08:30-1","content":"10th grade."},{"speaker":"Marcus","time":"00:08:32-9","content":"Did you like school?"},{"speaker":"Isaiah","time":"00:08:34-6","content":"Yes I liked school. I was always pretty smart in school. I was in AP classes. Especially in math. But I always liked school, it just was I always ended up in trouble. It was more or less because I was a popular guy too."},{"speaker":"Marcus","time":"00:09:02-2","content":"Sure. What about grandparents? Any other special adults in my life?"},{"speaker":"Isaiah","time":"00:09:08-1","content":"My grandmother was my heart. Her name Clara."},{"speaker":"Marcus","time":"00:09:14-0","content":"Is she your mother's mother?"},{"speaker":"Isaiah","time":"00:09:16-4","content":"Yes that's my mother's mother. She is my heart. When she was alive it was like, I took care of my grandmother. She had both of her legs amputated."},{"speaker":"Marcus","time":"00:09:30-7","content":"Diabetes?"},{"speaker":"Isaiah","time":"00:09:34-2","content":"Yes diabetes run in our family. Man she was always there and I guess the thing that for me to always remember her was that she passed on my birthday."},{"speaker":"Marcus","time":"00:09:50-1","content":"How old were you?"},{"speaker":"Isaiah","time":"00:09:58-4","content":"I was like 12 or 13. Then after that I spiraled. That is when I really started getting in trouble. When she passed, it just went downhill from there."},{"speaker":"Marcus","time":"00:10:18-1","content":"Especially, if you have that type of relationship with her where you were taking care of her."},{"speaker":"Isaiah","time":"00:10:20-0","content":"I used to stay in the high rise with her. I guess that was my haven. Because when I was there I always felt that I was needed, whereas when I am at home, you know my brothers and sisters are always there and they are always picking up the slack. When I was at my grandmother's house, I was always needed."},{"speaker":"Marcus","time":"00:10:51-3","content":"Isaiah am I accurate in saying that while all families have their ups and downs, you grew up with a clear understanding that there were adults who loved and cared for you and were interested in your wellbeing or do you feel like you had to make it on your own?"},{"speaker":"Isaiah","time":"00:11:10-3","content":"I had adults to really care for me and love me. I would be lying if I said otherwise. I know my family really loved and cared about me. Cared about what I was doing. Man I mean it was told to me you are going to end up in prison boy if you keep on hanging in the streets. It was going in one ear and went out the other."},{"speaker":"Marcus","time":"00:11:38-9","content":"Was there any fighting in that house? You talked about some fights in school and outside?"},{"speaker":"Isaiah","time":"00:11:49-6","content":"Me and my brother. My sister, boy I stayed. But it was always most of the time me and my brother and sister would always get into fights and stuff. It was never a knock down, beat down, try to hurt you or kill you type fight. It was just a few blows here or there. It was never nothing that I could not forgive them for or they could not forgive me for."},{"speaker":"Isaiah","time":"00:11:49-6","content":"It was not that type of vibe because my Mama did not play that. She would understand if I done something wrong and me and brother got into it or me and my sister got into it. Vice Versa. Whatever. So the disciplinary part of it was, when she got home my brother already then already chastised me. When she got home, she going to do what she need to do. And that's the way it was in our house."},{"speaker":"Marcus","time":"00:12:51-1","content":"Your said that your stepfather really took a backseat to the disciplinary stuff, so he was there. Are they still in your life? Your mother and stepfather?"},{"speaker":"Isaiah","time":"00:12:54-9","content":"My mother passed since I've been here."},{"speaker":"Marcus","time":"00:12:59-4","content":"How old were you when that happened?"},{"speaker":"Isaiah","time":"00:13:06-2","content":"I'm sorry. I was maybe like 22, 23."},{"speaker":"Marcus","time":"00:13:07-2","content":"So very early on."},{"speaker":"Isaiah","time":"00:13:08-0","content":"Yes."},{"speaker":"Marcus","time":"00:13:09-1","content":"Do you remember your last interaction with her? A visit?"},{"speaker":"Isaiah","time":"00:13:11-7","content":"Yes she came see me. My sister, they came see me. I did not know that she was really sick. I mean she hid it and she made sure the rest of the family did not let me know because she felt like I already had too much on my plate. She did not want me to worry about her while I was already here."},{"speaker":"Marcus","time":"00:13:52-8","content":"That makes a lot of sense. Because she must have been quite young, relatively young?"},{"speaker":"Isaiah","time":"00:14:03-5","content":"Yeah my Mama was like in her 50s when she passed."},{"speaker":"Marcus","time":"00:14:07-8","content":"Yeah very young. I can only imagine how the pain of watching a son go to prison, you want to do everything to make that less painful I suppose. I am sorry to take you into that. What about intimate relationships? Any girlfriends that stick out in your mind?"},{"speaker":"Isaiah","time":"00:14:37-7","content":"I am still with my childhood girlfriend from 13 years old. She still comes to see me. We have kids together."},{"speaker":"Marcus","time":"00:14:46-5","content":"Tell me about your kids. Well first off what's her name?"},{"speaker":"Isaiah","time":"00:14:51-1","content":"Her name is Tamika."},{"speaker":"Marcus","time":"00:14:53-1","content":"How many kids?"},{"speaker":"Isaiah","time":"00:14:56-9","content":"Shoot we have 3 kids. Well I have 3 kids by her. Man, she loves me, always love me. That was the one woman that my mother said was the one for me. That was my Mama's girl. She loved her. And she been riding this whole joke with me. She's been up and down that road coming see me, making sure that I am straight. She has been knowing everything. Matter of fact, she just came last Saturday. Her and my kids came up here together. My grandson."},{"speaker":"Marcus","time":"00:15:42-7","content":"Do they come up to the rodeo?"},{"speaker":"Isaiah","time":"00:15:43-9","content":"Yes they used to come up to the rodeo, when I used to be going out to the rodeo, they used to come out to the rodeo. Every rodeo she going to be there bright and early spinning the bin with all full of food."},{"speaker":"Marcus","time":"00:15:57-0","content":"Do you participate in the rodeo?"},{"speaker":"Isaiah","time":"00:16:00-0","content":"I sell hobby craft out there. I sell hobby craft."},{"speaker":"Marcus","time":"00:16:00-0","content":"Tell me a little about your children. These are the three that you have with Tamika?"},{"speaker":"Isaiah","time":"00:16:08-5","content":"Yeah the three I have with Tamika."},{"speaker":"Marcus","time":"00:16:12-8","content":"What are their names? How old are they now?"},{"speaker":"Isaiah","time":"00:16:20-9","content":"I have Jovanna. She is 28. I got Jovanna I got Muff. She is 16. That's my baby there. And I got Darione, which is monkey. She is 19. All 3 of them are like day and night. Jovanna is the passive one. She is the oldest and more laid back. She is the type of person who feels like everybody deserve a second chance, and third chance, and fourth chance."},{"speaker":"Isaiah","time":"00:16:20-9","content":"Then you got Monkey, she is like the carbon copy of me. Well of the old me, because she is so rebellious. All of them then been to college and everything. They educated. They Mama did a perfect job with them. They done been to school and all of them got good jobs. She is always pushing. And then you got Muff. She is the one that strives for so much attention."},{"speaker":"Isaiah","time":"00:16:20-9","content":"Yes. You can look at them they are like the spitting image of me. All the way down to the gap. All my kids have the gap between their teeth. It's like all the way there."},{"speaker":"Marcus","time":"00:17:50-7","content":"Interesting. With programs like Malachi Dads and various other programs here to help people to be more effective parents with their kids. Do you feel that you've been able to parent your kids from here?"},{"speaker":"Isaiah","time":"00:18:09-4","content":"Yes. I am very active in their life, and I try not to be judgmental. That is like the key aspect that make them really talk to me because I do not judge them on everything that they do. When they do something wrong, I explain to them what they done wrong and how they can prevent different stuff. But I want to be not only they parent, but I want to be their friend as well."},{"speaker":"Isaiah","time":"00:18:09-4","content":"That's what I tell them. I want to be your friend, not just your parent. I want you to be able to feel comfortable coming to talk to me about things that is going on in your life. And it is working. It has been working because I got a beautiful relationship with all my kids."},{"speaker":"Marcus","time":"00:19:05-7","content":"I tell you what, there are a whole bunch of people on the outside who cannot say that about their families."},{"speaker":"Isaiah","time":"00:19:12-2","content":"I know. That is one of things that my girl always tells me. She be like man your kids respect you so much. When you make a call, it is like you are right there with them. If you say, I don't want you to do this, it ceases immediately. It is like you are right there, right on the street with them. That is just how much they respect you."},{"speaker":"Marcus","time":"00:19:39-0","content":"That type of thing comes overtime, to develop that relationship. It does not just happen."},{"speaker":"Isaiah","time":"00:19:50-2","content":"That was the thing. She never allow them not to be in my life. Through this whole ordeal, she always made a way every month, twice a month, every year, since I have been here, she has always been there. She brings the kids, makes sure that once a month or twice a month that they see me."},{"speaker":"Marcus","time":"00:20:12-5","content":"That is amazing."},{"speaker":"Isaiah","time":"00:20:15-6","content":"You got to take into account too, that she come from the ghetto. She come from one of the worst spots in New Orleans. She come from the Florida projects. And she made it, so that our kids made it. My step son, he is in college right now. He is doing good. Everybody going to college. So, I feel like it was a success."},{"speaker":"Marcus","time":"00:20:49-6","content":"Let's talk a little bit about how you ended up taking this path. You know sometimes when you start to get into these things you can see that a person just gets into the wrong crowd and one thing leads to another and it's a whole series of things and this was just one of them. Sometimes it is just one first attempt situation. How was it for you?"},{"speaker":"Isaiah","time":"00:21:26-5","content":"I hung with older guys, much older guys. I think maybe what really defined me starting to go down that path was the first time I went to jail. I was real young, you know."},{"speaker":"Marcus","time":"00:21:53-0","content":"When was the first time you were arrested?"},{"speaker":"Isaiah","time":"00:21:54-9","content":"I was like 13 years old. I was arrested for a burglary. And when I got in the jail, my Mama tried to get me out. I had to wait and go to court and all this here. I got in jail and by me hanging with older guys on the street, so naturally when I am in the jail, I am going to hang with older guys."},{"speaker":"Isaiah","time":"00:21:54-9","content":"While I am in jail, I'm hearing all these stories about, oh I did this. I committed this crime, and this how you don't get busted. I am listening to all of that and it sounds fantastic. All the while it was grooming me for bigger things and I did not realize that listening at these stories, it like planted a seed in my head that graduate from breaking in cars and burglary to something else, snatching a purse or robbery."},{"speaker":"Isaiah","time":"00:21:54-9","content":"Because all of these stories, to a kid, sound fascinating. That was the changing point. They say that prison is supposed to help you, it is supposed to rehabilitate you, but they never tell you the other side of the card. That not only does it help you, but it teach you other aspects of the wrong side of life too. I missed the part about the help me change when I caught the part of the other side of life."},{"speaker":"Marcus","time":"00:23:57-1","content":"So your first arrest is 13 and you were saying now that this coincides roughly with the time when you said that you started to spiral a little bit after your grandmother's death. Do you find yourself getting in and out of trouble with the law all through your teens?"},{"speaker":"Isaiah","time":"00:24:15-6","content":"After that I was like back and forth. And then I was going through the stage of. I went from a group home to a mental health hospital. From the mental health hospital, straight to \"LTI\" and from there it was a spiral. I was only home for 6 months when I caught this charge from LTI."},{"speaker":"Marcus","time":"00:24:51-5","content":"Tell me about your charge."},{"speaker":"Isaiah","time":"00:24:54-2","content":"Well I came home from LTI and the easiest way to make money without actually, I thought was without actually hurting anybody or robbing anybody, was to sell drugs. So that is what I came home and started doing, selling drugs, and trying to support a much older woman."},{"speaker":"Marcus","time":"00:25:22-6","content":"Is that Tamika?"},{"speaker":"Isaiah","time":"00:25:25-4","content":"No. That is my other kid's mother. She passed. I was back and forth. That was the two relationships I was back and forth in between. Between Tamika and her. Even those two relationships they was existent together, basically."},{"speaker":"Marcus","time":"00:25:47-3","content":"And you have kids with the other woman?"},{"speaker":"Isaiah","time":"00:25:51-5","content":"Yes. I have 3 by her too."},{"speaker":"Marcus","time":"00:25:54-1","content":"What about your relationship with them? Are you still in touch with them?"},{"speaker":"Isaiah","time":"00:25:57-8","content":"One of my sons he own his own landscaping company and my other son went to Afghanistan, military, and did two and a half years over in Afghanistan. And my daughter she is currently doing beautician work."},{"speaker":"Marcus","time":"00:26:15-5","content":"All in New Orleans?"},{"speaker":"Isaiah","time":"00:26:17-1","content":"Yes. All in New Orleans."},{"speaker":"Marcus","time":"00:26:19-7","content":"You were telling me that you were with this older woman and you're trying to support that."},{"speaker":"Isaiah","time":"00:26:27-8","content":"I mean you out there selling the drugs, and you always got people that they feel like you to be played with. They could challenge you. And that is the way it be a lot of times. I just started growing hair in my face when I was like 26 years old. Up here. I always had a little kid look even on the street."},{"speaker":"Isaiah","time":"00:26:27-8","content":"So you looked at me and you say this little bitty boy, weighed like 100 and something pounds. So you underestimate, you know a lot of people. That happens a lot, and that is one of the things that bring you here. Well at least one of the things that brought me here."},{"speaker":"Marcus","time":"00:27:32-9","content":"You know people say that there is nobody who is doing drugs in New Orleans who is not carrying a firearm."},{"speaker":"Isaiah","time":"00:27:38-0","content":"Yes I mean, one don't go without the other. If they dealing drugs and they said they not carrying a gun, they lying. Because you got to protect you and you got to protect your product. So basically, that is like eating a peanut butter jelly sandwich without jelly on it. Peanut butter go with jelly."},{"speaker":"Marcus","time":"00:28:05-9","content":"So you get arrested. I imagine that you spend a bit of time in the parish, going through the trial. Do you remember the trial really well? Sometimes these things become a blur."},{"speaker":"Isaiah","time":"00:28:25-9","content":"Exactly. It be like a haze because man you are sitting up there and you are listening at these horrifying stories about you like, you are an animal. And you not really like that. You know the district attorney paint a picture of you like you some mass killer or something and it is not really like that. Through the whole time I am listening at people come up, march up and telling stories about me that a lot of them I know is not the truth."},{"speaker":"Isaiah","time":"00:28:25-9","content":"Some are, but a lot of it is not the truth. And it is like I can't really do anything. I don't know what I can do to stop them from lying. And my lawyer just sitting there and he just going through the procedure with them. He ain't writing nothing down or doing anything. He is just there. I write something down if they say and I show it to him and he is like yeah, alright. Shakes his head and is right onto something else."},{"speaker":"Marcus","time":"00:29:55-1","content":"Was your family in court?"},{"speaker":"Isaiah","time":"00:29:56-2","content":"Yes they were in there."},{"speaker":"Marcus","time":"00:29:58-9","content":"Do you remember the effect of hearing the verdict?"},{"speaker":"Isaiah","time":"00:30:02-7","content":"When I got found guilty of first degree murder, it was like a punch in the gut. All of the wind was knocked out of me. And then for the judge to say well we are going to go into penalty phase of the trial right now. We ain't going to wait."},{"speaker":"Isaiah","time":"00:30:02-7","content":"We are going to decide his fate right here and right now. We ain't going to wait, we going do this right here and right now. And for the court to the penalty phase, to determine if you are going to get the death penalty or life in prison. And man it really hurt me for my mother and my kid's mother to get up there and beg the people for my life."},{"speaker":"Isaiah","time":"00:30:02-7","content":"I mean it really hurt me. I felt as though if I get the death penalty maybe I can get some help. That is the people that actually get all of the help. I felt like don't beg them. Let them do whatever they going do, that way I can get the help I really need."},{"speaker":"Isaiah","time":"00:30:02-7","content":"I know that you are not financially able to get the help for me, so let them do what they need to for me to get the help that I really need. But they did not understand that. The only thing they was thinking about was that these people are about to try to take your life."},{"speaker":"Marcus","time":"00:31:35-3","content":"That was a pretty insightful vantage point that you had at that young age to know that if you are on death row you will get a whole bunch of lawyers and appeals."},{"speaker":"Isaiah","time":"00:31:50-9","content":"It was more or less I don't know what made me even think like that at that time or at that age. But I knew that when you are going through stuff like that, all of those things are afforded to you."},{"speaker":"Marcus","time":"00:32:09-6","content":"So they spared you the death penalty?"},{"speaker":"Isaiah","time":"00:32:15-8","content":"Yes. The jury came back with a unanimous verdict of life in prison. They said it was because of how young I was when the crime was committed."},{"speaker":"Marcus","time":"00:32:15-8","content":"Let me ask you this. Let's say that particular incident did not happen. How do you think the rest of your life would have charted out in the next few months or years?"},{"speaker":"Isaiah","time":"00:32:40-7","content":"Me and my girl always talk about this right now. That if this crime wouldn't have happened, where would I be? A lot of my friends, the guys that I ran with, are dead and a lot of them are in prison, here. So, that question it draws a blank because the life that I chose to live in, the life that was living, I do not know if it would have took me to the grave or the prison later on. Honestly, I don't know."},{"speaker":"Isaiah","time":"00:32:40-7","content":"I know the life that I wanted, the life that my kids' mothers wanted for me. With Tamika, she would not even accept drug money from me period. She refused it. She was the one person that was not with me for the money. For the street fame or anything because she just wanted me. I think that if I would have just settled down and just focused more on her, my life would have took a whole another change."},{"speaker":"Marcus","time":"00:34:19-8","content":"I want to go back to you coming here and how that first? Before I do that, is there something about the first 19 years of your life that's really important in terms of who you are today that we really did not get a chance talk about? Something I should have asked you?"},{"speaker":"Isaiah","time":"00:34:52-7","content":"Well, I would say coming up a lot of things that I wanted to do, I didn't get a chance to do. I lived in Illinois with my Auntie for a little while. It was so slow I guess. I begged to come home because I felt as though it was too slow for me there. And I went right back here to Louisiana and run right back into a wreck, run right back into jail. I mean everything."},{"speaker":"Isaiah","time":"00:34:52-7","content":"They tried to do everything they could to keep me away from this. They sent me away where I could be in a slower environment. That didn't even work. I guess life throw curve balls at you all the time, but when you just keep getting them, I mean what that say?"},{"speaker":"Marcus","time":"00:36:06-1","content":"Honestly one of the reasons that we wanted to talk to folks like yourself because you've been here 25 years plus. You're also considered something who is rehabilitated, who turned their lives around, a different person. I want to get into that process. For a minute, can you describe a young 19 year old Diggs that came in through the gates of Angola? Do you remember the bus ride?"},{"speaker":"Isaiah","time":"00:36:41-3","content":"Yes."},{"speaker":"Marcus","time":"00:36:42-8","content":"Tell me about that. Tell me about what kind of man that was."},{"speaker":"Isaiah","time":"00:36:45-1","content":"Very arrogant. I mean the thought in my head was that I'm coming here as a man and I'm going to leave here or die here as a man. It was so many horror stories that you heard about Angola."},{"speaker":"Isaiah","time":"00:36:45-1","content":"And I came up here with like it was like 9 of us. And out of 9 people that came here, it was like only 3 of us that actually survived the trials of going through here. I am talking about the rest of them fell to the waste side became homosexuals and live different lives and just not them. But it was like only 3 of us that actually made it through the trials of the fire."},{"speaker":"Isaiah","time":"00:36:45-1","content":"My thoughts at that time was that if you mess with me I am going to do you something. That is just the way it was. My Mama always stressed to make that. Man don't let nobody hurt you. I rather see somebody else crying over their child than me crying over mine. Don't let nobody hurt you. That was the thoughts that was in my head when I first came here."},{"speaker":"Marcus","time":"00:38:20-4","content":"Survival."},{"speaker":"Isaiah","time":"00:38:21-8","content":"Survival. I was a nice looking kid when I came here. That was what they preyed on. They preyed on that. So, I had to toughen up. I had to man up. Be the man that I always said that I was. I had to be that man."},{"speaker":"Marcus","time":"00:38:50-3","content":"Did you find yourself getting into a lot of trouble?"},{"speaker":"Isaiah","time":"00:38:51-4","content":"Yes. All the time because I just would not let anybody say anything to me. You couldn't tell me nothing. And like my first year here, I maybe had like 50 something write ups. I cut up. You couldn't tell me nothing. And then I guess a light clicked on in my head as the years went to passing and the transformation came."},{"speaker":"Marcus","time":"00:39:39-1","content":"How did that. Tell me about that."},{"speaker":"Isaiah","time":"00:39:42-1","content":"I guess it was more or less that I asked Tamika to marry me and she told me no. Even though she was my soulmate. She know she was my soul mate. I know she was my soulmate. But she said I am asking her for all the wrong reasons. I am asking her for possession. I am asking her because I want to have her as a possession. I did not understand that at the time. I was furious. Then when I really thought about it, I realized she was right."},{"speaker":"Isaiah","time":"00:39:42-1","content":"She said my arrogance was one of the reasons why she could not marry me at the time. She said I was so selfish, self-centered. It wasn't that she did not love me because she loved me with the flaws and all. But she just couldn't tie in with that. And I had to bring on a change. I had to change. I had to not only change for her, I had to change for my kids as well. I did not want that to rub off on them."},{"speaker":"Marcus","time":"00:41:03-9","content":"How long into your incarceration did those changes start to take hold?"},{"speaker":"Isaiah","time":"00:41:08-5","content":"Maybe like 8 or 9 years into the incarceration. They really started sitting there. I was like."},{"speaker":"Marcus","time":"00:41:28-0","content":"Your late 20s."},{"speaker":"Isaiah","time":"00:41:29-9","content":"Yes. Warden Cane made me trustee. For some reason he took a chance with people. Lifers and murderers specifically. He trusted murderers more than he trusted anybody because he understood that one event don't define the rest of your life. And he made me trustee. Man I was like trustee for like 16 years without a write up."},{"speaker":"Isaiah","time":"00:41:29-9","content":"People used to see me and they see me going working on the street and they knew the old me and they couldn't believe it. They like who trust you to be a trustee? And they couldn't believe it. And then when I say man I ain't had a write up in 10 years, 6 years, 9 years. They couldn't believe that because they knew the old me. They knew the old Isaiah. That transformation was a slow process but it was the best process that could have happened to me."},{"speaker":"Marcus","time":"00:42:47-0","content":"What kind of stuff did you do on the street as trustee?"},{"speaker":"Isaiah","time":"00:42:51-6","content":"Man I did. We cleaned all the schools and stuff right out of St. Francisville we used to go across the river, catch the ferry, and go across the river and cut all the grass stuff around there. Did the fiber optics and stuff. Did the fiber optic work here. As a trustee I done did so much."},{"speaker":"Isaiah","time":"00:42:51-6","content":"I remodeled the RC up there that they turned into the museum. I am the one that did all of the sheet rocking and everything up there. Painting and everything. Man I done had so many different jobs. I did body offender work. I worked on the trash truck. I mean I done had too many different jobs and done so many different things that it is just."},{"speaker":"Marcus","time":"00:43:47-0","content":"Yes. You have obviously also taken advantage of all of the programs and educational programs and vocational training. I mean if you are doing body offender."},{"speaker":"Isaiah","time":"00:44:07-9","content":"Yes I did body offender. I took the ASC certification test and I missed it by 3, bout 3 points. But I was supposed to reapply to do it and I wound up getting transferred doing some other stuff and they transferred it over from coming here to do the test to you have to go there to do it. It just was all kind of stuff so I just left it alone."},{"speaker":"Marcus","time":"00:44:21-5","content":"What about you're GED? Did you get that?"},{"speaker":"Isaiah","time":"00:44:24-5","content":"I never received my GED. In all actuality I was scheduled to take the GED test and for some reason I missed the call out and I wasn't able to take it. And then after that I'm doing this job and this job and as a trustee you are constantly moving and you can't. You can't just have a job here and say, well okay on this job I'm working down the street, okay y'all got to bring me in because I got to go to school."},{"speaker":"Isaiah","time":"00:44:24-5","content":"And for 16 years it was like that. I am constantly being shuffled around doing this job or doing that job and I guess I looked at it as me doing certain jobs didn't require me to have this you know the GED. And as I got older I guess I went to feeling as though that I really didn't need it."},{"speaker":"Marcus","time":"00:45:31-0","content":"Do you have any intentions of applying for clemency for compensation of your sentence?"},{"speaker":"Isaiah","time":"00:45:44-8","content":"Yes. I had said after the next election that I was going to apply for it."},{"speaker":"Marcus","time":"00:45:49-5","content":"Okay. So tell me what is your typical day like? What is your routine when you get up in the morning to when you go to bed at night?"},{"speaker":"Isaiah","time":"00:46:00-5","content":"I work at the mayor's office. I am a mayor's office clerk. So, my mornings start early when the shift change at five o'clock in the morning. I get up and make the coffee in the office and make sure everything straight for hen the shift change."},{"speaker":"Marcus","time":"00:46:29-6","content":"That's here in the main prison?"},{"speaker":"Isaiah","time":"00:46:30-9","content":"In the main prison in the west yard. Basically I make sure when say like when somebody get locked up I make sure all of their property is put in the boxes, sealed and placed in the proper room. After that I am a hobby shop man. I am in the hobby shop. You going to either catch me in the hobby shop or you're going to catch me on the basketball court, I try to do something to exercise."},{"speaker":"Marcus","time":"00:46:48-4","content":"What are you making in the hobby shop?"},{"speaker":"Isaiah","time":"00:46:52-6","content":"I do woodwork so basically. The power gone."},{"speaker":"Marcus","time":"00:46:55-4","content":"Yes we can fix that very quick. So you do woodwork you're tell me in the hobby shop. What kind of wood work?"},{"speaker":"Isaiah","time":"00:47:18-9","content":"Basically anything with wood. I do chairs. I do the table sets. I do bar sets. I do highchair sets."},{"speaker":"Marcus","time":"00:47:36-8","content":"And you sell that at the rodeo?"},{"speaker":"Isaiah","time":"00:47:39-1","content":"Yes."},{"speaker":"Marcus","time":"00:47:41-1","content":"That is a good source of income, right? What percentage of that can you keep? I forget it."},{"speaker":"Isaiah","time":"00:47:46-4","content":"Yes. Well, they take 21% off of it. Everything else is basically yours."},{"speaker":"Marcus","time":"00:47:55-6","content":"Do you find that that is the major source of your income for the year?"},{"speaker":"Isaiah","time":"00:48:00-7","content":"Yes basically I maneuver it around and make it work for me. You know because with that income there what I do is I take it and I reinvest some the money that I done made from that so I could keep going through the year. You know through the rest of the year. Every 6 months there is a rodeo."},{"speaker":"Isaiah","time":"00:48:00-7","content":"What I'll do is make sure I can have some kind of material or something that is going to last me until the next one come around and keep going. Also I try to like if birthdays come up I make sure that I make sure that I have something special for somebody in the family and stuff like that. The kids and stuff like that."},{"speaker":"Marcus","time":"00:48:53-6","content":"I've gotten the sense from everything you've said that it has clearly had a major impact on your family. Even the ones that have stuck with you all this time. Who do you think it's the hardest for over the years? Who do you think takes your incarceration the worst?"},{"speaker":"Isaiah","time":"00:49:18-2","content":"I think my kids. I think my kids. Their whole life, you know, I've been right here. Even though I'm active in their life. You know. I am not there to take them to ball games or wasn't there for the things that a father would do with their kid. So I think it was the hardest on them. And you know I guess. Yes my kids."},{"speaker":"Marcus","time":"00:49:53-1","content":"Have some guesses and maybe this seems like a strange question. I think at different times while you're here there are different things that are the most challenging. Like when you first come here there's a whole survival mentality. What is the worst experience for you now at this age?"},{"speaker":"Isaiah","time":"00:50:23-7","content":"The worst part at this stage is seeing the younger guys that's coming in now looking at them and looking at me through them. Seeing the challenges that they going to have to face and realizing that they don't realize it because they walk around in prison. They got they headphones on. They got their pants skinny jeans on. Pants hanging off they butt. They drugging. They doing all the different things that is going to keep them here. They think everything is all peaches and cream it's all just going to be laid out on a platter from them."},{"speaker":"Isaiah","time":"00:50:23-7","content":"I'm going home in 3 years. I'm going home in 5 years. It don't work that way. Instead of them getting involved in things that could possibly help them get out faster. They're involved in more of the wrong things than anything. And I look at them and I see myself when I was they age just doing the same things. It's scary because they don't really see the reality of it."},{"speaker":"Isaiah","time":"00:50:23-7","content":"And you can tell them about it. And you know the first thing they be like oh man you tripping. But I was where you was at, at one time. And now I done got old, look at me, and now I got grey hair, but I'm still the same person that came through these cracks all of these years later. Just with a different mindset."},{"speaker":"Marcus","time":"00:52:25-2","content":"Yes I mean um maybe they just have to go through it."},{"speaker":"Isaiah","time":"00:52:28-9","content":"Why? Why just go through it? Why do 26 years, 20 years, 25 years, before you wake up?"},{"speaker":"Marcus","time":"00:52:40-1","content":"Yes that is depressing."},{"speaker":"Isaiah","time":"00:52:45-1","content":"Losing people along that way."},{"speaker":"Marcus","time":"00:52:51-3","content":"Let me ask you something rather difficult. One of the things that I am trying to explore in this project is the lengths to which people go in order just to cope with the fact that they are serving life and that in spite of the possibilities of getting out, there is also the very likely possibility of not getting out. And so when you think about that, in the context of your life, how do you cope with that?"},{"speaker":"Isaiah","time":"00:53:46-9","content":"Well. Basically, hope. I live on hope. You know because I know one thing that there is a God. He sit high and he look low. And I live on hope knowing that someday somewhere this is going to be rectified. Even if it ain't in this life, it's in the next, something gone be rectified."},{"speaker":"Isaiah","time":"00:53:46-9","content":"Every day I wake up, I just think God for being alive. Being able to breath. There is just so many people that don't wake up. I try to do something every day different. Or touch somebody every day to make a difference in somebody life. Whether it's my kids, my girl, or a stranger. That's what keeps me motivated."},{"speaker":"Marcus","time":"00:55:05-8","content":"Do you see a lot of guys just lose hope?"},{"speaker":"Isaiah","time":"00:55:09-2","content":"Yes. You see a lot of that round here. I think the most depressing thing that was ever said was that 85% of the people here, going to die here. And then the percentage was raised up. That was the most depressing that anybody could ever say. That make you lose any hope that you actually have. Because you wonder am I in that 15%? What am I doing or what am I going to do to be in that 15%?"},{"speaker":"Marcus","time":"00:56:13-4","content":"Let me ask you this. What are you most proud of, of all the things you've done?"},{"speaker":"Isaiah","time":"00:56:22-1","content":"Here I am a member of the drama club. I been with the drama club many years under Gary, Tyler, Kenyon. And I think that the most memorable thing that I've done here is perform in a play called \"The Life of Christ.\" It was filmed, and we interacted with another prison, a female prison. The female prison, St. Gabriel, came here, and they performed with us. And at the time it just was a play. It was just something to do. It was something to be able to interact and mingle with other women, with women."},{"speaker":"Isaiah","time":"00:56:22-1","content":"But as we started to do the play, and we got more engrossed with the bible, because we doing the story out of the bible, it brought me closer to god. It bought a lot of us closer to God. Because we see a side that we didn't know. I think that was one of my proudest moments here. I performed in all 3 plays that they did here each year. We had to do character study and everything else. That was one of the most memorable moments I've had in this place."},{"speaker":"Marcus","time":"00:58:31-4","content":"I'm going to go with the idea that at some point, you'll become eligible for parole, and you'll get out. What would that chapter of your life look life?"},{"speaker":"Isaiah","time":"00:58:36-1","content":"I know my wife, my girl would probably have me on lockdown for a little while. But I think I would want to get involved with one of the programs that they have going on out there right now. They got programs that's actually helping the younger generation see the error of some of their ways. I think I got a story to tell. Because even at the age that I am now, I'm still in touch. You know I mean the younger dudes they look at me, and they call me Uncle."},{"speaker":"Isaiah","time":"00:58:36-1","content":"They call me uncle and that's a term of endearment. A term of affection. For them to label them as your uncle or something, that mean that they're willing to listen to you. If the guys here willing to listen to me, I think that my story could be told out there. And somebody, if it ain't nothing but 1 or 2 people, it might touch they life. Change the direction that they doing in."},{"speaker":"Marcus","time":"00:59:57-3","content":"Sure. I've really enjoyed talking with you. I've learned a lot about you which was the whole point. Is there a last question I guess? Is there something we should have talked about that we didn't get a chance to?"},{"speaker":"Marcus","time":"00:59:57-3","content":"` You know trying to give people who haven't thought much about life without parole and incarceration in this state to get a better sense of what that means. We've come quite a bit to that step. Is there something else you might want to talk about?"},{"speaker":"Isaiah","time":"01:00:36-5","content":"I think more or less that. It's the fact that we need help here. The program is trying to set up, I think it's going to be a lot of help and in a positive way. Because you know there's a lot of guys out there that deserve a second chance. I'm not saying everybody deserve a second chance, but some guys do deserve a second chance."},{"speaker":"Isaiah","time":"01:00:36-5","content":"And they could be productive in society. I just feel like we need a chance."},{"speaker":"Isaiah","time":"01:00:36-5","content":"We need that chance. Maybe our voice might be the one that stop your mother or grandmother from purse from getting snatched or getting hit over the head with something. Our voice might be that one that will stop that from happening. We just need that chance."},{"speaker":"Isaiah","time":"01:00:36-5","content":""},{"speaker":"Marcus","time":"01:02:09-7","content":"That's a good place to stop."}]}