{"name":"","transcript":[{"content":"Jack Segura REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:02-9","content":"So would you mind starting by stating your name the crime that you were convicted of how old you were and how much time you've already served?"},{"speaker":"Jack","time":"00:00:11-9","content":"I'm Jack Segura I was convicted of second degree murder I was 18 years old and I have served 35 and a half years"},{"speaker":"Marcus","time":"00:00:29-1","content":"Where did you grow up?"},{"speaker":"Jack","time":"00:00:30-6","content":"New Iberia Louisiana, southwest Louisiana"},{"speaker":"Marcus","time":"00:00:37-9","content":"I'm going to start by asking you a few questions about your childhood and then we'll move on to the time you've spent here what you've been up to here so if you wouldn't mind will you tell me a little bit about the folks who raised you your family?"},{"speaker":"Jack","time":"00:00:52-4","content":"My parents, both parents, mom and dad. I grew up in a home I was one of five kids in the family. I was the middle child and of course being the middle child without blaming mom and dad seemed like the two olders might have went with dad a lot the two younger with mom."},{"speaker":"Jack","time":"00:00:52-4","content":"I was left a lot by myself which for me was probably not a good thing if you ever recall the movie home alone? That's me. Not good home alone. And so growing up I had both parents aunts' uncles relatives close knit family. As far as me doing the things that I did as a kid I think I was an average kid I think I was an average boy growing up country boy at that but I was raised by many family members, many family members"},{"speaker":"Marcus","time":"00:02:07-1","content":"Is it fair to say that you grew up knowing that you grew up knowing that you were cared for and loved and nurtured?"},{"speaker":"Jack","time":"00:02:11-4","content":"Oh without a doubt without a doubt whether I wanted it or not"},{"speaker":"Marcus","time":"00:02:16-6","content":"Sure. Did your parents get along?"},{"speaker":"Jack","time":"00:02:19-2","content":"Yes my parents got along for the most part although my dad kind of had some extra marital affairs a few times, a few times. Other than that yeah matter of fact they were until my mom passed away they had been married 50 years so they never separated"},{"speaker":"Marcus","time":"00:02:42-3","content":"Was there fighting in the house?"},{"speaker":"Jack","time":"00:02:44-5","content":"Oh yes sir, yes lots of that lots of that"},{"speaker":"Marcus","time":"00:02:49-8","content":"Tell me a little bit more about that"},{"speaker":"Jack","time":"00:02:50-8","content":"Four boys' one girl"},{"speaker":"Marcus","time":"00:02:54-7","content":"Ok alright"},{"speaker":"Jack","time":"00:02:55-5","content":"Yeah there was a lot of fighting same thing kids' fight with one another. My dad my dad was more verbal abuse than anything my mom she was just the angel had to put up with all of us. But my dad quick tempered lots of anger military man and he didn't tolerate much but he was wasn't like I said he wasn't the abuser physical abuser it was more verbal."},{"speaker":"Marcus","time":"00:03:35-2","content":"What's your last memory of your mum?"},{"speaker":"Jack","time":"00:03:39-9","content":"Well my last memory it's been kind of hard to erase that was seeing her in the casket when I went to her funeral but happy memories? Just spending time with them here I was getting ready to graduate from seminary here when she passed away so she didn't she wasn't here for the graduation but she was very happy about it cause she knew I did everything I could in 4 years and out and I think she was proud of that. It's probably my biggest accomplishment. Yeah."},{"speaker":"Marcus","time":"00:04:21-8","content":"Sure what about grandparents do you have any?"},{"speaker":"Jack","time":"00:04:24-8","content":"Oh yeah both my grandparents on my dad's side Seguras passed away when I was young my grandfather I think I was five and my grandmother passed when I was like 8. But on my moms side of the family they my grandfather was the last one that was like 2005."},{"speaker":"Marcus","time":"00:04:49-2","content":"Ok. Who visits you here?"},{"speaker":"Jack","time":"00:04:51-8","content":"My dad. My sister. And two of my aunts and my best friend. I have brothers that have come here for years and years they're out of state now and they don't come to Louisiana a whole lot anymore not like they used to so it's basically my dad and my sister nowadays. And my aunts"},{"speaker":"Marcus","time":"00:05:13-1","content":"Ok yeah. I'm trying to get a sense of what your childhood home was like in New Iberia so could you kinda paint a picture for me if we're sitting on your front porch looking out what would we see?"},{"speaker":"Jack","time":"00:05:28-9","content":"We would see the football stadium. Where the high school played football. Right across the street. The bleachers and that's and the whole stands the football field and that was early. Later on my family moved out of the city limits but basically that's where I spent my life at right there and it was the football field"},{"speaker":"Marcus","time":"00:05:54-7","content":"Did you play football?"},{"speaker":"Jack","time":"00:05:55-7","content":"No I never played football I boxed for a short period and played baseball. Baseball was my sport"},{"speaker":"Marcus","time":"00:06:05-9","content":"Sure. Did you like school?"},{"speaker":"Jack","time":"00:06:08-4","content":"Did I like school- first through the 6th grade I loved school and then something happened. Something happened."},{"speaker":"Marcus","time":"00:06:20-2","content":"Something happened in 7th grade"},{"speaker":"Jack","time":"00:06:21-4","content":"During the summertime going to the 7th grade- drugs. Drugs and alcohol man changed my whole perspective on life"},{"speaker":"Marcus","time":"00:06:29-7","content":"Tell me a little bit more about that"},{"speaker":"Jack","time":"00:06:33-2","content":"Age 11, I started using marijuana drinking alcohol and from there by the time I was age 15 I was full blown addicted. Heroin addict synthetic heroin and that lasted till I was 40 years old. I was a drug addict till I was 40. 29 years. Started at 11."},{"speaker":"Marcus","time":"00:07:03-8","content":"Wow. So what was the highest year of school that you completed?"},{"speaker":"Jack","time":"00:07:10-4","content":"Ninth grade. Ninth grade dropout"},{"speaker":"Marcus","time":"00:07:14-6","content":"And drug related would you say?"},{"speaker":"Jack","time":"00:07:16-4","content":"Oh without a doubt without a doubt so yeah 1-6 grade I loved school from that point on I just I guess got social promoted seriously because I didn't learn anything."},{"speaker":"Marcus","time":"00:07:36-9","content":"18 is so young to be given a life sentence. How would you describe that kid?"},{"speaker":"Jack","time":"00:07:46-6","content":"Very angry very angry very angry yeah. No self control problem with authority didn't wanna couldn't tell me anything I was an adult I was an adult two months I was an adult. Just disoriented. Not a sober day."},{"speaker":"Marcus","time":"00:08:20-0","content":"Do you remember the first few weeks here at Angola?"},{"speaker":"Jack","time":"00:08:25-3","content":"Like it was yesterday"},{"speaker":"Marcus","time":"00:08:26-7","content":"Yeah tell me about that. It's a different it's everybody says it's a totally different place"},{"speaker":"Jack","time":"00:08:32-2","content":"Yes is it. Yeah when I first came through the front gates I went to lockdown because I escaped out the parish jail and they recaptured me within hours and then I was put in lockdown up here so my first couple weeks was in lockdown in a room with a door closed 24/7 metal door with just a little window lights out."},{"speaker":"Jack","time":"00:08:32-2","content":"It was January 1984 and it was very cold and I felt like this is where I'm going to serve my life sentence. In this dark room which they were just puttin me there for the time being until the classified me in and then put me in a working cell block but first couple weeks was spent in lockdown and then from there I went to camp A which has been closed for years now and I worked in the field. Worked in the fields."},{"speaker":"Marcus","time":"00:09:38-5","content":"Sure. I'm assuming you don't have any children"},{"speaker":"Jack","time":"00:09:40-9","content":"No I don't. thank god I don't"},{"speaker":"Marcus","time":"00:09:43-6","content":"You were so young"},{"speaker":"Jack","time":"00:09:44-7","content":"Right I wouldn't have been able to take care of them"},{"speaker":"Marcus","time":"00:09:47-0","content":"Yeah"},{"speaker":"Jack","time":"00:09:49-1","content":"Not from here"},{"speaker":"Marcus","time":"00:09:52-9","content":"Right yeah. Were you arrested prior to the crime that you are now convicted of?"},{"speaker":"Jack","time":"00:09:57-4","content":"Yes I had several arrests but no other convictions until"},{"speaker":"Marcus","time":"00:10:02-7","content":"Oh ok. So I if we think about what went down that path would you say that the crime that you are convicted of was related in some ways to drug addiction?"},{"speaker":"Jack","time":"00:10:18-4","content":"Yes it fueled the anger that caused me to commit that murder yes. And it wasn't a total stranger it was actually someone I knew"},{"speaker":"Marcus","time":"00:10:28-6","content":"Right and many- it usually is. One of the reasons that we wanted to talk with you is that you are widely considered to be a model trusted member of this community now someone who's turned their lives around since coming here. How far into your sentence do did you decide or finally come around to deciding I'm going to change my life"},{"speaker":"Jack","time":"00:11:04-9","content":"It happened 13 years ago when I was 40 years old"},{"speaker":"Marcus","time":"00:11:10-0","content":"Tell me sometimes it's a when you look at transformations like that sometimes it just a gradual process you just sort of age out sometimes it's a light bulb"},{"speaker":"Jack","time":"00:11:18-4","content":"Mine happened overnight."},{"speaker":"Marcus","time":"00:11:19-8","content":"Ok tell me about it"},{"speaker":"Jack","time":"00:11:20-9","content":"I quit using drugs"},{"speaker":"Marcus","time":"00:11:23-5","content":"What made you decide to do that?"},{"speaker":"Jack","time":"00:11:25-8","content":"It wasn't by choice and I had a couple overdoses. The last one was the one that scared me. So without security ever being involved in it I shook back I made it from the overdose and I said that was it. I'm through with it. And I've never been high again. Never been high its almost 13 years."},{"speaker":"Marcus","time":"00:11:55-8","content":"Congratulations"},{"speaker":"Jack","time":"00:11:57-2","content":"Yeah thank you. That was the beginning of my change. It took me getting off the drugs before I would accept any other change in my life because before that I have life what does it matter and just did whatever I wanted to do when I felt life doing it. But that was definitely a change for me and it changed my whole life."},{"speaker":"Marcus","time":"00:12:24-1","content":"So tell me what other things what so what have you been tell me about the last 13 years"},{"speaker":"Jack","time":"00:12:29-2","content":"The last 13 years well I started going to church becoming actively involved in the church from there to the seminary I did 4 years in the seminary while I was in seminary I worked with hospice at the hospital I spent 9 years over there and that was probably the best part of my entire incarceration. Those 9 years."},{"speaker":"Jack","time":"00:12:29-2","content":"Sounds kind of crazy working at a hospital around dying people but it gave me a purpose. It gave me a purpose and showed me a different side. Yeah a compassionate side and I probably sat with over 50 people to their death."},{"speaker":"Marcus","time":"00:13:25-7","content":"It takes a special person to do that"},{"speaker":"Jack","time":"00:13:28-3","content":"I didn't know I was that special person yeah. I miss it its been a while since I've done it I got out the program started teaching substance abuse anger management with reentry. I've taught faith based classes with the chaplain's department."},{"speaker":"Jack","time":"00:13:28-3","content":"So for the past 13 years that's been my life here hospice program 9 years going to school for 4 years and between that my affiliation with alcoholics anonymous Dale Carnegie which is a speaker club organization and the toy shop I worked in the toyshop for many years making toys for the kids that don't have any. Underprivileged done that for a long time"},{"speaker":"Marcus","time":"00:14:27-1","content":"Do you think you'll go back to Hospice work at some point?"},{"speaker":"Jack","time":"00:14:29-3","content":"I would love to do it I would love to continue doing it I think I reached a burnout with it 9 years and when I tell you day after day it was my life I lived it. 9 years on just burnt out burnt out seeing so many friends die so many"},{"speaker":"Marcus","time":"00:14:49-4","content":"Of course. Can you describe your typical day here now?"},{"speaker":"Jack","time":"00:14:57-0","content":"Very busy. Very busy. I'm teaching same 2 classes right now anger management, substance abuse with the its a program that's in booth 3 at camp C it's the CCR the guys that were in lockdown now they're in a program I teach in there that's my job at the present time and between that and my hobby which is woodwork something I love to do my days are they go by too fast sometimes. Too time too fast yes."},{"speaker":"Marcus","time":"00:15:39-0","content":"So I'm this is a hard question that I find it difficult to really try to get my mind around the concept of life without parole there's all this rehabilitation here- what.. I'm sure there are times when you are left with the thought that it's possible that you will never leave here. All of those men that you sat with in hospice probably reminded you of the possibility of that as well. How do you cope with that?"},{"speaker":"Jack","time":"00:16:19-6","content":"Well that's yeah that's very hard very hard question how do I cope with it? I have to remind myself to keep moving forward. I've accepted that there's a possibility I'll die here. Some people say what's the difference where you die? It's a thing where I don't want to give up I've come too far to lay down."},{"speaker":"Jack","time":"00:16:19-6","content":"My doctor tells me after my 50th, after I turn 50 years old my doctor tells me I'll probably live another 35 years I said I don't know if that's good doc. But we laughed about that he said of course it is any time you're alive its a good thing but to live in a place like this year after year after year watching people die watching people go home I feel like my day is coming so I have to stay positive try to just continue moving forward and at the same token not be selfish with my time here. That's why I try to be involved in programs that help other people and that's what I've been doing for quite a while now."},{"speaker":"Jack","time":"00:16:19-6","content":"So yeah you gotta stay positive about it I mean many days when I was still drugging it wouldn't've matters if I'd have died right then and there it really wouldn't have mattered. It wouldn't have mattered. Today? I think entirely different. But yeah you just gotta keep moving forward can't lay down I've come too far. Too far. And things are changing things are changing."},{"speaker":"Marcus","time":"00:18:14-0","content":"They are they are. And just a few and again you're one of these cases just a few months into your 18th"},{"speaker":"Jack","time":"00:18:18-5","content":"2 months"},{"speaker":"Marcus","time":"00:18:20-7","content":"I mean it's- there's something so utterly arbitrary about that."},{"speaker":"Jack","time":"00:18:24-4","content":"And did know they have to have a cut off somewhere"},{"speaker":"Marcus","time":"00:18:28-5","content":"They do"},{"speaker":"Jack","time":"00:18:30-4","content":"I understand that"},{"speaker":"Marcus","time":"00:18:32-4","content":"The brain science is suggesting that 25"},{"speaker":"Jack","time":"00:18:33-8","content":"25 I've read over and over and over I've read it yep"},{"speaker":"Marcus","time":"00:18:36-4","content":"Yeah. When you- its 35 years. Is that enough? Is 35 years enough for second degree murder?"},{"speaker":"Jack","time":"00:18:54-9","content":"It should be. It should be yeah. Yep."},{"speaker":"Marcus","time":"00:19:02-1","content":"When you look back on the crime and I don't know how often you would after 35 year but you can tell me when you look back on the crime and the victim victims family and so forth and try to sort of find your own space with that how do you feel about that 35 years later?"},{"speaker":"Jack","time":"00:19:19-7","content":"Senseless. Yeah senseless. I've thought about it many a times believe me and there are its just like anything else that happens when it happens it happens so fast. So fast. Could been avoided many times could've been avoided just wasn't. Wasn't avoided. Some people say its fate I made that choice I made that choice I could've walked away I could've walked away and my- do I regret it? Of course I do he was a friend he was a friend yeah."},{"speaker":"Marcus","time":"00:20:10-5","content":"If you were afforded the opportunity to speak with his parents or his family what would you want them to know?"},{"speaker":"Jack","time":"00:20:23-7","content":"Well I mean I would at least ask them to forgive me. Yeah how do you apologize I don't think that's possible really I would just ask that they forgive me I mean I've served the time some people feel it's never enough. I don't know."},{"speaker":"Jack","time":"00:20:23-7","content":"I would just his brother his brother had contacted me once. through family members and he's always felt like he understood why things happened how things happened because of the lifestyle and it was somewhat drug related and he's an I don't think he's ever really held anything against me but other family members have so for me to apologize to them would never be enough. It'd never be enough."},{"speaker":"Marcus","time":"00:21:33-6","content":"Have you forgiven yourself?"},{"speaker":"Jack","time":"00:21:34-9","content":"Yes. That was probably the hardest part. Yeah forgiving myself yep because that's what kept me the drug addict kept me from trying to excel bettering myself because I felt I didn't deserve anything else. Today I look at it differently today I know I had to forgive myself I had to forgive others so much involved in a murder case so much. Yeah."},{"speaker":"Marcus","time":"00:22:14-2","content":"True. If let's just say when you come before a pardon board parole board all they're going to have is that information up until you're 18 and then they don't really have that much more maybe a conduct record and then you're going to have to paint a picture of who you are and what would what do you want them to know what would you tell them?"},{"speaker":"Jack","time":"00:22:39-9","content":"Well I would hope that they would which they would see you can put a portfolio together the accomplishments I've made the work I've put in the change I- conduct record wow. I filed clemency last year and they turned me down without even granting me a hearing after 35 years and I felt I was deserving."},{"speaker":"Jack","time":"00:22:39-9","content":"35 years and that's a long time and they don't owe you anything they don't owe you anything so. I had a portfolio put together for them its nice its decent but my conduct record was one of the things that they used against me in 75 write ups and I haven't had a write up in 12 years now I haven't had a write up in 12 years and that meant nothing so how would I present myself before the board today."},{"speaker":"Jack","time":"00:22:39-9","content":"I would hope that they would consider the things I have done the years I've put into it and it's a consistent thing where its not where I fall here and there or its 12 years clean. No incidents and I've been putting in a lot of work and its not for myself more its for others more than anything."},{"speaker":"Jack","time":"00:22:39-9","content":"So I would hope that they could that they could look at the person when he arrived 18 19 years old and the person today is definitely a different person because the person I used to be wasn't willing to help others. That was a selfish person I would hope I would hope that they could see a change other than me aging I would hope they could see a change and give me that opportunity."},{"speaker":"Marcus","time":"00:24:55-8","content":"Yeah. This might seem like an odd question but what is the worst part of being in prison here?"},{"speaker":"Jack","time":"00:25:02-4","content":"Being away from family. Losing family. Losing family members since I've been here has probably been the worst part. I mean the prison itself I've seen some seen a whole lot been through a whole lot but nothing was worse than losing family members not being able to be there."},{"speaker":"Marcus","time":"00:25:26-5","content":"Sure I'm sure."},{"speaker":"Jack","time":"00:25:27-7","content":"Yeah"},{"speaker":"Marcus","time":"00:25:32-9","content":"And the best part?"},{"speaker":"Jack","time":"00:25:34-9","content":"The best part? That I'm a different person today. Best part and I think because of that because had I still been that individual who acted the way I acted when I first came here I probably wouldn't even been able to go to my mother's funeral my brother's funeral that would've been pushed to the side I even got a chance to do the eulogy for both of their funerals so that was a real good thing. It meant a lot. Yeah."},{"speaker":"Marcus","time":"00:26:19-8","content":"Sure. What are you proudest of?"},{"speaker":"Jack","time":"00:26:22-1","content":"What am I proudest of? That would be my bachelor's degree. In Christian ministry probably my biggest accomplishment ever in life."},{"speaker":"Marcus","time":"00:26:34-9","content":"Yeah it's a big one"},{"speaker":"Jack","time":"00:26:36-5","content":"For a ninth grade dropout it's not too bad"},{"speaker":"Marcus","time":"00:26:39-1","content":"It's a big accomplishment"},{"speaker":"Jack","time":"00:26:40-2","content":"Yeah it is"},{"speaker":"Marcus","time":"00:26:43-1","content":"I'm sure that you envision what your life could be if you were released. What is that what would you paint that picture for me?"},{"speaker":"Jack","time":"00:26:54-5","content":"Paint that picture. Well if I would be allowed to do it because of me being a convicted felon I am sure I could be involved I know guys that are involved in drug counseling would be"},{"speaker":"Marcus","time":"00:27:08-5","content":"Oh yeah."},{"speaker":"Jack","time":"00:27:10-2","content":"Yeah it would be my career I would hope. That's what I've been working at and hoping to one day put it to use. I mean who knows it better than I do?"},{"speaker":"Marcus","time":"00:27:25-6","content":"And in some ways you are putting it to use with the reentry program it's just not outside."},{"speaker":"Jack","time":"00:27:31-2","content":"Right yeah and I enjoy I enjoy teaching I enjoy being able to try and help somebody who's struggling with the same things I struggled with for 29 years of my life yeah."},{"speaker":"Marcus","time":"00:27:52-8","content":"Is there a question that I should have asked you I didn't ask something that you didn't have the opportunity to talk about that you might have wanted to? And if not then let me end with this last thing. We you and I had a conversation a little bit about the fact that people just have no idea about what actually happens in prison. What would you want people who are not who don't know to know about what's going on here in Angola?"},{"speaker":"Jack","time":"00:28:37-5","content":"In what area?"},{"speaker":"Marcus","time":"00:28:38-6","content":"Well so what would you want people to know about the good?"},{"speaker":"Jack","time":"00:28:43-2","content":"The good that goes on here?"},{"speaker":"Marcus","time":"00:28:45-0","content":"Yeah"},{"speaker":"Jack","time":"00:28:47-0","content":"Well there is a lot of positive things going on here and if a person wants change its available to them. its I think it's I think the thing is with the programs here is that most people get involved in programs because they feel it might help me in the long run it might help me to if I have this in my record but I'm not getting anything out of it I'm just going to sit there I'm not going to participate I'mma get a piece of paper and its more than that."},{"speaker":"Jack","time":"00:28:47-0","content":"It's more than that the education that you can get is limitless when I first came here? You worked in the field there was no education. very little education so I would say to someone who's never been here and doesn't know anything about prison that there's a lot offered here if a person wants to grab ahold of it get something out of it its here its offered you just have to take advantage of it and most people its they feel like it's being pushed on them."},{"speaker":"Jack","time":"00:28:47-0","content":"And they're not going to learn anything. They're not going to learn anything. So you have that opportunity to get some education here be involved in something positive I'd say take advantage of it. Programs here today are probably better than they've ever been. Today yeah."},{"speaker":"Marcus","time":"00:30:33-6","content":"I believe that"},{"speaker":"Jack","time":"00:30:35-1","content":"Yeah. Yeah and there's a whole lot you can get involved in. yep"},{"speaker":"Marcus","time":"00:30:41-0","content":"Well thanks. Thank you very much for sitting with us"},{"speaker":"Jack","time":"00:30:43-7","content":"I'm not very talkative"},{"speaker":"Marcus","time":"00:30:45-4","content":"Actually you did great"}]}