{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "James Refuge Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "James",
      "time": "00:00:00",
      "upperBoundTime": "00:01:09",
      "content": "My name is James Refuge. I was convicted for armed robbery and murder. And, I was 18 years old when I committed the crime in 1969. And like, I went to court. I wasn't, I was on drugs, but I wasn't, the drugs didn't cause me to do what I did."
    },
    {
      "speaker": "James",
      "time": "00:00:00",
      "upperBoundTime": "00:01:09",
      "content": "What I did was because I was taught from a young age through my mother that was the only one that really had control over my life was my mother. But she always told me, never, always take care of my sisters and brothers. Never let nothing happen to them."
    },
    {
      "speaker": "James",
      "time": "00:00:00",
      "upperBoundTime": "00:01:09",
      "content": "Well I heard a conversation at the age of 16 my grandfather, my sister, one of my sisters asked my grandfather if he was going to buy them some, a new outfit for school, to get back to school. He told her no, so I heard this conversation at 16, and said well I ain't going to let that happen. I went to robbing and went to Payless and went to buy clothes for my sisters to go to school. Sisters and brothers."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:09",
      "upperBoundTime": "00:01:17",
      "content": "Sure. Tell me a little bit about the people who raised you."
    },
    {
      "speaker": "James",
      "time": "00:01:17",
      "upperBoundTime": "00:01:23",
      "content": "All right, well my aunt raised me after I came out of the homes. I had an aunt named Doris Demay, she died."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:23",
      "upperBoundTime": "00:01:28",
      "content": "Okay, so how old were you when you were put in foster care?"
    },
    {
      "speaker": "James",
      "time": "00:01:28",
      "upperBoundTime": "00:01:31",
      "content": "Fourteen."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:31",
      "upperBoundTime": "00:01:32",
      "content": "Okay, this is a year after your mother died?"
    },
    {
      "speaker": "James",
      "time": "00:01:32",
      "upperBoundTime": "00:02:31",
      "content": "A year after my mother died. I was put in the Boys Home and I ran away from there and so they wound up catching up with me, living with my aunt and they sent me to the state industrial school for nine months. Where I stayed there. And then I got out at the age of 15."
    },
    {
      "speaker": "James",
      "time": "00:01:32",
      "upperBoundTime": "00:02:31",
      "content": "And when I got out of that, I start staying with my aunt. Because my grandfather didn't want me under his custody no more. And I was 16 years old, roaming the streets and I went into the Fisher Project, a neighborhood where I used to hang out because I didn't want my sisters and brothers to see me in that part because we were living in Jefferson Parish."
    },
    {
      "speaker": "James",
      "time": "00:01:32",
      "upperBoundTime": "00:02:31",
      "content": "And I didn't want them to see the life that I was living, I didn't want them to grow up the way I was living. And through the Fisher Projects, I watched it come from ground level. In reality, I thought, \"I run the projects.\" You couldn't come in the project without coming through me. And that's how it was in that neighborhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:31",
      "upperBoundTime": "00:02:44",
      "content": "Did you live there, did you spend the night there?"
    },
    {
      "speaker": "James",
      "time": "00:02:44",
      "upperBoundTime": "00:03:24",
      "content": "I just stayed there all day until dark. And then I had a bunch of friends, like a lot of girlfriends. All the girls used to call me Little James. That's what they called me at the time. And all the girls just wanted to be part of me. Just to say they went with me. Because the reputation that I had, I had a reputation, I was young put it like that. And through that reputation, I stayed there because I didn't have any relatives at all living in that Fisher Project."
    },
    {
      "speaker": "James",
      "time": "00:02:44",
      "upperBoundTime": "00:03:24",
      "content": "I was living in Jefferson Parish with my grandfather at the time. Then my aunt moved and took me with her in Jefferson parish Street. And that's when, I just go hang in the projects. I wasn't, I quit going to school and hang out in the projects every day, every day. I wouldn't let my sisters or brothers come nowhere near around that project, and I didn't want them to know about it."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:24",
      "upperBoundTime": "00:03:28",
      "content": "Right. What about your father? Was he ever in your life?"
    },
    {
      "speaker": "James",
      "time": "00:03:28",
      "upperBoundTime": "00:04:16",
      "content": "Well, my father, sure, my father was living in Chicago. See, he used to come get me every summer and, to come stay in Chicago, but he tried to get me at the age of 16 to come live with him, but through my younger days in Chicago, I realized that I felt like I couldn't make it in Chicago the way, that life, the way I've seen the life in Chicago with the gang life. I don't like gangs, I never did."
    },
    {
      "speaker": "James",
      "time": "00:03:28",
      "upperBoundTime": "00:04:16",
      "content": "And like, through my younger years, my daddy come every summer and bring me to Chicago with him. And, he'll bring me back and, I was real young then and that's when I got, my mother died, and I made 16, and I was stay with my grandfather, my daddy's daddy. And he tried to get me to go to Chicago. I said no because I couldn't survive up there. I felt like I wouldn't survive in Chicago."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:16",
      "upperBoundTime": "00:04:20",
      "content": "Sure, it's different culture."
    },
    {
      "speaker": "James",
      "time": "00:04:20",
      "upperBoundTime": "00:04:23",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:23",
      "upperBoundTime": "00:04:26",
      "content": "You mentioned that you quit going to school. What was the highest grade of school?"
    },
    {
      "speaker": "James",
      "time": "00:04:26",
      "upperBoundTime": "00:04:32",
      "content": "Seventh grade. I went to Landry."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:34",
      "content": "And so, how were you supporting yourself?"
    },
    {
      "speaker": "James",
      "time": "00:04:34",
      "upperBoundTime": "00:05:23",
      "content": "Well, I was doing little jobs. I thought working round, picking up paper, and stuff in the projects. I was in the little school, they called it. They would pay us, pay us $45 every Friday for picking up paper. We'd bring so many sacks to the office. Then I'd work at a grocery store in with a man that I used to go with his daughter."
    },
    {
      "speaker": "James",
      "time": "00:04:34",
      "upperBoundTime": "00:05:23",
      "content": "He had, this man had was Grant, he had some business and he'd let me operate his business for him when he not around. And that's how I was surviving and, like I said, I just started doing things I should've never did. Because when my mother let die, I didn't have control, nobody had control, she was the only one that really had control in my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:23",
      "upperBoundTime": "00:05:20",
      "content": "Sure, and you have 7 younger siblings?"
    },
    {
      "speaker": "James",
      "time": "00:05:20",
      "upperBoundTime": "00:05:24",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:24",
      "upperBoundTime": "00:05:39",
      "content": "Can you paint a picture, this is a long time ago and I'm just trying to picture, picture your neighborhood there. So, let's talk about the Fisher Projects, you spent most of your life up there?"
    },
    {
      "speaker": "James",
      "time": "00:05:39",
      "upperBoundTime": "00:05:41",
      "content": "I spent most of my life up there."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:41",
      "upperBoundTime": "00:05:46",
      "content": "All right, so if I'm standing next to you, were both 18, both 17, looking around, what would we be seeing? What would I be seeing?"
    },
    {
      "speaker": "James",
      "time": "00:05:46",
      "upperBoundTime": "00:06:13",
      "content": "Well, you'd be seeing a lot of youngsters, you see a lot of people going in and out the projects. In and out buildings. You have, you know, certain neighborhoods where you have basketball courts, play football, and you see all kind of different types of activity going on. Drug dealers, whatever. And, we'd be doing a lot of things that, that the average ghetto people would do. And that's the way I was brought up."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:13",
      "upperBoundTime": "00:06:22",
      "content": "In the late 60s?"
    },
    {
      "speaker": "James",
      "time": "00:06:22",
      "upperBoundTime": "00:06:25",
      "content": "It was the 60s. The late 60s. The 1960s. The projects came up in 1965."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:25",
      "upperBoundTime": "00:06:28",
      "content": "Okay."
    },
    {
      "speaker": "James",
      "time": "00:06:28",
      "upperBoundTime": "00:06:31",
      "content": "And through that, I stayed in that project until 1969."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:31",
      "upperBoundTime": "00:06:39",
      "content": "I got it. Did you have a person that you were particularly close with? Like a best friend coming up?"
    },
    {
      "speaker": "James",
      "time": "00:06:39",
      "upperBoundTime": "00:06:40",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:40",
      "upperBoundTime": "00:06:42",
      "content": "Tell me about, about that person."
    },
    {
      "speaker": "James",
      "time": "00:06:42",
      "upperBoundTime": "00:06:56",
      "content": "Well, this is a girl, a woman of mine. She had a son for me. Her name is Glennis Jones. Me and her were, we still close today. We had relationship at 1967. We've been having a relationship for 50 years. She's still with me today."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:56",
      "upperBoundTime": "00:06:58",
      "content": "Wow."
    },
    {
      "speaker": "James",
      "time": "00:06:58",
      "upperBoundTime": "00:08:47",
      "content": "And we were so close. She had a son, my son wound up dying at the age of 26 because he wanted to be so much like me in the Fisher Projects. He had heard so much of me and like, through her. She asked me to marry her in 1978 while I was in this prison, I told her I wouldn't do it. Because I couldn't see the things that I see today. And like, she used to send my son up here to visit me with her sister, her sister had a husband up here to with me."
    },
    {
      "speaker": "James",
      "time": "00:06:58",
      "upperBoundTime": "00:08:47",
      "content": "And, my son's daughter visit me at the age of 6 years old all the way till he made 16. When she was letting him, because she used to bring him too. Then, when she stopped coming, she start saying by him doing his time in Angola, we could visit regardless."
    },
    {
      "speaker": "James",
      "time": "00:06:58",
      "upperBoundTime": "00:08:47",
      "content": "I used to work up in their building and everything in the 70s. My son made 16 years old, and he told me, he said, \"Daddy, I can't come visit you no more.\" I said, \"Why is that?\" Because I told them about the life that you lived, and that you don't have no friends in that life. He was a drug dealer, so he said, \"I can't come visit you because I got to carry a gun everywhere I go.\" I said, \"You don't have to bring no gun in Angola.\" He said, \"Well, I understand see, but I got to come all the way to the front gate with it in my car.\""
    },
    {
      "speaker": "James",
      "time": "00:06:58",
      "upperBoundTime": "00:08:47",
      "content": "So, I said, \"Well remember one thing, remember you don't have no friends in that life that you do, that you're living now. You can't trust no one.\" So, 1976, my son wind up getting shot up in the shoot-out, and he died. And from what I heard and what I was hearing about, he wanted to be, he heard so much of me that he wanted to be just like me. That was this woman that I'm still with today that was her son."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:47",
      "upperBoundTime": "00:08:51",
      "content": "What was her name? I missed that."
    },
    {
      "speaker": "James",
      "time": "00:08:51",
      "upperBoundTime": "00:08:52",
      "content": "Glennis. Glennis Jones."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:52",
      "upperBoundTime": "00:08:54",
      "content": "So, who visits you up here?"
    },
    {
      "speaker": "James",
      "time": "00:08:54",
      "upperBoundTime": "00:09:03",
      "content": "Glennis Jones, my sister Linda Harrison, and, back in the day, they had all my sisters and brothers would visit me."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:03",
      "upperBoundTime": "00:09:04",
      "content": "Okay."
    },
    {
      "speaker": "James",
      "time": "00:09:04",
      "upperBoundTime": "00:09:06",
      "content": "But they all got families now. And like, they had slowed down but right now, today, Glennis Jones and my sister and daughter participant right now, for visitation."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:06",
      "upperBoundTime": "00:09:18",
      "content": "Right. If you had to pick an adult, of the adults in your life when you were growing up, who would you pick? Who took the greatest interest in you? Who would that be?"
    },
    {
      "speaker": "James",
      "time": "00:09:18",
      "upperBoundTime": "00:09:27",
      "content": "My auntie Dun Demay."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:27",
      "upperBoundTime": "00:09:31",
      "content": "Your auntie."
    },
    {
      "speaker": "James",
      "time": "00:09:31",
      "upperBoundTime": "00:09:33",
      "content": "But all my aunts and uncles, they all passed."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:33",
      "upperBoundTime": "00:09:36",
      "content": "What's your last memory of your aunt?"
    },
    {
      "speaker": "James",
      "time": "00:09:36",
      "upperBoundTime": "00:09:46",
      "content": "Oh man, she was so close to me, she used to come visit me. You know, through the time I was arrested and, in this prison, and all, until she passed away."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:46",
      "upperBoundTime": "00:09:48",
      "content": "Do you remember your last visit with her?"
    },
    {
      "speaker": "James",
      "time": "00:09:48",
      "upperBoundTime": "00:09:51",
      "content": "Well, it'd be way back in the 70s."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:51",
      "upperBoundTime": "00:09:52",
      "content": "Oh really?"
    },
    {
      "speaker": "James",
      "time": "00:09:52",
      "upperBoundTime": "00:10:02",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:02",
      "upperBoundTime": "00:10:03",
      "content": "So, did you find yourself getting into fights a lot at home?"
    },
    {
      "speaker": "James",
      "time": "00:10:03",
      "upperBoundTime": "00:10:04",
      "content": "Well, not at home."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:04",
      "upperBoundTime": "00:10:05",
      "content": "Okay."
    },
    {
      "speaker": "James",
      "time": "00:10:05",
      "upperBoundTime": "00:10:56",
      "content": "Just on the streets. I was on the streets and outside the, in the neighborhoods. Like I say, I was so good with my hands I should have been a professional. I had the opportunity to do that. Guys would come talk to me about it at my younger age, you know. But I didn't know what I was facing until now. Until today, 17 years ago when the Lord touched my heart in this prison."
    },
    {
      "speaker": "James",
      "time": "00:10:05",
      "upperBoundTime": "00:10:56",
      "content": "Even in this prison, I could've been a professional in here. But I was living so wild. The Lord touched my heart. He showed me how I let the devil use me, you know. To the point where, I don't live that life, I'm not the same person that first came here. I'm a totally different man now."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:56",
      "upperBoundTime": "00:11:09",
      "content": "Yeah, I do want to talk about that. Do you remember, we're just going to bring us back to when you got here? Do you remember the first time you got arrested?"
    },
    {
      "speaker": "James",
      "time": "00:11:09",
      "upperBoundTime": "00:11:49",
      "content": "Yes, sir. I remember I first got arrested in 1969, in December. And what the arrest, I was arrested in Chicago. And two guys that told on me, Larry Miller who was my fall partner, and the older guy Jim Johnson. They sent, they told the people where I was at. I was living in Chicago at the time. That's where I went, where I was when I went after I committed the crime."
    },
    {
      "speaker": "James",
      "time": "00:11:09",
      "upperBoundTime": "00:11:49",
      "content": "And they come, they come got me. So, they brought me to Orleans parish. So, when I went to Orleans parish, I was young and like, I said, my first arrest."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:49",
      "upperBoundTime": "00:11:50",
      "content": "That was your first arrest?"
    },
    {
      "speaker": "James",
      "time": "00:11:50",
      "upperBoundTime": "00:12:04",
      "content": "My first arrest and I stood my ground because I felt like, if I do, because of my size, I wasn't going to let no one abuse me, no one handle me, no any kind of way. And I had to do what I had do, as far as fighting and other things."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:04",
      "upperBoundTime": "00:12:07",
      "content": "Is your fall partner serving a life sentence?"
    },
    {
      "speaker": "James",
      "time": "00:12:07",
      "upperBoundTime": "00:12:32",
      "content": "No, I'm the only one. One Miller did, he wound up, the next, the same age as me. He had got 21 years, and the other guy, Jim Johnson, he got cut loose. The lawyer that was supposed to represent me, represented him. And that lawyer name was Harry Connick. And he refused to accept me as defender."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:32",
      "upperBoundTime": "00:12:42",
      "content": "Sure. Fair. You briefly talked about drug use, were drugs and alcohol a big part of your life at the age of 18?"
    },
    {
      "speaker": "James",
      "time": "00:12:42",
      "upperBoundTime": "00:12:45",
      "content": "Well, I used it, but it didn't have no control over me."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:45",
      "upperBoundTime": "00:12:55",
      "content": "Okay. Would it be fair to say that you were mistreated as a child? Or do you not see it that way."
    },
    {
      "speaker": "James",
      "time": "00:12:55",
      "upperBoundTime": "00:13:30",
      "content": "I don't see it that way. The only thing I did, I shouldn't have did what my grandfather, you know. I couldn't accept the things that he said and did. He had possession, he had full possession of me, or custody, put it like that. He had custody of me."
    },
    {
      "speaker": "James",
      "time": "00:12:55",
      "upperBoundTime": "00:13:30",
      "content": "And the way I heard him talk to my sisters, I couldn't accept it. About he wasn't going to buy them anything. I feel like he supposed to do that. He supposed to buy us things. Because he was getting the forms for us. We wereliving in his house and everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:30",
      "upperBoundTime": "00:13:32",
      "content": "Did you find yourself butting heads with him?"
    },
    {
      "speaker": "James",
      "time": "00:13:32",
      "upperBoundTime": "00:13:47",
      "content": "Well, we did. We had words. That's as far as we went."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:47",
      "upperBoundTime": "00:13:54",
      "content": "Okay. So, Mr. Refuge, one of the reasons that we wanted to speak with you and folks like you is that, you've served a very long time already, and you are widely considered to be rehabilitated."
    },
    {
      "speaker": "James",
      "time": "00:13:54",
      "upperBoundTime": "00:13:56",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:56",
      "upperBoundTime": "00:14:14",
      "content": "A model inmate. But let's go back for a second, and you tell me you spent a couple of years in the parish. And now your 21 when you come to Angola. Tell me about that. Coming to Angola in 1971?"
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "1971, I was first brought to Angola. I was placed on death row for the electric chair. And I stayed on death row and, when they demolished the death penalty, well, I went through some physical contact with other prisoners because of my size, but I never lost."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "And, next thing, I was boss, and you know, I would just say that I wouldn't let anyone handle me in no any kind of way. Do me no anything. Being on death row, they demolished the death penalty in 1972. And, to be honest, it was a blessing for me, because they demolished it two weeks before, my execution date was coming up."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "And when I got back to court, it was like a sheet pulled from over my head. A comfortable mind where I see daylight and I felt the change in my life at that point because I'm looking. I was told that all my remittance, and everything was, that I didn't have no more chance in court. And you will be executed, by demolishing, it just took the sheet from over my head. I felt a whole lot different, so they brought me back to appellate court to get resentenced."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "Then they brought me to Angola, and I had to go through, they put me in, in the cell block when I first came back to Angola in 1972 December. And, I had to go through a, the governor of public corrections, she had something to do with public corrections, Elayne Hunt. I had to go through her to get out the cell blocks to be placed in population in Angola."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "And it placed me now, in 1973, they put me in the, on East side, it was called. And when I got in there, a lot of the guys had heard so much about me, that they said \"Man, you James? You Little James?\" And I said, \"Yes, I'm Little James.\" He said, \"Man, I thought you were six foot, 265 pounds.\" You got a lot of people afraid of you because of where I lived it."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "And I regret the life that I was living then because I abused a lot of people. We took a lot of men pride. I did some things that were real hurtful to modern standards as of today. Because after I look back, because it was to the point where, I'd be honest with you and anybody else. In them years, them days, I was afraid to go home."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "I was afraid to even come out of Angola because I thought I was going to lose my life the day I hit the streets because of the way I abused a lot of other men. In this place, because I thought my life would be like, more like in jeopardy. But as the years went by, I met some guys that's in a legal program and they showed me some points where, man they would look into your case. They knew I had some good grounds. But I said, well it doesn't matter you know."
    },
    {
      "speaker": "James",
      "time": "00:14:14",
      "upperBoundTime": "00:18:09",
      "content": "And from that point, as I, through my living, I was 50 years old and where I lived then was Angola, in the prison. And the Lord touched my heart and turned my life around. And he went to showing me you know, in 1976 when I got stabbed, I couldn't believe it that I made it, I walked all the way to the hospital till I got the emergency room. That's when I passed out, they put me in an ambulance and they rushed me straight on the streets."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:09",
      "upperBoundTime": "00:18:12",
      "content": "You were stabbed?"
    },
    {
      "speaker": "James",
      "time": "00:18:12",
      "upperBoundTime": "00:18:38",
      "content": "I was stabbed in the center of my back. Stabbed in the center of my back. And then, before that, I should have, I got stabbed right here, there's a mark there with butcher knife that came close to my throat and like I said, I got so many wounds in body because of my lifestyle. But today, it's totally different. I'm a totally different person than what I used to be."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:38",
      "upperBoundTime": "00:18:47",
      "content": "Let's talk a little bit about that transformation? So, you're in a very violent prison and, in the 1970s, and you're just fighting."
    },
    {
      "speaker": "James",
      "time": "00:18:47",
      "upperBoundTime": "00:18:48",
      "content": "Just fighting to survive."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:48",
      "upperBoundTime": "00:18:59",
      "content": "Fighting to survive. And you get a couple of stabbings during that time. Last one in in 1976."
    },
    {
      "speaker": "James",
      "time": "00:18:59",
      "upperBoundTime": "00:19:00",
      "content": "Right in 1976, the worst one."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:00",
      "upperBoundTime": "00:19:00",
      "content": "Okay, that was the one in your face?"
    },
    {
      "speaker": "James",
      "time": "00:19:00",
      "upperBoundTime": "00:19:02",
      "content": "No, in my back."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:02",
      "upperBoundTime": "00:19:03",
      "content": "In your back, okay."
    },
    {
      "speaker": "James",
      "time": "00:19:03",
      "upperBoundTime": "00:19:06",
      "content": "The knife came this close to my heart."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:06",
      "upperBoundTime": "00:19:14",
      "content": "Oh okay. And it was at that point that you thought you needed to change things, or did you just come right back fighting?"
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "I just came right back fighting, still doing the same thing that I was doing. Up until 2000. That's when I changed my life around. 2000, the Lord touched my heart because, be honest with you, I could see God in reading the Bible and going to church, in the 70s. I thought they were using that as protection. That's what I looked at it."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "Then, one day, I had a preacher man come, from off the street and was looking for me. Now, something told me, something said, \"Man take it off, take this day off.\" I used to go, used to deal with recreation."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "I was official, really, I was an instructor over officiating. And I used to deal with basketball at night, called basketball at Angola up here. So, God told me, he said, \"Man, got a preacher be coming looking for you,\" so I said this one tonight, I'm going to take the day off and just see who it is."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "So, I'm Church, so I went to that Church that particular night and, it was in 2000. And got across with the men on the streets that I grew up with. And, he just so happened to call my name. I said, \"Man I know that man, I know that guy.\" He was, was a preacher at that time. But this time, you know we did a lot of things on the street coming up in our teenage life."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "When I recognized who he was by making these names, calling these names, all these names and accusations I realized who he was then. And he turned to be preacher and it touched my heart, and from then on, he would share things with me about how he turned his life around. And, a week or so later, I got blessed and the Lord just touched my heart."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "And I did start going to church and I did see what I had seen back in the 70s, about why dudes are going to church and why they are using the Bible. Why they're carrying, you know, the bible. Then I start reading the bible. God started showing me how he used me. And I got myself together and I thought like, I was working with God, this is my goal today. That was a big relief out this prison."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "My goal is to get out there, get my grandkids or young kids, and teach them not to make the mistake that I made. I want to work with these young kids, and show them because even this prison, they got some young guys come here that I sat down and talked to and I showed them what, and they got 2 or 3 years, or 5 years at the most and that is the deal. And I talked to them and they see me."
    },
    {
      "speaker": "James",
      "time": "00:19:14",
      "upperBoundTime": "00:22:21",
      "content": "They say, \"Man, you're a blessed man, you don't look it.\" I don't look my age and I get around get as well as they do. And I showed them this ain't no place to be. 48 years in prison, incarcerated, I saw much. I destroyed my life, I destroyed 48 years of my life in prison. And I got grandkids. I got two daughters. And also had a son, my son, you know, died."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:21",
      "upperBoundTime": "00:22:22",
      "content": "Tell me about your daughters."
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "Alright, my daughters, Shemain, one of my daughter's name is Shemain and she'll be 50 years old in December of this year. She is married, and she got one son. I never saw, I broke her heart because she was two years old last time I seen her. And their mother died at a young age from sickle cell anemia."
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "My youngest daughter is 47. She'll be 48 in September. I never seen her. The close I came to seeing her was a picture of her, and the reason that came about, my mother-in-law told her so much hateful stuff about me, until she didn't want me communicating with her."
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "So, what happened, one of my cousins were coming to visit me back in this time, and she asked my cousins if the person that she could visit do, do she think he knows her daddy. And well, they was going to college together. My cousin and my daughter, my youngest daughter, her name KayKay, and she said, \"The person you go visit, he might know my daddy. Could you ask him do he know my daddy?\" So, in the process of doing that, she said, \"Well, what your daddy name?\" And when she told her, \"My daddy name is James Refuge.\" She said, she looked at her, \"well, you already know. That's who I go visit. I'm visiting James Refuge, but didn't know you're related.\""
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "So, she wind up, so like my cousin, told her how you thought about telling her so she sent me pictures and write names on them because all the people grew up on me. Got all my nieces and nephews that I never met. So, she just so happened to send me a picture of my daughter without putting her name on it. She told me in the letter, said call me when you get this."
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "I get on the phone, I get the picture and I look at it, and I said, \"Lord have mercy.\" My daughter look exactly like me. So, I get on the phone and I said, I talk to her and she said, \"You know who that is on the picture?\" I said, \"You don't got to say no more. That's my daughter.\" She said, \"Yeah.\" I said, \"She look just like me.\""
    },
    {
      "speaker": "James",
      "time": "00:22:22",
      "upperBoundTime": "00:25:18",
      "content": "She got all my ways, she's exact. So, but my daughter, she went to school to be, she works for the crime lab. She do the blood tests on crime. She lives in Texas. Her husband is a private investigator. And, she got two kids. And like, my mother-in-law still don't want me and her communicating. But I'm going to get with her. If get out here today or tomorrow, that's going to be the first thing I do, catch up with my two daughters. I want to show them."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:18",
      "upperBoundTime": "00:25:21",
      "content": "Have you tried to reach out to them from here?"
    },
    {
      "speaker": "James",
      "time": "00:25:21",
      "upperBoundTime": "00:26:03",
      "content": "Well, I don't know where their building be located, communicated. But I'm more sure that, from what they, see their grandmother hated me so bad, so much because I'm young. That's what bothered her."
    },
    {
      "speaker": "James",
      "time": "00:25:21",
      "upperBoundTime": "00:26:03",
      "content": "My mother-in-law wanted me to marry they momma. But I was too young to get married, and I didn't feel like, like me and her, their mother was young, and they didn't see the lifestyle as being married. But my mother-in-law got mad because I didn't want to accept the situation there. So, she split to spread the soil between me and my two daughters."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:03",
      "upperBoundTime": "00:26:13",
      "content": "Okay sure, I understand. SoI have a question for you. So, you were almost, in 2000, you were close to 50."
    },
    {
      "speaker": "James",
      "time": "00:26:13",
      "upperBoundTime": "00:26:15",
      "content": "Right, I was 50."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:15",
      "upperBoundTime": "00:26:17",
      "content": "This is a time when you said you changed your life around."
    },
    {
      "speaker": "James",
      "time": "00:26:17",
      "upperBoundTime": "00:26:18",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:18",
      "upperBoundTime": "00:26:20",
      "content": "Why do you think it took you so long?"
    },
    {
      "speaker": "James",
      "time": "00:26:20",
      "upperBoundTime": "00:27:06",
      "content": "Well, the way I come up in this prison, the way I came up in life. And I didn't see the things that I see. Now even today, in those, prison ain't what it used to be any way no more. It's totally different. They say Angola is not what it used to be back in the day. There was a time that your shadow, if I laid out my bed and I just had my eyes closed, if I could be sleep, your shadow would wake me up."
    },
    {
      "speaker": "James",
      "time": "00:26:20",
      "upperBoundTime": "00:27:06",
      "content": "When I had to go to bed with a knife under my pillow or somewhere around me at all times. That's the way the life was back then. But nowadays, there's no violence concern. No violence taking place they say, or talk about it."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:06",
      "upperBoundTime": "00:27:14",
      "content": "Sure. So, can you describe what your typical day now is? What is your routine today? What do you do?"
    },
    {
      "speaker": "James",
      "time": "00:27:14",
      "upperBoundTime": "00:27:53",
      "content": "Well I work, I do painting, and I do construction work on the job. I'm the type of person that I like to work because the more I work, it motivates me. The more I get around much better. I'm all about some work. I don't care whatever, I'm going to help somebody to do some kind of work."
    },
    {
      "speaker": "James",
      "time": "00:27:14",
      "upperBoundTime": "00:27:53",
      "content": "And, at my age, I'm 67 years old, and the more I work, the better I feel, you know. I don't try to work myself to death. But I do, I like doing something. I'm going do something regardless of my job and everywhere I go. That's what, you know, my motivation I have about life now."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:53",
      "upperBoundTime": "00:28:02",
      "content": "Sure, so then after your job is over, where, how do you spend the rest of your day?"
    },
    {
      "speaker": "James",
      "time": "00:28:02",
      "upperBoundTime": "00:28:24",
      "content": "Well, there are two things I do to be honest with you, is that I watch the news, and from the news to my bed. I read my Bible. I read the Bible every day. I set it on the side of my bed, because the people I've live around are way much younger. I'm the oldest convict in my area where I live at, in my dormitory."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:24",
      "upperBoundTime": "00:28:28",
      "content": "What dormitory?"
    },
    {
      "speaker": "James",
      "time": "00:28:28",
      "upperBoundTime": "00:29:20",
      "content": "Cypress 1. I'm the oldest convict in there. I been out longer than the average individual in that dorm. The ward, some will come and talk to me, and some don't. And some of them don't understand what I do. Because I'm trying to stay out of trouble, trying to stay away from trouble because, it's a time I may have some old-fashioned ways because the way I was brought into Angola, but it ain't that no more."
    },
    {
      "speaker": "James",
      "time": "00:28:28",
      "upperBoundTime": "00:29:20",
      "content": "And the way I do things, I ain't going to disrespect no man and I don't want no man disrespecting me. And that's how they live, these youngsters nowadays, they're growing up, they learning because it takes certain situations, certain things for them to understand where they at, and what they're doing and what they got themselves into like me, myself. So, it took me some years."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:20",
      "upperBoundTime": "00:29:38",
      "content": "Sure. Now, knowing everything that you know, if you could go back to the James Refuge that arrived at Angola at 21, what advice would you give him?"
    },
    {
      "speaker": "James",
      "time": "00:29:38",
      "upperBoundTime": "00:32:00",
      "content": "Well, I'd give him, be conscious and be a person that has understanding. You know, try to share some positive things with a person. Because see like me, I see these guys see because I've felt like I should have been a professional ball player. I was so good at playing sports in this place. And I was teaching sports. And this is what I look at them, a lot of them like to sports and participate but always look back to where you should be that person on that TV screen."
    },
    {
      "speaker": "James",
      "time": "00:29:38",
      "upperBoundTime": "00:32:00",
      "content": "That professional ball player or whatever. And that's my, that's the way I look at it like. I should have been a professional, now what I want to do is help these guys, man, get out of, get your goal of being a good basketball player, baseball player, whatever. Reach that goal, it ain't too late. And that's the way it is if I get on the street. I would go out there and do some coaching because I'm still active. I destroyed 48 years of my life, that's what I look at. I didn't have the opportunity to be with my kids."
    },
    {
      "speaker": "James",
      "time": "00:29:38",
      "upperBoundTime": "00:32:00",
      "content": "I didn't have the opportunity to come up with my family. That's what it really takes its toll on me on, but I ain't giving up on that. Because I still got a life ahead of me. And I'd love to enjoy the rest of my life with my family members, if possible. And I said like, is it God's will for me. That's the way I look at life."
    },
    {
      "speaker": "James",
      "time": "00:29:38",
      "upperBoundTime": "00:32:00",
      "content": "You know, I'm in this prison for a purpose. To be honest. Like I said, my life got turned around. If I wouldn't have been in this prison, I would have been dead on the streets a long time ago."
    },
    {
      "speaker": "James",
      "time": "00:29:38",
      "upperBoundTime": "00:32:00",
      "content": "I would have lost my life because the way I was coming up, and the way I was living. And like I said, I look at it also God got me here for a purpose. And he is showing me how to adjust myself to things that I used to do that ain't good. To turn my life around, to be a positive man and I want to show other guys, other people, younger kids, especially young kids, don't make the foolish mistakes."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:00",
      "upperBoundTime": "00:32:04",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "James",
      "time": "00:32:04",
      "upperBoundTime": "00:32:40",
      "content": "I have a lot. I've really forgiven myself for what mistakes that I've made and what I did. Because I wasn't there for my sisters and brothers like I was supposed to have been. Like my mother had taught me to do. You know, this is the way, the way she taught me, brought me up. Don't never let nothing happen to them and I wasn't there. But to be honest, after 8 kids, I'm the only one incarcerated."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:40",
      "upperBoundTime": "00:32:42",
      "content": "What about the victim's family, do you think about that?"
    },
    {
      "speaker": "James",
      "time": "00:32:42",
      "upperBoundTime": "00:33:01",
      "content": "Yeah, I think about that too because I know what its like for someone to lose a loved one. You know, I have a grace for them. I'm sorry that I did what I did, and I said I'm sorry. I didn't mean to do it, but it happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:01",
      "upperBoundTime": "00:33:07",
      "content": "Yeah, after 48 years, I mean, how much punishment is enough punishment?"
    },
    {
      "speaker": "James",
      "time": "00:33:07",
      "upperBoundTime": "00:33:38",
      "content": "That's what I tried to understand to. How long? What all it takes? How long I have to be incarcerated because me being incarcerated will not bring that individual being back to life because of how long I be in here. So, what it takes for a man to be incarcerated?"
    },
    {
      "speaker": "Marcus",
      "time": "00:33:38",
      "upperBoundTime": "00:33:41",
      "content": "Yeah. You mentioned early on that your plan is to go before the pardon board at some point."
    },
    {
      "speaker": "James",
      "time": "00:33:41",
      "upperBoundTime": "00:33:43",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:43",
      "upperBoundTime": "00:33:59",
      "content": "And, the pardon board will have your crime of conviction. They'll have your disciplinary record. It'll have some materials that you have to provide. You will have a short window of opportunity to tell them who James Refuge is today. What are you going to tell them?"
    },
    {
      "speaker": "James",
      "time": "00:33:59",
      "upperBoundTime": "00:34:54",
      "content": "I could tell them that, I'm not the same person I used to be. I'm not that same individual anymore. Even though I had that one write-up, it took me 10 years to get that one write-up. To keep me from going at a certain time. But my life done change and I'm not the person that I used to be and I'm a totally different man compared to what I used to be back in 48 years ago. I'm not that individual."
    },
    {
      "speaker": "James",
      "time": "00:33:59",
      "upperBoundTime": "00:34:54",
      "content": "I'm a stronger man now, and I say this here, whoever has the opinion on my release or whatever, they won't have to worry about being, they won't have to worry about saying, \"I told you so.\" Because I will never come back to no body prison or no body jail in all my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:54",
      "upperBoundTime": "00:35:11",
      "content": "Yeah. What, what, let's talk a little bit about how you envision that. Let's say they do let you go. How do you envision your life, outside?"
    },
    {
      "speaker": "James",
      "time": "00:35:11",
      "upperBoundTime": "00:35:54",
      "content": "Well, getting me a job, working and cutting grass, doing lawn, doing, working at different individuals. You know, if I got to get a paint job, painting somebody's homes or houses or being a carpenter somewhere. Because when I was young, I had an uncle who was the manager over the Cotton cruise, and I used to go with him to work."
    },
    {
      "speaker": "James",
      "time": "00:35:11",
      "upperBoundTime": "00:35:54",
      "content": "Like I said, my grandfather taught me this here, before he died. He died at 97 years old. He told me the more he worked, the better he felt. And that's the way I feel, at my age. The more I work, the longer I could live and the better I feel. I'm going to get a job."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:54",
      "upperBoundTime": "00:35:58",
      "content": "Have you developed some vocational skills while you were here?"
    },
    {
      "speaker": "James",
      "time": "00:35:58",
      "upperBoundTime": "00:36:00",
      "content": "Yes, I have."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:00",
      "upperBoundTime": "00:36:02",
      "content": "Tell me about that."
    },
    {
      "speaker": "James",
      "time": "00:36:02",
      "upperBoundTime": "00:36:56",
      "content": "Well, I've been through painting. I done did, I've done a variety of jobs in here. I learned how to drive in here. I learned how to drive tractors. I worked the vegetable fields. I learned how to plant vegetables. How to, I learned how to build, how to do concrete, cement, and all this here. I learned how to place bricks, I was a brick layer in one of my projects."
    },
    {
      "speaker": "James",
      "time": "00:36:02",
      "upperBoundTime": "00:36:56",
      "content": "And we'd be in buildings in the rodeo grounds, and I helped do that part. And, like I said, construction work and paint, and I done learned how to drive. I worked at the incinerator, picking up garbage. Ain't too many jobs in Angola that I hadn't done. I was brought up."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:56",
      "upperBoundTime": "00:37:01",
      "content": "Sure. So, this might seem like a strange question, but Angola has changed a whole lot -"
    },
    {
      "speaker": "James",
      "time": "00:37:01",
      "upperBoundTime": "00:37:02",
      "content": "A whole lot!"
    },
    {
      "speaker": "Marcus",
      "time": "00:37:02",
      "upperBoundTime": "00:37:09",
      "content": "So, if I were to ask you what the worst thing about being in prison in the 70s, I'd imagine you would tell me it was the violence."
    },
    {
      "speaker": "James",
      "time": "00:37:09",
      "upperBoundTime": "00:37:12",
      "content": "It was the violence."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:12",
      "upperBoundTime": "00:37:15",
      "content": "What's the worst thing now, for you?"
    },
    {
      "speaker": "James",
      "time": "00:37:15",
      "upperBoundTime": "00:37:32",
      "content": "Just being in prison, probably the worst thing is being in prison because I don't have the opportunities to see my family members like I really want to see them. That's the worst part of my incarceration time right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:32",
      "upperBoundTime": "00:38:02",
      "content": "I understand. This is a difficult question, I know that you have hope that you might be getting to a pardon board and that you might be getting some relief at some point. But, I expect that you also spend some time contemplating the reality that you may die here. As many people are. How do you cope with that?"
    },
    {
      "speaker": "James",
      "time": "00:38:02",
      "upperBoundTime": "00:38:09",
      "content": "Well, express that to me again."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:09",
      "upperBoundTime": "00:38:37",
      "content": "So, I know that it's important, a lot of guys have told me, its important to hoping that one day you'll get out. And not to lose hope. But I think that you surely have spent some time thinking about the possibility that you might die here. And when you think about that, how do you cope with that. That's what I was asking."
    },
    {
      "speaker": "James",
      "time": "00:38:37",
      "upperBoundTime": "00:39:19",
      "content": "See, it's my goal this here, I never, never put that hope, that thought there in my mind about dying in Angola because, like I said, through me reading the Bible and the Lord touching my heart, he give me the strength and the ability that I will never die in Angola."
    },
    {
      "speaker": "James",
      "time": "00:38:37",
      "upperBoundTime": "00:39:19",
      "content": "I will never see that kind of hope; my goal is that I'm going to be released. And that's how I deal with the situation. Because like, I don't live the Angola style as of today. My mind stay focus on society, the streets. Every day from the time I get up because I thank God every day for waking me up every morning."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:19",
      "upperBoundTime": "00:39:21",
      "content": "Okay, so would you say you deal with it by not thinking about it?"
    },
    {
      "speaker": "James",
      "time": "00:39:21",
      "upperBoundTime": "00:39:26",
      "content": "Not thinking about it. Could I say something?"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:26",
      "upperBoundTime": "00:39:30",
      "content": "Yeah."
    },
    {
      "speaker": "James",
      "time": "00:39:30",
      "upperBoundTime": "00:40:06",
      "content": "Because it's based up on this here, some little guy that I been in this prison with over the years in wheelchair, health is gone. And I look at myself. I can't see myself being in that situation there. I don't take medication, because of my health. I continue to live the way I grew up as a youngster. I do things, I'm active. I may not be as active as I used to be, but I still got a little more motivation in myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:06",
      "upperBoundTime": "00:40:15",
      "content": "Sure, yeah. So, of all the things that you have done with your life, what are you the most proud of?"
    },
    {
      "speaker": "James",
      "time": "00:40:15",
      "upperBoundTime": "00:40:27",
      "content": "Being the man that I am. That's what I'm most proud of. Being the man and person that I am today. And knowing that I still have loved ones that's sticking with me."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:27",
      "upperBoundTime": "00:41:01",
      "content": "Is there something that I should've asked you that I didn't? Something that you may have wanted the opportunity to talk about, but I didn't ask you about. Or maybe something that you may want others who are not in prison, who don't see what's happening here, to know about?"
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "Well, that's a good question there too. A lot of people don't understand what's going on in this prison. They don't understand what they, what they're going through, especially the men. Because once you get into prison and get yourself into a situation, and you go to realizing that what you left behind and you not in the situation or position to help these individuals, because you may have kids or family members that need your support and your help. And being in here you can't do nothing."
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "You can't support them, you can't help them, and sometimes that's the way it gets with me."
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "I destroyed 48 years of my life when I could've been out there helping my sisters and brothers to get their life on the roll, which they never been in trouble, but I still feel like I missed something by not being with them, because I'm the oldest child. I'm the oldest brother. And they still respond with me, but they don't give me the respond that we used to have years ago, through coming up."
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "And I wouldn't want to see no one go through the change that I have been through. No man, or no woman should go through this situation I been through for 48 years and some guys have been longer than that. And like I said, hope. I keep that hope."
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "I had a friend of mine just made parole. He locked up just as long as me. We've been through the same things. Death row, and he was a juvenile when he got his charge. He made parole just last week. And he's out of here. And me seeing him getting out of here gave me more hope that my day going to come and he gave me the strength just to see him, what he do, and what he's been doing with his incarceration time."
    },
    {
      "speaker": "James",
      "time": "00:41:01",
      "upperBoundTime": "00:43:21",
      "content": "That was a blessing, that the man made parole. Like I said, he fell up under the juvenile bill and he was 65 years old and he was in good health."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:21",
      "upperBoundTime": "00:43:24",
      "content": "Wow. Yeah."
    },
    {
      "speaker": "James",
      "time": "00:43:24",
      "upperBoundTime": "00:43:26",
      "content": "That's a blessing for me."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:26",
      "upperBoundTime": "00:43:31",
      "content": "Right, you're just a few months older."
    },
    {
      "speaker": "James",
      "time": "00:43:31",
      "upperBoundTime": "00:43:32",
      "content": "Older."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:32",
      "upperBoundTime": "00:43:38",
      "content": "Yeah. Well, Mr. Refuge, thank you so much for seeing us."
    },
    {
      "speaker": "James",
      "time": "00:43:38",
      "upperBoundTime": "00:43:40",
      "content": "I appreciate it."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:40",
      "upperBoundTime": "00:43:43",
      "content": "I really appreciate you sharing your story with us and talking with us."
    },
    {
      "speaker": "James",
      "time": "00:43:43",
      "content": "I enjoyed doing this here. Like I said, my day is coming. I will be free."
    }
  ]
}
