{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:04",
      "content": "Jarrod Lanclow Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Jarrod",
      "time": "00:00:04",
      "upperBoundTime": "00:00:14",
      "content": "Alright, my name is Jarrod Lanclow, I'm serving a life sentence, I was convicted of second degree murder, and I've currently been incarcerated for the last twenty-one years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:14",
      "upperBoundTime": "00:00:16",
      "content": "How old were you when you were arrested?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:00:16",
      "upperBoundTime": "00:00:22",
      "content": "I was eighteen years old when I was arrested."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:22",
      "upperBoundTime": "00:00:44",
      "content": "I was just speaking with somebody who was seventeen years old when they were arrested and now they're eligible for parole after twenty-five years. Does is seem particularly cruel to you that, had you been just a few months younger, you would also be eligible for parole after twenty-four years, twenty-five years?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:00:44",
      "upperBoundTime": "00:00:47",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:47",
      "upperBoundTime": "00:00:49",
      "content": "I mean it seems so arbitrary."
    },
    {
      "speaker": "Jarrod",
      "time": "00:00:49",
      "upperBoundTime": "00:01:00",
      "content": "Not much difference. It could be a difference between a day, seventeen and eighteen years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:00",
      "upperBoundTime": "00:01:24",
      "content": "I'm going to ask you a few questions about, just your life coming up to your eighteenth birthday which is just a kid. And then we'll talk a little bit about your first few years here and the changes that you've gone through. Can you start by just telling me a little bit about the folks who raised you, about your family?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:01:24",
      "upperBoundTime": "00:02:02",
      "content": "Okay. I grew up with both of my parents. I grew up in actually a very good home. Mom and dad was always there for us. I grew up with one brother, older, a year older than me. Middle class home, never really did without. Mom and dad loved us loved us a lot, always expressed they loved us, they were there for us. Dad worked, mom stayed home and took care of us, going to school. I mean, they were always there. Never had to do without either of my parents. We were well loved and it was well known."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:02",
      "upperBoundTime": "00:02:03",
      "content": "And where did you grow up?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:02:03",
      "upperBoundTime": "00:02:06",
      "content": "I grew up in Eunis, Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:06",
      "upperBoundTime": "00:02:08",
      "content": "Did your parents get along?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:02:08",
      "upperBoundTime": "00:02:25",
      "content": "Oh mom and dad got along great, as a matter of fact they've been married like forty-nine years now, and still get along great. Yeah they make sure that I mean like, they expressed their love to us, showed us how to love, by doing the right thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:25",
      "upperBoundTime": "00:02:30",
      "content": "So it's fair to say you grew up in a household knowing you were cared for and nurtured and loved."
    },
    {
      "speaker": "Jarrod",
      "time": "00:02:30",
      "upperBoundTime": "00:02:32",
      "content": "Oh definitely, definitely, without a doubt."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:32",
      "upperBoundTime": "00:02:34",
      "content": "How about school, did you like school?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:02:34",
      "upperBoundTime": "00:03:18",
      "content": "Yeah, school, I did well in school up until probably maybe around fourth or fifth grade. I would get distracted easily. A lot of times I probably wouldn't want to be there. I just know that I would get distracted easily. But still my grades wouldn't really suffer. I didn't pretty good as far as making grades."
    },
    {
      "speaker": "Jarrod",
      "time": "00:02:34",
      "upperBoundTime": "00:03:18",
      "content": "As I got older though, that's when I noticed things started changing. I would want to be at school less, probably around junior high. Started getting involved in the wrong things, wrong people, and at that point I think I really didn't want to be in school anymore."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:18",
      "upperBoundTime": "00:03:19",
      "content": "Did you finish high school?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:03:19",
      "upperBoundTime": "00:03:21",
      "content": "No, I dropped out in the ninth grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:21",
      "upperBoundTime": "00:03:25",
      "content": "Okay, so when you drop out, then what are you doing?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:03:25",
      "upperBoundTime": "00:03:48",
      "content": "Well when I dropped out in the ninth grade I actually got expelled for fighting. But by that time I think I was like sixteen years old. I mean, I was selling drugs and I figured that school really wasn't a place that I needed to be. I could make more money selling drugs not being in school just taking up time from doing what I wanted to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:48",
      "upperBoundTime": "00:03:50",
      "content": "Was that the first time you were kicked out of school?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:03:50",
      "upperBoundTime": "00:03:53",
      "content": "Yeah, that was the first time."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:53",
      "upperBoundTime": "00:04:05",
      "content": "I've never been to Eunis, so can you just paint a picture for me if I'm in your neighborhood where you grew up. Are your mom and dad still in the same house?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:04:05",
      "upperBoundTime": "00:04:06",
      "content": "Still live in the same house."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:06",
      "upperBoundTime": "00:04:08",
      "content": "Okay so, do they have a front porch there?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:04:08",
      "upperBoundTime": "00:04:10",
      "content": "Yeah, kind of."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:10",
      "upperBoundTime": "00:04:18",
      "content": "Okay so if I'm on the front steps, let's say, on the door. I'm looking out into the neighborhood on a summer afternoon, what am I seeing and hearing and smelling."
    },
    {
      "speaker": "Jarrod",
      "time": "00:04:18",
      "upperBoundTime": "00:04:53",
      "content": "Oh you're seeing probably a lot of kids, it was a pretty active neighborhood, my middle class neighborhood. I mean, seemed like there was always a lot going on, nothing bad. A lot of kids playing, Our house pretty much was like the center where all the kids in the neighborhood who would come, my mama would be at work so we would kind of do what we wanted. It was great. Like, you would, I mean just, everybody knew each other. So you kind of, everybody would get along, there wasn't a lot of trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:53",
      "upperBoundTime": "00:04:54",
      "content": "Was it racially integrated? Or was it."
    },
    {
      "speaker": "Jarrod",
      "time": "00:04:54",
      "upperBoundTime": "00:05:00",
      "content": "Oh yeah, definitely. Yeah definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:00",
      "upperBoundTime": "00:05:04",
      "content": "What about a best friend coming up? Is there somebody you consider yourself closest to?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:05:04",
      "upperBoundTime": "00:05:22",
      "content": "Yeah, I had a friend Lance. We grew up with, probably been knowing him since I was four years, four five years old. And up until I came to jail, he was even with me when that happened, when I committed my crime and, yeah. I actually had quite a few friends from the neighborhood that I grew up with that I was really close to, but he would be one of the main ones."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:22",
      "upperBoundTime": "00:05:24",
      "content": "Are you still in touch with any of them?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:05:24",
      "upperBoundTime": "00:05:34",
      "content": "Yeah a few of them, not Lance, he got killed. A few of them, some of them have been killed. Yeah I still stay in touch with quite a few people actually."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:34",
      "upperBoundTime": "00:05:37",
      "content": "How did the others get killed?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:05:37",
      "upperBoundTime": "00:05:53",
      "content": "Shot. I mean, I would always, and the crazy thing is growing up we always figured by the time when we were teenagers, the way we were living, that it probably would happen anyway. I mean I came to prison, a couple of them got killed. Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:53",
      "upperBoundTime": "00:05:55",
      "content": "Over drugs? Selling drugs?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:05:55",
      "upperBoundTime": "00:06:00",
      "content": "Different things. Drugs, altercations, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:00",
      "upperBoundTime": "00:06:07",
      "content": "So, did you grow up where violence was kind of normal around you as a teenager?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:06:07",
      "upperBoundTime": "00:06:43",
      "content": "No, I would say it was common around me because I believe I put myself in those situations. Like I would put myself in environments where it was happening a lot. Like as far as around our home, not that much. But being involved with drugs we were always being put in different situations where pretty much it would be pretty, it would happen regularly. And it just seemed, just became common."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:43",
      "upperBoundTime": "00:06:50",
      "content": "Outside of the home, did you find yourself, you said you got expelled for fighting-- did you find yourself fighting quite a lot?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:06:50",
      "upperBoundTime": "00:07:27",
      "content": "Yeah, definitely. Like actually I had been suspended twice that year for fighting. That was my first time ever being expelled, but yeah I mean always. It seemed honestly most of the time that I would get into fights it wasn't over myself, it was one of my friends getting involved in a situation and it probably."
    },
    {
      "speaker": "Jarrod",
      "time": "00:06:50",
      "upperBoundTime": "00:07:27",
      "content": "My mother used to even tell me that was my biggest problem, I was always going out there for my friends. And most of the situations nine out of ten of the situations I was getting into was for a friend. When I probably didn't have to."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:27",
      "upperBoundTime": "00:07:37",
      "content": "What about girls, I mean you were so young when you were arrested and incarcerated. But is there a specific girlfriend that you still think about?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:07:37",
      "upperBoundTime": "00:07:55",
      "content": "There's definitely one that I, when I committed my crime, my girlfriend then, I mean she has come up here for years, probably twenty years. And then other girlfriends, I mean, I always had girlfriends. I'm still in touch with a few of them, like support."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:55",
      "upperBoundTime": "00:07:59",
      "content": "Sure, do you have any kids?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:07:59",
      "upperBoundTime": "00:08:01",
      "content": "No, no kids."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:01",
      "upperBoundTime": "00:08:03",
      "content": "Who visits you here?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:08:03",
      "upperBoundTime": "00:08:16",
      "content": "My mother and my father still comes. I have a couple of my friends that I grew up with, cousins. Actually a couple of friends that left here and went home, they come and see me. I visit pretty regularly, I'm pretty fortunate."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:16",
      "upperBoundTime": "00:08:17",
      "content": "That's good."
    },
    {
      "speaker": "Jarrod",
      "time": "00:08:17",
      "upperBoundTime": "00:08:21",
      "content": "Yeah, I have a lot of support."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:21",
      "upperBoundTime": "00:08:34",
      "content": "When they, when they come and see you do they have, do you have a sense that they have, they're hopeful that something's going to give and you're going to be able to get out."
    },
    {
      "speaker": "Jarrod",
      "time": "00:08:34",
      "upperBoundTime": "00:08:55",
      "content": "Yeah, definitely. A lot of them are familiar now because I mean I've, just coming to see me and talking to me about the laws. Like most of them that already that I would be going home. They're not really familiar with a life without parole and what it actually means. But yea, most of them, definitely. Everybody has hope."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:55",
      "upperBoundTime": "00:08:58",
      "content": "What about grandparents? Do you have any memories of grandparents?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:08:58",
      "upperBoundTime": "00:09:14",
      "content": "Yeah, one of my grandmothers, pretty much grew up around her. She was pretty much always there till after I came to prison she died, she passed. Yeah definitely, grandparents. My grandmother on my mother's side, she was always there, the other, I mean she was."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:14",
      "upperBoundTime": "00:09:19",
      "content": "What's your last memory of her?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:09:19",
      "upperBoundTime": "00:09:49",
      "content": "Probably when I was out on bond for this murder charge before I went to trial I saw her like two days before my trial started, just went to the house, visited with her for a while. Cause I used to do that, even when I dropped out of high school, and"
    },
    {
      "speaker": "Jarrod",
      "time": "00:09:19",
      "upperBoundTime": "00:09:49",
      "content": "I mean I be running the streets all the time but my grandmother lived in these homes so I'd always go and stop by to check on her. One day go cut her grass or just go visit with her, see how she's doing. I did that pretty regularly, sometimes every day if I could. Even if just for five ten minutes I'd just go stop by and just see her."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:49",
      "upperBoundTime": "00:10:02",
      "content": "Sure. So if you had to, would it be fair to say that, prior to this charge, your life had gone down the wrong road?"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:49",
      "upperBoundTime": "00:10:02",
      "content": ""
    },
    {
      "speaker": "Jarrod",
      "time": "00:10:02",
      "upperBoundTime": "00:10:02",
      "content": "Definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:02",
      "upperBoundTime": "00:10:12",
      "content": "Okay, and so if you had to isolate one main reason for that, what was it?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:10:12",
      "upperBoundTime": "00:10:43",
      "content": "I didn't see it then, but I know now. Impatience. I didn't have any patience. And my mom used to always tell me that. We didn't have a whole lot growing up. I had other friends when we were growing up, they had a little bit more. And it became more of a problem when I was maybe twelve or thirteen I started stealing to get things I wanted, and it just escalated. It was more of just not, wanting everything that I would eventually have in live anyway but wanting it right then and there, and not being able to wait."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:43",
      "upperBoundTime": "00:10:44",
      "content": "Impulsive kid."
    },
    {
      "speaker": "Jarrod",
      "time": "00:10:44",
      "upperBoundTime": "00:10:49",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:49",
      "upperBoundTime": "00:10:52",
      "content": "Were drugs and alcohol a major part of your own life?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:10:52",
      "upperBoundTime": "00:11:17",
      "content": "Yeah. I mean, I started smoking weed probably, smoking marijuana probably about fourteen years old. And probably smoked it as often as I could, sometimes every day until I came to jail. Alcohol wasn't that big. I mean, maybe sometimes on the weekends, I wasn't really too big on alcohol but I would frequently, but marijuana definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:17",
      "upperBoundTime": "00:11:45",
      "content": "So Jarrod You have, I think, more certifications than I think almost anyone else we're talking to, it seems. Vocationally but also in other ways. But if, and were going to get to that. But can you just for a second, tell me about, if you had to describe that eighteen year old? How old were you when you came here? Nineteen?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:11:45",
      "upperBoundTime": "00:11:48",
      "content": "Yeah. I was nineteen when I came up here."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:48",
      "upperBoundTime": "00:11:58",
      "content": "You spent some time in the parish. So when you're nineteen coming through the gates of Angola can you take a minute and go back there and describe that kid?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:11:58",
      "upperBoundTime": "00:12:46",
      "content": "When I came through that gate, I still remember, I remember the day I came up here. By the time we actually got to the entrance we were going to, it was at night time. And one thought comes to mind, I think of it pretty often, it seemed sense. Because like, and it seemed like you were living day for day like. I mean, I don't know it was violent, I didn't know what to expect."
    },
    {
      "speaker": "Jarrod",
      "time": "00:11:58",
      "upperBoundTime": "00:12:46",
      "content": "All I knew is that I was going to survive no matter what. So when I think about it seemed hopeless like there was nothing to look forward to in the future. I had life without parole, I could never go home and if I can't go home then I don't have a life. There was nothing to live for. That was the most profound thing I just hopeless. I was completely hopeless."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:46",
      "upperBoundTime": "00:12:51",
      "content": "So what were your first few days like here? What were your first few months like here?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:12:51",
      "upperBoundTime": "00:13:56",
      "content": "Trying to adjust to change, a change I didn't want. Like I think the next day after I got here I got locked up, thrown in the hole, because I didn't want to go to work. They said you have to work in the fields and I didn't know about working I wasn't working in the field. I think I was more resistant to the rules because I didn't care, I just didn't care."
    },
    {
      "speaker": "Jarrod",
      "time": "00:12:51",
      "upperBoundTime": "00:13:56",
      "content": "So, I got in trouble as soon as I got here. Right after that I kind of started meeting a few people, like other young guys, cause there was a whole bunch of us that came at the same time that was young so everybody was kind of, not knowing what to expect, kind of looking out for each other. Started kind of building some relationships with a few people. Just trying to adjust to the place."
    },
    {
      "speaker": "Jarrod",
      "time": "00:12:51",
      "upperBoundTime": "00:13:56",
      "content": "It seemed like another world, just so foreign. Like nothing was registering. Just trying not to get in trouble but at the same time not even caring if you did because, I mean, why not, why not get in trouble, I had nothing to lose. I think that was one of the things that the first few days I got myself into trouble, just trying to adjust."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:56",
      "upperBoundTime": "00:14:13",
      "content": "So you had said that you were feeling hopeless, and I think that that is a very logical thing with the life sentence in Louisiana. But, I don't think that's how you feel now."
    },
    {
      "speaker": "Jarrod",
      "time": "00:14:13",
      "upperBoundTime": "00:14:15",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:15",
      "upperBoundTime": "00:14:19",
      "content": "So what, what's changed?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:14:19",
      "upperBoundTime": "00:14:21",
      "content": "Alright actually, it took me"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:21",
      "upperBoundTime": "00:14:22",
      "content": "Your sentence hasn't changed."
    },
    {
      "speaker": "Jarrod",
      "time": "00:14:22",
      "upperBoundTime": "00:15:35",
      "content": "No, my sentence hasn't changed. Thinking about it, it took me, I ain't always been a model inmate, it took me a lot of years but, I would say before I started to change, probably about the first fifteen years maybe. Maybe fourteen fifteen years, around there, what it was, cause I had been in and out of trouble, and maybe around seven eight years ago I went and got locked up, I went to camp J, stayed almost a year back there on lockdown."
    },
    {
      "speaker": "Jarrod",
      "time": "00:14:22",
      "upperBoundTime": "00:15:35",
      "content": "And actually some of the wardens that knew had known of me, and they started this mentoring program. And so they actually pulled me from out of lockdown to come and mentor and just basically use myself as an example for some of the younger guys."
    },
    {
      "speaker": "Jarrod",
      "time": "00:14:22",
      "upperBoundTime": "00:15:35",
      "content": "And that right there, I believe, probably had the biggest impact on my changing because, I mean, I never envisioned myself to be in a position to take my own wants and needs and put it aside and put someone else's before my own. Which is what I do now. And, just the wardens giving me a chance. Trusting me, giving me a chance to actually change, and help other people change, I think that's what brought it on."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:35",
      "upperBoundTime": "00:15:37",
      "content": "Are you still working with re-entry?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:37",
      "upperBoundTime": "00:15:38",
      "content": "Oh yeah. Definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:38",
      "upperBoundTime": "00:15:40",
      "content": "Tell me about that."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "Well, alright I'm a lead vocational mentor in a collision program. Basically we're taking guys that are sentenced to the program, short termers, and helping them gain, employable skills so that when they leave they can actually have a set of skills where they can actually, legitimately earn a living and not rely on their old means, selling drugs or whatever they were doing."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "I have a group of guys I might have twenty, twenty-five guys that I'm responsible for and I got to be an example to them. Like help them. Can't tell them, I don't tell them."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "One of the first things when they come in and we orient them I let them know that nobody's here to tell you what you have to do. I'm not going to make you do anything. You've a choice to make. Same as with me, I had choices to make and I made the bad choices and that's why I am where I am. But they don't have to be that, they don't have to."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "One thing I tell them, 'you don't want to be like me,' I don't know what's best for everybody, I don't know what's best for them most of the time I don't even know what's best for myself. What I'm saying I don't know what they want to be in life, but I know what they don't want to be, they don't want to be me."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "Because I look in that mirror every day and I see somebody that, though yeah, I mean, the person I've become, I mean, I'm good with myself. But it's the situation, I know they don't want that, so I try to just use my life as an example to them. Not making them, telling them what they have to do but just showing them that, the choices that they make, the consequences they can pay, I know they don't want this. But it's good, like I said, it was a change for me. Just having to take someone else's wants and needs and putting them before my own."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "And that's every day because they all have issues they deal with. Every day they come in they might, each one of them has their own, maybe , problem something with their family that's going on, maybe just something that's personal but they bring it to the table and I have to help them deal with that as well as deal with my own issues."
    },
    {
      "speaker": "Jarrod",
      "time": "00:15:40",
      "upperBoundTime": "00:17:49",
      "content": "But the biggest thing for me was that I learned that life isn't all about me, it's not about. I don't live my life for myself anymore. It's the biggest difference. With the re-entry program so live your life for other people rather than yourself."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:49",
      "upperBoundTime": "00:17:56",
      "content": "Yeah. So what's your typical day look like? What's your routine? You were telling me you're really busy."
    },
    {
      "speaker": "Jarrod",
      "time": "00:17:56",
      "upperBoundTime": "00:19:32",
      "content": "Oh, rough, oh God. So we fix and paint cars, so I usually get to work probably about 6:20 in the morning I mean, as soon as I get there, trying to line up the jobs for the day. Trying to structure who's going to be doing what, what has to get done, what's priority over something else. Then guys start coming in."
    },
    {
      "speaker": "Jarrod",
      "time": "00:17:56",
      "upperBoundTime": "00:19:32",
      "content": "They have a hands on aspect of the job where they're actually working on the vehicles and they have a technical aspect where they're earning their certifications. So I make sure everything's lined up with that. Guys will come in, everybody, as soon as they come in they calling my name. If my name doesn't get called 500 times in a day it doesn't get called once."
    },
    {
      "speaker": "Jarrod",
      "time": "00:17:56",
      "upperBoundTime": "00:19:32",
      "content": "Everybody needs, that's what it's like, as soon as they come in I know, I prepare myself because everybody needs something. I have to go from one individual to the next, see what they need, make sure they have what they need, make sure the jobs are getting done. If something goes wrong, or security comes or something, I'm responsible, so I have to deal with problems all the time."
    },
    {
      "speaker": "Jarrod",
      "time": "00:17:56",
      "upperBoundTime": "00:19:32",
      "content": "Some days are slower than others. It's not usually that bad because I'm used to it now. Sometimes I don't leave work until 11, 12 o'clock at night just making sure everything's operating the way it's supposed to. The shop, I'm responsible for the shop, the operation of it. It's a lot of responsibility. But it's not bad, it's not. Like I enjoy helping them, and then they go to depending on me so, that's what I'm there for."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:32",
      "upperBoundTime": "00:19:40",
      "content": "Do you see, do you have a sense that some of these guys are just going to be fine and some of them are just going to be back?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:19:40",
      "upperBoundTime": "00:20:59",
      "content": "Definitely, the some, but what it is, a lot of them, I can see now, I can see, I look at some of the guys that come through here they'll have an I don't care attitude and I see my old self, and I think that's one of the reasons like a lot of the guys come to me because I can relate, I relate to them. I don't try to take an authoritative figure and tell them, like I said, what they have to do, or make them do things."
    },
    {
      "speaker": "Jarrod",
      "time": "00:19:40",
      "upperBoundTime": "00:20:59",
      "content": "You give them options, give them choices, and they got to make the decision for themself. They're grown men, and so a lot of them, I just let them know that, I was like them one day, a long time ago I was wild and crazy like them too, but they can see it, and when they see that in you when they see that self in you and they see that they can relate, they open up."
    },
    {
      "speaker": "Jarrod",
      "time": "00:19:40",
      "upperBoundTime": "00:20:59",
      "content": "Like some of the guys, some of my guys that come through they're some of the worst one's. In the beginning they're resisting to security, they're resisting to the program. They're resisting to everything you're trying to tell them and show them. But after, I mean, after spending time with them, because I mean, like I tell them, who am I?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:19:40",
      "upperBoundTime": "00:20:59",
      "content": "They don't know me from the next person, why should you trust me? And I tell them that. But at the time when they see themselves in you, they open up and those end up being some of my best guys. They learn the most they, you just have to give them a chance to change. Not make them change but let them change them self."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:59",
      "upperBoundTime": "00:21:22",
      "content": "Yeah and it's an interesting thing. It seems to me that guys with the longest sentences seem to have more successfully turned their lives around than the guys with the real short sentences. And I don't know if there's no incentive for them or, what's up with that?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:21:22",
      "upperBoundTime": "00:22:38",
      "content": "It takes time. And to me that's the biggest thing like, a lot of those guys are young and I know personally because it took me a lot of time to change. And it wasn't looking for reward. It came to the point where I looked at my life and I had wasted so much of it. Even coming to prison, alright in the beginning, I mean, you don't have that much understanding."
    },
    {
      "speaker": "Jarrod",
      "time": "00:21:22",
      "upperBoundTime": "00:22:38",
      "content": "You really, you just don't care, because you have nothing to lose. But after so long, you look at your life and you realize, I know me personally, I speak for myself, I realized I had just wasted so much, even in prison doing nothing, that eventually, someone giving me a chance, I took that chance and figured why not change? Why not? I mean I wasted so much I want to do something with myself to at least, if it's just helping somebody so they don't fall into the same position I'm in."
    },
    {
      "speaker": "Jarrod",
      "time": "00:21:22",
      "upperBoundTime": "00:22:38",
      "content": "Like I tell some of them, you have two, three four years whatever how much time they're doing, like most of the short termers. A lot of them don't get it, because they don't care. They know they're going home they don't have anything, they feel like they don't have anything to lose. But, and I tell a lot of them you get hit with a forty fifty year flat sentence, then you're going to want to change and it's too late, don't wait till it's too late."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:38",
      "upperBoundTime": "00:22:40",
      "content": "Yeah, that's a good thing to tell them"
    },
    {
      "speaker": "Jarrod",
      "time": "00:22:40",
      "upperBoundTime": "00:22:59",
      "content": "And some people I think that they take more time than others. We get some of them that they're going to see that they'll get it pretty quickly, and you have others that don't want it, it's going to take more time, it's going to take more severe consequences. I think for some of them, for them to open their eyes. Eventually they'll change, given enough time."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:59",
      "upperBoundTime": "00:23:07",
      "content": "Tell me a little bit about the vocational opportunities you've taken advantage of. Some of the certificates you've earned."
    },
    {
      "speaker": "Jarrod",
      "time": "00:23:07",
      "upperBoundTime": "00:24:26",
      "content": "Alright, when I started some years ago I started in the automotive, I earned some electrical certifications, like a diploma in automotive technology, that's been a while that's been maybe twelve, thirteen years ago. I got my GED stuff and while being incarcerated. I got that pretty early on though, right after I'd come to prison."
    },
    {
      "speaker": "Jarrod",
      "time": "00:23:07",
      "upperBoundTime": "00:24:26",
      "content": "I've taking like residential commercial electrical certification classes. I have, like, four ASE certifications in automotive. I have, I'm ASE Master certified in collision repair. I started working on earning my I-CAR platinum certification which is inter-industry and auto collision repair."
    },
    {
      "speaker": "Jarrod",
      "time": "00:23:07",
      "upperBoundTime": "00:24:26",
      "content": "We actually, we just started a few months ago taking online classes, and it's actually the first time I think in the department of corrections where it's been allowed, to earn those certifications and it actually helps a little bit more with making guys like in our program, the collision program, more marketable for when they leave, makes them more knowledgeable, just makes them more of an asset to their potential employers when they leave."
    },
    {
      "speaker": "Jarrod",
      "time": "00:23:07",
      "upperBoundTime": "00:24:26",
      "content": "So I have, I'm actually working on four different I-CAR certifications right now. What else, I have to get all of the different things I've done over the years."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:26",
      "upperBoundTime": "00:24:29",
      "content": "But you would certainly be very employable."
    },
    {
      "speaker": "Jarrod",
      "time": "00:24:29",
      "upperBoundTime": "00:25:56",
      "content": "Oh definitely. It's taken time, taken time and its putting interest in it and learning, but actually I love it. Coming here I didn't know much about automobiles other than to drive them, put some gas and drive them. But like, learning more about them I mean, you developed a love for it, and what happens is like, I tell you that and like my guys that I'm helping them to learn a skill so that when they leave they can use that skill."
    },
    {
      "speaker": "Jarrod",
      "time": "00:24:29",
      "upperBoundTime": "00:25:56",
      "content": "When they see, they see you have a love for it and they gain an interest in it, over time you see they develop a love for it and if they love what they're doing they're going to be great at it. If a man does something that he doesn't love doing I mean he might be good at it, but he's never going to be as good as he could be. So I try to instill that in them, like, try to help develop work ethics. I'm not lazy, I work."
    },
    {
      "speaker": "Jarrod",
      "time": "00:24:29",
      "upperBoundTime": "00:25:56",
      "content": "If there's one thing I believe it's leading by example. I tell my guys all the time, if I ask you, if I send you outside, cause it's hot what we do in our trade sometimes. It's hot, summertime, you go out there, I'll send them to a parking lot to work on a car, might be working underneath there on the concrete, dirty, I'm right there with them. I never ask them to do anything I'm not willing to do with them, and they know that. It can be as simple as washing the parking lot."
    },
    {
      "speaker": "Jarrod",
      "time": "00:24:29",
      "upperBoundTime": "00:25:56",
      "content": "A guy asked me one day, I was standing outside washing the parking lot he said, \"What you doing that for? Get one of them guys to do it\" I said, \"Well I don't mind\" I said, \"If they see me do it and I go ask them they won't have no problem doing it themselves\""
    },
    {
      "speaker": "Marcus",
      "time": "00:25:56",
      "upperBoundTime": "00:25:57",
      "content": "Lead by example."
    },
    {
      "speaker": "Jarrod",
      "time": "00:25:57",
      "upperBoundTime": "00:25:59",
      "content": "Oh definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:59",
      "upperBoundTime": "00:26:06",
      "content": "Are there other organizations at Angola that you're active with? I mean it sounds like you're a pretty busy day."
    },
    {
      "speaker": "Jarrod",
      "time": "00:26:06",
      "upperBoundTime": "00:26:48",
      "content": "I'm part of the Del Carnegie public speak class. I took that, I was scared to death of my public speaking before I took that class and it kind of broke me out of that. And now I'm afforded opportunity to be able to speak in front of a lot of tours that come through, different groups, so it helped with that. Sober group, AA, I've been involved with them for years."
    },
    {
      "speaker": "Jarrod",
      "time": "00:26:06",
      "upperBoundTime": "00:26:48",
      "content": "Even around the time I didn't think I really had a problem but most of the time we do have problems, just don't realize it. But that helped out a lot too, substance abuse. That's pretty much all I have time for. Because the re-entry program it consumes everything, it consumes everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:48",
      "upperBoundTime": "00:27:23",
      "content": "So I'm going to ask you a little bit about, to reflect a little bit about the crime of conviction. It's been twenty one years, which is by any stretch of the imagination a very long time, almost a lifetime. When you look back on the crime and on the victims and the victim's family. You have this perspective now, of distance. What is it that you feel about it now?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:27:23",
      "upperBoundTime": "00:29:24",
      "content": "Tragic. I definitely look at it now differently than I did some years ago. Extremely tragic like, unnecessary. Like I can see now, in the beginning I will say when the crime first happened, I thought it was necessary. Like I kind of justified my own actions and I see back then where I thought I did the right thing."
    },
    {
      "speaker": "Jarrod",
      "time": "00:27:23",
      "upperBoundTime": "00:29:24",
      "content": "Whereas I'm looking back now, it was unnecessary, I see where I didn't have to, and I feel it's more of a situation where I overreacted and I took something further than it should have gone. It took me a long time to see that. Actually, taking the, I took a victims awareness class some years ago and it kind of opened my eyes to a lot of things, a lot of simple things that I never even thought of. Was like the victim, I blamed the victim for it happening."
    },
    {
      "speaker": "Jarrod",
      "time": "00:27:23",
      "upperBoundTime": "00:29:24",
      "content": "In my mind, he created the situation back then, so I wanted to blame him, I wanted to blame my friends, rather than looking at myself. And over the years, now I look at myself, like I was the cause. It was me, wasn't nobody else was responsible but me. And that's the last time I came to lightly. And like I said it took me, probably took me a good fifteen sixteen years before I actually realized that I was the problem the whole time."
    },
    {
      "speaker": "Jarrod",
      "time": "00:27:23",
      "upperBoundTime": "00:29:24",
      "content": "But as far as the victim, when I think about it now, I think about my parents. When they come. I think about all of the opportunities I denied them by my actions by me coming here. So but when I do that I think about the victim what all I denied him by taking his life. What all I denied his family, his friends, his loved ones, people that knew him, by taking him from them. I didn't think about that in the beginning because I didn't know him. It was just a situation that came up and, so I mean I didn't."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:24",
      "upperBoundTime": "00:29:25",
      "content": "Do you want some water?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:29:25",
      "upperBoundTime": "00:29:35",
      "content": "Yeah. Alright, thank you."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:35",
      "upperBoundTime": "00:29:41",
      "content": "Jarrod have you forgiven yourself?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:29:41",
      "upperBoundTime": "00:29:50",
      "content": "Yeah, I believe I have. Also I think that's how I was able to move on. Yeah definitely. Took a while."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:50",
      "upperBoundTime": "00:30:08",
      "content": "Yeah, I'm sure. One of the things that I guess any criminal justice system has to come up with some finite sort of number in the end as to what a sentence should be. How much punishment is enough?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:30:08",
      "upperBoundTime": "00:30:50",
      "content": "I think it depends on the individual and I'm not going to lie and say that, or try to make it, try to ease it a little bit because I'm incarcerated. I think it just depends on the individual. Like it could range anywhere from 15-20 or it could take 30-40 years. Then some of them might never change."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:50",
      "upperBoundTime": "00:31:50",
      "content": "So, Jarrod, this is a difficult question but it's also why we're talking. So I know that a lot of people serving life without parole just keep hope alive somehow. And your situation is particularly difficult I think because you were so young, at eighteen but not young enough to be eligible for the latest round of relief."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:50",
      "upperBoundTime": "00:31:50",
      "content": "There have to be times when you, while you're maintaining hope, there have to be times when you have to face squarely that you may never leave here. How do you, I guess I'm trying to understand how you cope with that. Cause that's also real."
    },
    {
      "speaker": "Jarrod",
      "time": "00:31:50",
      "upperBoundTime": "00:32:59",
      "content": "I try to, one thing, I mean I try to keep the stress down. Like I mean my days are so busy I just try to give myself to helping other people but, it's difficult at times but it just. No matter what, what it is with me, no matter what I would never give up, period."
    },
    {
      "speaker": "Jarrod",
      "time": "00:31:50",
      "upperBoundTime": "00:32:59",
      "content": "So I mean, that, that kind of gets me through. No matter, even if I never get out, if I never make it home, I'm going to fight until the end. So I mean that fight kind of keeps you going, moving forward. It's probably harder for those guys that give up and accept it. But I'll never accept it, and I think that's probably what gets me through."
    },
    {
      "speaker": "Jarrod",
      "time": "00:31:50",
      "upperBoundTime": "00:32:59",
      "content": "That's probably the biggest factor, like I said you've got a lot of guys that they gave up, they don't have any hope. They don't give. Nothing can be going on and I'm still, I never give up. No matter what, I can't, it's not in me, and I think that's probably plays the biggest part in what gets me through."
    },
    {
      "speaker": "Jarrod",
      "time": "00:31:50",
      "upperBoundTime": "00:32:59",
      "content": "I still face that reality like. Man I'm like it might take decades to get out if I ever do, If I don't make it, I mean I'll help the people I can help along the way and just fight it till the end. And that's all in my mind that's all I visualize. I'll fight however long as it takes."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:59",
      "upperBoundTime": "00:33:26",
      "content": "When you see some of the older guys who have been here serving his life sentence on second degree murder and there, getting into their sixties, seventies, we talked a little bit about your friend who's in hospice, or who was in hospice. Is that something that's very difficult to see? Those older guys?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:33:26",
      "upperBoundTime": "00:34:41",
      "content": "Oh definitely, definitely. But I think, like, I don't do without hope like. Even seeing them, even like this day and age now, because my, I remember when I first came here like twenty years ago, nobody was leaving, like rarely people would leave. But now, you got a lot of people that leave and you have life sentences that they're getting parole."
    },
    {
      "speaker": "Jarrod",
      "time": "00:33:26",
      "upperBoundTime": "00:34:41",
      "content": "You've got a whole lot more hope now just in the atmosphere in the prison as a whole. And just that alone is enough to, I think it kind of motivates people. You see come momentum going. So it's a lot easier to cope with now because you're seeing people constantly leaving."
    },
    {
      "speaker": "Jarrod",
      "time": "00:33:26",
      "upperBoundTime": "00:34:41",
      "content": "Even if you never leave, you seeing them leave so that. You just have a different perspective, it's a whole different perspective. So that alone will allow, will kind of motivate some change. And it might be people that have no hope of ever getting out but you see even little changes in them, you see a little glimmer of hope in them and just that little bit is enough to kind of push towards changing from."
    },
    {
      "speaker": "Jarrod",
      "time": "00:33:26",
      "upperBoundTime": "00:34:41",
      "content": "You can notice the change. The guy who didn't care a couple years ago, didn't care about anything, now all of a sudden he cares. Like I've come across who used to tell me, 'man I'm never going home, never,' and now they're talking about going home or trying to get home. That's just that hope."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:41",
      "upperBoundTime": "00:34:59",
      "content": "Somebody I was talking with was saying they used to be on a, be a tier walker when there was a lot of suicides back about five, six years ago when things weren't moving at all. And that's changed."
    },
    {
      "speaker": "Jarrod",
      "time": "00:34:59",
      "upperBoundTime": "00:35:01",
      "content": "Definitely, definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:01",
      "upperBoundTime": "00:35:05",
      "content": "He said whole bunch of people started coming out of the cell blocks."
    },
    {
      "speaker": "Jarrod",
      "time": "00:35:05",
      "upperBoundTime": "00:35:13",
      "content": "Yeah, people trying now, not to get in trouble. Trying to stay out of trouble, avoid trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:13",
      "upperBoundTime": "00:36:01",
      "content": "Yeah. If a parole board, let's say you do get a chance to go before a parole board. You're eighteen, when you committed your crime and there's logic behind that distinction and if they do extend parole eligibility to some other young lifers. What would you want them to know about you?"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:13",
      "upperBoundTime": "00:36:01",
      "content": "They're going to, my experience is that they have a, the details of the crime which you were convicted, any kind of prior arrests and so forth, and then they might also have your conduct record from here, and then some of the achievements that you've had here."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:13",
      "upperBoundTime": "00:36:01",
      "content": "But you're going to have a short window of opportunity to say, this is who I am. What would you tell them?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:36:01",
      "upperBoundTime": "00:37:18",
      "content": "That change didn't come easy. Definitely didn't come easy. And at the time I didn't think I ever would change. Stupid young man a long time ago, that's not me anymore. And I can see now that who I was back then, in the beginning I couldn't see. Selfish, everything was about me. Wanted everything. Didn't care about what the next person wanted."
    },
    {
      "speaker": "Jarrod",
      "time": "00:36:01",
      "upperBoundTime": "00:37:18",
      "content": "I took what I wanted. And thought I was doing the right thing, I didn't see anything wrong with what I was doing. When I look back now, after all these years, I see everything I was doing was wrong. I was living for myself and not, that's the biggest difference now is that it's not about me. It's definitely not about me."
    },
    {
      "speaker": "Jarrod",
      "time": "00:36:01",
      "upperBoundTime": "00:37:18",
      "content": "Every day that I live my life now, it's about putting other people before me. Somebody had told me once that, every day that you live your life you should look back, at the end of the day you should be able to look back and see where you learned something new that day."
    },
    {
      "speaker": "Jarrod",
      "time": "00:36:01",
      "upperBoundTime": "00:37:18",
      "content": "And I try to live my life that way. Because back then I wasn't trying to learn anything I was just trying to do what I wanted to do by whatever mean I knew to do it, and that was it."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:18",
      "upperBoundTime": "00:37:27",
      "content": "What is the worst part of the Angola experience? What's the worst part of being here?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:37:27",
      "upperBoundTime": "00:38:38",
      "content": "Man, being separated from your family, like people that you care about. Being able to do what you want. It's mainly that separation from family. Like, growing up, I remember as a teenager my mom would be going to work, when they would come in in the afternoon we usually would leave and run the streets and do what we do."
    },
    {
      "speaker": "Jarrod",
      "time": "00:37:27",
      "upperBoundTime": "00:38:38",
      "content": "And my mama used to always ask me to sit down for a few minutes just to talk. Even just for fifteen twenty minutes talk, and I was always moving fast, I got to go mama I have to go, and I was always leaving. And looking back now, like all the things that I miss, everything that I miss now and that I want, everything that I could possibly dream of having, I already had it."
    },
    {
      "speaker": "Jarrod",
      "time": "00:37:27",
      "upperBoundTime": "00:38:38",
      "content": "Just being able to be home to spend time with my family or coming and going like I want just to be able, just to be home. I had it all, threw it away. And just being away from that, just that separation from that is probably the hardest part. I'd give anything. Like I don't want, I don't want to be rich, I don't want the world I would be, just being separated from my family, and just being home is probably the hardest part of this."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:38",
      "upperBoundTime": "00:38:55",
      "content": "Yeah, so let's talk a little bit about that, when you envision, I'm sure you spend some time thinking about, what you would do when you get out. What does that look like?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:38:55",
      "upperBoundTime": "00:40:07",
      "content": "Yeah I think about that every day, it's kind of a. When you think about it though, the perspective you look at it, it's like it's not, don't look at it from one direction because it's uncertain because you're looking at it with uncertainty, but the direction that I would like to go in. Go home, see my family, work, definitely going to have to work, maybe have a family, just really to be honest with you, just find a peace."
    },
    {
      "speaker": "Jarrod",
      "time": "00:38:55",
      "upperBoundTime": "00:40:07",
      "content": "Just enjoy every day of life and at the end of the day to be able to look back and relax and just be at peace. Whether that's just sitting in the front yard and just kind of hanging out, talking to people that I actually care about and want to be around, and just trying to help some people. Just try to help people man. So where they don't have to go through the same things that I went through and not even what I went through but trying to prevent them from causing the damage I've caused. I've caused a lot of damage, a lot. I just, just simple life, I don't need nothing. You learn to appreciate all those simple things now."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:07",
      "upperBoundTime": "00:40:10",
      "content": "Yeah, no I can understand that."
    },
    {
      "speaker": "Jarrod",
      "time": "00:40:10",
      "upperBoundTime": "00:40:29",
      "content": "I remember as a teenager like, I was chasing all these I was chasing money, I wanted a nice car, and I always wanted nice stuff. Things we didn't have growing up. And looking back now, being taken from everything. I don't miss any of that. It's all those little simple things just that you miss."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:29",
      "upperBoundTime": "00:40:32",
      "content": "I'm just remembering, remember Ashanti Witherspoon?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:40:32",
      "upperBoundTime": "00:40:33",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:33",
      "upperBoundTime": "00:40:36",
      "content": "And he says, \"So what are you going to do when you get out of here?\" He goes, \"I'm going to take a bath\""
    },
    {
      "speaker": "Jarrod",
      "time": "00:40:36",
      "upperBoundTime": "00:40:47",
      "content": "Yeah I was just thinking about this. Said go and take a bath. I remember him, I remember Ashanti. When I first got here, the next day for orientation, he would always do the orientation."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:47",
      "upperBoundTime": "00:40:49",
      "content": "Yeah, for newcomers."
    },
    {
      "speaker": "Jarrod",
      "time": "00:40:49",
      "upperBoundTime": "00:41:09",
      "content": "And I still remember him talking to us and telling us he said if you're here long enough, he said eventually, he said, you're going to leave everything, he said, your friends are going to leave, your girlfriends going to leave, he said, family member, people that you care about, they're going to die off, he said, and that's what's going to happen. And he wasn't lying, wasn't lying."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:09",
      "upperBoundTime": "00:41:11",
      "content": "Sounds like you've had folks really stick by you though."
    },
    {
      "speaker": "Jarrod",
      "time": "00:41:11",
      "upperBoundTime": "00:41:19",
      "content": "Oh yeah definitely. I've had a lot of them kind of fall of too, but for the most part, the most important ones, yeah they're still there."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:19",
      "upperBoundTime": "00:41:20",
      "content": "But there was some truth to what he was saying."
    },
    {
      "speaker": "Jarrod",
      "time": "00:41:20",
      "upperBoundTime": "00:41:24",
      "content": "Definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:24",
      "upperBoundTime": "00:41:30",
      "content": "This may seem like an odd question, because it's prison. What is the best thing about being here for you?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:41:30",
      "upperBoundTime": "00:42:32",
      "content": "Best thing about being here? I would say the opportunity to learn. Like the opportunity, it doesn't seem like it because it's prison but there's a lot of opportunities here. Like, you could, I know because I've been in other situations where you could be in prison and not have the opportunity to learn anything. But like now, this day, it's so many opportunities, like if not for the prison really all of the skills that I have, everything that I've learned I wouldn't even know."
    },
    {
      "speaker": "Jarrod",
      "time": "00:41:30",
      "upperBoundTime": "00:42:32",
      "content": "I mean I could just as easily leave this place and could have fallen right back into the way I was before because I never would've learned, wouldn't have known anything, wouldn't have been exposed to nothing. But definitely the opportunities to learn, there's so many, you can literally change your life if you want to, if you choose to."
    },
    {
      "speaker": "Jarrod",
      "time": "00:41:30",
      "upperBoundTime": "00:42:32",
      "content": "But definitely the, I mean I love the opportunities we have here, there's so much to learn, so much more than we even have time for us to learn. There all things that will help better us."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:32",
      "upperBoundTime": "00:42:46",
      "content": "Yeah and until recently, not so recently, my understanding is there are opportunities that were not available to lifer's, they were only available to people who were going to be coming up for release in five years or so."
    },
    {
      "speaker": "Jarrod",
      "time": "00:42:46",
      "upperBoundTime": "00:43:09",
      "content": "Right. It was always like that, like years ago, like maybe fifteen years ago or more. If you had life it was hard for you to get into like a vocational trade. Like maybe they'll let you get a GED but other than that it the short termers that they were allowing to take the slots. But now, pretty much anybody can get into a vocational trade, learn skills, yeah definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:09",
      "upperBoundTime": "00:43:13",
      "content": "And what do you think that's about?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:43:13",
      "upperBoundTime": "00:43:47",
      "content": "I think it's because they're trying to, probably, maybe, trying to prepare, like. Because, okay you have guys that like learn a skill, and you can take him, and he can teach someone else. Like especially the long term, I mean, if you give some of them the opportunity to learn a skill, they're going to be here, or at least most of them, they're going to be here. So if something does happens with someone else, I mean you always have a backup person who is always able to pass along the knowledge."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:47",
      "upperBoundTime": "00:43:56",
      "content": "What you've accomplished a lot. Of all those things, what are you most proud of?"
    },
    {
      "speaker": "Jarrod",
      "time": "00:43:56",
      "upperBoundTime": "00:45:04",
      "content": "Probably being a lead mentor. Because it affords me the opportunity to like a leadership role, something I never had before. I think though throughout my life I've never been a follower pretty much always been a leader but actually official like a spot where I got guys, they watching what I'm going, they looking up to me so I mean I got to set an example."
    },
    {
      "speaker": "Jarrod",
      "time": "00:43:56",
      "upperBoundTime": "00:45:04",
      "content": "If I expect them to do the right thing, then I know I have to do the right thing so being in that role, that positions, that's probably my biggest accomplishment. Even over the certifications and things I've learned. I think that mentor role I play, probably by far, biggest accomplishment."
    },
    {
      "speaker": "Jarrod",
      "time": "00:43:56",
      "upperBoundTime": "00:45:04",
      "content": "This put me in a lot of different positions too, like I said, that alone, I think, brought along most of my change. Because like I said, before I fell into that role I never considered taking somebody else's wants and needs and putting them before my own. But, the wardens giving me a chance, an opportunity to be an example and to change. It brought on, it actually brought on more change than I had expected. But that probably would definitely be my biggest accomplishment."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:04",
      "upperBoundTime": "00:45:15",
      "content": "Let's say that you are here for another ten years. What would be your goals for those ten years? What do you want to accomplish."
    },
    {
      "speaker": "Jarrod",
      "time": "00:45:15",
      "upperBoundTime": "00:45:52",
      "content": "To still educate myself, still learn as much as I can and just to share the knowledge. Like I'll keep doing what I'm doing for another ten years because no matter what, each day I'm teaching somebody something new. I got new guys in there constantly cycles so it's not like I'm just going to be showing the same people the same thing over and over."
    },
    {
      "speaker": "Jarrod",
      "time": "00:45:15",
      "upperBoundTime": "00:45:52",
      "content": "Probably just to be in that same pretty much role or position I'm in and just helping, just to help as many guys as long as I can. To potentially stay out there, just to try to help them do the right thing, try to help them try to make the right choices just so they don't have to go through what I went through."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:52",
      "upperBoundTime": "00:46:22",
      "content": "Sure. It's been really valuable to talk to you. Is there something that I should've asked you that I didn't ask you or something that you wanted to have an opportunity to communicate that you didn't. I mean is there something that you would like the legislature to know about the actual reality of life without parole or anything. Just wanted to give you an opportunity to say anything."
    },
    {
      "speaker": "Jarrod",
      "time": "00:46:22",
      "upperBoundTime": "00:47:55",
      "content": "The reality of it, I mean, we make choices. We make choices, I mean, a lot of us here, in the beginning like people, I think, the lack of education or the lack of understanding even of this situation we're going through, regardless of what we do, plays a big part in it. Like I said there's no excuse no matter what. When it comes down to it, commit a crime and I mean we got to pay the price."
    },
    {
      "speaker": "Jarrod",
      "time": "00:46:22",
      "upperBoundTime": "00:47:55",
      "content": "And saying that, not everybody comes here and changes, not everybody comes here and changes, I mean I could've just as easily come here and been one of those people that never change, I see them all the time I know plenty of them. But people do change, but given the right opportunity. I mean given the right opportunity for them to educate their self. Like I said, one of the main, the biggest thing that opened my eyes was a program that's offered to us, victim awareness."
    },
    {
      "speaker": "Jarrod",
      "time": "00:46:22",
      "upperBoundTime": "00:47:55",
      "content": ""
    },
    {
      "speaker": "Jarrod",
      "time": "00:46:22",
      "upperBoundTime": "00:47:55",
      "content": "Man I never imagined that taking that class would have such a profound effect on me, it educated me to the simplest things that I just never considered. And that right there played one of the biggest parts in me looking at the victim the way I look at him now. Looking at myself, I mean I look at myself in the mirror now and I see myself totally different, even after taking that course."
    },
    {
      "speaker": "Jarrod",
      "time": "00:46:22",
      "upperBoundTime": "00:47:55",
      "content": "Yeah definitely just educating the guys here and affording them the opportunity and exposing them to the right things can bring on that change."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:55",
      "upperBoundTime": "00:47:57",
      "content": "True, makes sense to me."
    },
    {
      "speaker": "Jarrod",
      "time": "00:47:57",
      "upperBoundTime": "00:48:05",
      "content": "But without that, without the exposure, it's, they just cycle and constantly just, a lot of them don't change."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:05",
      "content": "That makes sense to me. This is probably a good place to stop. Thank you very much."
    }
  ]
}
