{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:20",
      "content": "Jeffrey Hillburn REDACTIONS FINAL"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:20",
      "upperBoundTime": "00:00:33",
      "content": "My name is Jeffrey Dale Hillburn. In the the penitentiary I'm referred to as Jeffrey Dale because the state kinda goes by your first name. I spent my life kinda going by Dale I was born January 3rd, 1967, in a small northeast Louisiana town called Bosco. What else?"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:33",
      "upperBoundTime": "00:00:37",
      "content": "The crime for which you were convicted"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:37",
      "upperBoundTime": "00:00:47",
      "content": "I was convicted of second degree murder in Richland parish in 1993."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:47",
      "upperBoundTime": "00:00:48",
      "content": "And you've served how many?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:48",
      "upperBoundTime": "00:00:50",
      "content": "I've served a little over 26 and a half years thus far."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "Okay, so I'm going to ask you some questions about your childhood and time growing up up to the age of 24 and then I'm going to ask you some questions about your time since then."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "Lets start with maybe tell me a little bit you were mentioning your dad a little earlier tell me a little bit about your childhood the folks who took care of you who raised you took an interest in you"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "Jeffrey #00:01:19-8#:My mother and father were they were both grew up dirt poor really. My mother's descended from a heavy Acadian stock, you familiar with Acadians? My mother was a true Acadian with a mixture of Acadian actually a little Chinese from the very first Chinese doctor to live in Louisiana and a lot of Indian."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "My father was mainly scotch Irish from what we know, and a lot of Indian. Family come from out of the Appalachian Mountains. My father was a mechanic my mother was a house wife and a store owner. We had the little general merchant in northeast Louisiana it was kind of a legendary place at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "They were very well known. They were both will Rodgers types, everybody knew them everybody loved them they never met a stranger, they were very outgoing people and to this day still the only 2 people I've ever called heroes in my life. They were hard working people."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "My father was probably one of the very best diesel mechanics around for years he was legendary in farming circles and he was raised as a blacksmith he grew up through the depression both of them did."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "They were wonderful people they sacrificed not just for our family but they took care of everybody that needed help. I spent most of my life thinking that we were basically not poor but lower income people and didn't realize how wealthy we really were, because of what we did how we treated people because somebody showed up needed help my father there were six of us kids, he sent one of us to go help them sometimes."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:50",
      "upperBoundTime": "00:03:42",
      "content": "I've been 150 miles from home with somebody I didn't know at all helping them do something because they told my parents they needed help. And it was just their mentality."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:42",
      "upperBoundTime": "00:03:45",
      "content": "Wow. Would you say that you were raised in a very loving caring nurturing family?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:45",
      "upperBoundTime": "00:05:40",
      "content": "Not in the way that some people some people view loving and nurturing and caring families as families that do a lot of hugging. My father was raised by a very hard man he was half almost half breed he was a very cold and he was a legend in his time. He was something else but there wasn't a lot of among me and my family there wasn't a lot of hugging there was one girl she's the baby my sister Rachel and she was spoiled rotten but among us?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:45",
      "upperBoundTime": "00:05:40",
      "content": "My father loved us without doubt we knew it every minute of our life but it wasn't a lot of hugging it wasn't I think of my dad when he worked for around home or different places I worked with him sometimes. Most of the day we'd barely say 10, 15 words to each other. But that's how we were around each other. Its was, I derived as much benefit and growth from spending time like that with my dad as most kids did playing baseball."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:45",
      "upperBoundTime": "00:05:40",
      "content": "I never played baseball and things like that with my dad I hunted I fished I worked with him and he never treated us like children. I had my first job at the age of 7 with a real paycheck working for our neighbor's farm. He treated us the way that we deserved based on our behavior."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:45",
      "upperBoundTime": "00:05:40",
      "content": "He'd like to say he raised men. He treated us like men from the time we were young. He expected us to be responsible and show maturity and if we failed it wasn't their fault it was our fault. He never told us that. He never implied that. But we knew if we failed it was our fault not theirs."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:40",
      "upperBoundTime": "00:05:45",
      "content": "Did was there a lot of fighting in the house?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:05:45",
      "upperBoundTime": "00:06:45",
      "content": "Yes, we're country kids and I'm talking about old school country. We fought for fun the way I guess other kids played Nintendo or Candy Crush things like that now? Its what we did for fun we fought among ourselves. We fought at school in fact it was such a routine thing at Longwood Junior High School. where I went to school that the principal Mr. James McKay used to bring boxing gloves out and sit on the cement slab while we played basketball and if you put the gloves on everything was fine."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:05:45",
      "upperBoundTime": "00:06:45",
      "content": "If you fought without the gloves then you you faced some punishments and you had three options but we fought for fun nobody was ever mad at each other in general. You would fight with somebody and go sit in class with them next I mean seat to seat and you were still best friends it's just what we did. There was never animosity in it."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:45",
      "upperBoundTime": "00:06:51",
      "content": "Okay, yeah that's a different thing so fighting for sport boxing and wrestling that type of thing I'm talking about fighting over conflict."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:06:51",
      "upperBoundTime": "00:07:45",
      "content": "I never really knew any of that until I probably was in high school. Because our rural community was very tight knit until I was in high school I never knew any of that and it happened a few times but I'm a hillburn and unless you're from that area you don't really understand what that means."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:06:51",
      "upperBoundTime": "00:07:45",
      "content": "We have a reputation and generally especially due to my dad and my older brothers, you didn't really want to fight a Hillburn twice. And a lot of people if they knew you were going to fight a Hillburn they changed their minds and because we were considered tough and formal training in different areas. It wasn't that we were violent people, it's just that we weren't going to lose."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:45",
      "upperBoundTime": "00:07:49",
      "content": "Right. Was there conflict between your parents?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:07:49",
      "upperBoundTime": "00:08:01",
      "content": "Never really if they there were times where we sensed tension but it was never displayed in front of us they were very careful about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:01",
      "upperBoundTime": "00:08:23",
      "content": "So I want to I'm interested in that rural community that you were describing so can you sort of put me there? So if I'm looking out of your door, what would I see and smell and hear?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:08:23",
      "upperBoundTime": "00:09:30",
      "content": "We were in the south corner of the parish I could walk out the front door and be in $$ parish in just a couple of minutes on foot a few more minutes I could turn and be in Richland parish you would smell slop you would smell cause if you were looking from the front steps you were looking at trees 150 yards away a forest if you looked out the back door behind the rice field you were looking at more forest."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:08:23",
      "upperBoundTime": "00:09:30",
      "content": "It was kind of a time warp here everybody there knew everybody it was a farming community you smell farm you saw fields freshly turned earth most of the time there were small pockets of trees anywhere where there weren't real forests. In fact to go in one direction it was called going across the swamp the other direction you went to 165 and the river was right on the other side of the highway it was a really rural boondock type area for lack of a better description"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:30",
      "upperBoundTime": "00:09:35",
      "content": "Sure I think I can picture it. What was the highest year of school that you went to?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:35",
      "upperBoundTime": "00:09:41",
      "content": "I have a degree from Louisiana biblical college in banking and finance and I attend NLU in English literature."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:41",
      "upperBoundTime": "00:09:44",
      "content": "Okay so you definitely graduated from high school then"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:44",
      "upperBoundTime": "00:09:49",
      "content": "Yes sir. High school was not a problem."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:49",
      "upperBoundTime": "00:09:54",
      "content": "Right. Did you have some folks you considered your best friends when you were growing up or a best friend?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:54",
      "upperBoundTime": "00:09:54",
      "content": "I had a lot of friends the term best I don't know I've never really considered it like that because I felt that pretty much all the friends I had were people I could always depend on and never have to doubt. But I wasn't as outgoing as the other people in my family. I think it was cause I was the youngest boy and two of my older brothers were actually basically old enough to be my parents and so that was a large gap there."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:54",
      "upperBoundTime": "00:09:54",
      "content": "I spent a lot of time in the woods or doing things by myself because we were kind of away from everybody we didn't live close to people my same age for the most part. At school I had really good friends. We'd do anything in the world for each other. Bret hart who just passed away from cancer, Jason Benet people like that I guess they were all my best friend in how I look at it"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:54",
      "upperBoundTime": "00:11:08",
      "content": "Have you managed to stay in touch with any of them?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:11:08",
      "upperBoundTime": "00:11:46",
      "content": "I hear from them off and on. As I said I'm not the most outgoing person I generally when somebody writes me I respond but I'm not a person who actually actively seeks the companionship of other people to offset loneliness, or this environment rather."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:11:08",
      "upperBoundTime": "00:11:46",
      "content": "I mean I enjoy talking to my friends I really I miss them but I know they have lives and its not as easy for somebody out there to sit down and write letters as it is for somebody in here. So I don't want them to feel obligated to do so."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:46",
      "upperBoundTime": "00:11:48",
      "content": "Do you have regular visitors?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:11:48",
      "upperBoundTime": "00:12:52",
      "content": "I have. I did for many years. After my mother passed away I talked my dad into only coming once a month they used to come twice a month never failed. And when you consider that it is about a five hundred mile round trip and their ages my parents were both near their 50s when I was born. My father kept coming religiously in fact until a month before he passed about a month before he passed in 2013."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:11:48",
      "upperBoundTime": "00:12:52",
      "content": "Since then I get frequent visits as I refer to them they come three or four times a year which is to me its still great but it's a lot of people get visits weekly or 2 or 3 times a month. I get maybe 4 or 5 visits a year now which I still consider frequent."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:52",
      "upperBoundTime": "00:13:16",
      "content": "Yeah it's an interesting thing that I've discovered through just talking with various folks whoever visits seem to for some folks just go on the whole time they've got family support outside they're just relentlessly there and others over time they've just sort of petered away."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:16",
      "upperBoundTime": "00:14:16",
      "content": "I talk about that with tours a lot. The average inmate will get regular or frequent visits which are defined basically as once or twice a month for about 7 years after that it starts to taper off because people as they age they get married or they have families their jobs occupy more of their time. Finances."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:16",
      "upperBoundTime": "00:14:16",
      "content": "All of these factors culminate in sometimes the reduction of visits. I tended to notice that a lot of the people that continue to get those constant visits tend to live closer or they have easier transportation or they're financially able to do so. But for a lot of people the culmination of age children job obligations and finances are going to put a reduction in the time they're able to visit. Its not because they don't care its because sometimes their lives occupy so much time out there that it makes it, you don't come to Angola on a whim. It's a day trip."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:16",
      "upperBoundTime": "00:14:23",
      "content": "Yeah it is for sure. No matter where you are right? Do you have any children?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:23",
      "upperBoundTime": "00:14:51",
      "content": "Yes sir I have a daughter Tiffany Kay she's married to a very fine young man he was in the air force probably I believe he was a lieutenant when he got out. They live in Georgia now. I actually have 3 grandchildren. One is a little older and then two twins that were born last year."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:51",
      "upperBoundTime": "00:14:53",
      "content": "So one so you have one daughter?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:53",
      "upperBoundTime": "00:14:56",
      "content": "One daughter."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:56",
      "upperBoundTime": "00:14:59",
      "content": "Were you married when you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:59",
      "upperBoundTime": "00:15:10",
      "content": "No sir so it was more of a case of teenage hormones more than I mean I really cared for tiffany's mother and still do but it was more of a hormonal issue than a planned issue."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:10",
      "upperBoundTime": "00:15:14",
      "content": "I totally understand. Do you remember the first time you got arrested?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:14",
      "upperBoundTime": "00:15:16",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:16",
      "upperBoundTime": "00:15:18",
      "content": "Can you tell me about that?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:18",
      "upperBoundTime": "00:16:01",
      "content": "The first time I was actually arrested was actually a complete misunderstanding and not meaning to be funny about it but the old school we went to they had we used to go there after they'd close it and it was basically falling apart being used for various things and we thought that somebody had left a bunch of like kitchen ware stainless steel inserts and stuff."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:18",
      "upperBoundTime": "00:16:01",
      "content": "And we picked some of those up not realizing that they were being held for like a meals on wheels program and when they contacted us I was arrested and then everything was basically dismissed because they understood what went on."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:01",
      "upperBoundTime": "00:16:07",
      "content": "Did you have various brushes with the law before the crime for which you're now serving time?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:16:07",
      "upperBoundTime": "00:16:43",
      "content": "Other than having a girlfriend that got me involved with some bad checks and stuff not really. I had interactions a couple of times behind fights at bar at a bar in high school which I didn't start but I finished. But I didn't, I wasn't into drugs or alcohol things like that really. I didn't, I don't have the mentality for drugs and alcohol I guess I should say"
    },
    {
      "speaker": "Marcus",
      "time": "00:16:43",
      "upperBoundTime": "00:17:14",
      "content": "Sure. So obviously one of the reasons we're talking to you is that you've been identified as a trusted model inmate. Someone who's turned their lives around here and that's part of the story that we're trying to make more visible but when you look back on the person who arrived here 26 years ago how would you describe that person?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:14",
      "upperBoundTime": "00:19:16",
      "content": "Immature in a lot of ways. Never having been exposed to this type of environment I had a certain understanding of what to expect but not a reality of what I would encounter. I got in a few fights which the mentality was different here then if you didn't start the fight and they figure you were justified, you didn't get locked up. And I got in several fights because I just didn't like the way somebody talked to me or something and after two or three times of that I just said I don't want to fight you they just want to beat you up and I don't get beat up easy."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:14",
      "upperBoundTime": "00:19:16",
      "content": "So I was pretty much left alone after that because they don't want to they don't want more trouble than they can deal with and.. I was fortunate in that my education got me out of the field they warden Whitley had the record classification to do reviews of records and I was selected to be a tutor but I assumed that it would be like prison you saw on TV and the movies and its nothing like that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:14",
      "upperBoundTime": "00:19:16",
      "content": "It's not a battle for survival here every day, it wasn't then, its not now. And I think at the time being young and hard headed and immature I might have been more confrontational than I needed to be when somebody approach me in a disrespectful manner I believed but I hope I've grown out of that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:14",
      "upperBoundTime": "00:19:16",
      "content": "And I've come to learn that TV and movie impressions of prisons especially Angola are nothing like the reality of it so its been a big change in the understanding of the environment I live in."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:16",
      "upperBoundTime": "00:19:26",
      "content": "Sure. How do you make sense of a punishment like life without parole?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:19:26",
      "upperBoundTime": "00:21:25",
      "content": "The logic of it based on things that I get a chance to read and the background of knowledge that I've built up here there is no real logic to it. Because if the logic of a life sentence is to deter crime and the majority over 51% of people serving life in Angola are first offenders the highest and lifers have the lowest recidivism rate of any crime for second degree murder."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:19:26",
      "upperBoundTime": "00:21:25",
      "content": "I think the logic doesn't apply because recidivisms always coming in from other crimes. Its not coming in from the lifer's especially second degree murder things like that first offenders. If its going to deter crime but you're putting this person away forever and then the next person who is arrested is a first offender also at what point did the guy who got locked up before him affect his mentality to deter him from committing a crime?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:19:26",
      "upperBoundTime": "00:21:25",
      "content": "Because many first degree first offenders for second degree murder are here because of something that should've been classified as manslaughter heat of passion you're not thinking about the consequences. You don't expect something to happen. It just happens. Now in those situations where somebody actually planned a crime they fully expected to get away with it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:19:26",
      "upperBoundTime": "00:21:25",
      "content": "They didn't expect to get caught they're not worried about the consequences but with over 51% being first offenders the consequences of the other people who committed these types of violent crime that mandate life has never really occurred to them, because its not something that they expected to happen or anticipated happening. Its just anger or reactionary issues that got them their charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:25",
      "upperBoundTime": "00:21:29",
      "content": "Would that be the way you would characterize your own charge?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:29",
      "upperBoundTime": "00:21:29",
      "content": "Pretty much I'm not one of those people who claims to be innocent. The weapon never left his hand but I lost my temper. I have the knowledge of how to fight. I did when I lost my temper I did one of the moves that I knew would end up somebody was going to get hurt. I reacted in a way that in my experience would cause the hurt to happen to him more than me."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:29",
      "upperBoundTime": "00:21:29",
      "content": "That doesn't make it right it doesn't make it justified and that's something I deal with every day because victims who are created on both sides of the crime and my temper caused that. And that's still very very wrong."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:29",
      "upperBoundTime": "00:22:51",
      "content": "After 26 years, is it remorse? I'm trying to I'm struggling with this a little bit too when you have heat of passion types of crimes where two people are fighting its either him or me there are different types"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:22:51",
      "upperBoundTime": "00:22:53",
      "content": "Different scenarios, that really go."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:53",
      "upperBoundTime": "00:23:14",
      "content": "Yeah but when it's a scenario like that and you've served 26 years of your life in prison do you get to the point where you're like I think I'm I think I'm done I've done enough."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "No sir you mentioned the remorse issue if somebody had somebody that had been on the opposite side of the fence as my parents on several political issues and all mad and comment to my dad about a year or two after I was locked up he said yeah you're not so high and mighty now you're your son's in prison. Daddy said yeah but he's in prison he's not dead. He said I have no problem with him being charged with a crime."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "Because he's alive. He could've been dead. My belief on it's a little different. Its everyday you have to get up and you have to focus on what you can do. And it's not just about making your life better my mom and daddy raised us in what I've always referred to as a selfish manner. People I know you've talked to people that are involved in charity work and humanitarian efforts and they always talk about how they dedicate their lives to being unselfish."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "And that's a bunch of bull. If they do that they're being hypocrites because I don't care what you do to help someone else do you feel better about it when it's over with? Do you feel like you're a better person? Do you feel like you've done something to improve somebody else's life your life or the world around you? If you do you've been selfish because you gain a little bit of ego to a degree behind that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "You feel like you're better now."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "Well if you get up every single day regardless of how little it is if its just pushing somebody in a wheelchair if its just helping somebody carry something they're struggling with when everybody else is just passing them up if you take the time and help that person you've become a better person and you've made that other person's day a little better. And if you continue to do those things every day."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "It doesn't matter where you are or who's around you the goal is to be selfish to become a better person. I'm not concerned with how DOC looks at it I'm not concerned with how other people around me look at it I don't care if anybody notices what I do its about what I do every day so that when I go to bed I can lay my head on my pillow and I know that I'm doing what my parents wanted me to do."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:23:14",
      "upperBoundTime": "00:26:12",
      "content": "The judges the DAs none of those people are involved in why I live my life the way I do. I do it for my parents and for myself. And by that it's hopefully going to carry over to at some point my children grandchildren if they live their lives right. So it's not a point where I'm ever going to say I've done enough because if I get to that point I'm deluding myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:12",
      "upperBoundTime": "00:26:30",
      "content": "Let me restate that, I really appreciate what you just said about that and that's the way you have decided to life your life sentence. But what I mean is is 26 years enough?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:26:30",
      "upperBoundTime": "00:28:41",
      "content": "You're talking about time wise? I personally feel like without trying to lessen the impact of any crime that removes a life there has to be a better way to judge when it's enough. Many states have 10-25. There are all sorts of scales for life or virtual life in other states. Parole Charles Manson gets a parole that's a very famous example he gets a parole hearing he's never going home but he gets a hearing. We don't get a hearing."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:26:30",
      "upperBoundTime": "00:28:41",
      "content": "No matter how much you've done with your life and rehabilitated yourself or been rehabilitated you're there's no way to say ok he's ready to go home because life means you die at Angola its the second death penalty. For me? Somebody on the board may look at it and say ok we feel like 20 years was enough for him he should go home or maybe 25 or maybe 30."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:26:30",
      "upperBoundTime": "00:28:41",
      "content": "Another guy may be worthy in 10 he might not be worthy until 50 based on behavior I feel and albeit I'm probably biased I feel I was ready to go home a long time ago but there has to be a system put in place because we recycle aluminum cans but we wont recycle people."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:26:30",
      "upperBoundTime": "00:28:41",
      "content": "We have one of the, we're tied for number 1 for the most churches per capita in America which would seem to indicate that there's a faith based population in Louisiana that believes in mercy compassion and forgiveness but its not showing up where its most important. I'll throw away a stranger that's the mentality apparently. I'd like to go home."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:41",
      "upperBoundTime": "00:29:37",
      "content": "Right I think that it's very confusing when I'm trying to explain to people who are not familiar with Louisiana law that there are many, many, people serving a life sentence for second degree murder who never killed anybody. The scope of offenses for which people are serving a life sentence is so broad as to question the concept of fitting crimes to punishments."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:41",
      "upperBoundTime": "00:29:37",
      "content": "The idea that you can be in here for the most heinous thing you can imagine doing serving a life sentence and drive someone to an armed robbery that turns deadly and have the same sentence and we don't make distinctions between those people does that make any sense to you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:29:37",
      "upperBoundTime": "00:29:39",
      "content": "Once again this is a failure for logic that I could apply to this situation in my belief."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:39",
      "upperBoundTime": "00:29:41",
      "content": "Yeah."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:29:41",
      "upperBoundTime": "00:31:35",
      "content": "Recently there was a case that was settled, concerning a juvenile actually where he was a 3rd offender sentenced to what we call habitual life in Louisiana and they sent him back and resentenced him to life with parole which is an iffy issued based on our current statutes because the new legislation hasn't taken effect yet and they've had this happen before they're making these exceptions creating a parole eligibility in a life sentence where the votes don't actually cover it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:29:41",
      "upperBoundTime": "00:31:35",
      "content": "The guy committed a third non violent felony offense and got life. Like you said we have what's called a principal crime a guy can drive somebody to a store the guy goes in and robs the store kills a clerk comes out and both of them are going to prison for life. The driver may not have actually known for sure what was going on but if he got defender or a poor law, he's going to prison for life. Is it that important to keep our prisons full that we want to make sure we send people to prison?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:29:41",
      "upperBoundTime": "00:31:35",
      "content": "Is it that important that we show that we are not going to be lenient on crime so that a politician can be reelected by saying I'm the DA and I've convicted this many people? It's not his job to convict people or get convictions it's not his job to send people to prison for life just because he think they deserve it. It's his job to uncover the facts in a case and decide whether it's got enough facts to try."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:29:41",
      "upperBoundTime": "00:31:35",
      "content": "A guy who drove somebody to a convenience store and then the passenger robbed and shot somebody? How is that worthy of going to prison for life?"
    },
    {
      "speaker": "Marcus",
      "time": "00:31:35",
      "upperBoundTime": "00:31:38",
      "content": "I don't know."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:31:38",
      "upperBoundTime": "00:33:01",
      "content": "The facts and logic just don't support it. I mean a sentence like this should be reserved for the most heinous crimes that's why some people say the death penalty exists. I don't believe that. We can't pave a highway correctly where it lasts long we can't get our schools from the bottom of the list how can we be expected to implement the death penalty correctly? Life sentences should be the maximum and it should be for those most heinous unforgiveable crimes. We have to apply some type of real logic and understanding in the use of a life sentence."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:31:38",
      "upperBoundTime": "00:33:01",
      "content": "There's no gray area for them either its either his crime isn't worthy of a life sentence or we don't like what they did so we're going to put them in prison for life. Three non violent felony offenses how is that a life sentence? I mean one guy came here for basically a 1500 theft is his third offense. How is that worthy of a life sentence?"
    },
    {
      "speaker": "Marcus",
      "time": "00:33:01",
      "upperBoundTime": "00:33:03",
      "content": "Does the distinction of 18 for the juveniles does that make any sense to you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:33:03",
      "upperBoundTime": "00:34:50",
      "content": "I would like to be able to say I come into that blindly but I've actually read the study but I believe this before I ever read the study because I was fortunate and I had a really good education in junior high and in high school. We all know that teenagers do not behave as fully responsible adults. There's a reason that Louisiana changed its drinking law from 18 to 21."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:33:03",
      "upperBoundTime": "00:34:50",
      "content": "I mean we had pressure on us to do so we were one of the last states to do so but we did it because according to all evidence an 18 year old does not exercise proper judgment when under the influence of alcohol which hardly anybody does. But an 18 year old who has poor judgments making decisions before imbibing gets worse after they drink or use any type of substance."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:33:03",
      "upperBoundTime": "00:34:50",
      "content": "But it doesn't just stop at 18 its if I can't sign a contract that's legally binding until I'm 18, but I can't drink until I'm 21. Why are those 13 ages different? If I can't sign a contract until I'm 18 but I'm can't make a responsible decision about drinking till I'm 21 but I can vote at 18 and I can join the military and die for my country at 18 but I can't take a drink of a beer or drink wine legally until I'm 21."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:50",
      "upperBoundTime": "00:34:52",
      "content": "You can be sentenced as an adult."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:52",
      "upperBoundTime": "00:35:36",
      "content": "Some cases as young as 12 and 14. Why are we have the differences why isn't there one consistent age this is an adult. 12, 14, 16 these things apply to contracts drivers' licenses 18 tobacco drinking 21. Somebody doesn't believe that you're responsible enough for certain things until you've reached certain ages. Why isn't it the same across the board?"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:36",
      "upperBoundTime": "00:35:43",
      "content": "That's a good question. Can you describe your typical day here I know you're a staff writer for the angolite and I'm sure that takes a lot of your time but what does a typical day look like for you today?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "A normal day I I'm an early riser I'm grew up in a family where getting up early was normal sometimes I go to work before 5 o'clock sometimes I wait till 5:30 I wake up every morning between 3:45 and 4 sometimes I just read for a little while sometimes I get ready and go to work early. But my early morning for me is spent working with notes or research information I can do it while it's quiet."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "Where I am once 7:30 8 o'clock hits people are starting to come in and out people are starting to seek information or we're being asked to go do assignments or cover a certain thing so I work better as far as writing and research when I'm not distracted by something. So I try to get most of that done by 7:30 or 8 o'clock if possible. For example recently 3 4 times a day I'm spending several hours at a time going out where they're building an ice house a new ice house for the new prison complex area."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "So I'm going and standing around with a camera sometimes doing nothing for a couple hours waiting for them to do something that's worth taking a few more pictures of because we're going to cover it plus they need the pictures for things that the prison needs to do. During the day I will be approached by inmates about sometimes information about criminal justice issues about stories we've done in the past. Sometimes I will be called upon to do to speak to a tour group."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "I will work on different aspects of articles research for the magazine that we work together with. Around 10 o'clock we will count. When the count clears people will go eat we will count again about 3 o'clock 3:30 and then we will count again at 7 o'clock at night after that they count every hour until right after 4 o'clock but in the course of a day I will move around the prison a good as far as main prison on a regular basis."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "Seeing what's going on many times sometimes, if we know something's going on we're going to get a camera we're going to go cover it. The other day they brought in a tour to look at the medical dorms. I was already out and about with a camera taking pictures of the ice house I went with the tour took pictures of that sometimes you just pick up and camera and they having a sporting event on the yard. You go cover that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "Sometimes there's something going on with a church group you go cover that. Sometimes its a matter of just sitting around in between movement reading up on news information trying to make sure that you stay current on the issues of not just criminal justice but things that relate to prison and ways that you don't always consider because if we hear that transportation systems are having a real issue around new Orleans we knew that's going to impact visitation here because they some people rely on buses to get from new Orleans to Angola to visit."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:35:43",
      "upperBoundTime": "00:39:45",
      "content": "If it's just a lot of little things that sometimes don't make sense and you try to keep up with it so you keep a big picture of what's going on how it affects prisoner's administrations security and Angola because as the angolite we serve as kind of a chronicler of Angola's daily and historical perspectives."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:45",
      "upperBoundTime": "00:39:57",
      "content": "Sure. So if you I'm sure you spend some time envisioning being released. How do you envision your life if you were to receive a pardon or be eligible for parole?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:39:57",
      "upperBoundTime": "00:42:17",
      "content": "I know that I'm going back home for a little while to the Bosco Monroe west Monroe area that's where my family is located. That's where most of my mother's family had moved into that area. Between a half dozen and a dozen job offers."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:39:57",
      "upperBoundTime": "00:42:17",
      "content": "I'm not at this time I probably narrowed it down to 3 or 4 but I do know that based on the fact that I'm over 50 years old my health isn't the same as it was when I got locked up and I've got to get out there and every day I've got to work twice as hard as I would've at 24 because I don't have as much time to build up a safety net for retirement as the average person does."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:39:57",
      "upperBoundTime": "00:42:17",
      "content": "I can't afford to sit around and say well I'll have time to put money aside I'm going to have to get out there and work whatever job I take I'm going to have to work very hard there and I'm going to have to work side jobs extra jobs I'm going to have to make as much money as within the job boundaries as the job market will allow me based on what wages are being paid based I'm fortunate and I've got a lot of skills to fall back on but I've got to get out there and use those skills to make money."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:39:57",
      "upperBoundTime": "00:42:17",
      "content": "I've got to try to help my family I want to still be involved in doing things to help guys here who haven't been as fortunate as I have. Because I really do consider myself to be one of the very lucky prisoners here. But if I just walk out of here and don't help some of these other guys that's kinda stupid of me. But in the process I ve got to plan for my future and try to help my family who's helped me the entire time I've been here"
    },
    {
      "speaker": "Marcus",
      "time": "00:42:17",
      "upperBoundTime": "00:42:20",
      "content": "Do you have a where are you in this process do you have a release date?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:42:20",
      "upperBoundTime": "00:42:26",
      "content": "A life sentence carries no release date as but I applied for clemency."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:26",
      "upperBoundTime": "00:42:31",
      "content": "Clemency."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:42:31",
      "upperBoundTime": "00:43:36",
      "content": "I'm applying for clemency and unlike the popular theory that people with life can get a pardon I can't get a pardon it's not legally possible in Louisiana for me to get a pardon with a life sentence. What I can do and am in the process of doing I apply for clemency."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:42:31",
      "upperBoundTime": "00:43:36",
      "content": "If I'm granted a hearing I will go in front of the pardon parole board. I will plead my case. The DA and sheriff and others will state their case and if I'm granted a recommendation it generally comes in forms of 30, 50, 60, 90 years is given which most of which hopefully that would be applied to me would make me parole eligible."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:42:31",
      "upperBoundTime": "00:43:36",
      "content": "Once my sentence is changed from a life to a parole eligible sentence things will change but if I'm also trying to get into court with post conviction which would hopefully change my sentence either from life to manslaughter."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:36",
      "upperBoundTime": "00:43:38",
      "content": "To a fixed term."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:43:38",
      "upperBoundTime": "00:44:15",
      "content": "Just anything manslaughter would be ideal because it's a 21 year sentence. Even at max sentence I'm automatically release at 26.5 years. But either way, either through the clemency process because once it's if it would be granted fi I got a recommendation and if it was granted a lot of ifs involved, I would be eligible to apply for a pardon then within several years, but I would hopefully be eligible for parole right away. And that's the hope is that one of the processes will happen."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:15",
      "upperBoundTime": "00:44:30",
      "content": "Sure. You have gained a lot of skill you had actually you had quite a few skills before you came to Angola which isn't the typical story actually."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:30",
      "upperBoundTime": "00:44:40",
      "content": "I've come to learn that here I'd never met a person in my life who didn't work and earn paycheck I come to Angola and met grown men who had never earned a real paycheck in their lives. I didn't I started at 7 I didn't understand that."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:40",
      "upperBoundTime": "00:45:16",
      "content": "Right. Yeah. So I know that I'm going to talk to you separately about your work with the angolite but is there a question that I should have asked you and I didn't ask you? Is there something about the reality of life without parole that this story that we're trying to get out there is something that you could share with us that I haven't asked you about?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:45:16",
      "upperBoundTime": "00:48:40",
      "content": "The biggest thing I see in my experience and I'm very careful to use the terminology that makes sure that its not misunderstood as a fact its what I see and what I believe a life we tend to refer to it a lot of times among ourselves as the other death penalty but the truth is I see it on a daily basis here is I've known guys with life sentences who after the visits fade away their outside support fades away their hope basically fades away they become what we refer to as institutionalized. They accept life in prison as their reality."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:45:16",
      "upperBoundTime": "00:48:40",
      "content": "I've seen guys burn their transcripts, so that it's basically a symbolic gesture that I'm giving up I'm not trying to go through court anymore. I know guys that are so content here that whatever benefits and privileges the prison allows them is their world. They make no effort to get out. And losing one of those small benefits is more traumatic to them than something happening to their people on the outside because this thing affects them every day. It might be something small and inconsequential to somebody like me who my family is more important to me than everything else."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:45:16",
      "upperBoundTime": "00:48:40",
      "content": "But for this guy it may be access to something and he loses that and that's more traumatic to him than anything outside the prison because he's accepted this world. And for me to see that a thing such as a life sentence and a guy who's served 30 40 50 years here has lost his family has lost his friends and has lost hope has given up any belief that he's going to go home because for all intents and purposes we've put people in point lookout who asked to be buried there because they said that's where my family is."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:45:16",
      "upperBoundTime": "00:48:40",
      "content": "They basically accepted the fact that the family that they had on the outside is not their real family anymore its the guys they know here who have died or who are living in the hospital ward with no hope of getting out this is their family now and to ask to be buried at Angola because this is your family to me is the most depressing aspect of what a life sentence can do."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:45:16",
      "upperBoundTime": "00:48:40",
      "content": "Because I'm often asked are you going to go home? I never even I doubt I'm going home, the question is how? Because my family and myself have made sure that if I die here whether its tomorrow or god forbid 25 years from now my body will not stay here, I'm leaving Angola. I'm not going to be buried here. But somebody who says I want to be buried at Angola that's the saddest part of what a life sentence does to you."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:40",
      "upperBoundTime": "00:48:53",
      "content": "I agree. I remember seeing Hasein in the farm with bones. He said that. He said he wanted to be buried here because his friends are here."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:48:53",
      "upperBoundTime": "00:48:59",
      "content": "I see where that's important to him. Because they've lost everything else."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:59",
      "upperBoundTime": "00:49:13",
      "content": "When you're confronted with that it's an absurd thing to have to come to grips with. I guess at some point there's a turning point where people just come to some kind of acceptance. Maybe that's what it is?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:13",
      "upperBoundTime": "00:49:16",
      "content": "We call it institutionalization here. Where you accept this kind of life."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:16",
      "upperBoundTime": "00:49:20",
      "content": "Yeah. And you're saying that that's something to be avoided?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:20",
      "upperBoundTime": "00:49:23",
      "content": "Oh yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:23",
      "upperBoundTime": "00:49:25",
      "content": "Yes."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:25",
      "upperBoundTime": "00:51:00",
      "content": "Its I know guys who have forgotten they're prisoners actually they think that because of their stature or their influence here or something that they're not the same as those other prisoners and they're deluding themselves. I am the same prisoner as the guy who's in the field really when it all boils down to it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:25",
      "upperBoundTime": "00:51:00",
      "content": "The fact that I might have certain skills or background that got me a better position doesn't change the fact that I'm still a prisoner at Angola with a DOC number. But within those boundaries I do not have to allow myself to become institutionalized where I accept that I can never have a greater ambition to just be a prisoner here."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:25",
      "upperBoundTime": "00:51:00",
      "content": "My goal and my ambition involves freedom. It involves returning to my family. It involves repaying those debts I owe my family for the support and the belief that they have in me. It is not to stay here and fulfill a penitentiary job such as a dorm or Angolite staff writer or tractor driver or mechanic that's not what I am going to accept. I'm a Hillburn that's who I am. What I am is a prisoner. I'm going to follow the path to who I am. Everything else is just something I'm doing in the meantime."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:00",
      "upperBoundTime": "00:51:05",
      "content": "Yeah that's actually very helpful to me to hear that. I'm also trying to understand how people deal with it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:51:05",
      "upperBoundTime": "00:53:14",
      "content": "I know people I live in a dorm that's all trustees and I watch them accept the life here. Not all of them but a great many people accept the life here and the comforts all them amenities that being a trustee or being known and trusted for whatever job they're in has built up for them and it sounds odd but I actually sit there sometimes and watch people and wonder how they go on every day with the behavior that they would rather sit around and talk about prison stuff as opposed to going to the library or the law library or checking on news that can help them."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:51:05",
      "upperBoundTime": "00:53:14",
      "content": "I know guys who will cry harder about the fact that they can't go work out on the weight pile than they will that, oh I can't go to the law library. They don't mind not going to the law library because some of thems never been in there. But they go work out every free moment they can. Or they're more worried about whether they're going to be able to go play sports. And those things are good to keep your mentality focused."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:51:05",
      "upperBoundTime": "00:53:14",
      "content": "I believe in some type of relaxation but don't put those things ahead of your freedom and I see people who do that constantly here they put these institutional pursuits ahead of their legal pursuits, their family and their freedom, and it is the most confusing and confounding thing in the world to me."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:14",
      "upperBoundTime": "00:53:19",
      "content": "To I think what you're also saying is don't ever forget that this is not normal."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:19",
      "upperBoundTime": "00:55:00",
      "content": "It is definitely not normal. This is through the looking glass in every way possible this is not the reality of what we're intended for. There has to be consequences for crimes. I will never argue against that. But should the consequences result in the destruction of potential and possibility because everybody brags about the skills that can be found at Angola."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:19",
      "upperBoundTime": "00:55:00",
      "content": "We have guys teaching young men how to be mechanics carpenters plumbers these guys know those skills why aren't can't they go on the street and teach kids and other programs that before they come to prison? People refer to the talent that's at Angola when they walk through our rodeo and they say oh, well these guys make great furniture or they paint or why can't they have that same talent, and be released?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:19",
      "upperBoundTime": "00:55:00",
      "content": "We all know the movie director that is living in Europe now, because he doesn't want to come back to America and be prosecuted for his crime and people support him. There are people here who have done lesser crimes, and they're serving life. And nobody supports them. It's amazing."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:00",
      "content": "That's a good note to end it on actually. It is amazing."
    }
  ]
}
