{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Jeffrey Nelson Marcus REDACTIONS FINAL"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:00",
      "upperBoundTime": "00:00:17",
      "content": "Jeffrey Nelson I was 19 years old, and I was convicted of first degree murder and that was in '95, so I've served 23 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:17",
      "upperBoundTime": "00:00:21",
      "content": "ay and you mentioned earlier that you pled to first degree?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:21",
      "upperBoundTime": "00:00:22",
      "content": "Yeah I pled guilty."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:22",
      "upperBoundTime": "00:00:32",
      "content": "So I'm going to start by asking you some questions about your childhood the point of this interview is you learn who you are as a person."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:32",
      "upperBoundTime": "00:00:35",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:35",
      "upperBoundTime": "00:00:36",
      "content": "Pretty straightforward."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:36",
      "upperBoundTime": "00:00:38",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:38",
      "upperBoundTime": "00:00:46",
      "content": "So I would like to start with that and then we'll work up to the events that led you to this and of course the bulk of your life home has been since and then so I'd like to learn about who you've become."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:46",
      "upperBoundTime": "00:00:49",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:49",
      "upperBoundTime": "00:00:53",
      "content": "So let's start with your family can you tell me about the folks who raised you."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:53",
      "upperBoundTime": "00:01:39",
      "content": "Yeah I was raised in, I had a mother and a father but it was my stepfather and they were married since I was like 3 and until I was 12 actually I thought my stepfather was my father. My two brothers are half-brothers and come home from school one day I was about 12 and there was a guy sitting at the dining room table had been in Texas, this is in New York, had been in Texas all this time."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:00:53",
      "upperBoundTime": "00:01:39",
      "content": "Mum told me that this is your father and I was blown away you know in fact I ran out the house went and hid in the woods till I watched the truck leave out the driveway."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:39",
      "upperBoundTime": "00:01:42",
      "content": "Wow."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:01:42",
      "upperBoundTime": "00:02:11",
      "content": "Yeah and form that point on it was chaos in school they got actually my stepdad and my mother got divorced. So my stepfather would come pick up my brothers for visitation on the weekends and stuff but didn't come pick me up because the court didn't order it and they're beefing. So she wasn't going to let him see me and this and that."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:11",
      "upperBoundTime": "00:02:12",
      "content": "ay I see."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:02:12",
      "upperBoundTime": "00:02:15",
      "content": "So that caused a lot of confusion and anger."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:15",
      "upperBoundTime": "00:02:17",
      "content": "Where are you in the age order of these kids and how what the age difference."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:02:17",
      "upperBoundTime": "00:02:18",
      "content": "I'm the oldest."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:18",
      "upperBoundTime": "00:02:19",
      "content": "You're the oldest."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:02:19",
      "upperBoundTime": "00:02:59",
      "content": "I was 12 when all this happened the divorce and all this they were let's see the one up under me was 8 and the one up under him was 7. So which consequently one of them works in Washington for the government now. The other ones a Denver city police officer."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:02:19",
      "upperBoundTime": "00:02:59",
      "content": "And I know it's probably because they didn't understand what was going on as much as I did why it you know why I ended up being black sheep quote in the family. But again that's not an excuse, it's just saying you know analyzing it since I've been here a while you know just what caused this or that."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:59",
      "upperBoundTime": "00:03:03",
      "content": "As you get older you get all kinds of perspective on various things in your childhood."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:03",
      "upperBoundTime": "00:03:24",
      "content": "Right but so anyways after that I ran away various time ended up going to live with my real father who had moved back to New York for maybe a year, and he had 3 other kids and now there's a stepmom, that didn't work out. Ran away from there too."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:24",
      "upperBoundTime": "00:03:26",
      "content": "Where in New York?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:26",
      "upperBoundTime": "00:03:37",
      "content": "My father lived in Jamestown which is right on the Pennsylvania border on the western coast of New York and my mother was from Rochester Buffalo area the Great lakes."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:37",
      "upperBoundTime": "00:03:39",
      "content": "Yeah, but where are you living?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:39",
      "upperBoundTime": "00:03:40",
      "content": "Where?"
    },
    {
      "speaker": "Marcus",
      "time": "00:03:40",
      "upperBoundTime": "00:03:43",
      "content": "Where in New York were you living as a kid?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:43",
      "upperBoundTime": "00:05:44",
      "content": "Mainly in Medina which is Buffalo, Rochester. My parents had a well or my mother had a horse ranch bred Rottweiler's. And different dogs and stuff. It was a good I'd say like an upper middle class type of upbringing family. Until 15 or so mom was an alcoholic even though she kept raised the kids and to care of us financially and all that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:43",
      "upperBoundTime": "00:05:44",
      "content": "It was always one thing after another, different men and different issues and stuff you know and she got in a car accident and her new husband who I didn't even know because I was gone at that time got killed and she got crippled from the waist down well after that she became a Christian. They told her she'd never walk again, a year later she was walking again so God healed her."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:43",
      "upperBoundTime": "00:05:44",
      "content": "So when I finally did come back home I was at my father's when this happened and when I did come back home my other brothers and my sister are all taken out of public school and they're in a Christian school now. If I wanted to live with her I had to go to the Christian school and that was worse you know. So like everybody just adapted and went with it, and I'm like these ain't even the people I know you know."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:03:43",
      "upperBoundTime": "00:05:44",
      "content": "So I was just real angry, and confused, and I graduated, well that was till I was 17. So it was about a year I went to that school and then I got the speech from the new stepdad that if I didn't want to abide by the rules that I could leave or stay and abide by the rules. So I left and they emancipated me, and when I was 17 I had my own apartment working full time job and I still graduated high school."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:44",
      "upperBoundTime": "00:06:03",
      "content": "ay wow that's a lot. So, I was going to ask you about the men who came into your mother's life and then became part of your life and you've described a couple of them, were there other men who were a source of conflict for you."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:06:03",
      "upperBoundTime": "00:06:05",
      "content": "In what way?"
    },
    {
      "speaker": "Marcus",
      "time": "00:06:05",
      "upperBoundTime": "00:06:16",
      "content": "So men that would come into your mother's life who would ended up butting heads with you, aside from the stepfather you just mentioned who said it's my way or the highway kind of thing.."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:06:16",
      "upperBoundTime": "00:06:48",
      "content": "Right. Not that I can remember that stands out. I was kind of just compartmentalized them with her over here. And I mean I remember waking up in the morning and several times and didn't know who was going to walk out that bedroom. What I'm saying and whoever did if they were here for a week, a month or two days didn't matter to me that's her. He didn't nothing to do with me in my mind."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:48",
      "upperBoundTime": "00:06:50",
      "content": "They didn't try to start disciplining you either."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:06:50",
      "upperBoundTime": "00:06:53",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:53",
      "upperBoundTime": "00:07:17",
      "content": "So that's quite a lot to unpack. So if is it accurate to say up until the age of 12 or so that you felt that you were in a loving environment with adults who care for you and then you kind of had to fend for yourself after this change in your life."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:07:17",
      "upperBoundTime": "00:07:19",
      "content": "Absolutely yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:19",
      "upperBoundTime": "00:07:25",
      "content": "All right what about school you mentioned that you graduated from school and you went to a couple of different schools along the way and then this Christian school is that where you graduated from?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:07:25",
      "upperBoundTime": "00:07:29",
      "content": "No I ended up graduating from a public school that was in their town."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:29",
      "upperBoundTime": "00:07:32",
      "content": "Were you good in school? Did you like school?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:07:32",
      "upperBoundTime": "00:08:14",
      "content": "Science and math and art, I really liked that's why I stayed I think definitely wasn't cause of friends, I didn't really by moving around so much I was kind of outcast in school too. But I wrestled from like 8 year sold all the way up until I graduated."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:07:32",
      "upperBoundTime": "00:08:14",
      "content": "I went to the state finals twice and that was my foundation I guess, you could say of who I was. That's what kept me, this is what I know so all the rest of it I can just push to the side and that's what kept me going. I think that's the only reason I graduated."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:14",
      "upperBoundTime": "00:08:20",
      "content": "Great, so did you have a coach who to an interest in you who felt like or a particular teacher that you thought some kind of a bond with as well?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:08:20",
      "upperBoundTime": "00:08:32",
      "content": "Yeah Mr. Lewis my art teacher, was also my wrestling coach, and he was kind of a and I didn't look at it at that time but looking back at it now I see it more as a father figure."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:32",
      "upperBoundTime": "00:08:42",
      "content": "Have you stayed in touch with anybody that you knew before your 19th birthday or so."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:08:42",
      "upperBoundTime": "00:08:44",
      "content": "No, as soon as I graduated high school that summer, graduated in June, by August I was gone, I left New York state."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:44",
      "upperBoundTime": "00:08:54",
      "content": "What brought you down to Louisiana?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:08:54",
      "upperBoundTime": "00:09:17",
      "content": "Nothing. I never spent the night in Louisiana got extradited back. I got arrested in California. I left New York, went to Myrtle Beach, went to Florida. I just was going various places. I'd work for 2 weeks till id get a paycheck and then I'd leave."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:17",
      "upperBoundTime": "00:09:19",
      "content": "What kind of work were you doing?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:19",
      "upperBoundTime": "00:10:24",
      "content": "Everything whatever factory work, construction work, laying ceramic tile whatever you know whatever I could get. In fact I never interviewed in a place I didn't get hired. But I was just wanting to see the things that I didn't see, see the world and at the same time I didn't really consider myself to have any real friends or family that was close."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:19",
      "upperBoundTime": "00:10:24",
      "content": "So I didn't have any ties, why not and I was leaving Myrtle Beach and going to Mardi Gras with another guy that I met in Myrtle Beach. Find out later he's AWOL from the military. He was 21 at the time I was 19. I didn't know this at the time but that's how we ended up coming through Louisiana."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:09:19",
      "upperBoundTime": "00:10:24",
      "content": "Well my charge happened literally on I-20 Rest Area. So we never left I-20, we didn't cut down to go to New Orleans because when that happened, we just kept going west and ended up in California."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:24",
      "upperBoundTime": "00:10:26",
      "content": "I see, so you never made it to New Orleans?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:26",
      "upperBoundTime": "00:10:30",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:30",
      "upperBoundTime": "00:10:39",
      "content": "All right what about any girlfriends that stick in your memory from coming up?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:39",
      "upperBoundTime": "00:10:40",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:40",
      "upperBoundTime": "00:10:44",
      "content": "Tell me about that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:44",
      "upperBoundTime": "00:12:27",
      "content": "It was a few that were more of friends really it's kind regrets because it seems like the ones that meant something back then weren't the girlfriends they were just friends that were girls that think back man I should acted on that. Something might of some of that or maybe they'd seem closer now, looking back because they were friends and not just a fling."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:44",
      "upperBoundTime": "00:12:27",
      "content": "But yeah there was several of them 3 of them really that I could look back and say that they were more like a sister. We partied with and all that, I remember got in several fights over more than I actually, than I ever really thought of about my real sister or my brothers like defending them and stuff."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:44",
      "upperBoundTime": "00:12:27",
      "content": "In fact the night that I left New York it was on the 4th of July this girl Amy that I was real cool with. I was cool with her mom too and this is a long story anyway I ended up punching a security guard because of her, who was getting into it with her ex-boyfriend. And in my mind people when they came back that night, they told me man, the police are looking for you this and that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:10:44",
      "upperBoundTime": "00:12:27",
      "content": "Come to find out, the whole time that I when I left new York, the whole time until I got arrested I thought I was on the run for punching a \"cop.\" Well come to find out there was no detainers, there was no charges ever filed, it was a rent-a-cop, they probably swept, nothing ever even happened of it but in my mind I'm on the run."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:27",
      "upperBoundTime": "00:12:29",
      "content": "Sure."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:12:29",
      "upperBoundTime": "00:12:30",
      "content": "But that was all behind a girl that I was never even kissed. It was just a friend."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:30",
      "upperBoundTime": "00:12:34",
      "content": "You told me, that you're not in touch with these folks anymore."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:12:34",
      "upperBoundTime": "00:12:36",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:36",
      "upperBoundTime": "00:12:50",
      "content": "So the issue with the security guard, how did you find out that that was never an issue?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:12:50",
      "upperBoundTime": "00:13:11",
      "content": "Because when I got up here, after I got here when you go to make trustee or even file for clemency or anything like that they run NCIC on you, and if you have any type of detainers or anything like that, and they tell you when you get your jacket your rap sheet that tells you first offender or anything like that, or if there's anything open. I had none of that."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:13",
      "content": "So you're a first offender."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:13",
      "upperBoundTime": "00:13:18",
      "content": "In fact other than that incident there I've never even had a speeding ticket."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:18",
      "upperBoundTime": "00:13:19",
      "content": "Wow."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:19",
      "upperBoundTime": "00:13:36",
      "content": "But it's not because I didn't do stuff wrong, I just never got caught for it. I wasn't a criminal. It was more of all of this came about from wanting to party and being real irresponsible and not considering the consequences of my actions."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:36",
      "upperBoundTime": "00:13:40",
      "content": "So like every other teenager."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:40",
      "upperBoundTime": "00:13:42",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:42",
      "upperBoundTime": "00:13:45",
      "content": "So what about fighting was there was fighting part of your coming up."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:45",
      "upperBoundTime": "00:13:47",
      "content": "Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:47",
      "upperBoundTime": "00:13:48",
      "content": "Yeah so tell me about that in school?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:48",
      "upperBoundTime": "00:14:34",
      "content": "I think it was I grew up on a farm and I think because of my older cousins and uncles and friends that were around me and stuff, that's just what men did, you know what I'm saying. So couple that with the anger, and the confusion of the things that happened in my life, and I lashed out."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:13:48",
      "upperBoundTime": "00:14:34",
      "content": "And any time somebody said something I didn't like my answer what do you do, you punch them in the mouth. I look back now and I realize that's childish and stupid but to me at that time that's the answer."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:34",
      "upperBoundTime": "00:14:42",
      "content": "Yeah, is when you look back on all those fights, is there one that really still sits with you the way memories do?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:42",
      "upperBoundTime": "00:14:45",
      "content": "No not really."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:45",
      "upperBoundTime": "00:14:46",
      "content": "So it was all just about."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:46",
      "upperBoundTime": "00:14:46",
      "content": "Yeah just in none of them were serious."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:46",
      "upperBoundTime": "00:14:48",
      "content": "That's how you have."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:48",
      "upperBoundTime": "00:14:54",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:54",
      "upperBoundTime": "00:14:59",
      "content": "Were you, I'm assuming not but were you physically or sexually abused at any point in your life?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:14:59",
      "upperBoundTime": "00:15:01",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:01",
      "upperBoundTime": "00:15:10",
      "content": "And you graduated from high school first offense, so I'm assuming also that you didn't get kicked out of school."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:10",
      "upperBoundTime": "00:15:27",
      "content": "No. I did get kicked out the reason I want to go live with my father right after the divorce, I ended up hitting a teacher with a chair in the leg, and he would grab my arm, and that's why I got kicked out of that school. That's why I went to live with my father. I didn't have a choice. It wasn't what I decided to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:27",
      "upperBoundTime": "00:15:29",
      "content": "So you got kicked out once, and I'm also going to assume that you don't have any children but I should ask."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:29",
      "upperBoundTime": "00:15:34",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:34",
      "upperBoundTime": "00:15:41",
      "content": "Let me ask you about firearms did you have easy access to firearms."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:41",
      "upperBoundTime": "00:15:50",
      "content": "Yes. I grew up with the around them. All my father did was hunt, all my uncles, everybody I knew that's all they were hunters."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:50",
      "upperBoundTime": "00:15:56",
      "content": "And when you left New York for Myrtle Beach and then your trip down here were you armed?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:56",
      "upperBoundTime": "00:15:58",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:58",
      "upperBoundTime": "00:15:59",
      "content": "And what was your understanding about why you were armed."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:15:59",
      "upperBoundTime": "00:16:32",
      "content": "It's just what one does. I don't know I've always had a rifle. Now I had a pistol that was bought at a pawn shop, and I knew it was illegal because I didn't have a license for it. All my other guns at the point in my apartment and stuff I didn't bring them, they were all rifles and stuff. And I only brought the pistols, because it was easily you could pack it in a bag, matter fact carry it in a backpack, couldn't take a rifle with me you know."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:32",
      "upperBoundTime": "00:16:39",
      "content": "Right and did you see as like you know you're going on a road trip person protection, you never know."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:16:39",
      "upperBoundTime": "00:17:49",
      "content": "Right I mean I really never even, I mean this sounds crazy. In fact my step dad found it under the seat of my car. I had probably had it or since I was 16 and he found it under the seat of my car."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:16:39",
      "upperBoundTime": "00:17:49",
      "content": "One day I think my mom found it she was cleaning my car out or something but he was the one that addressed it and asked me why I had it and first thing I said, \"Is protection.\" He said, \"Well where you going or what are you doing that you need to protect yourself.\" \"Nowhere really.\" \"Well then why do you need protection?\" I think it was more like a cool thing."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:16:39",
      "upperBoundTime": "00:17:49",
      "content": "You know, because when he asked me that it made me think, I'm really not going I'm not going to the inner city or anywhere that I would need a gun. That conversation stuck in my mind, because his response was well if you're carrying that one day you're going to have to use it and you're either going to die or go to prison."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:16:39",
      "upperBoundTime": "00:17:49",
      "content": "He told me that and that was little less than two years after or before I ended up catching this charge. That always stuck with me you know what I'm saying I'm like man but had had that gun this would have never happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:49",
      "upperBoundTime": "00:17:51",
      "content": "Well tell me about what happened."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "Well I told you about Joe Harman was his name. I met him at Myrtle Beach I was working at a place called Fric-N-Frac, its airbrushed t-shirts. He was pretty much just an average Joe beach bum you know and like I said he was on the run but I didn't realize that. I didn't know that, he had went AWOL didn't want to go to Kuwait or where it was during desert storm."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "Well his little hustle I guess you call it was going to the beach and picking up wallets and cameras and whatever and going to that's how he ended up coming up to my shop didn't know me from Adam and Eve asked me to hold this bag for him. Said all right. So I threw it under the counter he takes off don't even know this dude we were the same age you know roughly the same age he's two years older than me but."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "So during my break I lo in the bag being nosey because what's going on is this full of cocaine and the cops after you or something you know what's the deal I open up and I immediately know the stuffs stolen because it's a bunch of jewelry and random stuff that you're not just going to have packed in a little bag."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "So he come back later and pick it up and I asked him I said, \"Man what's the deal, what you're doing you know.\" \"You looked in here? I said, \"Yeah I looked. I'm holding it for you I'm going to look\" So that's when I found out what he was doing. So long story short I end up pretty much moving in with him, in you know not really an apartment we were paying by the week in Myrtle Beach."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "And went from that job to Studebaker's, working the floors at dance club. Everything shuts down in Myrtle Beach in say end of August I think it was because it's a tourist town, and it gets kind of cool in South Carolina. So it just shuts down. And most of the shop owners and club owners have the same type of shops or clubs in Florida and during the off season for Myrtle Beach, they'll go down there."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "I had the opportunity form two different places to go down there and we ended up going. He talked me I never even heard of Mardi Gras, I mean I just never heard of it. He's running all down me its party central, and I'm blown away by Myrtle Beach all the women are so loose it's drinking and partying and all that everybody wants to do. They're on vacation or whatever and I'm staying here and I'm like, \"Wow there's some place even better than this for partying you know I want to go.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:17:51",
      "upperBoundTime": "00:20:57",
      "content": "So neither one of us had a vehicle. So we end up hitchhiking. So I got everything I owns in a backpack, and I mean I got money you know from working not great with money. I mean as long as I could pay for rent for a week, the rest of it I'm spending on alcohol and booze and drugs or whatever. Never really did a lot of drugs, acid and weed, that's about it. But so we're hitchhiking and a guy picks us up out of Florida and we're in the back of the truck. It's a pickup truck, he's an older guy in his late 50s."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:57",
      "upperBoundTime": "00:20:53",
      "content": "You're in the back of the truck."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:20:53",
      "upperBoundTime": "00:21:09",
      "content": "Yeah both of us and we drive, I don't know probably 4 or 5 hours, and we stop at a rest area and get out."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:09",
      "upperBoundTime": "00:21:10",
      "content": "In Louisiana."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "No this was in Mississippi. And we get out and the guy asked me if either one of us have a driver's license I said, \"Yeah I got one.\" He said, \"Well would you mind driving, I'm kind of tired.\" But whatever I say all right so he goes to use the bathroom and stuff I get in go to driving."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "And Joe and I had been tossing around you know when we get low on money he was talking about robbing some place or burglarizing some place or this or that and I'm like, \"Okay.\" He's older than me. I'm not saying he influenced me I just didn't want to be the one that pussied out, you know what I'm saying."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "So as we're driving along I lo down and I see he's got this briefcase on the floor of the truck under his seat and didn't really think much of it we stopped at another rest area to use the bathroom. He did."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "I'm sitting there in the truck I pull the briefcase out open it up and it's full of savings bonds, and traveler's checks. I mean full the guy was moving from Florida to Oklahoma and had just retired and was moving to live with his daughter I found all this out later. He also had a 38 in the console of his truck right there so I tell to Joe about what I see and he's like man lets rob him let's take it.\" I'm like Okay.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "So he goes back Joe goes and he's asleep in the bed of the truck the whole plan is and I'm sitting here and rolling over in my mind, are we just going to stop and tell this dude to get out and take his truck or whatever. And I'm like man we really don't need to do this, and I'm just for probably an hour of driving. I'm just rolling over in my mind what kind of situation I'm in."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "This dude is expecting me to do this and I'm the one that told him what's there. So I kind of initiated it wasn't even on his mind. But now I felt I'm in a situation where I got to do something and really was probably putting all the pressure on myself when I look back at it. I cared way too much what people thought you know what I'm saying."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "At what point if they told me if they could put me on a lie detector test today that was 100% reliable and told me, if I just told the truth no matter what it was that I could walk out that gate soon as we're done with that interview, I couldn't tell you why I shot that dude. No idea. I just ended up picking the gun up and shooting him. Don't know why I did it. There was no reason to do it. I mean I could have just as easily stopped the truck and told him to get out and drove off."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "That's what happened. We got to California, we ended up not going to Mardi Gras because that happened in Louisiana. We went to Abilene Texas, dropped the truck off on the street caught a bus and went to California and from California went to Tijuana Mexico, came back, drunk from Tijuana, Mexico, to a bus to downtown Hollywood, because I was drunk and stupid and not a criminal, didn't realize I shouldn't be using this dudes credit card."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:21:10",
      "upperBoundTime": "00:24:49",
      "content": "And I used it to rent an 11th floor suite at a remote inn and SWAT team kicked in the door about 2 hours later you know what I'm saying. That's pretty much the cut and dry of what happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:49",
      "upperBoundTime": "00:24:56",
      "content": "Sure. Well let me ask you this if this incident had not happened for whatever reason, how do you imagine the rest of your few months, years what would have turned from there?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:24:56",
      "upperBoundTime": "00:24:59",
      "content": "I think I would've."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:59",
      "upperBoundTime": "00:25:02",
      "content": "Surely you've thought of this sort of, what if."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:25:02",
      "upperBoundTime": "00:25:51",
      "content": "Oh yeah. When I got to the parish hail my mom felt the need to send me through the mail the three different colleges that I was accepted to that I had applied to when I was still a senior, and letting me know you know I don't know what she was letting me know, maybe you threw this away or I don't know. I've thought about that often that maybe if I'd just sowed my wild oats, and got it out the way then I would ended up coming back going to college."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:25:02",
      "upperBoundTime": "00:25:51",
      "content": "Like I said one brother, my little brother went in the military, got his master's degree in criminal science political science and criminal justice and international business. Now works for NSA and my other one is a Denver city police officer and my little sister is a veterinarian, you know so I'm like."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:51",
      "upperBoundTime": "00:25:58",
      "content": "So you would have been some mixture of that probably."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:25:58",
      "upperBoundTime": "00:26:25",
      "content": "I mean I don't know what I would have been but I think I would have been successful I think I would have went to college, maybe the military something of that sort. But I needed to, I mean because all of them right after high school before going into the military or college, I've heard when I from calling home my little sister got caught smoking weed and my brother got caught drunk driving. Its different things, they were all doing the same stuff I was doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:25",
      "upperBoundTime": "00:27:06",
      "content": "Right absolutely so I want to switch gears and start talking about what you've been up to now there's this one event and it sort of changes your entire trajectory. But I want to learn about these last 23 years but before I switch gears is there something about you the first years of your life up until you're about 19 or so that you think is significant in terms of your story that we didn't talk a lot about."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:06",
      "upperBoundTime": "00:27:25",
      "content": ". In fact I think the 19 years before I was here was wholly insignificant. As a person I mean it all lays foundation for shaping me and who I am now but this place raised me it made me into the man that I am today and it really is relevant to who I am today what happened before I came here. It was like I flipped a whole other chapter in my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:25",
      "upperBoundTime": "00:27:32",
      "content": "I want to go there. So I assume you spent a few months in the parish."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:32",
      "upperBoundTime": "00:27:33",
      "content": "18 months."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:33",
      "upperBoundTime": "00:27:42",
      "content": "18 months do you remember that ride down to Angola? Tell me about that?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "Yeah it was night time, and I had heard from some of the guys in the parish jail that Angola's the bloodiest prison in the country and yada, yada, yada. In '95, '96 well when I first got here the first year I was here there was 4 or 5 killings. It wasn't 4 or 5 a week like they were talking, but still since then now you don't ever hear or hardly ever hear of it happening."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "So it was still, there was fights every day and stuff so it still was kind of rough but in my mind I'm walking into something where I'm it's either I didn't know if I was going to have to kill somebody to survive. But I knew I was going to survive, and then I got here and growing up in New York I had no I never gave any thought to racism."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "I wasn't around any black people so it wasn't an issue I didn't like them I didn't dislike them, I didn't hate them, I didn't I never taught anything good or bad about them they just wasn't in my life. So I never thought about it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "I get in here, and it's cultural shock, I'm whitey. I'm all their cause of problems you know the white man put them in prison the white man enslaved them this and that. I don't disagree with all that but I didn't do it, and I don't understand why you know what I'm saying, I got to be white boy. So coupled that with I'm scared to death well I went back then to anytime someone looks at me sideways I'm going to punch you in the mouth because I'm show you just because I'm white. I'm not a rat I'm not weak I'm not a hoe."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "Because I thought that's what everybody assumed. So I reacted so for the first two years I was here I bounced around from cell block to cell block getting in a fight about every 3 weeks till I realized looked around, I'm really the only one doing this to myself, nobody's pushing me until after I punch them and I realized, man I'm bumping my head against the wall for nothing."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "So I made it out the cell blocks and into population and once I get into population it's just not it's not violent. I'm like man this is a schoolyard. Now the cell blocks is a little worse than population but still I was making it way worse than it really was."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "It took about 6 months and I realized there was a hobby shop didn't even realize that. Got into the hobby shop and realized I had the opportunity to make money well I immediately my mom used to send for the first two years that I was here, she would send me like a hundred dollars a month."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "I wrote her and told her I didn't need her to send me any more money I could make money now. Still young and didn't realize that was moms only way to help me and she can't any other kind of way and I just cut her off from that. That was later on down the road that I realized that and that it hurt her and blah blah blah."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:27:42",
      "upperBoundTime": "00:31:27",
      "content": "So anyhow so for the next ten years probably that's what I did. I worked in the hobby shop, worked my state job spent my time in the hobby shop making money and who cares what else goes on in the world. I'm high. I'm happy. I got something in my stomach nobody's messing with me I'm die here whatever I don't really think about it just put that in the back of my mind."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:27",
      "upperBoundTime": "00:31:29",
      "content": "What were you making in the hobby shop?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:31:29",
      "upperBoundTime": "00:32:03",
      "content": "Jewelry. A guy that I was working out with painted and he taught me how to paint or he got me started painting, and I always loved art, but didn't think I was an artist and I switched over into that, and got real aggravated several times because I'm not a natural artist, I had to make myself one. And that's what I do today is oil paint and sculpture metal sculpture, clay, oil, acrylic, airbrush."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:03",
      "upperBoundTime": "00:32:04",
      "content": "Wow."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:32:04",
      "upperBoundTime": "00:32:20",
      "content": "That's become my I realized my passion, art and in fact I run the sign shop for Angola, that does all the 18 wheel, I paint all the 18 wheelers I do all the signs do all the advertisement for the rodeos and stuff."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:20",
      "upperBoundTime": "00:32:24",
      "content": "Oh wow."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:32:24",
      "upperBoundTime": "00:32:35",
      "content": "I'm on the rodeo committee, there's four of us at Angola that are on the rodeo committee that go up to the ranch house and have the meetings and stuff for advertisement and that's just become my whole life is the painting."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:35",
      "upperBoundTime": "00:32:49",
      "content": "So I mean the thing is you've clearly become a very trusted member of this community I mean one of four people who have that kind of access but you're a trustee and you're painting."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:32:49",
      "upperBoundTime": "00:33:25",
      "content": "I've also completed, when they started the reentry program I was working in maintenance. So they had the HVAC heating ventilation and air conditioning and electrical in the maintenance shop at that time. I went through level one and two of HVAC level one and two of electrical."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:32:49",
      "upperBoundTime": "00:33:25",
      "content": "Then I went to generator school finished that out completely. Then they had a fiber optic classes they started it only went one round because it was so expensive they couldn't afford to do it. I was in that first class completed all the fiber optic classes, so I've got four trades under my belt."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:25",
      "upperBoundTime": "00:33:27",
      "content": "Wow yeah that impressive."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:33:27",
      "upperBoundTime": "00:33:41",
      "content": "Yeah I just don't work in them here because doing the sign shop thing gives me more I mean I the real estate I have I have a hut four gyms two rooms in the gym so it's more beneficial than just doing electrical work all day."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:41",
      "upperBoundTime": "00:34:01",
      "content": "Sure you got to do what you got to do. When you look back on your time here when do you think when was sort of a tipping point where you're like well this is where I just kind of turned my life around."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:01",
      "upperBoundTime": "00:34:01",
      "content": "I was looking, when I filed my clemency, I was looking at my write ups because I had to write in when I was doing my application I had to write in for my record. Because they ask you about your write ups. The first six years I was here or so I think it is I was getting like 2 or 3 write ups a year. Actually the first two years I was here I had like 20 something write ups well I think like 15."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:01",
      "upperBoundTime": "00:34:01",
      "content": "Then I had went from that to 2 or 3 a year for about 3 years then I jumped to like 1 a year. When I turned 25 and the reason I know this is because I was me and my partner was talking about the study, I'm familiar with the studies for your brain is fully developed when you're 25. I was looking at the dates."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:01",
      "upperBoundTime": "00:34:01",
      "content": "And I was like you realize when I turned 25, I started getting one write up a year and then when I turn about 30, 35 it started one every two years and then for the last probably 8 years hadn't really had any. I had one and it end up getting thrown out you I went two periods I had 6 years between a write ups."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:01",
      "upperBoundTime": "00:34:01",
      "content": "But it's like you can see, and why it was significant to me is because there was no this was before you started doing these interviews and I really thought that anybody was going to do it I just heard these studies and I was like man those studies are right according to my record personally it had applied to me."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:34:01",
      "upperBoundTime": "00:34:01",
      "content": "I'd like to see the data on everybody on this prison their age, and how their write ups evolve. Because I know some of them are 50 years old and still bump their head up against the wall every day, if that's."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:01",
      "upperBoundTime": "00:36:10",
      "content": ""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:36:10",
      "upperBoundTime": "00:36:26",
      "content": "Most of my write ups are well either simple fights, which is just fistfights or aggravated disobedience. Could be something like leaving a towel hanging on the end of your bed or showing up late to work."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:26",
      "upperBoundTime": "00:36:28",
      "content": "What aggravated about that?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:36:28",
      "upperBoundTime": "00:36:39",
      "content": "Aggravated is any time they give you a direct verbal order to do something, and you don't do disobedience is it in the rule book and you go against it."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:39",
      "upperBoundTime": "00:36:41",
      "content": "I got it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:36:41",
      "upperBoundTime": "00:37:01",
      "content": "Its standard you never see anybody wrote up for disobedience. In fact it's like, I think they teach that in the academy, if you writing a write up and it's a disobedience I gave inmate such several direct verbal orders, to take the towel off the end of his bed and he flatly refused. Did that ever happen nope but that's how it goes."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:01",
      "upperBoundTime": "00:37:21",
      "content": "Sure are so when you look back on that person coming in here you were pretty clear about the act that you think of yourself as having been raised here, and the person that you are has been shaped by this experience more than any experience before."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:21",
      "upperBoundTime": "00:37:23",
      "content": "Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:23",
      "upperBoundTime": "00:37:46",
      "content": "What advice would you give, and I'm sure you see these guy in reentry, you also see guys coming in serving a life sentence at your age. When you look, and you must maybe I'm just assuming that you see a little bit of yourself in some of these guys coming in. What advice would you give your younger self?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "To watch the people around you and see the results of their actions. I mean you couldn't watch me. And see in fact I got a friend that's only been here like 6 years. He wants to drive the 4 wheeler. He wants to be a trustee. He wants to have a dog you know because he sees me have this stuff or somebody else has this stuff. I say, \"Dude you don't understand what this to for these people to lo at me like they do and put that trust in me.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "I said, \"It didn't happen overnight.\" In fact he was like 4 years old when I got here but he thinks well if he has it I can have it and you're right in a sense. But you also have to earn it, not nothing that you do more in what you don't do. I see these guys that got here when I got here, and they're still bouncing around back and forth to the cell blocks because they're still using drugs, or they want to have a cell phone or whatever."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "To me I just think that your actions today are going to dictate what's happening to you tomorrow in the sense of, I could probably get high every day if I wanted to now. I could have a cell phone and all that. But two years from now that might stop me from going home, and I consider that now."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "Before with my actions I don't consider, I was in fact it was a security officer that told me this my boss that I worked for, and I never forgot it. He said look at this prison and your life as if it was your hand. He said now hold your hand in front your face. He said, \"It's all you see is your hand you're looking at your hand, you know every line on your hand.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "He said, \"Even though that hands right in front of your face, it's in your face all the time, this prison, the people around you the attitudes form the guards and the other inmates.\" He said, \"If you could learn to lo through your fingers at what's beyond that which could possibly be your freedom, instead of focusing on this hand that's in your face.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:37:46",
      "upperBoundTime": "00:40:09",
      "content": "He said, \"You'll make it a lot easier on yourself.\" And I do. Different stuff comes up where I want to lose my temper or somebody else loses their temper or whatever. Now first thing pops into my mind especially since I got that clemency hearing man this dude can say whatever he wants to, it ain't gone affect my life a bit."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:09",
      "upperBoundTime": "00:40:11",
      "content": "Not worth it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:40:11",
      "upperBoundTime": "00:42:27",
      "content": "No who cares what he thinks is his opinion really and I think this being such a close knit society in here everybody cares what everybody else thinks. Whether you're a preacher a politician a reentry mentor whatever you care about other people's opinions. There's no hiding it. There's no secrets in prison. Eventually it's going to come out if one person knows everybody's going to know whatever it is."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:40:11",
      "upperBoundTime": "00:42:27",
      "content": "So everybody cares about what the other person's thinking, but if you're looking at that hand and looking through those fingers I consider I could be on the outside one day, is it going to matter what this whole prison thinks of me? It's not. So that's what I would tell people. If you live for yourself and look at what could happen in the actions that you do, and even in your thoughts considering what other people are going to think about."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:40:11",
      "upperBoundTime": "00:42:27",
      "content": "Because when I first got here it was convict code and a moral thing and there's certain things you do and certain things you don't, the prison has totally changed. The convict code is out the window, it doesn't exist anymore. You got certain people that are still trying to live by it, but when everybody else isn't you can't."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:40:11",
      "upperBoundTime": "00:42:27",
      "content": "So now you just got to be able lay your head down at night and sleep and live with your own morals just like you doing on the street. It's not about anybody else, or what everybody else thinks about you it's about you it's you being able to lo yourself in the mirror and live with yourself."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:40:11",
      "upperBoundTime": "00:42:27",
      "content": "I mean to be honest, this might sound crazy I'm glad I came to prison because everything that makes me who I am today was shaped by this place. My outlook, my views my morals what I hold valuable what I don't. And if I go out there tomorrow it's not about working a nine to five job, and having a wife, and kids and a nice car and a nice boat and a four wheel or nothing, it ain't about any of that it's about leaving my footprint in the world. I wouldn't have that outlook, I don't think if I was out there. I think I would have been in the rat race of life, and wouldn't have that outlook."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:27",
      "upperBoundTime": "00:42:46",
      "content": "Yeah quite possibly. I mean we are who we are, because the sort of accumulation of all those experiences and to the extent that you've found yourself to be kind of happy with what you re it's hard to then blame the experience you know I understand exactly what you're saying."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:42:46",
      "upperBoundTime": "00:42:50",
      "content": "Yeah not saying I want to stay here."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:50",
      "upperBoundTime": "00:43:18",
      "content": "I understand. I completely understand everything you're saying. You have been here for 23 years and for that time you surely have thought about the fact that you this could be it. Now when you're and you also know how you've changed, and what kind of a man you are. When you think about those two things together how do you cope with that?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:43:18",
      "upperBoundTime": "00:44:01",
      "content": "I'm not religious but I'm spiritual, and I think there's a way of causal actions and effects all right and whatever you want to call it whether it's God. The power, this energy whatever it is there's cause and effect in every religion there is that universal law. And I think quite possibly that it was karma that caused me to be here whether it was in a past life or this life."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:43:18",
      "upperBoundTime": "00:44:01",
      "content": "I'm not saying I believe in past lives I'm just saying that."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:01",
      "upperBoundTime": "00:44:03",
      "content": "I understand."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:03",
      "upperBoundTime": "00:44:55",
      "content": "There's got to be a reason you know this didn't just happen for no reason at all. I don't think it was just because I committed some violent act. So I do what I can take advantage of every opportunity I can and if in the end I'm here when I'm I be honest with you if I'm 70 years old and the law changes and I get paroled eligibility I'm 70 years old."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:03",
      "upperBoundTime": "00:44:55",
      "content": "Can't work can't go live a life, I might as well, I don't already established myself here what I got another 15 years of living to do at best. So I got a time frame of maybe 15 years, 20 years left of hope of getting out. If it happens awesome and there's a reason for that. If it doesn't I just deal with it and go back to becoming the best human being that I can and figuring out how I can leave my footprint right here."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:55",
      "upperBoundTime": "00:44:58",
      "content": "Right and this is also a fairly large community."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "So I mean it's not really about, I mean being on the street to me is like I said, my libido slowed down. It ain't about getting pussy or eating a steak or going accumulating all these goods and property and status and whatever. It ain't about that."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "It's about leaving my footprint I have a plan of I got a friend of mine she has 9 acres in Port Jervis, which is about two hours north of Brooklyn. She's kind of, we got same dream similar dream, she wants to start a bed n' breakfast I'd like to start a retreat a non-denominational kind of eclectic style retreat. Doesn't matter who you are or what you are, or where you're from, and where we go out here."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "And maybe whether you know one weekend it's open air painting classes, next weekend it's meditations and yoga or next the following weekend it's something whatever you want to do just to get away from the city and to be out here and to have an impact on your life."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "Also get to the point to where I could bring some of these kids that are troubled children out here maybe because I went to summer camp a couple times when I was young. That's impacted me, I can't really say how that's impacted me, but I've never forgotten those few months that I spent in a totally different atmosphere out in the woods with these people, that I don't know showing me different things like hiking, and how to build fires and whatever."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "So I think that it's important that people make places that are outside of their normal society, where you can go here and experience other people and life outside of, whether it's the city or the country, wherever you're from you're just being removed from your environment and put into a place where you can just focus, and not have to worry about anything else."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:44:58",
      "upperBoundTime": "00:47:15",
      "content": "Whether it's families or jobs or whatever, and like I said for adults too. I think there's adults that could go to a retreat and they've lived in the city their whole life and never experienced any of that, and it would be beneficial to them."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:15",
      "upperBoundTime": "00:47:18",
      "content": "Sure absolutely sure."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:47:18",
      "upperBoundTime": "00:47:57",
      "content": "So whether it ever becomes a reality or not I don't know but that's one of my. I do like I said I do metal sculptures and I do real well with them at the rodeo. I would like to do huge metal sculptures on this property, like a storey or two you know and that's something that be there for hundreds of years, but it's something that people could come to this place, and look at this stuff."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:47:18",
      "upperBoundTime": "00:47:57",
      "content": "That's one of the things I would like to use to draw it in along as well with my artwork but it's all about the footprint and I don't know."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:57",
      "upperBoundTime": "00:48:26",
      "content": "Right and so I understand. So there are also these other trades that you could fall back on in your vision. So aside from the vision of the retreat which I understand. Let's say if you get a favorable hearing everything goes as best as it can what else is part of that picture for you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:48:26",
      "upperBoundTime": "00:49:48",
      "content": "I have a she works for Carrie works for Paul Cox Industry which is he builds custom motorcycles pretty well known he's built bikes for Brad Pitt, Steven Tyler I mean he's pretty big."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:48:26",
      "upperBoundTime": "00:49:48",
      "content": "When you fire for your clemency you have to have two things is a residency plan and job offers. Well I got two job offers, both starting at like 35 an hour and one of them working for him doing airbrush and graphics and stuff on these bikes. The other one is her, his wife owns this building is damn near a city block but it has an art gallery in it, has a restaurant in it, a wine tasting place."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:48:26",
      "upperBoundTime": "00:49:48",
      "content": "There's several different business she owns the building. She doesn't own the business and she wants me to take care you know like the ground or property manager whatever."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:48:26",
      "upperBoundTime": "00:49:48",
      "content": "So I could do either of those the artwork on the bikes is appealing to me and I might very well mess with that to be financially secure, but again finances isn't what I'm aiming for. I think I'm too old to build anything financially so why even worry about it you know what I'm saying."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:48",
      "upperBoundTime": "00:49:50",
      "content": "How'd you meet Carrie?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:49:50",
      "upperBoundTime": "00:50:00",
      "content": "At the rodeo. Just coincidence that she lives in New York. She's actually from Washington and she's been in New York for probably the last 15 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:00",
      "upperBoundTime": "00:50:46",
      "content": "Cool. All right another possibly difficult area and this has to do with the victim. So when you look back on what happened you've been I completely understand this idea that it doesn't make sense to you why it happened and I get that. But when you look back on what happened and you think about the victim the victim's family, it's been 23 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:00",
      "upperBoundTime": "00:50:46",
      "content": "So you've been reminded every day for 23 years and you've been punished for it. So I think I'm anticipating that it's kind of a complicated feeling that you might have about what happened now when you think about it but how do you feel?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:50:46",
      "upperBoundTime": "00:51:33",
      "content": "Well I think that what I did is something that can't never be made up for you know no matter who I become or how much good I ever do. That's what the footprint thing is all about you know trying to make up trying to balance out, trying to be a better person to make an impact on other people's lives because of what I've done."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:50:46",
      "upperBoundTime": "00:51:33",
      "content": "I feel very guilty to a point that's one thing I really try to avoid that conversation with most people that know me. I've never even that I see every day, I've never even had that conversation with them because I don't know it makes me feel like less of a human."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:33",
      "upperBoundTime": "00:51:34",
      "content": "Sorry."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:51:34",
      "upperBoundTime": "00:51:44",
      "content": "Sorry."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:44",
      "upperBoundTime": "00:52:00",
      "content": "No problem."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:52:00",
      "upperBoundTime": "00:52:14",
      "content": "Like I said I can't explain why it happened, so it's hard for me to deal with it inside myself because I don't know."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:14",
      "upperBoundTime": "00:52:44",
      "content": "I understand. I understand and I'm sorry for taking you there. I think that also one of the things that happens is that you end up having a better understanding of the impact of those actions on the victim's family because you see your own family dealing with the impact of losing you."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:14",
      "upperBoundTime": "00:52:44",
      "content": "When you look back on your family, your incarceration who has it been hardest for of all of the folks who care about you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:52:44",
      "upperBoundTime": "00:53:32",
      "content": "Probably my mother. My father died two years ago, never came to visit me never sent me a penny, never sent me a letter, encouraged to call me or encouraged me to call him. But when we talked it was about what was going on with the farm, what was going on with his business, how was the weather, never even addressed me being in prison."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:52:44",
      "upperBoundTime": "00:53:32",
      "content": "I've actually quit talking to him, because I was like, man this is you know, never had a relationship with him before and obviously we weren't building a real one of the phone. It probably impacted my mother the most because she feel like she failed as a parent. It don't matter how much I tell her otherwise you know that's the way it is."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:32",
      "upperBoundTime": "00:53:50",
      "content": "You know she you're mother. It's always going to be hard. Do you get visits up here from any family or friends?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:50",
      "upperBoundTime": "00:55:15",
      "content": "Yeah, not a whole lot because they're out of state but whenever they can afford it. Like Carrie for the last five years she's come down twice a year. It's my brothers and stuff have been in the military and had jobs and families and careers and stuff. So they haven't come as much."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:50",
      "upperBoundTime": "00:55:15",
      "content": "In fact Daniel one that works in Washington is almost every time I call home to my mom's house to ask about him because he'll email every now and then but he's usually not in the united states for whatever reason can't talk about where he's at till he comes back, and then just isn't open with it."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:50",
      "upperBoundTime": "00:55:15",
      "content": "So we don't, I mean I'm probably closest to him growing up and now even, but it's weird because we talk the least. But I understand that its cause of his career you know, in fact he's not even married or have children. So his life has been his career, so we're most open with emotions and with each other."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:53:50",
      "upperBoundTime": "00:55:15",
      "content": "So he's came to visit maybe twice in the whole time, I've been here but I understand it's because you were in high school then college then the military and now your career not because he doesn't want to come. So I'm understanding about that. I chose to commit a crime halfway across the country. You know what I'm saying. I can't get mad at them."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:15",
      "upperBoundTime": "00:55:19",
      "content": "When was the last time you saw your mother?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:19",
      "upperBoundTime": "00:55:36",
      "content": "About a year ago. She comes to the rodeo pretty often. She doesn't like come sit in the visitors shed because of her hips and stuff she's got metal rods in her legs so she'd rather come to the rodeo where she can walk around, and sit when she wants to."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:36",
      "upperBoundTime": "00:55:56",
      "content": "I imagine it's very gratifying for you in spite of all the regret to be able to have your mom see you in the light that you are now, as opposed to never seeing you past that point just relying on phone conversations. She sees the man that you've become as well."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:56",
      "upperBoundTime": "00:57:56",
      "content": "She's got a whole house full of artwork that she wants to I told her I said the reason I told you to quit sending me money is so I can sell my paintings at the rodeo and I can support myself but if you come up here and take all my paintings I can't do that. I can't tell mom no. She says, \"Well I'll pay you for them.\" I said, \"No can't do that either so it's a catch 22.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:56",
      "upperBoundTime": "00:57:56",
      "content": "But in fact I hadn't talked to her in about 6 months. I kind of got upset with her, I mean I really it was about the clemency thing and she made the comment to me, that I was asking for she never did send me a letter. I got about 12, 13 letters of character reference whatever to send in with my package. I didn't get one from her."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:56",
      "upperBoundTime": "00:57:56",
      "content": "She always says that you know she's getting old and she forgets I think she does have, it does has ran in the family Alzheimer's maybe this that. But that could also be an excuse I don't really know. But she said that the comment that she made was that if I'm in prison, then she knows where I'm at and that I'm safe and she doesn't have to worry about me."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:56",
      "upperBoundTime": "00:57:56",
      "content": "Meaning that the person I am is that 16 year old kid that she knew, and she doesn't really know me now. She thinks that if I get out I'm going to still be that 16 year old kid that kept her up at night wondering if I was alive or dead and wondering where I was at, and what kind of crazy shit I was doing."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:55:56",
      "upperBoundTime": "00:57:56",
      "content": "I'm not that same person and no matter how much she sees what I'm doing now, she sees me for two or three hours twice a year at the rodeo. It's not changing her image of me, even though I'm telling her I've been certified in this, and I've accomplished this and I do this and I do this, it's not registering to her."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:56",
      "upperBoundTime": "00:57:58",
      "content": "Right she's still relating to the kid she knew."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:57:58",
      "upperBoundTime": "00:58:39",
      "content": "Right so I needless to say I got pissed off by that comment. I didn't say nothing to her I mean that's mom what are going to say. I just kind of brushed it off but didn't call for a few months and then just don't really know how to address that. I'm the type of person I don't let stuff whether it's you on a daily basis when we're around each other or family out there, I don't let stuff just kind sit over here, and fester. I feel it's best to address things."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:57:58",
      "upperBoundTime": "00:58:39",
      "content": "So when I do call again I got to address that and I don't really know how so that stopped me from calling."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:39",
      "upperBoundTime": "00:58:51",
      "content": "Yeah I understand that. So I was wrong in assuming that it's gratifying for you to be able to show your mother who you are now because she's still stuck back in the 90s."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:58:51",
      "upperBoundTime": "00:59:02",
      "content": "I mean it is gratifying to show her, it's aggravating when she doesn't see it when it's in her face, you know what I'm saying."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:02",
      "upperBoundTime": "00:59:29",
      "content": "I get it. So this also may seem like an odd question because it's prison but you really have I mean much more than most of the folks that I've talked to you know really are living at the sort of as best as you can here in Angola with respect to access, privilege, trust and so forth but what's the worst part of this place for you?"
    },
    {
      "speaker": "Jeffrey",
      "time": "00:59:29",
      "upperBoundTime": "01:00:49",
      "content": "Living on a razor's edge all the time because no matter how high you get you're still a convict. And one action can put you in the cell and take all that. Let's say I get a cell phone I get busted with it, I'm going to spend a year in the cell block at least."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:59:29",
      "upperBoundTime": "01:00:49",
      "content": "They got guys on the walk it's become so common they get busted with a cell phone, they going to go to the dungeon for 2 days, go to DB court get out of DB court get RTQ back to the same dorm maybe put in cell, or 90 days restriction over their head or something. If they get another write up then it get imposed."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:59:29",
      "upperBoundTime": "01:00:49",
      "content": "The higher you are or the more trust you have the more they feel betrayed, or that you abused their trust, or whatever when you do get in trouble. So for me getting any type of write up before was that it's going to be looked at more serious, and I'm going to because I have these people's trust and I was violating I was abusing that, then I'm get smashed."
    },
    {
      "speaker": "Jeffrey",
      "time": "00:59:29",
      "upperBoundTime": "01:00:49",
      "content": "Also since I been granted the hearing a year ago if I get a simple disobedience, anything, it's gone. It's out the window it's walking that razor's edge."
    },
    {
      "speaker": "Marcus",
      "time": "01:00:49",
      "upperBoundTime": "01:00:53",
      "content": "Stay on that razor."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:00:53",
      "upperBoundTime": "01:00:55",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "01:00:55",
      "upperBoundTime": "01:01:10",
      "content": "That makes a lot of sense too. Of the various things that you've done over the last 20 odd years, what do you think you're most proud of."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:01:10",
      "upperBoundTime": "01:01:28",
      "content": "My spiritual progress."
    },
    {
      "speaker": "Marcus",
      "time": "01:01:28",
      "upperBoundTime": "01:01:29",
      "content": "Tell me a little bit more about that."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:01:29",
      "upperBoundTime": "01:01:49",
      "content": "Like I said I'm not religious per se, but I meditate a lot practice breathing exercises, read ceaselessly from every, are you familiar with Aleister Crowley."
    },
    {
      "speaker": "Marcus",
      "time": "01:01:49",
      "upperBoundTime": "01:01:52",
      "content": "No."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:01:52",
      "upperBoundTime": "01:02:42",
      "content": "Well I read a lot of esoteric stuff and really believed in vibrational theory and that there's a lot of universal laws and abilities that we have that we don't put into practice you see. I think that that can be utilized in our life. We create our own luck we create our future you know by not only what we do but what we think and what we say I think we're putting that out there you know. It comes back around to us."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:01:52",
      "upperBoundTime": "01:02:42",
      "content": "So I spend a lot of time studying reading and trying to apply what I can apply."
    },
    {
      "speaker": "Marcus",
      "time": "01:02:42",
      "upperBoundTime": "01:02:48",
      "content": "Alistair Crowley is someone who writes about this?"
    },
    {
      "speaker": "Jeffrey",
      "time": "01:02:48",
      "upperBoundTime": "01:03:04",
      "content": "No, Alistair Crowley was a famous I don't even really know what to call him a lot of people say he was a magician. He was ostracized by the esoteric community for putting out secret knowledge he lived 150 years ago."
    },
    {
      "speaker": "Marcus",
      "time": "01:03:04",
      "upperBoundTime": "01:03:08",
      "content": "I'll look him up learn about him."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:03:08",
      "upperBoundTime": "01:04:35",
      "content": "Yeah but I he's one of the people that I look to the most because he was open with information that nobody else was. But anyways there's things that I've studied, everything from Christianity to Islam, read the Bhargava Gita. Done a whole bunch of studying seeking and I just come to the realization that it's all the same damn thing you know what I'm saying."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:03:08",
      "upperBoundTime": "01:04:35",
      "content": "I mean it's just a different deity under a different name or whatever but it's all about the same thing. So I just went on my own journey reading various things, studied all the way up to 8th degree Wicca until I realized that's just a bunch of women trying to prove their power in the world ,you know it's you know, everybody's got their agenda."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:03:08",
      "upperBoundTime": "01:04:35",
      "content": "So I think that if you can tap into the resources inside your own subconscious, and your own being, to be who you think you're meant to be, or just to be open to change instead of getting close minded in ideas and concepts, that who you're supposed to be, you'll attain that."
    },
    {
      "speaker": "Marcus",
      "time": "01:04:35",
      "upperBoundTime": "01:04:52",
      "content": "Yeah and I think also maintaining some kind of sort of spiritual health and mental health is that much more challenging because you're trying to do that in prison where it just about everything is working against that and I think that's something that most people don't understand it's that much more of an accomplishment to remain healthy and sane."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:04:52",
      "upperBoundTime": "01:05:37",
      "content": "Yeah especially when I mean a lot of people the only source of that here in this prison is going to church in the chapel. It's all the same dogma no matter what religion it is. I'm kind of jaded in that because of my childhood and growing up in that. But I do give it a chance but now I see it's really not to shit on anybody else, but it my viewpoint or perspective of it is here, it's a political game."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:04:52",
      "upperBoundTime": "01:05:37",
      "content": "Well on the street it's the Sunday morning when everybody gets to dress up and place nice and then go back to their normal life. I mean it's not you know I just don't see the benefit of it other than everybody needs to believe in something."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:37",
      "upperBoundTime": "01:05:38",
      "content": "Yeah I get it."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:05:38",
      "upperBoundTime": "01:05:41",
      "content": "So I don't knock it just wasn't for me."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:41",
      "upperBoundTime": "01:05:42",
      "content": "Yeah sure."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:05:42",
      "upperBoundTime": "01:06:21",
      "content": "So I had to, like I said I spent a lot of money on books, and stuff that I order and get through the mail and sometimes I wonder, am I just reading what mainstream media will allow me to read because anything that's real out there that's not mainstream. I'm not going to get it buying it off of Amazon."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:05:42",
      "upperBoundTime": "01:06:21",
      "content": "So how restricted, am I really learning what I need to learn and again it comes to I'm at where I'm at in life, and I got to make the best of what I can and if I was meant to have more knowledge, or understanding in the future I guess I'll get it, if not whatever."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:21",
      "upperBoundTime": "01:06:25",
      "content": "Well for what it's worth and you can get a penny for it it's on Amazon."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:06:25",
      "upperBoundTime": "01:06:27",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:27",
      "upperBoundTime": "01:06:39",
      "content": "So I again I'm going to ask you the same question I asked when we finished up talking about your childhood, is there something else that I should know about you, or something else that you think I should have asked you."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:06:39",
      "upperBoundTime": "01:06:41",
      "content": "About prison or?"
    },
    {
      "speaker": "Marcus",
      "time": "01:06:41",
      "upperBoundTime": "01:06:49",
      "content": "About anything yeah about who you are."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:06:49",
      "upperBoundTime": "01:06:51",
      "content": "No, I think we pretty much covered it."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:51",
      "upperBoundTime": "01:07:10",
      "content": "Well I've got one last question you raised this earlier in the interview and that's what I'm going to kind of circle back to it that you were raised with this idea that you know for you it wasn't race was just kind of completely insignificant because you were never kind of confronted with dealing with any kind of racial diversity right."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:07:10",
      "upperBoundTime": "01:07:12",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "01:07:12",
      "upperBoundTime": "01:07:34",
      "content": "Then you get thrown into the opposite environment here where whites are a minority and I've heard people say that well, even if whites are a minority, whites still get certain privileges that blacks don't. You've been living here for 20 years, can you tell me about race here at Angola?"
    },
    {
      "speaker": "Jeffrey",
      "time": "01:07:34",
      "upperBoundTime": "01:09:18",
      "content": "I don't think there's any set I think what's I heard a story one time probably read it in a book I don't know where I read it. But there's a guy who's travelling he came to this town, he's on a hill and looking down on this town, there's a guy sitting under a tree an old man and he said, \"What sort of people is it in this town?\" The old man asked him, \"What sort of people is it whence you came.\" And he said, \"Aw they're evil and hateful people.\" And he said, \"Well you'll find that people here are the same.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "01:07:34",
      "upperBoundTime": "01:09:18",
      "content": "So the guy moved on past the town and wanted nothing to do with it. Same thing happened a couple days later, another traveler comes the old man answered the same exact question. The old man asks him the same exact question what sort of people whence you came he said, \"Oh kind and friendly.\" He said, \"You'll find the people here are the same.\""
    },
    {
      "speaker": "Jeffrey",
      "time": "01:07:34",
      "upperBoundTime": "01:09:18",
      "content": "I think that's how the prison is you know. if you're looking for hatred and racism and poor old me I'm the minority because I'm black or I'm the minority because I'm white and I'm prison or I'm the minority because my people were enslaved 200 years ago or I'm abused, whatever kind of way you want to be abused that's how you're going to be abused you know."
    },
    {
      "speaker": "Jeffrey",
      "time": "01:07:34",
      "upperBoundTime": "01:09:18",
      "content": "Do other people show favoritism? Oh absolutely I got redneck bosses that that's what they are redneck bosses. But I also know some rednecks that can't stand the white man because he's smart and he's going to be the one that runs off or he's going to be the one that gets by you where I can catch this brother because he ain't too bright. So I know what he's doing. I know what he's about so you going to show favoritism towards the brothers instead of towards me because you don't trust me."
    },
    {
      "speaker": "Marcus",
      "time": "01:09:18",
      "content": "Jeff thank you so much."
    }
  ]
}
