{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Jerome Derricks_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:00",
      "content": "Al right, so let's start by having you just set the record by stating your name, the crime of conviction, how old you were and how much time you've served."
    },
    {
      "speaker": "Jerome",
      "time": "00:00:00",
      "upperBoundTime": "00:00:12",
      "content": "Okay. My name's Jerome Derricks. I'm serving a life sentence for second degree murder and so far I've served 33 years to life sentence."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:12",
      "upperBoundTime": "00:00:14",
      "content": "And how old were you?"
    },
    {
      "speaker": "Jerome",
      "time": "00:00:14",
      "upperBoundTime": "00:00:19",
      "content": "I was just had turned 20 at the time of the crime."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:19",
      "upperBoundTime": "00:00:39",
      "content": "Alright, and tell me. I said to you earlier that I really just want to learn about your life and so the first makes sense to start with your early childhood. And tell me a little bit about the family that raised you, the folks that raised you?"
    },
    {
      "speaker": "Jerome",
      "time": "00:00:39",
      "upperBoundTime": "00:01:23",
      "content": "My mom really was the primary caregiver when I was coming up. My mom and dad divorced when I was a year old. I'm originally from St. Louis and when my mom and dad divorced, my mom moved back down here to Louisiana and I was still about a year and a half so I really didn't have any association with my dad because I really didn't know him I didn't know him until I turned 18 and drove back to St. Louis to see him and we still didn't have any real communication with one another. We might've spent 30 minutes with him at the most and that was it. And that was the last interaction I had with my biological father."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:23",
      "upperBoundTime": "00:01:27",
      "content": "Were there men who came into your mother's life? Who then came into your life?"
    },
    {
      "speaker": "Jerome",
      "time": "00:01:27",
      "upperBoundTime": "00:02:06",
      "content": "Yes, my step-father and I think I was around 7 or 8 when she re-married but, we really didn't have a close relationship. Like I said, my mom was primarily the one that really raised me. We had the connection. But my step-father was a good man though. He was a good man. It's just that I didn't have that male-dominant figure in my life to teach a boy to become a man. I didn't have that. Never had that."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:06",
      "upperBoundTime": "00:02:10",
      "content": "Sure, so what about siblings? Did you have brothers and sisters?"
    },
    {
      "speaker": "Jerome",
      "time": "00:02:10",
      "upperBoundTime": "00:02:14",
      "content": "I had, I still have 2 brothers and one sister."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:14",
      "upperBoundTime": "00:02:16",
      "content": "Where are you in that birth order?"
    },
    {
      "speaker": "Jerome",
      "time": "00:02:16",
      "upperBoundTime": "00:02:20",
      "content": "I'm the second oldest. I'm the second oldest."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:20",
      "upperBoundTime": "00:02:24",
      "content": "The second oldest- so you had a younger sibling then by a different father."
    },
    {
      "speaker": "Jerome",
      "time": "00:02:24",
      "upperBoundTime": "00:02:27",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:27",
      "upperBoundTime": "00:02:29",
      "content": "Where did you grow up in Louisiana?"
    },
    {
      "speaker": "Jerome",
      "time": "00:02:29",
      "upperBoundTime": "00:02:30",
      "content": "In Gun Sales, Covington"
    },
    {
      "speaker": "Marcus",
      "time": "00:02:30",
      "upperBoundTime": "00:02:33",
      "content": "Sure, not far from here."
    },
    {
      "speaker": "Jerome",
      "time": "00:02:33",
      "upperBoundTime": "00:02:36",
      "content": "Not far."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:36",
      "upperBoundTime": "00:02:45",
      "content": "So tell me a little bit about that. If I was, I'm trying to get a picture of Gun Sales. I drive through there. I haven't spent very much time there, so what's it like?"
    },
    {
      "speaker": "Jerome",
      "time": "00:02:45",
      "upperBoundTime": "00:03:43",
      "content": "Back then, I tell you, it was great. Because I used love to hunt and fish and I could go in the back yard and stand on the porch and watch deer's pass through and stuff like that so I was, I guess you could say a, outgoing person."
    },
    {
      "speaker": "Jerome",
      "time": "00:02:45",
      "upperBoundTime": "00:03:43",
      "content": "I loved to go in the woods, camping, hunting, and stuff like that and I remember when I got my first gun, a 410, and used to stay in the wood, I didn't care if I had shot anything or not I just liked to go in the woods hunting and thinking I'm Daniel Boone or something walking woods and stuff and it was, I had a real good upbringing as a child."
    },
    {
      "speaker": "Jerome",
      "time": "00:02:45",
      "upperBoundTime": "00:03:43",
      "content": "I wasn't really deprived of anything. And like I said, my mom, she was more influential in my life than anything and got along well with my siblings. We had our little tussles every now and then but we all love one another just what kids do."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:43",
      "upperBoundTime": "00:03:46",
      "content": "Was there a lot of fighting in your home?"
    },
    {
      "speaker": "Jerome",
      "time": "00:03:46",
      "upperBoundTime": "00:04:01",
      "content": "No. There was very little of that. My step dad and my mom, they would get in little arguments but nothing real serious and I can only remember a couple of times that they did that really."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:01",
      "upperBoundTime": "00:04:13",
      "content": "So is it safe for me to say that even though your father was not in the home, you grew up in a home where you knew that there were adults that cared for you, loved you, as opposed to feeling like you kind of had to make it on your own?"
    },
    {
      "speaker": "Jerome",
      "time": "00:04:13",
      "upperBoundTime": "00:05:42",
      "content": "Well, yeah. That's pretty safe to say. But deep within me, there as a hurt and I talked to my mom about it because I couldn't understand how a father did not want to find out how his son was doing. It was just me and my older brother by the same dad and it always was in the back of my mind, why wasn't this man reach out to find out how his sons are doing?"
    },
    {
      "speaker": "Jerome",
      "time": "00:04:13",
      "upperBoundTime": "00:05:42",
      "content": "And that really kind of bothered me for a long time and I've talked about that so much even to my members and I told them how it affected me because I'm like, was it something we did? Why would he just cut off all communications with his sons? A man wants, to know about his sons because, they're the ones that carry on his legacy and I'm like, well, I just don't get this."
    },
    {
      "speaker": "Jerome",
      "time": "00:04:13",
      "upperBoundTime": "00:05:42",
      "content": "Why wouldn't he send a birthday card? Why wouldn't he call? Why wouldn't he come see us or let us know anything? I didn't know anything about my father and that really just really ate at me for a long time. Even when I came to prison and told me story about that how it affected me because I said I could never do that to my kid. I could never do that and we'll talk about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:42",
      "upperBoundTime": "00:05:45",
      "content": "Sure, so did you ever get any answers to these questions from your dad?"
    },
    {
      "speaker": "Jerome",
      "time": "00:05:45",
      "upperBoundTime": "00:06:34",
      "content": "Neither my mom, because I tried to find out what broke them up and my dad, like I said, when I turned 18 and went back to St Louis to see him, I had bought my first car and I drove up there with my uncle to go see him because I wanted to try to get these answers, but instead of he and I spending time together, my dad and my uncle went out and left me at the house with my step-mom and my step-brother and sister and I'm like, \"man I come up here to see this guy and he still doesn't spend any time with me to answer the questions that I have.\" and I'm like. I told my uncle. I said \"I'm leaving in the morning,\" and I left. I didn't have any more. I tried."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:34",
      "upperBoundTime": "00:06:35",
      "content": "What kind of car was it?"
    },
    {
      "speaker": "Jerome",
      "time": "00:06:35",
      "upperBoundTime": "00:06:44",
      "content": "Yes I do. A 73 Cutlass, orange. That was my first car."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:44",
      "upperBoundTime": "00:06:51",
      "content": "So, tell me a little bit about school. So, how was school for you in Gonzales?"
    },
    {
      "speaker": "Jerome",
      "time": "00:06:51",
      "upperBoundTime": "00:07:26",
      "content": "I loved school. Pretty bright. I'm not going to say a whiz kid or nothing like that but, I guess you could say I was an athlete because I played every sport there was to play, ran track, I played football. I played basketball. Played baseball. I loved sports so I was always an active kid. And I guess me and my cousin, we really grew up together doing everything together, and when I tell you my school years was great, they were great. They were great."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:26",
      "upperBoundTime": "00:07:29",
      "content": "That's great. What was the highest grade that you went to?"
    },
    {
      "speaker": "Jerome",
      "time": "00:07:29",
      "upperBoundTime": "00:07:31",
      "content": "I graduated from Eastern high school."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:31",
      "upperBoundTime": "00:07:36",
      "content": "Alright, and what was the name of your elementary and middle schools?"
    },
    {
      "speaker": "Jerome",
      "time": "00:07:36",
      "upperBoundTime": "00:07:37",
      "content": "Dutch town."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:37",
      "upperBoundTime": "00:07:44",
      "content": "Alright, so, you're 18, you graduate. Then what happens?"
    },
    {
      "speaker": "Jerome",
      "time": "00:07:44",
      "upperBoundTime": "00:07:58",
      "content": "Well, you never asked about the problems that I think contributed. Okay. Because some of that was during school. We'll talk about that later."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:58",
      "upperBoundTime": "00:08:03",
      "content": "Okay, so I was going to ask you about- you said you liked school. Did you ever get kicked out?"
    },
    {
      "speaker": "Jerome",
      "time": "00:08:03",
      "upperBoundTime": "00:08:04",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:04",
      "upperBoundTime": "00:08:09",
      "content": "Okay, so well, go ahead and tell me about some of these problems then."
    },
    {
      "speaker": "Jerome",
      "time": "00:08:09",
      "upperBoundTime": "00:09:44",
      "content": "Like I said, my step-dad was great guy, but he loved to drink. He never got physical or anything while he drank, he just loved to drink so he used to send me to the store to get a half a pint of vodka here and there because that's what he drank so I think"
    },
    {
      "speaker": "Jerome",
      "time": "00:08:09",
      "upperBoundTime": "00:09:44",
      "content": "I started drinking. I used to take the alcohol out the bottle, pour me a shot of whatever and put water in it to keep him from knowing but I started doing that when I was about 13 years of age so by the time I got to high school, when I wake up in the morning, I had to get me a shot so when I look back over my life as to what do I think contributed to me being here."
    },
    {
      "speaker": "Jerome",
      "time": "00:08:09",
      "upperBoundTime": "00:09:44",
      "content": "I would have to say, first of all, it had to be the alcohol because I wouldn't consider myself a drunk or anything like that but I drunk before I even went to school. Nobody ever knew. My teachers didn't know. My parents didn't know."
    },
    {
      "speaker": "Jerome",
      "time": "00:08:09",
      "upperBoundTime": "00:09:44",
      "content": "The only person that knew was maybe because like I said, I was always good in school, never caused problems in school and I did the work that was required in school and I was an athlete. So nobody really picked up on the signs that I had a drinking problem because if I didn't drink, I just didn't feel right but I didn't understand it at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:44",
      "upperBoundTime": "00:09:47",
      "content": "What about in the evenings?"
    },
    {
      "speaker": "Jerome",
      "time": "00:09:47",
      "upperBoundTime": "00:10:00",
      "content": "I drunk in the evenings too, but I said, I never got drunk when I drunk so I wouldn't consider myself a drunk or anything like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:00",
      "upperBoundTime": "00:10:05",
      "content": "Do you think you were maybe self-medicating for something?"
    },
    {
      "speaker": "Jerome",
      "time": "00:10:05",
      "upperBoundTime": "00:10:07",
      "content": "Could have been."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:07",
      "upperBoundTime": "00:10:11",
      "content": "A lot of times when people are sort of maintaining a certain."
    },
    {
      "speaker": "Jerome",
      "time": "00:10:11",
      "upperBoundTime": "00:11:21",
      "content": "And then I got into smoking marijuana. Because I think I was about maybe 16 when I started doing that and that was more of a peer pressure thing than anything because at that time, you want to fit in and what your surroundings and when I smoked, I never did heavy drugs or anything like that, I mean, you shouldn't do any but my understanding and my philosophy is that marijuana mellows you out, so nobody goes do anything stupid when they're on marijuana."
    },
    {
      "speaker": "Jerome",
      "time": "00:10:11",
      "upperBoundTime": "00:11:21",
      "content": "So, and I started doing that, but I was still drinking and I was so I'm thinking that putting all this together, that I had a drug problem because I kind of, I guess you could say, became dependent on it. I just didn't feel right if I didn't do it."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:21",
      "upperBoundTime": "00:11:23",
      "content": "And still more the alcohol than the marijuana?"
    },
    {
      "speaker": "Jerome",
      "time": "00:11:23",
      "upperBoundTime": "00:11:30",
      "content": "Oh yeah- that was the main thing. That was the main thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:30",
      "upperBoundTime": "00:11:43",
      "content": "So, school and you must be doing this in a way that's quite clever. Because you're not having it interfere with anything."
    },
    {
      "speaker": "Jerome",
      "time": "00:11:43",
      "upperBoundTime": "00:11:56",
      "content": "I was good at it. I was good at it. I never had a DWI, and I used to drive and drink all the time. I've never had a DWI, never had a wreck. Never got a ticket or anything like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:56",
      "upperBoundTime": "00:12:04",
      "content": "Sure. So you graduate from high school. What are your plans at that point?"
    },
    {
      "speaker": "Jerome",
      "time": "00:12:04",
      "upperBoundTime": "00:12:31",
      "content": "I was working at the time that I graduated so I had a job already. I was working at a plant. So I was working at the plant. My plans was to actually get married. To my fiancé, but never happened because it was like I said, about a couple of years after I graduated when I got locked up."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:31",
      "upperBoundTime": "00:12:36",
      "content": "So, I was about to ask you about intimate relationships and children. Do you have any children?"
    },
    {
      "speaker": "Jerome",
      "time": "00:12:36",
      "upperBoundTime": "00:12:46",
      "content": "I have one daughter. She is 35 years of age. I have three grandkids one's 16, one's 6 and one is 2 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:46",
      "upperBoundTime": "00:12:53",
      "content": "Okay, well tell me about them. Have you managed to maintain a relationship?"
    },
    {
      "speaker": "Jerome",
      "time": "00:12:53",
      "upperBoundTime": "00:13:53",
      "content": "Great. Oh yeah. Even though I came to prison, I said that I would make sure that my daughter would have a close relationship with me that she would know her dad and I thank her mom on the most part for that because when I got locked up, my daughter was 2 years old. And she told me \"I'm going to make sure that your daughter knows you and you know your daughter.\" She brought my daughter up here like every other week to see me until she turned 18."
    },
    {
      "speaker": "Jerome",
      "time": "00:12:53",
      "upperBoundTime": "00:13:53",
      "content": "Then she came and said \"She's 18. She's on her own now she can come if she want to come. I did my job\" I said \"Thank you.\" Yeah, so me and my daughter, matter of fact, my daughter just got married on the 18th of last month and I and my daughter have a real close relationship. Love her to death. Loves her dad. She was at the pardon board hearing and everything, so we stay in contact every day."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:53",
      "upperBoundTime": "00:13:54",
      "content": "Yeah, so what about your grandkids?"
    },
    {
      "speaker": "Jerome",
      "time": "00:13:54",
      "upperBoundTime": "00:14:15",
      "content": "Grandkids are just a trip, they're something. My grandson, my first grandson looks identical to me. I was like \"wow\" they put two baby pictures of mine and his and we looked like twins I was like \"wow.\" But they are great. They are great."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:15",
      "upperBoundTime": "00:14:17",
      "content": "Do they come up for the rodeo?"
    },
    {
      "speaker": "Jerome",
      "time": "00:14:17",
      "upperBoundTime": "00:14:17",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:17",
      "upperBoundTime": "00:14:19",
      "content": "Will they be here in October?"
    },
    {
      "speaker": "Jerome",
      "time": "00:14:19",
      "upperBoundTime": "00:14:22",
      "content": "They should be here in October, the second or third Rodeo."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:22",
      "upperBoundTime": "00:14:25",
      "content": "Okay and do you sell hobby craft?"
    },
    {
      "speaker": "Jerome",
      "time": "00:14:25",
      "upperBoundTime": "00:14:26",
      "content": "I'm an artist. I paint."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:26",
      "upperBoundTime": "00:14:30",
      "content": "Okay. Oil Paint?"
    },
    {
      "speaker": "Jerome",
      "time": "00:14:30",
      "upperBoundTime": "00:14:43",
      "content": "And yes I do, Acrylic. I love Acrylics. Oils take too long and messy and only time I use oil is if I'm doing a portrait. Yeah, they come up and we be out there and visit, eat together, pray together, talk together."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:43",
      "upperBoundTime": "00:14:54",
      "content": "Sure, so let me ask you this. Did you, you're managing to go to school all this time you're telling me so what about brushes with the law?"
    },
    {
      "speaker": "Jerome",
      "time": "00:14:54",
      "upperBoundTime": "00:14:56",
      "content": "Never. Never ever."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:56",
      "upperBoundTime": "00:15:07",
      "content": "Okay so two years after high school, you end up getting a murder charge. Can you just briefly explain how we go from A to B.?"
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "Yes. It's really simple. When I look back and understand what caused this to happen because this was nothing that I just all of a sudden set up and said \"well, I'm just going to kill somebody today.\" It wasn't like that. I and my mom had an argument and after that argument, I said \"Well, I'll just go get drunk or just start drinking\" So, I was drinking but I'm feeling good and everything and I went by a friend's house and said \"Well, we going to smoke.\" But what I didn't know was that what I was smoking was not marijuana. What I was smoking is what some people call PCP, but it was they take embalming fluid and dip the joint in the embalming fluid- didn't know what I was smoking."
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "They called it Clicker and when I smoked this, it was like I was out of my body because I had lost total reality for two days. But I do know that I did it. There's no doubt about that and I never tried to downplay the fact that I actually took someone's life, an innocent person's life, but God knows that this was not anything that was planned. No motive, no reason or anything behind this. It is. So, I told my sister, I said, \"Well, listen, if you ever hear anything about a click em asuram or whatever, don't mess with and I remember telling my sister that, but, this was nothing planned or anything like that."
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "I've never been in trouble. No record, no brushes with the law or anything. I was a registered voter. I did everything by the book until that particular time but nobody looks at the fact that, the person you were before this or anything like that, I mean, they never even asked \"Well what caused this\" Or anything. They didn't care."
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "All they knew is that you took this person's life so now we going to crucify you. And that's just the way it is, when I come to prison, I'm like I was bitter because I was in prison because I understood to take a person's life, naturally, there's going to be consequences behind that, but nobody really, looked to say \"What caused this is a person, what caused him to do this?\" It's like they don't care what caused it."
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "They don't care what it did. Now, I understand that it was my choice to smoke, but like I said, I didn't know exactly what I was smoking. I should've been smoking anything but like I said, it wasn't planned or anything like that. There's no reason for me to do that. And that's been eating at me for years and years and years, especially having to explain that to your daughter when she's asking you, \"When are you coming home.\" That was the hardest thing, trying to explain to her, what happened. Because she used to always ask me \"Daddy, what happened?\""
    },
    {
      "speaker": "Jerome",
      "time": "00:15:07",
      "upperBoundTime": "00:19:12",
      "content": "And trying to put that in words to her because my daughter knows me well. She knows the kind of person that I am. My community knows the kind of person that I am. I've always been productive in my community. Who went to church on the street? I didn't just start going to church when I come to prison. And like I said, I was doing the right things and yeah, I made mistakes but society paints a picture on you like you're this terrorist or this person that has always doing bad. That's not who I am."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:12",
      "upperBoundTime": "00:19:27",
      "content": "Yeah, they had that act define who you are. Sure and it's a label. Yeah, it must've been horrifying to you to come to the consciousness of the reality of what had happened."
    },
    {
      "speaker": "Jerome",
      "time": "00:19:27",
      "upperBoundTime": "00:19:39",
      "content": "It was. I thought about suicide in the early stages of it. But, I guess God had other plans."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:39",
      "upperBoundTime": "00:19:49",
      "content": "Yeah. And not having any memory of it is even more frightening in terms of your feeling of having agency and control over what you do."
    },
    {
      "speaker": "Jerome",
      "time": "00:19:49",
      "upperBoundTime": "00:20:29",
      "content": "Right. Yeah, that's I guess that's the most frightening thing is because when I did realize what I had did, I tried to make right of it. Because I was terrified. After I found out what I had did and I'm like \"Man, what am I going to do?\" And I'm thinking, oh man, they're going to kill me. So I'm really terrified now and I'm like, well, it is what it is and I don't know what to do so, I guess you just in a catch 22?"
    },
    {
      "speaker": "Marcus",
      "time": "00:20:29",
      "upperBoundTime": "00:20:34",
      "content": "Sure, so I imagine that you spent a little bit of time in a parish prison while you're going through trial."
    },
    {
      "speaker": "Jerome",
      "time": "00:20:34",
      "upperBoundTime": "00:20:39",
      "content": "About 6 months at the most, and then I come here."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:39",
      "upperBoundTime": "00:20:43",
      "content": "Do you remember the trial? Or was it kind of a haze?"
    },
    {
      "speaker": "Jerome",
      "time": "00:20:43",
      "upperBoundTime": "00:20:47",
      "content": "Yeah, it's more it wasn't a trial at all."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:47",
      "upperBoundTime": "00:20:48",
      "content": "Oh, did you just plea?"
    },
    {
      "speaker": "Jerome",
      "time": "00:20:48",
      "upperBoundTime": "00:21:08",
      "content": "Yeah. It wasn't a trial at all. I mean, like I said, I knew I had did something wrong and I talked with my parents, I talked with my lawyer and everything, I'm like, I did this. I know that there's going to be consequences."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:08",
      "upperBoundTime": "00:21:31",
      "content": "Well, so you come here 33 years ago. Angola is a very different place then and what's more is that you weren't in anyway associated with that kind of criminal lifestyle that might have primed you for this kind of experience from a juvenile facility or something like that."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:31",
      "upperBoundTime": "00:21:34",
      "content": "Don't know anything. Don't know none."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:34",
      "upperBoundTime": "00:21:37",
      "content": "Alright tell me about your first few months here."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:37",
      "upperBoundTime": "00:23:51",
      "content": "I was scared as hell. The first thing I seen when I got here was a guy get his head bashed in to the iron mountain ringer. I mean, blood just gushed all over the wall and everything and I was like \"Lord I know I ain't going to make it\" I'm like I'm 140lbs, 5 feet 5, I'm look at these big old guys up in here."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:37",
      "upperBoundTime": "00:23:51",
      "content": "I'm like I'm just going to let it happen quick and get it over with because I had, I guess you can say, putting my mind at, okay, you're not going to make it. You going to die here so just let it be quick, get it over with. This is done. Because I had took a life so I figured, if I take a life, if somebody take my life, justice is done."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:37",
      "upperBoundTime": "00:23:51",
      "content": "That's the way I felt and like I said, at times, I thought about taking my own life because I said well, \"A life for a life, just mine as well go on and end it\" I come close a couple of times of just doing it out of depression, like especially after visits with my daughter and stuff like that. It was hard. I'm not going to say it wasn't hard. It was hard. But, I got stronger over the years."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:37",
      "upperBoundTime": "00:23:51",
      "content": "I had time to reflect and what my life would be if I had to stay here and then I started noticing the need here of the people that was illiterate and I couldn't believe that all of the people that couldn't read so I said okay well, I could do some good here so I started tutoring guys, older guys that couldn't even write their names, and I started feeling a self-worth."
    },
    {
      "speaker": "Jerome",
      "time": "00:21:37",
      "upperBoundTime": "00:23:51",
      "content": "I said, well, I could give some back like that, all the while still dealing with the fact that I took a life, an innocent life and even today that still, it's hard sometimes thinking about it so I can't imagine how the family feel, they lost a loved one."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:51",
      "upperBoundTime": "00:23:53",
      "content": "Well, your family did too."
    },
    {
      "speaker": "Jerome",
      "time": "00:23:53",
      "upperBoundTime": "00:24:27",
      "content": "True and I know it dealt with my mom because like I said, we had a close relationship and just to see the hurt in her face, it's like it just tore me apart. Even my sister, like no, not my brother, like that. And having to look her in the face and let her know \"Yeah, your brother\" I mean, it just- it does something to you. It does something to you, but."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:27",
      "upperBoundTime": "00:24:35",
      "content": "Of all the folks who've had to go through this with you and your family, who do you think took it the worst?"
    },
    {
      "speaker": "Jerome",
      "time": "00:24:35",
      "upperBoundTime": "00:24:37",
      "content": "My mom."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:37",
      "upperBoundTime": "00:24:38",
      "content": "Is she still with us?"
    },
    {
      "speaker": "Jerome",
      "time": "00:24:38",
      "upperBoundTime": "00:24:43",
      "content": "Yes. She's 74 now."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:43",
      "upperBoundTime": "00:24:45",
      "content": "Okay, is she still able to make it up here?"
    },
    {
      "speaker": "Jerome",
      "time": "00:24:45",
      "upperBoundTime": "00:24:49",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:49",
      "upperBoundTime": "00:24:59",
      "content": "Yeah, do you think your family have, how do they make sense of on what happened?"
    },
    {
      "speaker": "Jerome",
      "time": "00:24:59",
      "upperBoundTime": "00:25:40",
      "content": "Well, like I said, my family know that I've always been a good person. I've treated people with respect all my life. I've never did any violence to anybody in my entire life so they knew that something had to happen for him to snap like he snapped and take a life because that's not my character. That's not who I am. And it was hard for them to believe that I did this. You couldn't tell them that I did this, even me telling them that I did this, they wouldn't accept it. No, that's not who you are. So, it was really hard on them."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:40",
      "upperBoundTime": "00:25:45",
      "content": "Sure, and you never had access to a firearm. Other then you said you were."
    },
    {
      "speaker": "Jerome",
      "time": "00:25:45",
      "upperBoundTime": "00:25:48",
      "content": "My little 4/10 gun that I got as a teenager that was it."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:48",
      "upperBoundTime": "00:25:49",
      "content": "And this didn't involve a firearm."
    },
    {
      "speaker": "Jerome",
      "time": "00:25:49",
      "upperBoundTime": "00:25:53",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:53",
      "upperBoundTime": "00:26:18",
      "content": "So, drugs and alcohol were, part of your life and of course, you look back on it now, that's what you were referring to earlier that's that when the problem started because it left you open and wanting to experiment on things that was want to happen. Did you find that you really had to do some work on drugs and alcohol once you came here? Did you seek out drugs and alcohol here?"
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "When I first got here, I felt as though everything was over with anyway, so I mean, I had drugs and alcohol here when I got here so like- wow? We got the same stuff here as they got on the street. So, I kind of got into first finding out how to live in prison. Because, like I said, I didn't know anything at all. All I knew that I stood a chance of dying here wasn't never afraid of anything so I said well, I'm just take the first couple of weeks and see what happens because I didn't think I was going to get past the first week anyway? So I just said, I'm going to see what happens."
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "It was just shocking because when I got here, they had guys with breasts. And that's something that I had never seen in my life. I'm like is that real? I mean, like I said, all of this is new to me. So, I'm like \"wow.\" So I got this deal with this, now I'm like- first of all, am I even in the right place? So I'm like \"Oh my God.\" Then I started thinking about stories that I heard about prison. Because that's all I ever heard was stories. Like I said, never even visit a prison, never even visit a jail cell or anything so I don't know nothing."
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "I'm green as the grass on the ground so I'm trying to process this. I'm trying not to show my fear because I was terrified but I knew I would have defended myself if need me. I said I'm just going to go out with a bang you understand. Because you in prison, you don't want to feel weak or anything. So after the first week, I said, who I got through the first week. So then you get your job, they put you in the field. Something I said I would never do pick cotton, and sure enough, first thing I do is get in the field pick cotton and I'm like \"Wow\" I actually remember saying I couldn't have been in the slave days because they could have never made me pick no cotton and that's the first darn thing I do when I come to prison is pick cotton."
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "So I'm mad about that now. I'm like wow, never say what you're not going to do for one thing because it might come back and bite you and like I said, I've always worked. It's not funny- you ever pick cotton before? So, I was pretty good at picking cotton, ain't that something so like I said, I've always worked all my life so, I'm thinking like well, I've got to let them know I can handle my own because everybody gets a cup and they'll tell you this your row, that's your row so and then if you don't keep up with it, they lock you up, you go to dungeon."
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "So I said, no I've always been a worker so I'm going to carry my own. So I did that but then I said I just don't want to keep doing this so after 90 days you can do a job change. So that's what I did I put in for a job change then I moved out of the field and put into the kitchen."
    },
    {
      "speaker": "Jerome",
      "time": "00:26:18",
      "upperBoundTime": "00:30:01",
      "content": "So I always was a pretty good cook, still a pretty good cook and I started cooking, I started doing that. I started thinking about the guys that I was living around who used to come to me and read letters for them and write their letters for them so I said I know how I can help these guys so I became a tutor and I started…"
    },
    {
      "speaker": "Marcus",
      "time": "00:30:01",
      "upperBoundTime": "00:30:05",
      "content": "How far into your incarceration did you start doing that?"
    },
    {
      "speaker": "Jerome",
      "time": "00:30:05",
      "upperBoundTime": "00:32:33",
      "content": "About 6 years because like I said, the first few years, it was about survival. Because prison was prison back then. You couldn't trust everybody and like I said, I didn't know anybody so the few friendships that I did have, it was I guess you could say overtime me learning them, them learning me because to this day, I have a social list but very few friends in prison, so I started tutoring these guys on how to read and write and then I said, I should get into the library system."
    },
    {
      "speaker": "Jerome",
      "time": "00:30:05",
      "upperBoundTime": "00:32:33",
      "content": "So I became a librarian and started helping out in the library, getting books and we get books from the state library in Baton Rouge and stuff like that so that was a pretty good job too because it gave me access to the material that I needed to help the guys with."
    },
    {
      "speaker": "Jerome",
      "time": "00:30:05",
      "upperBoundTime": "00:32:33",
      "content": "So I started but one of the things I think it was in 96, I said, you need to really find out why you're here. What brought you here and it was one day I just sat back and started thinking about, how I grew up and the things that I did and the drinking and the stuff like that and I said \"You need to get in a program\""
    },
    {
      "speaker": "Jerome",
      "time": "00:30:05",
      "upperBoundTime": "00:32:33",
      "content": "So in 96 I started my first AA program and completed it and took several AA programs and substance abuse programs because I felt as though I really needed to identify what really caused me to go off on the deep end like that and even though I didn't know what it was, that's still not an excuse. I did that. But, I had to forgive myself in that I know the type of person that I am."
    },
    {
      "speaker": "Jerome",
      "time": "00:30:05",
      "upperBoundTime": "00:32:33",
      "content": "My family knows the type of person that I am and my community know the type of person that I am because there's nothing that they could go back in my past and say well this guy was a trouble maker, he gave us this, he gave us- there was no- even when I was on the board, there was nothing that they can use against me to say that this bad guy."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:33",
      "upperBoundTime": "00:32:39",
      "content": "Yeah, did you have the victim's family come to the hearing?"
    },
    {
      "speaker": "Jerome",
      "time": "00:32:39",
      "upperBoundTime": "00:33:01",
      "content": "I just wanted to have that opportunity to apologize to them personally because that was the only opportunity that I was going to have to do that even though I had written an apology letter to have placed in my file just in case they wanted to know or anything like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:01",
      "upperBoundTime": "00:33:20",
      "content": "Do you think you've changed a lot over the last 30 years? We all change, but I don't- but your story isn't really one of the fault race and then it turned to - it's sort of- I mean it is in some regards in respect to the drug use, but how's your life changed while you've been here?"
    },
    {
      "speaker": "Jerome",
      "time": "00:33:20",
      "upperBoundTime": "00:34:28",
      "content": "I've matured a lot. And I see things for what they are and I communicate with people better because like I said, I'm very honest and I will give you my opinion on something if it's something that I disagree with, I will tell you I disagree with it and over the years, at first, I was more like stand-offish with a wall up because trust was always hard for me to trust people."
    },
    {
      "speaker": "Jerome",
      "time": "00:33:20",
      "upperBoundTime": "00:34:28",
      "content": "Now, I'm more open. More empathetic with people, that's I would say more mature. Because a lot of people depend on me in here."
    },
    {
      "speaker": "Jerome",
      "time": "00:33:20",
      "upperBoundTime": "00:34:28",
      "content": "And I understand why because it's hard to find people that you can actually talk to and open up, not worrying about something like going to tell somebody else and stuff like that. So, the respect that the men here gives me, it says a lot about the maturity."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:28",
      "upperBoundTime": "00:34:35",
      "content": "Alright, so let's talk a little bit about the types of things that you've been up to since you've been here. What kinds of things occupy your time?"
    },
    {
      "speaker": "Jerome",
      "time": "00:34:35",
      "upperBoundTime": "00:35:21",
      "content": "Well, right now, the biggest thing that occupies my time is pastoring two different churches. So, that takes up a lot of time because I minister the death row inmates too. I started ministering the death row inmates in 2000 and been ministering to them ever since. I live in an old trustee camp, so I'm the pastor of that camp at Camp F, in 2000 also and we have membership at Camp F about 60 people and on Death row, maybe about 27. Because we have different denominations and stuff like that but I cater to all of them. If there's a need, I meet the need."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:21",
      "upperBoundTime": "00:35:30",
      "content": "Okay, so can you give me a sense of your like routine? What time you are up in the morning and what are you doing? What would your day look like?"
    },
    {
      "speaker": "Jerome",
      "time": "00:35:30",
      "upperBoundTime": "00:36:51",
      "content": "Okay, if I wouldn't have had to come over here this morning, on my birthday, I usually get up about 7:30, I go to the Chapel, open up the Chapel because we have AA classes, thinking for a change classes, victim awareness classes and so I open up the chapel for them. I go over my paperwork because I'm also a clerk, have to take care of that all the paperwork and then I go make rounds at camp to each dorm and because I live in a camp where there's a lot of elderly people."
    },
    {
      "speaker": "Jerome",
      "time": "00:35:30",
      "upperBoundTime": "00:36:51",
      "content": "So we make rounds to go check on them because sometimes you go walking around and one of the guys will be in the bed just passed out because we got a lot of diabetics and all of that back there too so just making the rounds, checking in on the older guys and once I do that, I'll go over to death row, make rounds to the ones at death row. Go on the tiers, make sure they're doing okay because I'm the only inmate that can be on the tier with death row while they're out their cell."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:51",
      "upperBoundTime": "00:36:54",
      "content": "Tell me a little bit about that. That's a very special role."
    },
    {
      "speaker": "Jerome",
      "time": "00:36:54",
      "upperBoundTime": "00:36:59",
      "content": "It is because not everyone can really work on death row."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:59",
      "upperBoundTime": "00:37:01",
      "content": "How do you minister to those guys?"
    },
    {
      "speaker": "Jerome",
      "time": "00:37:01",
      "upperBoundTime": "00:38:04",
      "content": "Just like I would minister to you or anybody else. See I had built a relationship with those guys over the years. Those guys know me. So I was the librarian. I was their librarian before I became their pastor so they knew my walk already so it was an easy transition for me because like I said, I had built a relationship with them over the years."
    },
    {
      "speaker": "Jerome",
      "time": "00:37:01",
      "upperBoundTime": "00:38:04",
      "content": "So, when the Bible College was open, I was one of the first that was in that class and one of the first graduates out of that class so when they asked, where you want to go I said I'm going to go to death row and been with them ever since. Been with them ever since so it, like I said, it was a neat transition and the respect that I get from them because first of all, I never judge a person for what they've done so and they know that. So they were more receptive to receive the word from me than anybody else."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:04",
      "upperBoundTime": "00:38:29",
      "content": "Sure, I think it would probably be a special person to do that particular job. You it's one of those things that death row, the guys know that they're going to have all these resources that wouldn't be afforded to somebody that's dead or that somebody that's serving a life sentence. Do you find that most of them are able to hold out for hope? Are they fairly hopeful?"
    },
    {
      "speaker": "Jerome",
      "time": "00:38:29",
      "upperBoundTime": "00:39:07",
      "content": "It does. Oh yeah, no doubt. We see people getting off of death row every day. I've always preached a hope to them that god has the final say so. Man might tell you you've been a going to die but the bible tells us that everybody's going to die."
    },
    {
      "speaker": "Jerome",
      "time": "00:38:29",
      "upperBoundTime": "00:39:07",
      "content": "So, with God, all things are possible and I've seen so many men get off of death row. Some go home. Some go into population, receive a life sentence, go into population, but it's very regularly that I see this so I'm like there is hope."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:07",
      "upperBoundTime": "00:39:18",
      "content": "Which gives them hope. It sort of feeds on its own in the same way that I think when people see that people are going home through the pardon and parole board is that it also gives them hope."
    },
    {
      "speaker": "Jerome",
      "time": "00:39:18",
      "upperBoundTime": "00:39:29",
      "content": "Right. I tell you one thing, when they see me get denied, a lot of them was like… If they don't let this guy out. And I'm like, no don't think like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:29",
      "upperBoundTime": "00:39:32",
      "content": "Wow, so you're pretty busy ministering to all these folks."
    },
    {
      "speaker": "Jerome",
      "time": "00:39:32",
      "upperBoundTime": "00:39:36",
      "content": "I'm pretty busy, every day, 7 days a week."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:36",
      "upperBoundTime": "00:40:33",
      "content": "Well, I'm that much more appreciative that you're sitting down with me on your birthday, as you said. Gosh, so this is a slightly difficult question. When you- I think particularly in your situation when you look back on the crime, and the victims and now you've seen the victim's families, it's 32 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:36",
      "upperBoundTime": "00:40:33",
      "content": "You've been punished daily for 32 years. 33 sorry. That last year's important. And you must get to a point where in order to move on as a human being, you have to forgive yourself. What is it that you feel when you look back on that and the victim and the families, the way you manage it at this very late stage in your life?"
    },
    {
      "speaker": "Jerome",
      "time": "00:40:33",
      "upperBoundTime": "00:41:43",
      "content": "I look at the fact that I not only impacted 2 families, my family and their family, but also my community because like I said, I was the type of person that would just help out an elder and I know that had I been in my community now that there's a lot of great things that I could be doing for my community so it's just like I hurt them by not being there. I understand that what we do, it not only impacts us but everybody that's around us because not bragging or anything like that or put starts on my chest or anything like that."
    },
    {
      "speaker": "Jerome",
      "time": "00:40:33",
      "upperBoundTime": "00:41:43",
      "content": "I know my ability and I know what I could be doing, I know the ideas I have inside of my head to make things better because I've done it here. Even though I'm here, I still use those gifts to make things better and the people better around me. And I always imagine, what good things I could be doing right there in my own community that I know need to be done."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:43",
      "upperBoundTime": "00:42:18",
      "content": "So actually, I want to get to that because one of the things that I want to explore with you in a little bit here is how you imagine this next chapter of your life should you be released and get some relief from the pardon board, what do you see yourself do, but before we get there you've changed a lot here in prison because of prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:43",
      "upperBoundTime": "00:42:18",
      "content": "When you look back and let's say this incident didn't happen that day, just whatever, it just went in a different way, how do you imagine the rest of your life would have gone?"
    },
    {
      "speaker": "Jerome",
      "time": "00:42:18",
      "upperBoundTime": "00:43:49",
      "content": "I probably would have been the mayor of Gonzales and moved on. I had those types of ambitions. I've always said that I probably would go to politics and stuff like that because that's where I believe that you can do the most help, when you're in a position to help because you have people in positions that they don't. They're in there for the wrong reasons. They're not for the people. I've always been a people person. That hadn't stopped even since I come to prison. Anybody that will tell you that's they mock me about that."
    },
    {
      "speaker": "Jerome",
      "time": "00:42:18",
      "upperBoundTime": "00:43:49",
      "content": "They call me the Bishop because I'm always in everything, and doing stuff but that's good because I know that they need it and I'm not putting my people down but my people need to be encouraged to reach and when I say my people, I'm talking about African American people. They need to be encouraged to pursue better things in life to pursue their education and stop settling for things that just is handed to them."
    },
    {
      "speaker": "Jerome",
      "time": "00:42:18",
      "upperBoundTime": "00:43:49",
      "content": "And I really believe that if we push ourselves, we can become greater. We can be the best that we can be, but some people are afraid of challenges and they just have to move beyond that. If they got someone to lead them in the right direction to move beyond that, it can be done."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:49",
      "upperBoundTime": "00:44:06",
      "content": "So, let's talk about this final chapter. Let's say you do go, you got 4 more years before you can apply again, right? Let's say they look upon it differently and they give you another chance. What are your plans?"
    },
    {
      "speaker": "Jerome",
      "time": "00:44:06",
      "upperBoundTime": "00:44:12",
      "content": "I have a job already lined up, a permanent job if you look in my package, and you will see that."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:12",
      "upperBoundTime": "00:44:19",
      "content": "The landscaping, a different one? I just skimmed through."
    },
    {
      "speaker": "Jerome",
      "time": "00:44:19",
      "upperBoundTime": "00:46:00",
      "content": "Not that one. Oh yes. You missed the big one there. I met this guy. He comes down from Chicago. He has his own company, products and he was at the hearing with me, he was at the hearing. He told the board that \"I've offered this guy a permanent job making 50 grand a year in my company because I know his abilities. I know that he can do it. He don't have to worry about anything.\" And that's why I always keep a copy of that and if I was to get out of bed tomorrow, the job is still there."
    },
    {
      "speaker": "Jerome",
      "time": "00:44:19",
      "upperBoundTime": "00:46:00",
      "content": "So, and he's a real good friend of mine because we've met over the years and I don't even really know how we became so close because he usually brings Wheaton college down here and they do like a week here at Angola and he's in one of the service and we just met and we just connected and we been friends ever since and that's been years. He just seen me for who I am because it was just like, \"Wow, God I see you moving.\" For someone to just volunteer and say, \"Look, I will guarantee you a job.\" and I'm like, \"Wow.\""
    },
    {
      "speaker": "Jerome",
      "time": "00:44:19",
      "upperBoundTime": "00:46:00",
      "content": "Yeah, that was pretty powerful to me it was and I guess just the thing that really keeps me motivated knowing that there's still good people in the world who see you for who you really are. And I'm like \"Wow\" Even to this day, if I need anything or anything, I can call him and say \"Tim, I need something.\" He's there. He's there."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:00",
      "upperBoundTime": "00:46:35",
      "content": "So let me ask you this, when you first came to prison, you said that the only thing on your mind is survival, right? And so that becomes the immediate challenge. You've gone through so much over the 33 years you've been here and it's a different prison. What do you now and especially me think having now gone through the pardon process, what for you now is the worst thing about being here? About life without parole?"
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "Well, probably because I know the system don't change. I don't believe that I would have a chance to really get back into society if this system don't change. I mean, if we had people. If prison was built for what prisons are, for rehabilitation, I think that there would be a different outcome, but prisons today, especially in Louisiana that is, they're not for rehabilitation."
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "A person has to rehabilitate themselves and that's the bottom line. A person has to want to change, but even though a person change, the system that we have says we don't care if you are rehabilitated or not. We don't care if you change. We don't care one way or the other. Our job is to keep you here in prison and that's the mentality that they have to keep you in prison because if you do the research on it, prisons make a lot of money and in order for them to make a lot of money, they have to have prisoners."
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "There's a lot of companies investing in prisons these days. And this is why I say I'm a realist. I understand what's going on and like I said, some of its racism. Some of its political but when you follow the money trial, you really get to the root of the- of what's really going on here."
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "I see a lot of hurt and sometimes I can feel the hurt myself when what's going on but you're not in a position to do anything about it and some of the people that are in power are afraid to do anything about it because of political backlash it might damage their career and stuff like that and I think my biggest hurt is that the humanity that's being lost in people, it's I don't think they value a person's life anymore and that's my hurt. That's what I feel like \"You don't care.\" We don't care."
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "We don't care, but what can you do? And as a pastor, you have to it's hard I tell you but you have to even forgive that, I have to forgive them even though they're not actually in the right capacity or the right spirit that they should be acting in and I still have to forgive that because when I look at them, I'm saying okay well those people were made in God's image too."
    },
    {
      "speaker": "Jerome",
      "time": "00:46:35",
      "upperBoundTime": "00:50:07",
      "content": "So I have to forgive them just as I want forgiveness, and I just have to trust a higher power knowing that okay you have the final say so, I'm doing what I can do. I'm being who I am. That's all I can do, but I don't want to become bitter within myself because, I see people that's people regardless, of who they are of what they've done. I see people as people made in God's image and I see the good in people. Not the bad because if I concentrate on that, I'm no better than them so I try to see the good in everybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:07",
      "upperBoundTime": "00:50:50",
      "content": "So I want to talk about some of the coping mechanisms that people come up with to deal with life without parole which again, it's sort of a I think when you see the lengths that people go to pastor Hicks once talked to me about this and he referred to it as false hope. Which is a devastating idea actually."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:07",
      "upperBoundTime": "00:50:50",
      "content": "That people have to sort of cling onto something, otherwise it's just unbearable. How do you cope with the possibility that you may not be released?"
    },
    {
      "speaker": "Jerome",
      "time": "00:50:50",
      "upperBoundTime": "00:51:47",
      "content": "Well, I start with the things that I've seen and we never thought that the juveniles would have an avenue of getting out. We see it happening. We thought we never see guys who got life sentence getting out. We never thought that the guys with the 20-40 lives were getting out. They're getting out."
    },
    {
      "speaker": "Jerome",
      "time": "00:50:50",
      "upperBoundTime": "00:51:47",
      "content": "So we look at all the positive things that happen and me, I look at it like well I see, I see things are moving. I see people are changing. People are seeing. It's people like you that comes in with an idea of things need change and bring that to the public and my hope is that if more people in society are aware of what's going on, then things can change and just maybe, just maybe, my day will come, when the right people see what's really going on."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:47",
      "upperBoundTime": "00:51:48",
      "content": "And things are changing."
    },
    {
      "speaker": "Jerome",
      "time": "00:51:48",
      "upperBoundTime": "00:52:27",
      "content": "They are. And I might not be the one to benefit from it, but me knowing that its coming is the thing that keeps me going. Telling them \"Hey listen, we might not even be the recipients of this, but somebody is going to benefit."
    },
    {
      "speaker": "Jerome",
      "time": "00:51:48",
      "upperBoundTime": "00:52:27",
      "content": "Let's thank God for them that benefits from it.\" They've got people in here that's been there longer than me. 50 almost 60 years. I want to see them people go home. We had a guy went home yesterday who'd been here for 50 years, no Johnny Lawrence. Yeah, older guy. I used to cook with him."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:27",
      "upperBoundTime": "00:52:29",
      "content": "Okay. He was at the pardon hearing?"
    },
    {
      "speaker": "Jerome",
      "time": "00:52:29",
      "upperBoundTime": "00:52:32",
      "content": "He had been made parole, him."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:32",
      "upperBoundTime": "00:52:42",
      "content": "Well, there was a man yesterday who'd been here for 49 years who just got made parole eligible after 50. It does happen."
    },
    {
      "speaker": "Jerome",
      "time": "00:52:42",
      "upperBoundTime": "00:52:49",
      "content": "It happens and that's a good thing because at one time, we wasn't in anybody go anywhere."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:49",
      "upperBoundTime": "00:52:59",
      "content": "I think that's what pastor Hicks was talking about in that you have to sort of give hope when it's false. Right? But yeah, things are changing."
    },
    {
      "speaker": "Jerome",
      "time": "00:52:59",
      "upperBoundTime": "00:54:10",
      "content": "Especially for your family. One of my girlfriends, I can't say fiancé but she was the girl I was engaged to before I got locked up and we were talking the other day and I said this, this is how we going to deal with this. I don't know what the future holds for us. I said but we're, we're back in communication now, so let's just keep communicating and see what happens down the road. We don't want to commit to anything because I don't want you to stop your life or anything like that."
    },
    {
      "speaker": "Jerome",
      "time": "00:52:59",
      "upperBoundTime": "00:54:10",
      "content": "I want you to live your life, to the fullest, and whatever God has down the road, we'll deal with that then but we not going to commit or lock into anything. Because I don't want to give her false hope or anything like that. I don't want to give my family false hope so I always tell them the truth: Things are happening."
    },
    {
      "speaker": "Jerome",
      "time": "00:52:59",
      "upperBoundTime": "00:54:10",
      "content": "I don't know how soon they going to happen, but things are happening. People are becoming aware so and that's a good thing. That's why when George contacted me and said \"Pastor, I believe, you want to go head up,\" I said \"well, sure I'll do that.\" Anything that's positive that's moving forward, I'm about it."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:10",
      "upperBoundTime": "00:54:14",
      "content": "So you've accomplished a lot. More than most folks."
    },
    {
      "speaker": "Jerome",
      "time": "00:54:14",
      "upperBoundTime": "00:54:21",
      "content": "I've accomplished just about everything a person can accomplish in here. When it was given, I took it, advantage of it,"
    },
    {
      "speaker": "Marcus",
      "time": "00:54:21",
      "upperBoundTime": "00:54:27",
      "content": "And that's very clear. What are you most proud of?"
    },
    {
      "speaker": "Jerome",
      "time": "00:54:27",
      "upperBoundTime": "00:54:59",
      "content": "The most thing I'm proud of is the people that I've helped be able to read for their own selves. Instead of having to have their own way- I got tired of them kept coming to me to read their letters so it was easier for me to teach you to read your own letters so you could stop bothering me. So I think that's the most joyful thing that I've helping them learn how to read because that's a big step in anybody's life when you learn how to read and write your own name so."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:59",
      "upperBoundTime": "00:55:28",
      "content": "Oh yeah, sure I've really enjoyed talking with you. I feel like I've learned a lot about you in a very short period of time. Is there something else that I should have asked you? Something that you think is important for folks to know about what's happening back here?"
    },
    {
      "speaker": "Jerome",
      "time": "00:55:28",
      "upperBoundTime": "00:56:44",
      "content": "Man, the only thing that I can think of is that more people would get involved and get on board with what you're doing to bring awareness to the public because the public is really being misinformed about a lot of things because they make it seem as though people in prison are animals and they have to know that these guys are not animals in here. You have some bright guys in prison that can do just about anything."
    },
    {
      "speaker": "Jerome",
      "time": "00:55:28",
      "upperBoundTime": "00:56:44",
      "content": "We just really have to get that out there so we can see and know but, man to me, if I can tell my victims again how sorry I am for their pain, that's what I would do, and it's sad that we can't have communications with them on our own to reach out to them, but, like I said, it was great that I had the opportunity to express that to them at the hearing because that was the only chance that I would probably get to do that and they're not even in Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:44",
      "upperBoundTime": "00:56:47",
      "content": "Yeah, I'm sure that was very powerful hearing."
    },
    {
      "speaker": "Jerome",
      "time": "00:56:47",
      "upperBoundTime": "00:56:50",
      "content": "It was."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:50",
      "upperBoundTime": "00:56:54",
      "content": "Well, I want to thank you very much for doing this."
    },
    {
      "speaker": "Jerome",
      "time": "00:56:54",
      "upperBoundTime": "00:56:56",
      "content": "No problem"
    },
    {
      "speaker": "Marcus",
      "time": "00:56:56",
      "upperBoundTime": "00:56:57",
      "content": "Was that okay for you?"
    },
    { "speaker": "Jerome", "time": "00:56:57", "content": "It was great." }
  ]
}
