{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:01",
      "content": "Jerry Brown_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:01",
      "upperBoundTime": "00:00:28",
      "content": "I'm just starting now? Okay my name is Jerry Dell Brown. I'm 42 years old. I caught my charge which is second degree murder at the age of 18 which was in 1995. And I have currently been locked up 22 years so this will be 23 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:28",
      "upperBoundTime": "00:00:45",
      "content": "Sure, okay so the point of this is just to learn more about you and your experiences and so I'm just going to ask you about the first 18 years of your life and then we'll talk a little bit about the circumstances of the charge and mainly about your time since then, the last 22 years or so. So let me start by asking you about the folks who raised you. Tell me about your family."
    },
    {
      "speaker": "Jerry",
      "time": "00:00:45",
      "upperBoundTime": "00:01:27",
      "content": "I was raised by my grandmother. When I say raised I mean, at the age I was spending learning that I was a person that I can really see what's going on that was my grandmother but my mother, she had me, she was when she had me when she was 18 so she was fairly young so she used to leave us with our grandmother a lot. So our grandmother ended up raising her kids which was 4 two girls and two boys so our grandmother's actually the mindset behind the mind of a young boy so to speak."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:27",
      "upperBoundTime": "00:01:31",
      "content": "Sure, and so tell me a little bit about your siblings."
    },
    {
      "speaker": "Jerry",
      "time": "00:01:31",
      "upperBoundTime": "00:01:39",
      "content": "Oh yeah, so my sister I have one brother, Derek, and two sisters both of my sisters are older than me. I'm the oldest son."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:39",
      "upperBoundTime": "00:01:42",
      "content": "Okay, so you're third in the birth order."
    },
    {
      "speaker": "Jerry",
      "time": "00:01:42",
      "upperBoundTime": "00:01:44",
      "content": "Yeah. I have a younger brother."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:44",
      "upperBoundTime": "00:02:03",
      "content": "Sure, so let me rephrase it. So if you had to pin point somebody who was closest to you who took the greatest interest in you when you were coming up, who would that be?"
    },
    {
      "speaker": "Jerry",
      "time": "00:02:03",
      "upperBoundTime": "00:02:11",
      "content": "My sister. She was actually one who was forced into a mother role before her time."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:11",
      "upperBoundTime": "00:02:12",
      "content": "Your oldest sister?"
    },
    {
      "speaker": "Jerry",
      "time": "00:02:12",
      "upperBoundTime": "00:02:30",
      "content": "Yeah, she had to actually do the mother thing when Mom was at work or there was no one there because there was a lot of kids. And so she, by her being the oldest grandchild, so she was forced into that role."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:30",
      "upperBoundTime": "00:02:34",
      "content": "Yep and so how many years older was she than you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:02:34",
      "upperBoundTime": "00:02:39",
      "content": "I think she would be about 44, 45. So she's only like three years older than me."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:39",
      "upperBoundTime": "00:02:41",
      "content": "And where were you raised?"
    },
    {
      "speaker": "Jerry",
      "time": "00:02:41",
      "upperBoundTime": "00:02:42",
      "content": "Shreveport, Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:42",
      "upperBoundTime": "00:03:04",
      "content": "Okay so, I don't think this is kind of a typical situation here I think with Grandma. Is it safe to say that you grew up knowing that you were cared for and loved or did you feel like you kind of had to fend for yourself?"
    },
    {
      "speaker": "Jerry",
      "time": "00:03:04",
      "upperBoundTime": "00:03:28",
      "content": "I think it's kind of both. The greater one would be knowing that you were cared for and loved but the tangibles was kind of harder to see because it was so many kids and with so many kids, it's kind of hard to keep your eyes on one in particular so it's just like spread out."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:28",
      "upperBoundTime": "00:03:36",
      "content": "Okay, alright, friends. Did you have close friends that still stick by you that still stand by you in your mind?"
    },
    {
      "speaker": "Jerry",
      "time": "00:03:36",
      "upperBoundTime": "00:04:17",
      "content": "Yeah, as a matter of fact, I went to my grandmother's funeral last year and a lot of guys, they just saw me, even though I was in handcuffs when I went there, they weren't coming to the front row/funeral until they saw me and when they saw me, even after twenty years, when they saw me, they still were like \"Man, there goes Jerry Brown.\""
    },
    {
      "speaker": "Jerry",
      "time": "00:03:36",
      "upperBoundTime": "00:04:17",
      "content": "So they came over there and began to talk with me and whatsoever and then liked hugged me and was like \"Man, that's our friend\" Said they were going to be in contact or and that they were sorry for not being in contact but we were going to be and I tell you, one of them actually kissed me on the jaw and you could tell."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:17",
      "upperBoundTime": "00:04:19",
      "content": "And have they been in contact with you since then?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:19",
      "upperBoundTime": "00:04:22",
      "content": "Yeah, really through my mother, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:22",
      "upperBoundTime": "00:04:26",
      "content": "Okay, who visits you up here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:26",
      "upperBoundTime": "00:04:27",
      "content": "My mother and my sisters."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:27",
      "upperBoundTime": "00:04:29",
      "content": "Okay, both sisters?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:29",
      "upperBoundTime": "00:04:29",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:29",
      "upperBoundTime": "00:04:33",
      "content": "Alright. So tell me what's Tamika doing?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:33",
      "upperBoundTime": "00:04:45",
      "content": "What's her job? Oh, she's Dr. Tamika Brown. She has a doctorate degree in Theology and so she preaches and does things in church."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:45",
      "upperBoundTime": "00:04:46",
      "content": "In Shreveport?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:46",
      "upperBoundTime": "00:04:48",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:48",
      "upperBoundTime": "00:04:50",
      "content": "What about your other sister and your brother?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:50",
      "upperBoundTime": "00:05:00",
      "content": "Beautician. She has a degree or something too. I know one of them is cosmetology, I guess, but she has her own beauty shop."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:00",
      "upperBoundTime": "00:05:03",
      "content": "Okay and your other sibling?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:03",
      "upperBoundTime": "00:05:07",
      "content": "My brother, he lives in Texas."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:07",
      "upperBoundTime": "00:05:08",
      "content": "What does he do?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:08",
      "upperBoundTime": "00:05:12",
      "content": "Some odd jobs. He has like two jobs actually, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:12",
      "upperBoundTime": "00:05:14",
      "content": "So you're not particularly close with him, he doesn't get up here very often?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:14",
      "upperBoundTime": "00:05:21",
      "content": "Because of that. He has a lot. I understand, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:21",
      "upperBoundTime": "00:05:29",
      "content": "But, were you in Shreveport proper or so were you in an urban environment growing up or in a suburban environment?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:29",
      "upperBoundTime": "00:05:30",
      "content": "No, it was urban."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:30",
      "upperBoundTime": "00:05:44",
      "content": "Suburban- urban. So you can you describe the housing so if I'm sitting on your front stoop driveway, can you paint a picture for me? What am I looking at?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:44",
      "upperBoundTime": "00:06:29",
      "content": "Yeah, well actually we used to have a like the flat projects like more like, I kind of think I remember seeing them like New Orleans, I've never been to New Orleans but I see pictures of the place and they have like the duplex houses and these they flat on the top."
    },
    {
      "speaker": "Jerry",
      "time": "00:05:44",
      "upperBoundTime": "00:06:29",
      "content": "Well, they had some of those across the street, but mostly on our street, it's really Small Street but it has houses lined up. It's only about 4 or 5 brick houses on the street and we lived in one of the brick houses actually on the street but it's, every house has a fence to the front to the back and a yard from this street to that street."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:29",
      "upperBoundTime": "00:06:32",
      "content": "Okay, what's going on? Is there a lot of people?"
    },
    {
      "speaker": "Jerry",
      "time": "00:06:32",
      "upperBoundTime": "00:06:42",
      "content": "Yeah, covered like ants."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:42",
      "upperBoundTime": "00:06:44",
      "content": "Fights? Fighting in the neighborhood?"
    },
    {
      "speaker": "Jerry",
      "time": "00:06:44",
      "upperBoundTime": "00:08:31",
      "content": "Yeah. High intensity. A lot of drugs, arguing, drinking. These are kind of things that I wasn't a drinker or a smoker because of this. I saw so much people who OD'd off of drugs and I'm talking about right then so I'm a young boy looking at this. People getting shot, killed right in front of me so I'm seeing all this and yeah he's shot."
    },
    {
      "speaker": "Jerry",
      "time": "00:06:44",
      "upperBoundTime": "00:08:31",
      "content": "I'm talking about his blood splashing on me and my mom had to come out and get me because somebody thought I got hit and I didn't so, I thought about that since I been here. Those type of experiences, traumatic experiences of being placed in an environment that had that type of traumatic events going on every day. It was chaotic, really chaotic. But it's an amazing thing because on the opposite side of it, there was love."
    },
    {
      "speaker": "Jerry",
      "time": "00:06:44",
      "upperBoundTime": "00:08:31",
      "content": "There was still a sense of there was love. There was a sense of caring. There was a sense of affection. But still, you had this ugly, grim outside every day. It's like the sun goes down, or even sometimes in broad daylight, these events are happening- dudes may have a wreck, jump out the car shooting. I'm talking about right there women and children have to get out the way. This every single day."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:31",
      "upperBoundTime": "00:08:36",
      "content": "Sure, did you think of your home as just a refuge from that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:08:36",
      "upperBoundTime": "00:08:37",
      "content": "No because it was in there too."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:37",
      "upperBoundTime": "00:08:41",
      "content": "Yeah, okay, so tell me a little bit about that."
    },
    {
      "speaker": "Jerry",
      "time": "00:08:41",
      "upperBoundTime": "00:09:36",
      "content": "I had a couple of family members who was on drugs and as a result of that there's a lot of situations that occur in the house like people stealing. You got these kids in here, you got this old lady, which is my grandmother, and you got others who don't use drugs and who try to have nice things like VCRs and things would come up missing and this is where the arguments and the fights because you taking things that's not for you and using them for something else."
    },
    {
      "speaker": "Jerry",
      "time": "00:08:41",
      "upperBoundTime": "00:09:36",
      "content": "And the key is especially me, I was really observant and how there's fighting over money. There's fighting over cars. There's fighting over TVs, everything is a fight, where's those arguments are actually physical."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:36",
      "upperBoundTime": "00:09:46",
      "content": "Were there any men in your mother's life that came into your life as a result of your relationship?"
    },
    {
      "speaker": "Jerry",
      "time": "00:09:46",
      "upperBoundTime": "00:09:47",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:47",
      "upperBoundTime": "00:09:51",
      "content": "So tell some of those, any of those conflict of any type?"
    },
    {
      "speaker": "Jerry",
      "time": "00:09:51",
      "upperBoundTime": "00:12:04",
      "content": "Yeah. Well, matter of fact, this was a question you have on the paper that talks about somebody being intimate saying which one of your family members like that you loved the most? And it was actually her because I looked at her like the world. And one of things that I liked about my momma is that she could fight. She was a great fighter. I ended up becoming a boxer here so I'm going to add that to it too. But my mom was a great fighter. That's something that was kind of it wasn't looked down on where I'm from."
    },
    {
      "speaker": "Jerry",
      "time": "00:09:51",
      "upperBoundTime": "00:12:04",
      "content": "If you was a good fighter, it also had its what I would call symbolic meaning to- meaning that you was a person who was not going to just allow anything to happen without putting up a struggle so she met this guys named Percy. I was going to write a book about him called \"No Mercy Percy\" He was very abusive to her. He was very abusive and he used to beat my mom and so I came in to stop her one time and he wanted to beat her up right in front of us. As little boys, me and my little brother because my sisters didn't live with us."
    },
    {
      "speaker": "Jerry",
      "time": "00:09:51",
      "upperBoundTime": "00:12:04",
      "content": "It was just me and him and he would beat her up right in front of us and I'm talking about he was big. He was a dude and he would just beat her up and what traumatized me the most about him in the respect of her is that that's not the same lady I saw. She had become weak. She put up more of a fight in life that I had saw compared to what she allowed herself to go through because of her affection for him."
    },
    {
      "speaker": "Jerry",
      "time": "00:09:51",
      "upperBoundTime": "00:12:04",
      "content": "And he was abusive. And she finally got the heart to leave him once he turned his anger toward us. When he turned his anger toward us that was the final straw. As long as it was on her, it was good, but when he turned his anger on her kids, she left him."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:04",
      "upperBoundTime": "00:12:07",
      "content": "How old were you when all this was going on?"
    },
    {
      "speaker": "Jerry",
      "time": "00:12:07",
      "upperBoundTime": "00:12:14",
      "content": "I was about I had to be about 10 or 11 because I played baseball."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:14",
      "upperBoundTime": "00:12:31",
      "content": "So, you got violence all around you. It's out in the street in your neighborhood and at home. So, where did you how did you get away from it all? Was there any place where you could escape to?"
    },
    {
      "speaker": "Jerry",
      "time": "00:12:31",
      "upperBoundTime": "00:13:21",
      "content": "You know what? I'm glad you asked that question because you just helped me to realize something. I used to have a bike and I used to get on that bike and I'd just ride and I'd go way up to my really far away and I never thought about where I was going, I would just go far as I could, I would stop and go in a store or something, buy something to drink and I'd come all the way back but the one thing that I do remember that I noticed was how I loved people."
    },
    {
      "speaker": "Jerry",
      "time": "00:12:31",
      "upperBoundTime": "00:13:21",
      "content": "I loved to meet people while I go to these places. I'm telling you, I would go a long way. I would be so far that when I go back, they would ask me, \"Where you been all day?\" I was like \"I don't know\" I just went somewhere just to get away and stay away."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:21",
      "upperBoundTime": "00:13:40",
      "content": "Yeah. You know a bike in a kid's life can be like a ticket to freedom especially if you are trying to get away from something. I can see that. What about school? How was school for you? Did you like school? Were you good in school?"
    },
    {
      "speaker": "Jerry",
      "time": "00:13:40",
      "upperBoundTime": "00:14:35",
      "content": "School was the exact same thing as the streets. There was drive-bys at our school, shootings, I mean. After school, there was war. Because I came from Shreveport. Shreveport is very gang-related. So and I remind you it was '86, '87 when I was like 12 or 13. I played basketball and football and track but it was just after school there was a war."
    },
    {
      "speaker": "Jerry",
      "time": "00:13:40",
      "upperBoundTime": "00:14:35",
      "content": "There was a war between the Crips and the Bloods and walking home like one time, I fought four or five dudes at the same time. All these guys jumped me and my friends stood right there. He didn't swing a blow to help. I had to fight and they tried to throw me in front of the city bus but some kind of way the bus missed."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:35",
      "upperBoundTime": "00:14:39",
      "content": "Wow. What was there- what was their beef with you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:14:39",
      "upperBoundTime": "00:15:04",
      "content": "There's somehow I let them, a guy wanted to borrow a gun and I went to his house and asked a question and he found out about it. It was an honest question but he found out about it and instead of coming ask me, he walked up to me and started punching. We just started fighting so all his friends jumped in."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:04",
      "upperBoundTime": "00:15:06",
      "content": "And your 12?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:06",
      "upperBoundTime": "00:15:08",
      "content": "Yeah, I'm like 12, I'm in 7th grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:08",
      "upperBoundTime": "00:15:17",
      "content": "You're 7th grade and you're having a conversation about a gun. So were firearms easy to get? A part of your life?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:17",
      "upperBoundTime": "00:15:33",
      "content": "No, it wasn't a part of my life but there was everywhere. Yeah, they weren't a part of my life. I was neither a gangbanger at the time nor was I am in drugs or alcohol."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:33",
      "upperBoundTime": "00:15:48",
      "content": "Okay and you're a child, sure. So, would you characterize your childhood as being physically abusive?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:48",
      "upperBoundTime": "00:15:54",
      "content": "Yeah, by the environment, but not necessarily by the family. Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:54",
      "upperBoundTime": "00:16:09",
      "content": "So, you've mentioned that no mercy Percy would sometimes turn his $$ towards you kids. That's when your mother had had enough of it. Did that go on for a while?"
    },
    {
      "speaker": "Jerry",
      "time": "00:16:09",
      "upperBoundTime": "00:18:16",
      "content": "Yeah, for a couple of years. One of the reasons that I feel like it really traumatized me per say was because of how I felt toward her. How I knew. I think I was the child that asked the most questions. And I used to talk to her a lot and she would tell me things that I don't think she told the rest of the kids because of my questions and I knew that she wanted to be successful and when she finally came got us and moved us to Spring Texas, everything she had told me about, it looks like she was having it."
    },
    {
      "speaker": "Jerry",
      "time": "00:16:09",
      "upperBoundTime": "00:18:16",
      "content": "She had a really nice job, she lived in a well-to-do neighborhood, brick house, three bedrooms, two cars, and she was doing well. She was doing well. She was like 27 so I was imagining that everything that she had contemplated beforehand, her soul reason of leaving us with our grandmother, it was now coming into fruition, but now the sad part about it is now who you choosing to share this with, he's the enemy, your downfall."
    },
    {
      "speaker": "Jerry",
      "time": "00:16:09",
      "upperBoundTime": "00:18:16",
      "content": "So now that everything you done positive, he was going to do it for you and that's exactly what happened. She had an accident at work where boxes fell on top of her. She was in a stocking room area and the boxes fell down on her and it cracked her tail-bone and as a result, she sued the company but they put her on some medicine that had cocaine in it. Yeah, back in those days, they used certain drugs for I guess as a pain but anyways, my mother ended up getting hooked on cocaine crack after. So, it just went worse, AWOL."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:16",
      "upperBoundTime": "00:18:31",
      "content": "So, Spring Texas, so how long? When was the Spring Texas part of your life? Is this this charge happened in Shreveport right? So you're in Shreveport and you move to Texas for a little while?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:31",
      "upperBoundTime": "00:18:34",
      "content": "Yeah. That's when I was around 10 or 11."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:34",
      "upperBoundTime": "00:18:37",
      "content": "Okay and when do you come back to Shreveport?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:37",
      "upperBoundTime": "00:18:40",
      "content": "About that was around 12."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:40",
      "upperBoundTime": "00:18:41",
      "content": "Okay so that was not long."
    },
    {
      "speaker": "Jerry",
      "time": "00:18:41",
      "upperBoundTime": "00:18:42",
      "content": "Not long just a couple of years."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:42",
      "upperBoundTime": "00:18:46",
      "content": "Okay was there any sexual abuse in your life?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:46",
      "upperBoundTime": "00:18:46",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:46",
      "upperBoundTime": "00:18:57",
      "content": "Okay so tell me you told me a little bit about school but you basically said it was an extension of the fighting in the street, especially after school let out."
    },
    {
      "speaker": "Jerry",
      "time": "00:18:57",
      "upperBoundTime": "00:19:00",
      "content": "Man, it was notorious."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:00",
      "upperBoundTime": "00:19:02",
      "content": "What was the name of your school?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:02",
      "upperBoundTime": "00:19:08",
      "content": "Midway middle school. This school was on the news and everything, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:08",
      "upperBoundTime": "00:19:10",
      "content": "Okay what was the highest year of school you completed?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:10",
      "upperBoundTime": "00:19:11",
      "content": "Tenth."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:11",
      "upperBoundTime": "00:19:15",
      "content": "So you went on to high school. What was your high school?"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:11",
      "upperBoundTime": "00:19:15",
      "content": ""
    },
    {
      "speaker": "Jerry",
      "time": "00:19:15",
      "upperBoundTime": "00:19:18",
      "content": "Well, same thing because it's right down the street."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:18",
      "upperBoundTime": "00:19:20",
      "content": "Okay and was that midway high school?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:20",
      "upperBoundTime": "00:19:33",
      "content": "Yeah. But Midway middle school is here at Fairpark, the same place Morris Lee Claiborne for the Dallas Cowboys. He came from the same school, but its right down the street. Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:33",
      "upperBoundTime": "00:19:37",
      "content": "So you finished 10th grade, why did you stop?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:37",
      "upperBoundTime": "00:19:40",
      "content": "I got kicked out. Fighting."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:40",
      "upperBoundTime": "00:19:46",
      "content": "Okay and then what are you doing? So you're not in school."
    },
    {
      "speaker": "Jerry",
      "time": "00:19:46",
      "upperBoundTime": "00:20:35",
      "content": "Well, I actually I had a chance to become a boxer because of police guy detective. He saw my school records that I was really smart and he like \"You good grades.\" He said \"But you have a behavior problem.\" It was because of the fights and these guys was getting seriously beat up, not just a typical they was getting hurt badly and so he wanted to help me become a boxer. He said maybe this could be something that could be used as something to help you instead of."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:35",
      "upperBoundTime": "00:20:37",
      "content": "To channel some of that."
    },
    {
      "speaker": "Jerry",
      "time": "00:20:37",
      "upperBoundTime": "00:21:18",
      "content": "Yeah, some of that. Some of the anger and energy you have can be channeled into something positive. And when I came to Angola and I started boxing, even the person you see today part of came from boxing. Boxing taught me how to like if something angers me, instead of lashing out or allowing some kind of fury something to come out to think about it, to relax, to understand that how to have proper judgment and see something that's not worth building a hill over, something not worth that."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:18",
      "upperBoundTime": "00:21:20",
      "content": "How does boxing teach you that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:21:20",
      "upperBoundTime": "00:21:26",
      "content": "Because boxing teaches you to be patient. It teaches you to."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:26",
      "upperBoundTime": "00:21:28",
      "content": "To wait for your time."
    },
    {
      "speaker": "Jerry",
      "time": "00:21:28",
      "upperBoundTime": "00:21:57",
      "content": "Time, good answer. It teaches you to be patient. It teaches you to see a target, all of us aren't good targets. It teaches you to know that you want to do something and continue to do it until you have it, until you accomplish it. It teaches you that pain sometimes is a builder, not a destroyer. And that's what boxing taught me. I teach a lot of boxers too now. Yeah, I'm a trainer now."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:57",
      "upperBoundTime": "00:22:00",
      "content": "So what about girlfriends?"
    },
    {
      "speaker": "Jerry",
      "time": "00:22:00",
      "upperBoundTime": "00:22:03",
      "content": "Oh yeah, my son's mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:03",
      "upperBoundTime": "00:22:04",
      "content": "Tell me about her."
    },
    {
      "speaker": "Jerry",
      "time": "00:22:04",
      "upperBoundTime": "00:23:06",
      "content": "Well, she was another one that I actually wrote a story about her, about her situation. I knew inside of my own head even on the street that I needed to be saved from it. And what I knew that something to be was death. Around my career, a lot of guys my age didn't live long and when I met her, she was like more of a mother to me. She was always protective to me like and I appreciated it because she taught me that I still had worth when I didn't see it."
    },
    {
      "speaker": "Jerry",
      "time": "00:22:04",
      "upperBoundTime": "00:23:06",
      "content": "I didn't even recognize it. And when I had my son by her, that's another thing that taught me that there was something worth living for because he was precious he was innocent. He was something that I wish I could be innocent. Not having to worry about this or that."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:06",
      "upperBoundTime": "00:23:19",
      "content": "Yeah, something about it. Yeah, so do you have some kind of ongoing relationship with any of the girls that you knew before this happened?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:19",
      "upperBoundTime": "00:23:20",
      "content": "What to who?"
    },
    {
      "speaker": "Marcus",
      "time": "00:23:20",
      "upperBoundTime": "00:23:24",
      "content": "With any of the girls, like the mother of your child? Do you have an ongoing relationship with her?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:24",
      "upperBoundTime": "00:23:29",
      "content": "Yes. She's my best friend. Yeah still to this day."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:29",
      "upperBoundTime": "00:23:39",
      "content": "So who comes and visits you other than your family. You said your sisters and your mom come visit you. Does she come to visit? The mother of your child."
    },
    {
      "speaker": "Jerry",
      "time": "00:23:39",
      "upperBoundTime": "00:23:54",
      "content": "No, she has never been to Angola but she came to when I was still in the parish. I stayed in the parish for 4 years from 95 to 99 yeah because she stays in St. Louis so it's a long way."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:54",
      "upperBoundTime": "00:23:58",
      "content": "Why did you stay in the parish for four years? Took that much time for your trial?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:58",
      "upperBoundTime": "00:24:18",
      "content": "I don't know. Yeah. There's something they was arguing in my case about. The statute of limitations of incarceration about them taking so long. It's just a lot of stuff they had on my case about my charges about proving this and that"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:18",
      "upperBoundTime": "00:24:22",
      "content": "Tell me about your child, a boy or a girl?"
    },
    {
      "speaker": "Jerry",
      "time": "00:24:22",
      "upperBoundTime": "00:24:25",
      "content": "A boy, Jam Arial."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:25",
      "upperBoundTime": "00:24:28",
      "content": "Tell me more about, do you have a relationship with him?"
    },
    {
      "speaker": "Jerry",
      "time": "00:24:28",
      "upperBoundTime": "00:25:22",
      "content": "Oh yeah, my main man! We have a really good relationship. I developed something with him since I've been locked up called how you say it, oh man up. Yeah, I got it from King David and Solomon out of the Bible it started as a program with him about asking questions. Something I'm realized about me and my dad we had no true relationship and I didn't want that for him."
    },
    {
      "speaker": "Jerry",
      "time": "00:24:28",
      "upperBoundTime": "00:25:22",
      "content": "So, I would write him and ask him 10 questions about him that I don't know and I would ask that he ask me 10 questions about myself I want you to know. I want you to know who your dad was. I want to clear up some things in case somebody told you something that was wrong."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:22",
      "upperBoundTime": "00:25:22",
      "content": "Sure that's a really smart way to initiate a relationship."
    },
    {
      "speaker": "Jerry",
      "time": "00:25:22",
      "upperBoundTime": "00:25:32",
      "content": "Yeah, I care about what he learning."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:32",
      "upperBoundTime": "00:25:31",
      "content": "Is he able to visit you here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:31",
      "upperBoundTime": "00:25:34",
      "content": "Oh yeah, oh man, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:34",
      "upperBoundTime": "00:25:36",
      "content": "When was the last time you saw him?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:36",
      "upperBoundTime": "00:25:46",
      "content": "Well, 2000 he came to all of Returning Hearts. 2016-17. I mean 16."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:46",
      "upperBoundTime": "00:25:50",
      "content": "Okay- so he's in his 20s not huh?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:50",
      "upperBoundTime": "00:25:50",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:50",
      "upperBoundTime": "00:25:54",
      "content": "Okay any other children aside from him?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:54",
      "upperBoundTime": "00:25:54",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:54",
      "upperBoundTime": "00:26:05",
      "content": "Okay so prior to this charge, did you have any other run-ins with the law? Any other previous arrests?"
    },
    {
      "speaker": "Jerry",
      "time": "00:26:05",
      "upperBoundTime": "00:26:25",
      "content": "Yeah. I had some arrests. Matter of fact, the fight I had at school, I got arrested for. I never been too juvenile but I ended up going to a juvenile facility for that fight but besides this, I never went to juvenile. I never had a charge on my rap sheet."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:25",
      "upperBoundTime": "00:26:37",
      "content": "Let me ask you this, let's say this didn't happen. Let's say you just didn't get out of bed that morning. What do you think would have happened in the next few years of your life?"
    },
    {
      "speaker": "Jerry",
      "time": "00:26:37",
      "upperBoundTime": "00:28:03",
      "content": "Let me go up a level. I actually got out of jail the day before. The simple burglary charge, I got out the day before and I met this lady and she told me that she had a roofing company and she said \"Do you want to work for me?\" I said, \"I will.\" She said that if I wanted to start the next day, which was Friday or did I wanted to wait till Monday to start fresh."
    },
    {
      "speaker": "Jerry",
      "time": "00:26:37",
      "upperBoundTime": "00:28:03",
      "content": "And these were my exact words to her. I said, \"I want to start Friday, tomorrow, because I want to spend as less time in the streets as possible.\" She looked at my mother and she said, \"This is the guy who sounds like he has his mind right.\" But the next day when I got up to actually call her to go to work, she didn't answer. So I went back home and went to sleep and got up again and called again but this time I got a secretary and the secretary told me to just come in Monday, don't worry about Friday. I never made it past Friday."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:03",
      "upperBoundTime": "00:28:08",
      "content": "So, what do you think would have happened? You would be a roof working for a roofing company?"
    },
    {
      "speaker": "Jerry",
      "time": "00:28:08",
      "upperBoundTime": "00:28:14",
      "content": "I don't know I don't know what I would be. I was rapping too so there's no telling what I would have done."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:14",
      "upperBoundTime": "00:28:15",
      "content": "Yep."
    },
    {
      "speaker": "Jerry",
      "time": "00:28:15",
      "upperBoundTime": "00:28:34",
      "content": "I think it's actually what I wrote on your paper. I answered all of your questions on my paper. I said that one of those, I just consider it to be one of the options that would have come upon my life because of the environment that I would have gotten killed. It was just something that you automatically know."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:34",
      "upperBoundTime": "00:28:52",
      "content": "So I want to switch gears and talk about the last 22 years, coming up on 23. But before I do, is there something about the first 18 years of your life that's really important in terms of shaping your life that we haven't had a chance to talk about?"
    },
    {
      "speaker": "Jerry",
      "time": "00:28:52",
      "upperBoundTime": "00:28:53",
      "content": "Yeah, my father."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:53",
      "upperBoundTime": "00:28:56",
      "content": "Okay tell me about that."
    },
    {
      "speaker": "Jerry",
      "time": "00:28:56",
      "upperBoundTime": "00:30:18",
      "content": "I just want to say this one thing about him. He died in 2010 but one of the things that has helped me to today even to today, even though we didn't have a good relationship is that he always showed excitement when he saw me. It's like he knew something about me that I didn't know. He was always expecting of me although he was never around but when I would find him, I would always have to find him. I would look all over the city until I found him 200 times."
    },
    {
      "speaker": "Jerry",
      "time": "00:28:56",
      "upperBoundTime": "00:30:18",
      "content": "Come to find, he had a whole other family. But I got really cool with the brothers on that side. That's what I can say about him. He always left me happy, even when he wasn't around because he would have this thing with him where he expected something from me- it was something good. It was and he would do it without worries. He would always make these gestures toward me and around me and to people about me but, as far as his presence being there."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:18",
      "upperBoundTime": "00:30:46",
      "content": "So, obviously we are interested in transition and changes that happen in a person right? And so you're as we all are, quite different after 22 years. Can you, just for a second though, just describe the Jerry Brown who was brought in through the gates of Angola? What kind of fellow is he?"
    },
    {
      "speaker": "Jerry",
      "time": "00:30:46",
      "upperBoundTime": "00:31:12",
      "content": "Well, I was 22 at the time. So, I was still kind of energetic, as a softer term to wild. I was cautious. I was studious because I still read a lot. I love reading. I love knowledge."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:12",
      "upperBoundTime": "00:31:14",
      "content": "Did that start in the Parish?"
    },
    {
      "speaker": "Jerry",
      "time": "00:31:14",
      "upperBoundTime": "00:31:36",
      "content": "No, it was on the street too, but I told you that one thing the detective knew about me was that I had good grades. I always was a person that liked to be informed, I always liked to be positive to, I had been around so much negativity."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:36",
      "upperBoundTime": "00:31:41",
      "content": "So, how are you different from that wild person?"
    },
    {
      "speaker": "Jerry",
      "time": "00:31:41",
      "upperBoundTime": "00:32:07",
      "content": "Well, once again, I'm able to see forward. I have foresight now. I'm able to see that one action can cause a ripple effect that can change your destiny forever if you don't look at it strong enough, if you don't think before you decide and you don't decide before you act."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:07",
      "upperBoundTime": "00:32:26",
      "content": "Right, its impulse control. Everything to do with brain development. How were your first few months here at Angola?"
    },
    {
      "speaker": "Jerry",
      "time": "00:32:26",
      "upperBoundTime": "00:33:15",
      "content": "Crazy. Because I went to the cell blocks and it was extremely cold yet they still wanted us to go to work call and I didn't understand it. And because of that, I didn't understand how this place was set up because I was like \"Why would they want humans outside in that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:32:26",
      "upperBoundTime": "00:33:15",
      "content": "It's like 22 degrees outside but they wanted us to go out and do work and then when I see the tools, I said \"what is that? That's a tool?\" You were supposed to cut the grass with it the sling blade, yeah, but it's this big hunk of wood with this big crooked piece of metal on it, so I didn't understand it. Where I'm from, I didn't see anything that looked like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:15",
      "upperBoundTime": "00:33:16",
      "content": "So you said \"I'm not going to work?\""
    },
    {
      "speaker": "Jerry",
      "time": "00:33:16",
      "upperBoundTime": "00:33:36",
      "content": "Oh, I went. I went. But a lot of guys had to coach me into what is this but immediately, I was like, \"This is inhumane. This is not even, this is unheard of.\" Yeah. Just didn't make sense to my brain."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:36",
      "upperBoundTime": "00:33:39",
      "content": "Okay, so you refused to work."
    },
    {
      "speaker": "Jerry",
      "time": "00:33:39",
      "upperBoundTime": "00:33:51",
      "content": "I worked, I stayed I just had to teach me how to do it and explain to the free man that he just came here."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:51",
      "upperBoundTime": "00:34:01",
      "content": "Okay, I get it. You're in the cell blocks, the working cell blocks. And did you find yourself getting into fights here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:34:01",
      "upperBoundTime": "00:34:37",
      "content": "No not initially, no I didn't. One of the reasons is because I'm observant, I was- I looked around a lot and I stayed to myself to the degree of it there's a decorum, there's a way that you, I learned that from my environment on the street that you just can't go to an area and just begin to let it all hang out, you have to look at stuff first. See what's what, so that kept me away from unwanted and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:37",
      "upperBoundTime": "00:34:49",
      "content": "Yeah, in many ways, all of the stuff that you went through living on the street, all that you describe and of course that time living in the parish, that prepared you to deal with this."
    },
    {
      "speaker": "Jerry",
      "time": "00:34:49",
      "upperBoundTime": "00:35:07",
      "content": "Yeah. I'm glad you said that because I told somebody the same thing. Maybe if I would have been raised differently, I don't think that I would never made it here. Some of the stuff I saw here, it was almost identical to."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:07",
      "upperBoundTime": "00:35:28",
      "content": "Right, sure. And you had this, the smarts to kind of recognize what's going on and keep yourself out of it. So can you describe what your typical day is now? What's your typical routine?"
    },
    {
      "speaker": "Jerry",
      "time": "00:35:28",
      "upperBoundTime": "00:36:40",
      "content": "Well, based on the environment I come from, based on the environment of Angola past, post-Angola bloodiest penitentiary in the United States, all those things taught me how to teach, I can teach from that. I can actually see guys doing things or getting into things and I can use their foresight and their hindsight to tell them this or that and the take to it because they know that just from listening at me, they know that this dude's really been there and that's my typical day."
    },
    {
      "speaker": "Jerry",
      "time": "00:35:28",
      "upperBoundTime": "00:36:40",
      "content": "I counsel all day every day. Older guys, younger guys, I'm a facilitator for Malachi Dads I preach. I'm a boxing trainer. So I use these different things, programs, to not only give back to the people in the community here but to actually contain to see myself grow."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:40",
      "upperBoundTime": "00:36:47",
      "content": "Yeah, so Malachi Dads, the boxing, preaching, are there other organizations that you've been a part of here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:36:47",
      "upperBoundTime": "00:36:56",
      "content": "Yeah, lifers organization, drama club."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:56",
      "upperBoundTime": "00:36:58",
      "content": "What do you do in the drama club?"
    },
    {
      "speaker": "Jerry",
      "time": "00:36:58",
      "upperBoundTime": "00:37:40",
      "content": "Oh, drama club's a lot of different things. I know a lot of different things, I know a lot of people think of acting when they originally think of drama but it's more than acting. Some of us, like me, I was a script writer. I write scripts, I write short stories. I write raps. Poetry, like when they get ready to develop some bills for the lifer's organization, some of the drama club guys would write because they're good writers that's focus."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:40",
      "upperBoundTime": "00:37:50",
      "content": "Right, so that's pretty much your day is every day some boxing training? Like I mean in terms of when you get up and you go to bed, you do a bit of all of those things?"
    },
    {
      "speaker": "Jerry",
      "time": "00:37:50",
      "upperBoundTime": "00:38:07",
      "content": "Yeah. Yeah, yup, make up time for some reading. Sometimes, I sit around and do a little talking, fellowship is very important, talking to people."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:07",
      "upperBoundTime": "00:38:30",
      "content": "After so many years, Jerry, do you still think about the victim? I mean, what are your- how do you make sense of everything in your mind now, when you look back on everything, the crime and the victim's family and all of that. I mean, is it part of your everyday existence? Or is it something that you kind of compartmentalize and live on and it seems."
    },
    {
      "speaker": "Jerry",
      "time": "00:38:30",
      "upperBoundTime": "00:42:01",
      "content": "Well, no because I'm one of the questions you have dealing with how do you feel about the family of the victim. That's a good question because I've dealt with it for a long time. I didn't know him or his family but I met the family going to trial and I happened to know one of his family members. She went to the school that I did and once I thought about that, not at Angola, but at the parish, it broke my heart because to know that you are the cause of somebody not having a family member. There's an empty table at the chair."
    },
    {
      "speaker": "Jerry",
      "time": "00:38:30",
      "upperBoundTime": "00:42:01",
      "content": "I mean, there's an empty chair at the table because of, that's heart wrenching because I think of my family, how would my family feel if somebody just took one of the members. That special person probably meant anything to the family, now he's been extracted. So I thought about that. I thought about that hard. I've cried about that- knowing that I've read that he had a daughter. That's the only child that I know of that he had and I got one son so I thought about how his family feels and that girl growing up without her dad being around because somebody killed him."
    },
    {
      "speaker": "Jerry",
      "time": "00:38:30",
      "upperBoundTime": "00:42:01",
      "content": "Or whatsoever so that always humbles me. It always gives me a plane in my mind to understand that you are alive but he's, so there's no reason for you to feel any kind of special way or nothing like that because you re alive and somebody's not. Even with my son, one of the reasons I enjoy him so much is because I'm still living and I still can give him a chance. And I just thought about our environment, how this guy got killed in that environment just as easily as I could have gotten killed in that same environment."
    },
    {
      "speaker": "Jerry",
      "time": "00:38:30",
      "upperBoundTime": "00:42:01",
      "content": "So, I never rule out the fact that God is in control. We can in our minds, no way guarantee who lives or dies tomorrow but we can control what we do in the sense of shooting and fighting and drug uses and drug selling- those are the things we can control. So, when I think about this man dealing with forgiveness, that's how I go to the point of being and going on is because I had to learn how to forgive myself and accept God's forgiveness. I think about God's forgiveness even the forgiveness of yourself don't work."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:01",
      "upperBoundTime": "00:42:09",
      "content": "What about your own family? Who in your own family do you think has taken the hardest time with watching you come to prison?"
    },
    {
      "speaker": "Jerry",
      "time": "00:42:09",
      "upperBoundTime": "00:43:42",
      "content": "All of them. I was like the center of my family. I was the, when I come in the house, everyone they, it's still like that. And I thank God for that because even to this day, my family suffered and has suffered with me being gone because of course they've taken care of me since I've been here."
    },
    {
      "speaker": "Jerry",
      "time": "00:42:09",
      "upperBoundTime": "00:43:42",
      "content": "So it's been them virtually in prison too for 22 years. Having to drive from Shreveport which is a 5 and a half hour drive, I have to watch my sister sitting at the table and she's going to sleep because she's driven all the way from Shreveport to here all to bring my mother to see me."
    },
    {
      "speaker": "Jerry",
      "time": "00:42:09",
      "upperBoundTime": "00:43:42",
      "content": "And she fighting sleep trying to stay up to enjoy the presence of her brother so these are the sides too I had to find forgiveness for hurt in my own family. For having people in the neighborhood looked at them sideways because they're like your son is in jail for killing somebody. So, they have to go to church with that, to the grocery store, so that, I always knew was a stigma that was left with them also."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:42",
      "upperBoundTime": "00:43:51",
      "content": "Yeah is there one person who's still struggling the most in that group in your family?"
    },
    {
      "speaker": "Jerry",
      "time": "00:43:51",
      "upperBoundTime": "00:43:51",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:51",
      "upperBoundTime": "00:43:56",
      "content": "more than others? They're all just kind of getting used to it now. It's been a while I guess."
    },
    {
      "speaker": "Jerry",
      "time": "00:43:56",
      "upperBoundTime": "00:45:16",
      "content": "Well, no. I think they're they getting used to what no they don't get used to it. I think, to a degree, when you say, \"Get used to it.\" they don't accept it like that. My family, they believe in God so since they believe in God, they have a way that they think. Their thinking is ordered by the bible so when they think of me coming to prison, they think that as the result of what I have become and the way that they think toward it now is that it's the result of who have I become."
    },
    {
      "speaker": "Jerry",
      "time": "00:43:56",
      "upperBoundTime": "00:45:16",
      "content": "The way that they feel, the enjoyment they have when they see me, it's the result of something that God has done in me which changes them. It removes the bitterness and the shame and the guilt that they were used to feel in the family structure for what I did and once that's taken out of the way, now they can be free again to deal with me so when they look at me here, they don't see a murderer. They see they brother."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:16",
      "upperBoundTime": "00:45:52",
      "content": "Sure, so they cope with all of this through a religious lens in the same way that you do right so I was going to ask you about when you really try to make sense in your head about a life sentence and the possibility, people die here all the time and you're seeing it. You see everything. When you think of the possibility of dying here as well, how do you make sense of that? How do you cope with that on a daily basis?"
    },
    {
      "speaker": "Jerry",
      "time": "00:45:52",
      "upperBoundTime": "00:46:12",
      "content": "I think about it like this I think the way we see things is more controlled by our perception. If you have an incorrect perception, you're going to see the wrong thing. If you have the right perception, you're going to see the right thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:12",
      "upperBoundTime": "00:46:14",
      "content": "Okay, well what's your perception?"
    },
    {
      "speaker": "Jerry",
      "time": "00:46:14",
      "upperBoundTime": "00:46:31",
      "content": "My perception is that people make statements but they not in control of tomorrow. If you not in control of tomorrow then how can you project tomorrow with your mouth?"
    },
    {
      "speaker": "Marcus",
      "time": "00:46:31",
      "upperBoundTime": "00:46:34",
      "content": "Well, so make that make sense to me a little bit."
    },
    {
      "speaker": "Jerry",
      "time": "00:46:34",
      "upperBoundTime": "00:46:47",
      "content": "Well, somebody once said 95% of the people here is going to die here. You can't control that. Even though it's a statement that you project, you can't control that."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:47",
      "upperBoundTime": "00:47:30",
      "content": "Okay. I understand that. Nobody knows what's going to happen tomorrow. Okay, but the fact is that we craft a sense of what's going to happen tomorrow based off of what happened yesterday and the day before I mean, we're not just guessing."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:47",
      "upperBoundTime": "00:47:30",
      "content": "And I understand anything is possible but when you look at the last 20 years of what actually happened at Angola, part of what's also possible. It's possible that you may get released within 10 years. It's also possible that you may not. Do you contemplate the possibility of not getting out of here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:47:30",
      "upperBoundTime": "00:48:20",
      "content": "No. Well and I once again I'll say a little bit my family is, we think about faith. Faith controls our interior thinking so, not to say that we deny reality, we just don't look at the pessimistic side of it. It's not that I'm I see that and I know that's a possibility but I'm not going to harbor."
    },
    {
      "speaker": "Jerry",
      "time": "00:47:30",
      "upperBoundTime": "00:48:20",
      "content": "I'm not going to sit on that. I'm going to keep moving in the hope of something better. I'm going to keep studying. I'm going to keep reading. I'm going to keep getting better because I believe that this positive thing will win. Love will conquer hate eventually."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:20",
      "upperBoundTime": "00:48:30",
      "content": "Okay, that makes sense to me. So it's, I just want to asses that what your saying is that I choose not to focus on that."
    },
    {
      "speaker": "Jerry",
      "time": "00:48:30",
      "upperBoundTime": "00:48:44",
      "content": "Right. I hear it, I see it and all know it's there and I know it's there also, but I'm not going to own it- I'm not going to own that thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:44",
      "upperBoundTime": "00:48:56",
      "content": "Even in the context of dealing with conflict through this religious lens that you're talking about, which I understand. What's the worst part of this experience for you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:48:56",
      "upperBoundTime": "00:49:59",
      "content": "Seeing men die here. I answered that on the paper too. The destruction of men to me, it's took on a new meaning even though in my environment, that's exactly what I was seeing, the destruction of men, but now that I have a different way of seeing things as a grown man, I see the destruction of men as horrible. It's and this goes back to my charge, 2nd degree murder, the destruction of a man."
    },
    {
      "speaker": "Jerry",
      "time": "00:48:56",
      "upperBoundTime": "00:49:59",
      "content": "And now it's become tragic. It's terrible that people have to die in this sense. People have to die in that sense as far as murder is concerned. People have to die because they OD'd off drugs even though it's something that they chose. So the destruction of men here though AIDS and all kinds of stuff here. That's the worst part of it that I've seen."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:59",
      "upperBoundTime": "00:50:16",
      "content": "Sure, what's your plan for if you get released from here, which you know I- one would, like you said, focusing on that, do you have a specific vision of what you'll do?"
    },
    {
      "speaker": "Jerry",
      "time": "00:50:16",
      "upperBoundTime": "00:52:24",
      "content": "Oh yeah. When you see this much negativity from the age of I can't even go back that far- even up to now, you can't help but have something to offer back. Depending in the area of benevolence because when you see this much death, destruction, hate, envy, there's jealousy and these type of things, you can't help but have something that you can offer back that's beautiful, respectable, honest, wholesome and that's what I've been working on for 22 years."
    },
    {
      "speaker": "Jerry",
      "time": "00:50:16",
      "upperBoundTime": "00:52:24",
      "content": "That's why when I saw your list of questions, I told the other guys, I've been thinking about this for 22 years saying some of these things, to say to the victim that I'm sorry. To tell them I just hate that that event ever happened. But I think what better way to say it then with your whole life? Whatever you have left, to give back to because since I've been here, I've taught so many guys how to read, I've taught so many guys how to box and I've taught guys just so much stuff to build in."
    },
    {
      "speaker": "Jerry",
      "time": "00:50:16",
      "upperBoundTime": "00:52:24",
      "content": "If the worst part has been seeing the destruction of men, my goal now is to build the construction of men to have things to tell them to help just something takes just this much. Like I just said, he's a mentor right now but he didn't want to have nothing to do with the good things in life until me and he had a conversation. He just told me, said \"I remember that.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:52:24",
      "upperBoundTime": "00:52:28",
      "content": "Who is this? You were pointing to somebody."
    },
    {
      "speaker": "Jerry",
      "time": "00:52:28",
      "upperBoundTime": "00:52:53",
      "content": "The guy that just he was right there. He was out there. He was having to talk to George, but he saw me and he shook my hand. He said \"You remember when you talked to me\" He was in tears in the east yard. He was about to give up and we walked the yard together and I talked to him and I did what was natural and I talked to him and as a result, after all those years, he graduated from the Bible college and he's a mentor."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:53",
      "upperBoundTime": "00:52:54",
      "content": "That's great."
    },
    {
      "speaker": "Jerry",
      "time": "00:52:54",
      "upperBoundTime": "00:53:00",
      "content": "I don't forget about that but, I hadn't been thinking about it and he just reminded me."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:00",
      "upperBoundTime": "00:53:01",
      "content": "Sure, that's a nice thing to be reminded of."
    },
    {
      "speaker": "Jerry",
      "time": "00:53:01",
      "upperBoundTime": "00:53:03",
      "content": "Oh yeah. Yeah, it's good."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:03",
      "content": "And that's actually a good place to stop."
    }
  ]
}
