{"name":"","transcript":[{"content":"Jerry Lewis Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-4","content":"Let me start by asking you a little bit about your childhood coming up. Tell me a little bit about your family, maybe some adults that took an interest in you and cared for you. What was your family life like?"},{"speaker":"Jerry","time":"00:00:13-5","content":"Well, my family was, it was a good thing, it wasn't no bad thing. It was, see my mom always, like I said, she always, my dad, they always looked out for me. Like my dad, he kept it to where he kept me around him all the time and as I got to the age of fifteen or fourteen or sixteen or somewhere around there."},{"speaker":"Jerry","time":"00:00:13-5","content":"He kept me with him until I grew where he could throw me the key, \"here son I want you to drive me\" It's want like no, what they call it, like where police was at, like where I could drive and get in trouble because I wasn't old enough to get licensed at the time."},{"speaker":"Jerry","time":"00:00:13-5","content":"So, but he would train me to drive, and once he had trained me now he wants me to drive him. He gave me the up than my other brothers and stuff like that and even much to where he had money sack. See, he was a first class welder, at Port Allen Marine, I don't know if you've heard of that. And he was a first class welder, a farmer, and so, he had a big money sack in his back trunk, and I'm the only one knew where it was at."},{"speaker":"Jerry","time":"00:00:13-5","content":"He kept his family, well nice, but he said, \"Son, if you need anything you ain't got to steal, just ask me for it\" And he went back down to that tire, he said, 'you always once he showed me that big money sack a lot of bills, hundred dollar bills and stuff like that, he kept money, he said, \"You need anything we gone go to the store\" I remember the last time that I went, that's how I met my wife I got married up here."},{"speaker":"Jerry","time":"00:00:13-5","content":"So she was in the shopping center. But I was young, I was about, I think I was about fifteen years old. And so I told him, he was going to buy me one of them little BB guns. I said, I couldn't wait because he trying to do something else, he trying to buy stuff like car parts or something so I couldn't wait, I said, 'I'm going over here to buy the BB gun, by the, them little guns."},{"speaker":"Jerry","time":"00:00:13-5","content":"So he said, \"Yeah I'm coming over there, don't you go over there and get lost now, I'll leave you here.\" And I remember. So, I went when I was going over there they had this little chick, about three of them, they were sisters. And she put her foot out there, she kept trying to get my attention, and so they stopped me, they was young too, but a couple of them, the one I was messing with she was about my age because she was fourteen."},{"speaker":"Jerry","time":"00:00:13-5","content":"And her sister she was like in her early nineteen and the other one about twenty. Anyways, so, they was telling me, she likes you, I said yeah. So she gave me her number, I said alright, she said, \"Call me as soon as you get home\" So I said alright. So I went round there by the guns by the BB gun and, see we was born, I was born and raised in the country. We moved to Baton Rouge in '72, and so I went around there and my daddy finally got round there I said, \"I want that one there, I want that one.\" Little BB gun."},{"speaker":"Jerry","time":"00:00:13-5","content":"He said that's what you want huh? I said yeah. So we got it then went around by the clothes and stuff, picked up me a few slacks and shirts. So we left. I was trying to see where that girl at before I leave, see if she's still there. So they had, they was walking out the door, they had got a little step and so I see them, they waving. So like I said, I left, soon as I got home I went to call her."},{"speaker":"Marcus","time":"00:05:16-0","content":"Yeah. I wanted to ask you a question as you're telling me about this, you had, nineteen of your years of your life outside before you came here, and thirty-seven since. When you think back on those memories, does it seem like a completely different world? Do you think back on those first nineteen years a lot or do you find yourself mainly thinking of more recent times?"},{"speaker":"Jerry","time":"00:05:41-5","content":"What I think about all the time, I lost. And it's a lot of time, like I've lost. Its really time I've lost in the time that I've been out there, I've lost more time than I've been out there. That's what I be thinking of. And it hurts, what I'm saying."},{"speaker":"Marcus","time":"00:06:09-1","content":"Sure. Do you remember the day you came into Angola?"},{"speaker":"Jerry","time":"00:06:15-1","content":"Yeah I remember the day. All that was in my mind, I said, \"One day, I'm going to get back out of here\" And like I say, keep a calm and do the right thing, you going to get back out. But I never was like I said, to harm people or to harm somebody. And that's, I always was like that."},{"speaker":"Marcus","time":"00:06:48-1","content":"Are you a different person today?"},{"speaker":"Jerry","time":"00:06:50-6","content":"Yeah I'm a different person."},{"speaker":"Marcus","time":"00:06:52-2","content":"How are you different from the person who came here?"},{"speaker":"Jerry","time":"00:06:55-9","content":"Well, wouldn't like I said. I don't do too much associating with people. But now I do. And back then I very, I very was a talk able person and now, like I said, I try to share things with people, and do all kinds of things, what I'm saying, without."},{"speaker":"Marcus","time":"00:07:30-4","content":"What's a typical day like for you here now? What's your daily routine?"},{"speaker":"Jerry","time":"00:07:35-0","content":"Well, my daily routine is like, I manning like, I work in the kitchen, my off days I go like in the library, law library, go get into some law books. Try to really get to learn what happened to me what I'm saying, try to find some other cases like mine."},{"speaker":"Jerry","time":"00:07:35-0","content":"They've got some old books back there but I still be trying to but I ain't never seen a case like mine. Where they, how they turned my case around, I ain't never seen, then they made my case the leading case for giving a guilty plea back. And from the time like I said, I gave my guilty plea back they had an article in the criminal code I seen where you can't give no guilty plea back after sentencing."},{"speaker":"Jerry","time":"00:07:35-0","content":"But they made some kind of way made it for me to give my sentence back. And for no reason and I think when the judge sentenced me, he sentenced me to the correct sentence. Not what he did to the maximum but under manslaughter."},{"speaker":"Marcus","time":"00:09:05-4","content":"Which was what? Forty years? How many?"},{"speaker":"Jerry","time":"00:09:08-0","content":"Twenty one, and but when he did it, and during my time like I said, I had had them when I was young, when I had had a, I kept getting arrests for DWI or something like that, and then. I was like a little drinker all the time, but I never did go out and hump buggies and stuff like that."},{"speaker":"Jerry","time":"00:09:08-0","content":"And I'd mind my own business, what I'm saying, but I never did go bother nobody while I'm being intoxicated or something. Always did know how to, if I'm intoxicated I ain't going to talk about I'm going to fight you go out and like that. No, I don't do that."},{"speaker":"Marcus","time":"00:09:58-4","content":"What do you value most about your life here at Angola?"},{"speaker":"Jerry","time":"00:10:06-0","content":"No."},{"speaker":"Marcus","time":"00:10:06-7","content":"Is there anything good here?"},{"speaker":"Jerry","time":"00:10:08-6","content":"Nothing good here. Nothing I mean, I don't like it but I try to do my best to make people really understand this not no life here though. Not I try to like some people be like they happy here. I mean it's nothing to be happy here for. Its always try to, you try to have a positive mind where you gone get out."},{"speaker":"Jerry","time":"00:10:08-6","content":"Work on your case or something, don't try to it's good to get like programs in your going to programs what they have, and but don't, don't stay in the negative things like, creating things like how you came here, what I'm saying. Try to jump out of that habit what I'm saying. You've got a lot of them still in that habit. And I don't agree with them, I mean, I cherish myself from that."},{"speaker":"Marcus","time":"00:11:28-5","content":"So you say you've changed, what do you think made you change?"},{"speaker":"Jerry","time":"00:11:32-1","content":"This here place. See things was not really in here, see how things is in here. And this not no life here."},{"speaker":"Marcus","time":"00:11:46-9","content":"If you were to go before a parole board or a clemency hearing, what would you want the parole board to know about you?"},{"speaker":"Jerry","time":"00:12:00-1","content":"From the time I came in here, and the time I have been here and the way I came in here, I didn't want to do it but this just happened, and just that quick. And like I said if I had a chance to not do it again, I wouldn't do it. But and at the time at my age, I was scared."},{"speaker":"Marcus","time":"00:12:47-1","content":"You were nineteen."},{"speaker":"Jerry","time":"00:12:47-9","content":"Yeah, I was scared. And like the lawyer told them when I was at the arraignment, when the lawyer was saying, \"Look at him\" And trying to show the other guys, they was bullies. They was running the streets like bullies. And I wasn't running those streets like that. And they wouldn't, the DA wouldn't open that up. I don't know why."},{"speaker":"Marcus","time":"00:13:21-7","content":"So, the strange and frustrating thing for people who look at life sentences at Angola is that, you have so many men engaging in all of these programs, vocational training, self-help groups, and the folks who look like they're truly rehabilitated, are serving a life sentence. Do you think there's something about being given a life sentence and having to deal with that, that makes people change their lives faster than the folks who get maybe a ten or twenty year sentence?"},{"speaker":"Jerry","time":"00:14:04-7","content":"Well that have a lot to do with it, but it really have a lot to do with yourself. If you can't sit back and think about the first step before you did all this what I'm saying, when you did this, and now time has passed and you're still doing the same thing. Something got to be wrong, I mean. I be seeing a lot of guys, like I said, doing the same thing. It just keep me from being round. Just like, I'm going to put it like this, Church. Me and you go to church."},{"speaker":"Jerry","time":"00:14:04-7","content":"You're looking good in church, but when you come back to the dormitory you back to you old thing again, your old wild things you're doing again. So I'm going to eliminate myself from you what I'm saying. Even much like I said, you trying to do things, but you don't want to do it. What I'm saying but, that's bad and I see you trying to get help. That's supposed to be the place where you're trying to get help. You bring all that out."},{"speaker":"Jerry","time":"00:14:04-7","content":"Then it'll help you more inside than the outside. Because people going to look at you and say, \"Yeah he trying to really do the right thing\" The pastor gone say, \"Come on up here, let me pray for you\" And it's on you from there. What I'm saying, but a lot of them, like I said, they don't pay attention to what they doing or thinking. And I can't the only thing I can do is just if you really need something or if I can help you, I'm going to help you but I ain't just. From my aspect, I don't get off into nothing what I'm saying."},{"speaker":"Jerry","time":"00:14:04-7","content":"From the time I came here, and back then the name of the game was survival and, it done changed a lot from then. And I can't, these guys here these days here, they got they got too much going for them for them to let this come between them like that what I'm saying. I just wish I could just, wish I could've seen that back then. What I'm saying? Not when I'm seeing it now."},{"speaker":"Jerry","time":"00:14:04-7","content":"But it's really helped me what I'm saying, it really helped me and right now, today or tomorrow, if I get out of here tomorrow, I don't want to get around nobody with nothing if I see you getting, trying to do something dumb or trouble something I don't want to be around you. I mean, I wasn't around that then, but I don't want to be around that."},{"speaker":"Marcus","time":"00:17:59-9","content":"Sure. So I wanted to ask you a question about that. If and let's say when you are released from Angola, how to envision your life?"},{"speaker":"Jerry","time":"00:18:12-6","content":"Well I think I could, I think I could go out there and be a family man, be a family person. Because that's the type of, I was on the start to. But when my life was taken like I said, I don't have no kids out there. Because I was."},{"speaker":"Marcus","time":"00:18:35-5","content":"A kid."},{"speaker":"Jerry","time":"00:18:36-2","content":"Yeah, so. But right now I could go out there and make it. I got family, I got a lot of, I still have a lot of family. My mom dead, my dad done passed away, and my baby sister done passed away, but I still have a pretty large family that care about me what I'm saying, knowing that I'm going to do the right thing when I get out of here, and a lot of guys don't have that."},{"speaker":"Jerry","time":"00:18:36-2","content":"And, that might play a lot of part to them lives in here. Because they ain't got nothing to do when they get out. And that's the biggest part. When you think about, what's your next goal if you're to be released out of here, what kind of life are you going to live out there? Because you can't go out there, a lot of things have changed from the time say, it's like thirty years you ain't been out there, a lot of things have changed. I think I can, I think I can go back."},{"speaker":"Jerry","time":"00:18:36-2","content":"Because see, when I got arrested, it was hard for me to come in here, like different things. Like, I was still coming up in school and I left out, I was just going into tenth grade, and I educated myself by picking up books, newspapers, and it's helped me. And like I said, and I looked at things."},{"speaker":"Jerry","time":"00:18:36-2","content":"I still think the neighborhood where I'm from, it wasn't a bad neighborhood and I could see things where, like I said I get out of here today or tomorrow I could make it around people. Because, the things how, what I do here you could do it out there what I'm saying. I'm not hard to get along with. You might say, \"Jerry that's wrong you're doing that.\" I'm going to say, \"Yeah?\""},{"speaker":"Jerry","time":"00:18:36-2","content":"I'm going to say, \"Thank you for telling me that.\" I'm going to listen to you, but you've got some people who don't want to do that. I can't see myself doing nothing like that. If I knew it was wrong, I ain't going to do it but like I said it's, I came from a long way. Thirty-seven years."},{"speaker":"Marcus","time":"00:21:58-5","content":"Thirty-seven years. Life sentence in Louisiana means life. And that's changing for some folks. For juveniles, for those who were sentenced between 1973 and 1979 of second degree murder. Do you think things are going to change?"},{"speaker":"Jerry","time":"00:22:20-6","content":"I got a feeling things are going to change."},{"speaker":"Marcus","time":"00:22:22-3","content":"Well thank you so much for sitting with me and talking with us. I appreciate your time."}]}