{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:08",
      "content": "Jerry Williams_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:08",
      "upperBoundTime": "00:00:18",
      "content": "My name is Jerry Williams. I have a life sentence, forty year life sentence for second degree murder."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:18",
      "upperBoundTime": "00:00:20",
      "content": "And how old were you at the time?"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:20",
      "upperBoundTime": "00:00:24",
      "content": "I was, I would say 17 and a half years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:24",
      "upperBoundTime": "00:00:28",
      "content": "Okay, and you've served how much time now?"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:28",
      "upperBoundTime": "00:00:30",
      "content": "Wait a minute, excuse me, 18 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:30",
      "upperBoundTime": "00:00:33",
      "content": "Okay, that's a pretty important distinction unfortunately."
    },
    {
      "speaker": "Jerry",
      "time": "00:00:33",
      "upperBoundTime": "00:00:36",
      "content": "Yeah, right."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:36",
      "upperBoundTime": "00:00:39",
      "content": "So the amount of time you've served?"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:39",
      "upperBoundTime": "00:00:41",
      "content": "I had to serve 41 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:41",
      "upperBoundTime": "00:00:55",
      "content": "Okay, and before this, we were talking about that fact that you've got a parole hearing coming up because you are one of the 70s lifers. Could you tell me a little bit about that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:00:55",
      "upperBoundTime": "00:00:57",
      "content": "About the 40 year thing?"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:57",
      "upperBoundTime": "00:01:00",
      "content": "No, about your upcoming parole hearing?"
    },
    {
      "speaker": "Jerry",
      "time": "00:01:00",
      "upperBoundTime": "00:01:43",
      "content": "Oh yeah, well, I was on the pardon board and I asked for a time cut and I got recommended and they said well we don't need you on the pardon board no more, we going to put you on the parole board because this 280 came up, this new law, and so I was kind of thrilled about it, so I waiting around, so I got on the board and I decided to say well, I'm going to go for it go for it really so, they told me, said right now you just, have to go with one. So I decided the second one, say, take the rest of it and I don't need it."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:43",
      "upperBoundTime": "00:01:51",
      "content": "Sure, so you're expecting that this parole hearing, which is coming up in about a month or so, that you'll be released."
    },
    {
      "speaker": "Jerry",
      "time": "00:01:51",
      "upperBoundTime": "00:01:54",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:54",
      "upperBoundTime": "00:01:55",
      "content": "That will be a happy day."
    },
    {
      "speaker": "Jerry",
      "time": "00:01:55",
      "upperBoundTime": "00:01:57",
      "content": "Oh yes it will."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:57",
      "upperBoundTime": "00:02:05",
      "content": "Can you tell me how you felt when you learned about that law that you might actually be able to walk out of here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:02:05",
      "upperBoundTime": "00:03:02",
      "content": "Well when I went on the board and I'd never forget. She told me, she said, I made the board. She told me, she said, \"You going to see me again on parole board.\" And I said, well, I hope you right. So, when this law came out and I was so shocked, and I said, man, she told me this here, and so but, I wanted to tell her on that last board."
    },
    {
      "speaker": "Jerry",
      "time": "00:02:05",
      "upperBoundTime": "00:03:02",
      "content": "But I said, no, I'm going to keep it quiet and just wait because I was so thrilled about it, just being able."
    },
    {
      "speaker": "Jerry",
      "time": "00:02:05",
      "upperBoundTime": "00:03:02",
      "content": "I really be thankful and said, \"Lord, you've blessed me with this here and I'm going to take fully control of it advantage of it.\" And so, and she said \"Well you'll see me again.\" And sure enough, I said, \"I'm back on it again.\" So and I'm thrilled to get back on there."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:02",
      "upperBoundTime": "00:03:52",
      "content": "So that's a very exciting time for you and I'm happy to be able to talk with you with that coming up. Let me ask you a little bit about your early years. As I said, the point of the interview is for me to learn about who you are and some of your experience both before this event that brought you here and then all these years at Angola as well. You're particularly interesting in that you've seen it all for forty years at Angola."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:02",
      "upperBoundTime": "00:03:52",
      "content": "You've seen it go from the bloodiest prison in the country to arguably one of the most progressive prisons in the country, and I'd like to talk to you a little bit about that transition, about your experiences with that, but why don't we start with your childhood. So perhaps you could tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:03:52",
      "upperBoundTime": "00:04:22",
      "content": "Well, my grandmother really raised me but I had to go back and forth with my momma and my grandmother. But I would prefer be with my momma but circumstances I had, she was trying to get her house sold in Louisiana from Texas and we move to Louisiana and I start staying with my mom again. When I came to Louisiana, I just, I was young and I was just."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:22",
      "upperBoundTime": "00:04:25",
      "content": "How old were you when you came to Louisiana?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:25",
      "upperBoundTime": "00:04:27",
      "content": "I would say about 9 or 10."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:27",
      "upperBoundTime": "00:04:29",
      "content": "And where in Louisiana?"
    },
    {
      "speaker": "Jerry",
      "time": "00:04:29",
      "upperBoundTime": "00:04:57",
      "content": "Leesville, Vernon Parish. I been there all my life, obviously all my life because I came there as 9 years old and I was a bad little boy but I wouldn't get in no trouble or nothing but I just in a at the wrong place at the wrong time. When I grew up, this where I end up at, right here."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:57",
      "upperBoundTime": "00:05:00",
      "content": "So you have your grandmother in Texas."
    },
    {
      "speaker": "Jerry",
      "time": "00:05:00",
      "upperBoundTime": "00:05:01",
      "content": "Well, she died."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:01",
      "upperBoundTime": "00:05:06",
      "content": "Okay, right, but at the time when you grew up, you had your grandmother in Texas."
    },
    {
      "speaker": "Jerry",
      "time": "00:05:06",
      "upperBoundTime": "00:05:09",
      "content": "No, my mother was in Texas. My grandmother was in Leesville."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:09",
      "upperBoundTime": "00:05:16",
      "content": "Oh, I understand. I'm sorry. So the point was to move to Leesville. What about your dad?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:16",
      "upperBoundTime": "00:05:18",
      "content": "He died when I was young."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:18",
      "upperBoundTime": "00:05:23",
      "content": "Okay. And were there other men who came into your mother's life who then became-"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:23",
      "upperBoundTime": "00:05:54",
      "content": "There was a- well see, I was staying with my grandmother for a little while and then I moved back with Momma because she had me and the dude couldn't see eye to eye, so I went to stay with my grandmother. If I wasn't with my real dad, I didn't want to be with no other dad, and that's where I was at with it. But as the years go on, he died, and I called him a step-dad, and he died and so we was."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:54",
      "upperBoundTime": "00:05:56",
      "content": "What about brothers and sisters?"
    },
    {
      "speaker": "Jerry",
      "time": "00:05:56",
      "upperBoundTime": "00:06:27",
      "content": "Well I got- I had six brothers with me and two sisters. I got one sister left one died and one brother died. The rest of us still living. And they're very important. They take care of me, since I've been here. I got a twin brother named Terry, my name Jerry and that's my heart there, that's what really what I just."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:27",
      "upperBoundTime": "00:06:30",
      "content": "Of all your siblings, are you closest with your twin?"
    },
    {
      "speaker": "Jerry",
      "time": "00:06:30",
      "upperBoundTime": "00:06:44",
      "content": "Oh yes indeed like I said that's my we came out, I'm the oldest, but I'm five minutes older than he is but I love him to death. That's my heart there."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:44",
      "upperBoundTime": "00:06:45",
      "content": "Where is he?"
    },
    {
      "speaker": "Jerry",
      "time": "00:06:45",
      "upperBoundTime": "00:08:07",
      "content": "He in Leesville. He still come up here. He be up here for the board and my sister and his wife and all the rest of them going to be here because they, they support me a lot. When we just go back to where we started from but, I was young man, when I first got this charge."
    },
    {
      "speaker": "Jerry",
      "time": "00:06:45",
      "upperBoundTime": "00:08:07",
      "content": "And I done made some mistakes I wasn't perfect, but I've learned since I've been here. I done seen so much stuff and been offered to so much stuff. But I wasn't and somehow I've got a hold a grip on myself when I got here and said I want to do something different with my life."
    },
    {
      "speaker": "Jerry",
      "time": "00:06:45",
      "upperBoundTime": "00:08:07",
      "content": "So, I said in order for me to do that I got to make trustee, I've got to do this here and do it right. And so I made trustee when I first got here cooking in the kitchen, baking, I've baked everywhere on this farm. I ain't the best baker but I could bake, I could I like cooking and baking. That's my thing. And I said I want to do something with myself so I learned how to cook and bake and drive tractors. I didn't know none of this kind of stuff, but I wanted to learn."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:07",
      "upperBoundTime": "00:08:25",
      "content": "Sure and I'm going to get to that because most of your life has been here, right? We're going to spend most of the time talking about that. But, again, I want to explore a little bit more about your life before you came here, so you have a twin brother, some other siblings. You're in Leesville. You start going to school in Leesville?"
    },
    {
      "speaker": "Jerry",
      "time": "00:08:25",
      "upperBoundTime": "00:08:31",
      "content": "Well, I dropped out of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:31",
      "upperBoundTime": "00:08:32",
      "content": "What was the last grade that you completed?"
    },
    {
      "speaker": "Jerry",
      "time": "00:08:32",
      "upperBoundTime": "00:08:40",
      "content": "I was in what they call, my fifth grade, something like that. I'm going to say fifth. I dropped."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:40",
      "upperBoundTime": "00:08:48",
      "content": "Okay, so fifth grade, you're eleven or so, ten or eleven years old. And what are you doing if you're not in school?"
    },
    {
      "speaker": "Jerry",
      "time": "00:08:48",
      "upperBoundTime": "00:09:13",
      "content": "We're running up and down playing, and this and because I didn't have no role model, to say \"Hey, do this here and do this here\" Because my momma was trying to work and keep the bills and pay the bills and I thought shoot dice and hustling but I was young, and trying to help out because she needed help."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:13",
      "upperBoundTime": "00:09:18",
      "content": "And when you say \"hustling\" as an eleven year old, what kind of hustling did you do?"
    },
    {
      "speaker": "Jerry",
      "time": "00:09:18",
      "upperBoundTime": "00:09:49",
      "content": "Well, see, I used to shoot dice, I used to love to shoot dice and I used to get my little quarters and nickels and raise them up and I go up there, and get on a corner and shoot dice and win a little money. I used to get so scared, I used to win so much money they called me that's my nickname on the streets. Because I used to shake dice all the time, just walk around and shake dice because I just wanted to make some money to try to help out and that's what I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:49",
      "upperBoundTime": "00:09:50",
      "content": "What about your twin?"
    },
    {
      "speaker": "Jerry",
      "time": "00:09:50",
      "upperBoundTime": "00:10:24",
      "content": "He did the same thing then. Not only that, my other side hustle was shining shoes. I used to go to the army base, you've probably heard of Fort Polk, I used to go out there, sneak out there, and shine the soldier's shoes for, back then fifty, sixty cents. Fifty cents, a quarter whatever I could get. And that's how I used to make my little money to shoot dice and stuff. But I never did get in no kind of trouble with I ain't never have no problems with drugs or any of that kind of stuff. I just liked to shoot dice."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:24",
      "upperBoundTime": "00:10:44",
      "content": "So you're doing this and I think I have a picture of it. I need you to maybe paint me more of a picture of your house in Leesburg, I've never been there. So let's say we go back in time and let's say I'm sitting with you on the front doorstep of your house looking out into the neighborhood, what am I seeing? What am I hearing?"
    },
    {
      "speaker": "Jerry",
      "time": "00:10:44",
      "upperBoundTime": "00:11:04",
      "content": "Well, we didn't have a, in our neighborhood, we didn't have no laws according to houses. My momma bought a house, about fourth bedroom house and it was on one street with about, one, two, about three houses on that street that was it."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:04",
      "upperBoundTime": "00:11:06",
      "content": "Okay, in a rural area?"
    },
    {
      "speaker": "Jerry",
      "time": "00:11:06",
      "upperBoundTime": "00:11:08",
      "content": "The rural area, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:08",
      "upperBoundTime": "00:11:08",
      "content": "Okay, I got it."
    },
    {
      "speaker": "Jerry",
      "time": "00:11:08",
      "upperBoundTime": "00:11:21",
      "content": "So, we had a driveway she had a car and that's what you'd see right there. I used to go to my uncle and them house and shoot dice and that's where they used to shoot dice."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:21",
      "upperBoundTime": "00:11:37",
      "content": "Okay, alright, I think I get a better picture of it. So was there any other person other than your mother and your grandmother, an adult that took an interest in you, that was very close to you or was it just those two women in your life?"
    },
    {
      "speaker": "Jerry",
      "time": "00:11:37",
      "upperBoundTime": "00:11:43",
      "content": "Well, my baby sister. I and she were real close too."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:43",
      "upperBoundTime": "00:11:44",
      "content": "Is she still living?"
    },
    {
      "speaker": "Jerry",
      "time": "00:11:44",
      "upperBoundTime": "00:11:45",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:45",
      "upperBoundTime": "00:11:45",
      "content": "What's her name?"
    },
    {
      "speaker": "Jerry",
      "time": "00:11:45",
      "upperBoundTime": "00:11:53",
      "content": "Sheila. And she's my other."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:53",
      "upperBoundTime": "00:11:53",
      "content": "You're other twin."
    },
    {
      "speaker": "Jerry",
      "time": "00:11:53",
      "upperBoundTime": "00:11:59",
      "content": "Yeah. They say we look just like each other too."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:59",
      "upperBoundTime": "00:12:05",
      "content": "I think it's wonderful that you have that support system through all these years. It's pretty unusual."
    },
    {
      "speaker": "Jerry",
      "time": "00:12:05",
      "upperBoundTime": "00:12:28",
      "content": "Well, if my mom were here, if my grandmother were still living, that would be, I probably wouldn't have been here this long because my momma, she was messed up when I got here because she died from cancer. Over when I was up here. My grandmother died when I was up here, and that's took a lot from me."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:28",
      "upperBoundTime": "00:12:35",
      "content": "Of course, do you remember the last interaction you had with your mother?"
    },
    {
      "speaker": "Jerry",
      "time": "00:12:35",
      "upperBoundTime": "00:12:37",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:37",
      "upperBoundTime": "00:12:38",
      "content": "Was it a visit?"
    },
    {
      "speaker": "Jerry",
      "time": "00:12:38",
      "upperBoundTime": "00:12:49",
      "content": "Yeah, before she died, she asked, she wanted to see me before she died, and I was down here so they brought me to the hospital."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:49",
      "upperBoundTime": "00:12:51",
      "content": "In Leesville?"
    },
    {
      "speaker": "Jerry",
      "time": "00:12:51",
      "upperBoundTime": "00:13:44",
      "content": "No, I believe it was in, I want to say it was in Lake Charles. I believe it was in Lake Charles hospital. She was like, I didn't even know who she was, until she had cancer, she had lost so much weight, I said. I went to somebody else. They said \"No, over here Jerry\" So I didn't even know who she was until, and she was sick I wouldn't get no visits I would get the visits from other people, but not from her so I didn't know who she was, so when I went and saw her man, that took a toll on me. But, just like I said, only wish she had was, all of us was grown, and I feel like all of us was grown. And I was just, I thank God for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:44",
      "upperBoundTime": "00:13:49",
      "content": "Did she die before your grandmother died?"
    },
    {
      "speaker": "Jerry",
      "time": "00:13:49",
      "upperBoundTime": "00:14:06",
      "content": "No, she died before, I'm pretty sure she did die before my grandmother. I'm not for really for sure but- man, I try and keep it there in my head, but I try to keep up, but I believe she died before my grandmother, though my grandmother's came before."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:06",
      "upperBoundTime": "00:14:09",
      "content": "Do they all come up here for the rodeo?"
    },
    {
      "speaker": "Jerry",
      "time": "00:14:09",
      "upperBoundTime": "00:14:13",
      "content": "My brother and they do. My momma and they never did."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:13",
      "upperBoundTime": "00:14:16",
      "content": "Are they going to be up here for this year's rodeo?"
    },
    {
      "speaker": "Jerry",
      "time": "00:14:16",
      "upperBoundTime": "00:14:18",
      "content": "Well, I hope not."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:18",
      "upperBoundTime": "00:14:20",
      "content": "Oh yes, so maybe for the first rodeo."
    },
    {
      "speaker": "Jerry",
      "time": "00:14:20",
      "upperBoundTime": "00:14:22",
      "content": "Yes, that's right, for the first one, they might."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:22",
      "upperBoundTime": "00:14:24",
      "content": "But then, on the 11th, you're going home."
    },
    {
      "speaker": "Jerry",
      "time": "00:14:24",
      "upperBoundTime": "00:14:27",
      "content": "Yeah, yeah, that's right."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:27",
      "upperBoundTime": "00:14:34",
      "content": "Okay, great. Was there a lot of fighting in your neighborhood, in Leesburg, as a teenager?"
    },
    {
      "speaker": "Jerry",
      "time": "00:14:34",
      "upperBoundTime": "00:15:04",
      "content": "Well, no we ain't never had none of that drama. I used to fight but it wasn't like… It was like, family. Our friends, we was all raised up together and let's say, right now, me and you get in a fight, your brother coming, my big brother coming, and we'll just let them fight but if you going to jump in, I going to jump in and we'll just fight like that and break it up and go back shooting marbles or what we was going."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:04",
      "upperBoundTime": "00:15:09",
      "content": "Sure. So do you remember the first time you got arrested?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:09",
      "upperBoundTime": "00:15:10",
      "content": "Oh yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:10",
      "upperBoundTime": "00:15:11",
      "content": "What was that about?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:11",
      "upperBoundTime": "00:15:51",
      "content": "I went to, I had found something- I'll never forget this here. I found a- a little just a little weed and but I didn't get busted with that though now. But I found it and give it to somebody that. I'm thinking it was like a narc a narcotic. And I thought, I'm to sell it. I sold it. I no drug dealer or nothing, but I found it and, go on, and I got busted and that's the only time I ever kind of got in trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:51",
      "upperBoundTime": "00:15:52",
      "content": "Okay. How old were you then?"
    },
    {
      "speaker": "Jerry",
      "time": "00:15:52",
      "upperBoundTime": "00:15:57",
      "content": "I was about 13."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:57",
      "upperBoundTime": "00:16:04",
      "content": "Okay, alright. So did you, as you did you ever feel the need to have a firearm?"
    },
    {
      "speaker": "Jerry",
      "time": "00:16:04",
      "upperBoundTime": "00:16:04",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:04",
      "upperBoundTime": "00:16:11",
      "content": "Okay, so can you briefly tell me what led up to the event that led up to prison here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:16:11",
      "upperBoundTime": "00:17:48",
      "content": "Alright, well we, one night, there was four of us. Me, Benny Ray, Freddie Johnson, and myself. We always just riding around, just having a good time just really, just riding around and we got broke. I was the type, like I said, I didn't like to get broke."
    },
    {
      "speaker": "Jerry",
      "time": "00:16:11",
      "upperBoundTime": "00:17:48",
      "content": "I always like to have money and the car was getting and we'd ride and I'm talking we are going to Texas and back this way because Leesville and Texas are very close to each other and so we were riding back and forth. We decide to go to Fort Port, I said man, and we don't have no money."
    },
    {
      "speaker": "Jerry",
      "time": "00:16:11",
      "upperBoundTime": "00:17:48",
      "content": "So I said, let's stop and get something at the not we got in the car, all four of us in the car and one of them said \"We ain't got no money\" Said \"Let's go rob this\" The first thing I said \"Oh so bad\" So I agree, so I said, we all agreed and went in the store, took the money, got in the car, left. One of them said, \"Well, his seen our face. We got to bring him and do him in.\" I said, \"Oh no man, I can't be down with this.\" So but, \"Man, you've.\" About me being young and we're all young really and there you go."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:48",
      "upperBoundTime": "00:17:51",
      "content": "Okay, so you went back to the store?"
    },
    {
      "speaker": "Jerry",
      "time": "00:17:51",
      "upperBoundTime": "00:17:55",
      "content": "Went back to the store, got him, brought him back and killed him and…"
    },
    {
      "speaker": "Marcus",
      "time": "00:17:55",
      "upperBoundTime": "00:17:59",
      "content": "Sure and were all, did you say four of you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:17:59",
      "upperBoundTime": "00:17:59",
      "content": "Four of us."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:59",
      "upperBoundTime": "00:18:02",
      "content": "Were all four of you charged with second degree murder?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:02",
      "upperBoundTime": "00:18:34",
      "content": "No, one was just, we all was charged with first degree first. I copped out to second degree because I was young me and my other friend about well, three of us. One turned state on us though see. One had turned state on us. Two of us copped out and one went to trial. And he got a life sentence without parole or anything else, me too. But I got a forty year life. He got a natural life."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:34",
      "upperBoundTime": "00:18:36",
      "content": "What about the others? Did everybody get a life sentence?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:36",
      "upperBoundTime": "00:18:49",
      "content": "Well, no. The one who turned state got 15 years. He got out. He been out for years. And the one copped out with me. He got out."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:49",
      "upperBoundTime": "00:18:51",
      "content": "How did he get out? Through the pardon parole?"
    },
    {
      "speaker": "Jerry",
      "time": "00:18:51",
      "upperBoundTime": "00:19:04",
      "content": "Right, he went on the parole board and got turned loose years ago, years ago though and I just. I got one more friend up on here named Freddie Johnson and"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:04",
      "upperBoundTime": "00:19:09",
      "content": "And he's serving a Natural Life sentence. His only way to get out."
    },
    {
      "speaker": "Jerry",
      "time": "00:19:09",
      "upperBoundTime": "00:19:10",
      "content": "Although juvenile."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:10",
      "upperBoundTime": "00:19:11",
      "content": "He was a juvenile."
    },
    {
      "speaker": "Jerry",
      "time": "00:19:11",
      "upperBoundTime": "00:19:16",
      "content": "He was a juvenile. He was fifteen. So he's probably."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:16",
      "upperBoundTime": "00:19:18",
      "content": "So he's parole eligible."
    },
    {
      "speaker": "Jerry",
      "time": "00:19:18",
      "upperBoundTime": "00:19:23",
      "content": "What? But not yet, so he. So he got parole, he went back to court, got on parole."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:23",
      "upperBoundTime": "00:19:31",
      "content": "Do you remember the bus ride coming into Angola?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:31",
      "upperBoundTime": "00:19:31",
      "content": "Yes"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:31",
      "upperBoundTime": "00:19:36",
      "content": "Can you tell me about what's going on in your head? First of all, it was a dirt road, wasn't it?"
    },
    {
      "speaker": "Jerry",
      "time": "00:19:36",
      "upperBoundTime": "00:20:17",
      "content": "It was, man and this friend right here didn't come with me. The other one came with me. Billy Ray came with me and when we coming in on a road. I said, \"Man, this is it, my life is over.\" And I said, well, all only thing I can do is try to make the best of it. I said, but one thing I'm not going to do, I'm not going to let nobody mess over me. So when I got here, I had to put it in my mind- I'm not going to let nobody mess over me, nobody, and I mean that."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:17",
      "upperBoundTime": "00:20:19",
      "content": "And this is the late 70s."
    },
    {
      "speaker": "Jerry",
      "time": "00:20:19",
      "upperBoundTime": "00:21:06",
      "content": "Yeah. Late 70s. I said, I'm not going to let nobody mess over me. And so, I used to fight. And my partner, Billy Ray, they used to jump on him. I used to help fight for him I said \"Man, I just wasn't going to stand for it\" But I learned down the road, I said, this ain't the way it go leave that alone, so. And that's how I got to become trustee. I've been trustee for about 32 years ain't never lost it and I had some good jobs. I done worked for the warden's house in his house. I done had some nice jobs and I learned a lot, like I said."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:06",
      "upperBoundTime": "00:21:19",
      "content": "Sure, sure. You were so young. Did you have any intimate relationships with any girls that stand out in your mind before you were incarcerated?"
    },
    {
      "speaker": "Jerry",
      "time": "00:21:19",
      "upperBoundTime": "00:21:21",
      "content": "Oh yes! I had- I had- oh yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:21",
      "upperBoundTime": "00:21:22",
      "content": "Any children?"
    },
    {
      "speaker": "Jerry",
      "time": "00:21:22",
      "upperBoundTime": "00:21:23",
      "content": "No children."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:23",
      "upperBoundTime": "00:21:34",
      "content": "No children, okay, and the other question I have is were drugs and alcohol a part of your life coming up as an adolescent in terms of you using it?"
    },
    {
      "speaker": "Jerry",
      "time": "00:21:34",
      "upperBoundTime": "00:21:44",
      "content": "Well, I used to like to drink a little bit but not as get drunk? I never did like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:44",
      "upperBoundTime": "00:22:05",
      "content": "So I have another question before we move on to Angola completely and that is, let's say this thing didn't happen that day, right? Let's just say, you didn't go to the 7/11 someone said \"no, we're not going to do this\" and you keep driving. How do you imagine the rest of your life would have unfolded?"
    },
    {
      "speaker": "Jerry",
      "time": "00:22:05",
      "upperBoundTime": "00:22:46",
      "content": "Well, I and my twin was talking about this same thing. He said, I feel like that I would have about four five kids, house, and car. Doing good I wouldn't know, I ain't got no bad family, believe me now. None of them is bad. I got a good family and I just got off on the wrong trail but if I regret every bit of it today that I should've turned around but I didn't so. It's spilled milk on the table but I learnt."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:46",
      "upperBoundTime": "00:23:14",
      "content": "It's this one thing, it was the first serious thing in your life and you're eighteen. So, before leaving your time before you came here, is there anything about your adolescence, your childhood, that's kind of important in forming who you are that we didn't get a chance to talk about? And we covered quite a bit of thing, but is there something else that I should have asked you about your childhood that I didn't ask you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:14",
      "upperBoundTime": "00:23:15",
      "content": "About my charge?"
    },
    {
      "speaker": "Marcus",
      "time": "00:23:15",
      "upperBoundTime": "00:23:19",
      "content": "About your childhood."
    },
    {
      "speaker": "Jerry",
      "time": "00:23:19",
      "upperBoundTime": "00:23:20",
      "content": "Not really."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:20",
      "upperBoundTime": "00:23:49",
      "content": "Okay, yeah I think we covered some things there. So, as you said, you've been a trustee for 32 years, this is, you're the perfect example of a person who comes here very young, turns his life around, and now begs the question, does it make sense to keep you here? When you look back to when you first arrived here, how would you describe that person?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:49",
      "upperBoundTime": "00:24:46",
      "content": "Oh man, I was really young, bitter, going through my I didn't want to hear nothing all I wanted to do was man, because I was scared really. If I'm being straight up, I was just scared. So far, I'd heard about it, and some of them look so rough around, it's a, I say, man, but I looked at it and I see, I say, you bleed just like me, he walk like me, he puts his pants on like me, so, what I'm going to be scared of?"
    },
    {
      "speaker": "Jerry",
      "time": "00:23:49",
      "upperBoundTime": "00:24:46",
      "content": "I say, if he put his hands on me, we going to go somewhere, and that's the way I had to look at it. And I thought about it, I say, well, then when I got up and I aged a little bit, a little older. I say, enough of this here, man I can do something better than here man I don't want to stay here the rest of my life, so I want to."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:46",
      "upperBoundTime": "00:24:50",
      "content": "Sure. Did you end up getting quite a few write ups when you first got here, spending some time in a cell?"
    },
    {
      "speaker": "Jerry",
      "time": "00:24:50",
      "upperBoundTime": "00:24:57",
      "content": "Well, I been to J one time. Once since I been here."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:57",
      "upperBoundTime": "00:24:58",
      "content": "Was that early on?"
    },
    {
      "speaker": "Jerry",
      "time": "00:24:58",
      "upperBoundTime": "00:25:14",
      "content": "That was early. Yup yeah and I didn't like it one bit because, and that's what really helped me turn my life around. Because I said okay I can't live like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:14",
      "upperBoundTime": "00:25:15",
      "content": "Was it for a fight?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:15",
      "upperBoundTime": "00:25:30",
      "content": "Nope, it was for a knife. It really wasn't my knife to tell you the truth. It wasn't mine, but I kept it when I got it, when I found it. I said, well I'm going to keep it."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:30",
      "upperBoundTime": "00:25:35",
      "content": "Yeah, I mean early seventies, late eighties, pretty much everybody needed something."
    },
    {
      "speaker": "Jerry",
      "time": "00:25:35",
      "upperBoundTime": "00:25:39",
      "content": "Yeah, everybody needed something to work with."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:39",
      "upperBoundTime": "00:25:50",
      "content": "Yeah, absolutely. So you're obviously a completely different person now, as everyone would be after forty years. How would you describe yourself now?"
    },
    {
      "speaker": "Jerry",
      "time": "00:25:50",
      "upperBoundTime": "00:26:02",
      "content": "Well, I don't have the education like the rest of them got, but I learn a lot. I'm a club president of a club."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:02",
      "upperBoundTime": "00:26:04",
      "content": "Which club?"
    },
    {
      "speaker": "Jerry",
      "time": "00:26:04",
      "upperBoundTime": "00:26:34",
      "content": "Wonders of Joy. An achievement organization, I did with sports and anything you can. And I helped out around when any other club asks me for, hey, man I need you over here, I'm there and just like I said, I've grown to another level because I want to do something different with my life. And just like I said, I've been a club president for twenty-three years."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:34",
      "upperBoundTime": "00:26:37",
      "content": "Is that what occupies most of your time here?"
    },
    {
      "speaker": "Jerry",
      "time": "00:26:37",
      "upperBoundTime": "00:26:52",
      "content": "Well, definitely keep me, keep me just outta, I call it outta trouble because I just don't like, I just hang around up here and do my little work and cook, eat, I do what I like."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:52",
      "upperBoundTime": "00:26:53",
      "content": "And stay away from…"
    },
    {
      "speaker": "Jerry",
      "time": "00:26:53",
      "upperBoundTime": "00:26:55",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:55",
      "upperBoundTime": "00:27:02",
      "content": "So, tell me a little bit about the other organizations you've been a part of while you've been here. The club president for 23 years, that's a long time."
    },
    {
      "speaker": "Jerry",
      "time": "00:27:02",
      "upperBoundTime": "00:27:27",
      "content": "Yeah, I had a church called Christian Unity- a religious church inside the club and we've had church on Sundays and Wednesdays we go to the A building and bring, they have outside guests come in and stuff like that. Like I said, I mostly just grew up here."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:27",
      "upperBoundTime": "00:27:42",
      "content": "Yeah, yeah you did. Can you tell me a little bit about some of the changes that you've seen happen at Angola from when you first came here to what it is now and why you think it changed?"
    },
    {
      "speaker": "Jerry",
      "time": "00:27:42",
      "upperBoundTime": "00:29:01",
      "content": "Well, it's difficult of most of the wardenship. Some of them is pretty fair. Honestly, I ain't never had a problem with none of them and the reason why it changed. What really changed this prison around is Warden Kane, King. I'm being truthful everybody saying he hard, but no, he just kept it real he just kept his thing and he was all about his business. And he changed this thing around from a bloody prison to, you can come in here I feel like a kid can come now in here."
    },
    {
      "speaker": "Jerry",
      "time": "00:27:42",
      "upperBoundTime": "00:29:01",
      "content": "I feel like and ain't no harm if you don't run into nothing trying to be a bully, you ain't got to worry about nothing. You can lay your head down in your bed at night and sleep good. You got no problems, but you one of them type you want to be one of the boys or you got to, I mean one time, you could sleep like the cell one eye open and now you ain't got to do that no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:01",
      "upperBoundTime": "00:29:03",
      "content": "Why do you think that is?"
    },
    {
      "speaker": "Jerry",
      "time": "00:29:03",
      "upperBoundTime": "00:29:27",
      "content": "Like I said, Warden Kane, King came here and said, he said, I'm not going to take it from you, you're going to give it to me. So, most of them, they do it. They just reach out and just don't want to change. He said, alright, he put churches, churches all the way around. He built stuff. He just changed, he changed."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:27",
      "upperBoundTime": "00:29:47",
      "content": "Let me ask you this, Mr. Williams it's so long ago, but when you look back on the crime and the victim, what are your feelings about it now? I mean, you've been punishing, you've been punished for 41 years."
    },
    {
      "speaker": "Jerry",
      "time": "00:29:47",
      "upperBoundTime": "00:30:24",
      "content": "I said is that I was young and stupid. I wouldn't, if I could change it right now, I would. I'd turn this whole thing around because I wasn't raised that right there. I ain't never killed no body in my life, but now, you don't there's certain things you have to go through with up here. That means that, if you didn't, you got to say you did. You got to say you did because they don't want to hear about \"Oh you.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:30:24",
      "upperBoundTime": "00:30:48",
      "content": "One of the other things that I think tend not to be part of the discussion is that there are two: there's the victim and victim's family and then there's also the different roles you all played in that. But then, for all of you guys, there's the impact on your own families when they have to watch you go through this. So can you tell me a little bit about the impact that this had on your family?"
    },
    {
      "speaker": "Jerry",
      "time": "00:30:48",
      "upperBoundTime": "00:31:52",
      "content": "Well, I look at it that I ain't get a chance to really grow up with my family. I grew up with my side, Richard, this is what I call my family. Some of the ones I sleep with, maybe forty thirty forty years with and I learned them and I got to be friends with them and all the stuff."
    },
    {
      "speaker": "Jerry",
      "time": "00:30:48",
      "upperBoundTime": "00:31:52",
      "content": "But, my own personal family, they victims too because they wanted to be with me and they come on in long rows out there to see me all the time and sometimes I tell them \"You don't got to come, just send me a couple dollars\""
    },
    {
      "speaker": "Jerry",
      "time": "00:30:48",
      "upperBoundTime": "00:31:52",
      "content": "The road, I'm from Leesville, way up there, so it takes a while to get here so I say, you don't get on no highway, just send me a little something, I'm cool. But, I know they want to come and see me."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:52",
      "upperBoundTime": "00:31:56",
      "content": "You must remember your trial."
    },
    {
      "speaker": "Jerry",
      "time": "00:31:56",
      "upperBoundTime": "00:31:58",
      "content": "Well, I didn't have a trial."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:58",
      "upperBoundTime": "00:32:13",
      "content": "I'm sorry, you plead, yes, you said that. Okay. If you think about your family, who was it hardest on to see you come here? Who took it the worst?"
    },
    {
      "speaker": "Jerry",
      "time": "00:32:13",
      "upperBoundTime": "00:32:14",
      "content": "My twin."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:14",
      "upperBoundTime": "00:32:20",
      "content": "Your twin yeah."
    },
    {
      "speaker": "Jerry",
      "time": "00:32:20",
      "upperBoundTime": "00:33:34",
      "content": "He took it real hard. I got counsel and I stay in the Heartbellow, Heartfellow. They moved me from. Down here to Angola to Hunts because I had to go through treatment and stuff. And now he took it so hard on to a man who I ain't ever seen the warden I said it's so good the warden allow the privilege to come see his brother, from another prison die, and that's kind of the impact we had."
    },
    {
      "speaker": "Jerry",
      "time": "00:32:20",
      "upperBoundTime": "00:33:34",
      "content": "Man, that's, now, he got cancer. So now I want to be out there with him, that's my main role. See if what man onto my I want to be there, and I thought I would have been. I told him, I said, I'm coming, because I should just be cool. I'm coming. I want to be there for him."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:34",
      "upperBoundTime": "00:34:01",
      "content": "You are. Let me ask you this. Let's go with that. So you've obviously spent quite a bit of time imagining your life outside of this prison, and for forty years you've probably been imagining what you could do if you left, and now here it is finally coming to life. What are your plans for the future?"
    },
    {
      "speaker": "Jerry",
      "time": "00:34:01",
      "upperBoundTime": "00:35:18",
      "content": "Well, matter of fact, we talked about this too. I say, he got his wife, they married. They got good little piece of land, and he told me said man and got a house for me, right in the back of it. He said, man that's yours. I said, no. I said I'm going to come there, stay with y'all for a little bit. I want to do something of my own. I say I'm going away. I say, I know how to work. Ain't nothing wrong with me? I say, I had counsel. God blessed me."
    },
    {
      "speaker": "Jerry",
      "time": "00:34:01",
      "upperBoundTime": "00:35:18",
      "content": "He have my body so I say I can still work and I like working. Dude who said in the club say Jerry, you're a workaholic he said, all you do is work. Because that's keeping me going and people be thinking I be, sometimes, older because I be moving so much, doing so much stuff, and I like doing it. I like to stay cooking, or doing something, like right now. I'd be selling sausages if I weren't with you right now. I would be selling sausages. Smoked sausages hot wing, that's my thing. Making some dollars, for the club."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:18",
      "upperBoundTime": "00:35:22",
      "content": "Sure. So you see yourself going, doing something with cooking?"
    },
    {
      "speaker": "Jerry",
      "time": "00:35:22",
      "upperBoundTime": "00:35:48",
      "content": "Yeah! Oh man, what I would like to do is get a little business, little something just make it, just like I said, I ain't going to live long, too long. Because people don't live that long. Well, I hope I do. I hope I live like my grandmother and them do 101, 102 stuff like that, but I it ain't going to be that good."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:48",
      "upperBoundTime": "00:35:50",
      "content": "Are you like 59 now?"
    },
    {
      "speaker": "Jerry",
      "time": "00:35:50",
      "upperBoundTime": "00:35:54",
      "content": "I am 59 years old. Be 60 in November."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:54",
      "upperBoundTime": "00:35:55",
      "content": "Yeah, you got some time."
    },
    {
      "speaker": "Jerry",
      "time": "00:35:55",
      "upperBoundTime": "00:36:15",
      "content": "Yeah, my thing is, I want to go out there and just live. Just go get me a little house. Just live. Make my little money. Get me a little job, a little woman, just chill. So, that's all I want to do is live."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:15",
      "upperBoundTime": "00:37:07",
      "content": "Yeah, I get that. So, let me ask you a question about coping. One of the things I've been exploring in this project is how men cope with the reality of an endless sentence- a life without parole sentence with no hope in sight how people handle that. Some people have found they'll talk about putting their life's in God's hands as it were just turning to religion to comfort that reality, right."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:15",
      "upperBoundTime": "00:37:07",
      "content": "Some people just distract themselves, they don't think about it they refuse to think about it. Other people are in denial and say that they're going to get out no matter what. For the forty years that you've been here, most of those years have been, there's been no hope that something's going to change."
    },
    {
      "speaker": "Jerry",
      "time": "00:37:07",
      "upperBoundTime": "00:39:18",
      "content": "Well, just like I said, when I first got here, I went on the pardon board and I tried. I said well, and I made it. Got my time cut to sixty years. Government food aside. So I said this is it. So I worked for the warden. I tried to get to the c barracks, the barracks. I feel like if I get there, I can show them what I can do that's work and work my way out."
    },
    {
      "speaker": "Jerry",
      "time": "00:37:07",
      "upperBoundTime": "00:39:18",
      "content": "This what I put in my mind I can work my way on out of this prison. Do something that somebody going to take a liking to and help me or I'm just. Its people help that take a notice in us and that reminds me of Mr. Turner Williams, Bishop Turner here I remember, that he used to work that the back there and man took a liking to me."
    },
    {
      "speaker": "Jerry",
      "time": "00:37:07",
      "upperBoundTime": "00:39:18",
      "content": "He had money, helped it, now he a free man and you give up hope, see. And I'm a fool, I'm a man, like I said, I'm not going to give up. If, I miss that boy, I'm still not going to give up. I think like this here. I think God, he's given me opportunity, this an opportunity. But I feel like myself now, I'm going to make it. I took that out my vocabulary, \"I'm not going to make it.\" I'm going to make it."
    },
    {
      "speaker": "Jerry",
      "time": "00:37:07",
      "upperBoundTime": "00:39:18",
      "content": "That's where I put it at. And I tell dudes, in the club now I got a little thing, I talk to everybody, mostly body. Ones who go on the board, I say, you got to stop saying \"Man what you think them- they over asking me- what you think them going to do?\" I say man, what you got to do, is you got to give it to God and just walk in there and be honest. That's all you got to do is be honest with it, not with them, with yourself and tell them say man."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:18",
      "upperBoundTime": "00:39:28",
      "content": "Sure, I get that. What has been the worst part of this experience for you?"
    },
    {
      "speaker": "Jerry",
      "time": "00:39:28",
      "upperBoundTime": "00:39:32",
      "content": "Well, the worst is being away from my family."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:32",
      "upperBoundTime": "00:39:40",
      "content": "Yeah. If there is a best part of it what would that be?"
    },
    {
      "speaker": "Jerry",
      "time": "00:39:40",
      "upperBoundTime": "00:39:43",
      "content": "With them. The best part?"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:43",
      "upperBoundTime": "00:39:55",
      "content": "What- well in the experience that you've gone through, if the worst part is being away from your family, is there a best part of Angola?"
    },
    {
      "speaker": "Jerry",
      "time": "00:39:55",
      "upperBoundTime": "00:40:03",
      "content": "No. I'm afraid not, I'm afraid not."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:03",
      "upperBoundTime": "00:40:20",
      "content": "Well, we are getting down to the last couple of questions one of which is when you look back on all the time you spent here and all the things you've done, what are you the most proud of?"
    },
    {
      "speaker": "Jerry",
      "time": "00:40:20",
      "upperBoundTime": "00:41:03",
      "content": "Well, old friend, you probably know him, I'd never could get him out of my head because he left something with me that I never will forget and when I took over this club right here, nobody else believe in me, they said they were going to have the club shut down and they were going to have it locked up and probably every word but I kept this club open without being shut down for nothing twenty-three years and he told me, he said \"Jerry, you going to do good\" and I did good."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:03",
      "upperBoundTime": "00:41:07",
      "content": "Yeah, you did. I think that's got to be a record, being club president for twenty-three years."
    },
    {
      "speaker": "Jerry",
      "time": "00:41:07",
      "upperBoundTime": "00:41:12",
      "content": "Well, no they got some have been there longer than that. They got some have been here longer."
    },
    {
      "speaker": "Jerry",
      "time": "00:41:07",
      "upperBoundTime": "00:41:12",
      "content": ""
    },
    {
      "speaker": "Marcus",
      "time": "00:41:12",
      "upperBoundTime": "00:41:13",
      "content": "Being an organization like that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:41:13",
      "upperBoundTime": "00:41:44",
      "content": "See they say about marvel prisoner, we all make mistakes and just like I said, I look at it as I still make mistakes but I don't do them in a way where I get locked up or trouble maker or all this here. It's just that I want to just do it and get away from it, just get away, that's all."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:44",
      "upperBoundTime": "00:42:06",
      "content": "For people who don't see what happens in prison, who are just getting along with their lives, like most people, what would you like them to know about what your experience has been which is you've spent your life in prison. What would you like them to know about that?"
    },
    {
      "speaker": "Jerry",
      "time": "00:42:06",
      "upperBoundTime": "00:43:23",
      "content": "Well, I would like, well, see what it need to be did, just like for yes and you. It need more of this here it need more of this here exposure. It need a lot of more of this here exposure to Angola because Angola doesn't fit."
    },
    {
      "speaker": "Jerry",
      "time": "00:42:06",
      "upperBoundTime": "00:43:23",
      "content": "But, now, I'm going to say this here. If it don't hold up and just start doing this right, on the right track, it going to flip back like it used to be. It going to flip back like it used to be because young, see y'all should know this, all the guys, older guys getting out and younger guys coming in. And they ain't going to put a blunt to you, they ain't putting up with it."
    },
    {
      "speaker": "Jerry",
      "time": "00:42:06",
      "upperBoundTime": "00:43:23",
      "content": "You got to be able to let people come in and see, just like what y'all are doing over here, what people's doing with their lives. And try to better thyself. See this here, pull up to me, well to me it was like a college to me. I feel like that I got a diploma and I got it in my hand and when I look up every morning to- I say man, I got the gold seal right here in my hand right here. I'm going to go and this is when I wake up."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:23",
      "upperBoundTime": "00:43:30",
      "content": "Sure what do you think the young guys who are now coming in with a life sentence?"
    },
    {
      "speaker": "Jerry",
      "time": "00:43:30",
      "upperBoundTime": "00:44:45",
      "content": "Yeah, well it's, well they come here terrified? They life's thrown away and so, a right up ain't nothing for them now. That's what I be telling some of the young kids who join I say, man, come on stay away from write-ups man. Though I try to get along with and try to do something better. Or they get in trouble they'll come to me and say look, go holler at this man here for me. I will try to do it on strict \"Aye, if you going to do the right thing.\" I'm not going to put me out there, and you ain't going to do the right thing. Do the right thing."
    },
    {
      "speaker": "Jerry",
      "time": "00:43:30",
      "upperBoundTime": "00:44:45",
      "content": "I'm going to speak up for you. Aright, go back to one talk just like I ain't say I ain't got I could say on all the free folks, I know most of them, the old guys, now they got new wardens and just started and I don't know too much about but I try to get along with all of them, because I try to be respectful. So that's why we get so many privilege, we are going to let him go over here, we are going to let him."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:45",
      "upperBoundTime": "00:44:46",
      "content": "Sure, and those are things you've earned."
    },
    {
      "speaker": "Jerry",
      "time": "00:44:46",
      "upperBoundTime": "00:44:48",
      "content": "Yeah, you earn that."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:48",
      "upperBoundTime": "00:44:54",
      "content": "What you said about we don't change something, this prison's going to flip back."
    },
    {
      "speaker": "Jerry",
      "time": "00:44:54",
      "upperBoundTime": "00:45:56",
      "content": "Well, see, that's what I'm saying see like- what y'all do over here is y'all bring in and say we want to know something about your life and you need to do that with a bunch of these youngsters. Sit them down and talk to them. Give them hope. Give what they need, they need hope. They don't need no really, they need help, really. A life sentence? Man, come on man. You're throwing them away."
    },
    {
      "speaker": "Jerry",
      "time": "00:44:54",
      "upperBoundTime": "00:45:56",
      "content": "That's what this is, man. I know that we make mistakes, and I agree with that, look at me. Forty one years of my life, gone. I can't bring it back. But I've learned from it. So this is the same thing we got to do with the youngsters. We got to teach them. That's why I tell them in the club, I'm not perfect. I'm not President, I just organize it. I just try to keep it going, keep things going, that's all I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:56",
      "content": "Sure. Okay, I think that's a good place to stop."
    }
  ]
}
