{"name":"","transcript":[{"content":"Jimmy Robinson REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"So would you mid starting by stating your name, the crime you were convicted of, how old you were and how much time you've served?"},{"speaker":"Jimmy","time":"00:00:11-2","content":"Okay, well my name is Jimmy Ray Robinson and my crime was a first degree murder charge and in prison I've served 36 years"},{"speaker":"Marcus","time":"00:00:24-9","content":"And how old were you when you were arrested?"},{"speaker":"Jimmy","time":"00:00:27-0","content":"24."},{"speaker":"Marcus","time":"00:00:27-9","content":"24. You didn't grow up in New Orleans did you?"},{"speaker":"Jimmy","time":"00:00:32-3","content":"No"},{"speaker":"Marcus","time":"00:00:33-2","content":"Where did you grow up?"},{"speaker":"Jimmy","time":"00:00:34-0","content":"Well I grew up in New Haven Connecticut."},{"speaker":"Marcus","time":"00:00:36-9","content":"Oh I wasn't aware of that. When did you come down to Louisiana?"},{"speaker":"Jimmy","time":"00:00:42-6","content":"80 almost 1980."},{"speaker":"Marcus","time":"00:00:46-2","content":"And how old were you?"},{"speaker":"Jimmy","time":"00:00:47-1","content":"24."},{"speaker":"Marcus","time":"00:00:48-2","content":"Oh okay, can you tell me then a little bit about your family who raised you in New Haven?"},{"speaker":"Jimmy","time":"00:01:00-5","content":"Yeah well. Well I transitioned from North Carolina at the age of 6 to New Haven and growing up I grew up my mother had one sister and one brother and that was in North Carolina and they were like sharecroppers and that's how I grew up working like on a farm when you were at that age I really wasn't working I was just growing up playing."},{"speaker":"Marcus","time":"00:01:40-3","content":"Where in North Carolina?"},{"speaker":"Jimmy","time":"00:01:41-6","content":"In a place. Lumberton it's near like Fayetteville. It's an army base there"},{"speaker":"Marcus","time":"00:01:51-3","content":"So it was just your mother and your sister?"},{"speaker":"Jimmy","time":"00:01:54-1","content":"And one brother."},{"speaker":"Marcus","time":"00:01:55-0","content":"And one brother and what was your mom's job?"},{"speaker":"Jimmy","time":"00:02:00-2","content":"Well actually she was a she used to work and clean other people's houses."},{"speaker":"Marcus","time":"00:02:10-4","content":"Were there men in your mother's life that came into your life?"},{"speaker":"Jimmy","time":"00:02:15-2","content":"No. Never. Not until we was all I think I was like when this guy came into her life I was like 12."},{"speaker":"Marcus","time":"00:02:36-3","content":"Okay. So tell me about that did you have a good relationship with them?"},{"speaker":"Jimmy","time":"00:02:42-5","content":"Yeah, he was he was alright he really wanted to be our father not a father figure but our father and you always and you dealing kids like that and when things happen the kids don't like well you not my father you can't tell my what to do all that kind of stuff like that yeah."},{"speaker":"Marcus","time":"00:03:04-9","content":"So did you butt heads a little bit with him?"},{"speaker":"Jimmy","time":"00:03:06-7","content":"Absolutely yeah."},{"speaker":"Marcus","time":"00:03:09-3","content":"Was there any physical violence in the house?"},{"speaker":"Jimmy","time":"00:03:11-5","content":"No."},{"speaker":"Marcus","time":"00:03:14-2","content":"Would it be fair to say that you grew up knowing that you were loved and cared for?"},{"speaker":"Jimmy","time":"00:03:18-2","content":"Oh absolutely yeah."},{"speaker":"Marcus","time":"00:03:20-6","content":"Okay all right what about friends? Friends when you were a teenager."},{"speaker":"Jimmy","time":"00:03:27-5","content":"Oh yeah, well you have friends in school, you basically we were just reckless kids doing all kind of crazy things just hanging out."},{"speaker":"Marcus","time":"00:03:46-4","content":"If I was looking at your school outside what would I see can you describe it?"},{"speaker":"Jimmy","time":"00:03:56-2","content":"What the school itself?"},{"speaker":"Marcus","time":"00:03:57-1","content":"Yeah the school, your high school."},{"speaker":"Jimmy","time":"00:03:59-5","content":"Oh high school well."},{"speaker":"Marcus","time":"00:04:02-5","content":"In New Haven."},{"speaker":"Jimmy","time":"00:04:03-9","content":"Yeah it was very large this particular school it was lee high school and from the school that I came from middle school to lee high I mean it was like it was like a trouble school everybody getting into trouble and fights just growing up young kids and then you transition to high school then you were looked upon to step up to another level with a lot of the kids that was leaving troop which was the middle school that I was in in our mind shady but you still kind of had to be like troop in high school but really it was a real nice school."},{"speaker":"Jimmy","time":"00:04:03-9","content":"And the teachers were they was willing to help the students to grow because this particular school they was trying to be the best school because they had like four other high schools as well. And so they was trying to be the top of the line"},{"speaker":"Marcus","time":"00:05:19-0","content":"Was it was it a fully integrated School."},{"speaker":"Jimmy","time":"00:05:24-2","content":"Oh yeah. Absolutely."},{"speaker":"Marcus","time":"00:05:24-2","content":"In New Haven what did you like best about school?"},{"speaker":"Jimmy","time":"00:05:35-7","content":"Actually I liked it meeting different people and I did my school work and everything but I always liked hang around the library and meeting when I say different people I mean like I'm basically speaking about different girls yeah and going to lee high You it was people from all over the place coming and going to school there."},{"speaker":"Jimmy","time":"00:05:35-7","content":"Now I know a lot of people because now you have Yale-New Haven this it's the university there and man you got all kind of people from everywhere around the world going to Yale so we had a kind of grew up in that kind of atmosphere and this particular school it was influenced by Yale."},{"speaker":"Marcus","time":"00:06:40-7","content":"Do you remember your first serious girlfriend?"},{"speaker":"Jimmy","time":"00:06:46-2","content":"First serious girlfriend."},{"speaker":"Marcus","time":"00:06:50-4","content":"From like school? Did you have a serious girlfriend in high school?"},{"speaker":"Jimmy","time":"00:06:54-5","content":"Not really I was just kind of like floating free."},{"speaker":"Marcus","time":"00:07:01-0","content":"That's fine that's fine. Did you ever get a kicked out of school"},{"speaker":"Jimmy","time":"00:07:05-9","content":"No never No just a little detention or something like that."},{"speaker":"Marcus","time":"00:07:11-1","content":"Did you ever have any kind of brush with the law while you were in high school?"},{"speaker":"Jimmy","time":"00:07:15-8","content":"Oh yeah I got I got well the first thing happened to me when I was in high school I got a jaywalking."},{"speaker":"Marcus","time":"00:07:25-5","content":"Jaywalking?"},{"speaker":"Jimmy","time":"00:07:26-4","content":"Yeah man I didn't even know I was jaywalking but anyway I got to B&E charge and that was all I ever had, all I ever had till I got this charge. And I never even though I was wild and reckless I never had run-ins with the law. I was just."},{"speaker":"Marcus","time":"00:07:56-4","content":"When you say you were wild and reckless what do you mean?"},{"speaker":"Jimmy","time":"00:07:59-6","content":"Well just doing crazy things your parents or your parent that they try to tell you while you don't need to be hanging with this group of people and you don't need to be hanging with them and don't cause all parents Think my child wouldn't be doing this if it wasn't for but actually He is doing what he want to do."},{"speaker":"Marcus","time":"00:08:24-8","content":"So what kinds of things what do you got up to?"},{"speaker":"Jimmy","time":"00:08:27-3","content":"Oh it be like ringing people doorbells just prank things."},{"speaker":"Marcus","time":"00:08:34-5","content":"Mischief."},{"speaker":"Jimmy","time":"00:08:35-1","content":"Yeah mischief that's it."},{"speaker":"Marcus","time":"00:08:36-9","content":"Okay were drugs and alcohol part of your life in high school?"},{"speaker":"Jimmy","time":"00:08:48-0","content":"Well I can say just smoking weed but that was new in that era so you knew you had to smoke weed and cigarettes to be cool so of course we were smoking weed and cigarettes But now As far as I drugs and alcohol Really playing a part not really especially alcohol. I mean I couldn't drink I didn't like it but I would smoke weed occasionally."},{"speaker":"Marcus","time":"00:09:24-3","content":"So did you finish High School?"},{"speaker":"Jimmy","time":"00:09:26-6","content":"No I went to the 10th grade."},{"speaker":"Marcus","time":"00:09:28-7","content":"Okay why'd you. Why do you stop?"},{"speaker":"Jimmy","time":"00:09:31-2","content":"Because really I figured I could keep money in my pocket by being in the street instead of spending all that time in school so school is out."},{"speaker":"Marcus","time":"00:09:43-9","content":"So you were hustling."},{"speaker":"Jimmy","time":"00:09:44-3","content":"Right."},{"speaker":"Marcus","time":"00:09:45-2","content":"What were you doing?"},{"speaker":"Jimmy","time":"00:09:46-4","content":"And we just break into different things we just take stuff and sell it. Adventure trying to sell weed."},{"speaker":"Marcus","time":"00:09:56-4","content":"And you manage to not get in trouble with the police? Right. So then you drop out of 10th grade then what just bring me up to your trip down to Louisiana how do you spend the next few years after that?"},{"speaker":"Jimmy","time":"00:10:10-3","content":"Okay. One of the guys that we grew up together we came up with a decision that we was going to go to the military on the body plan. So we went down to the recruitment office and took the test and we passed the test so we thinking we going together but eventually he went to one place and I came to Georgia I went to Fort Benning Georgia."},{"speaker":"Marcus","time":"00:10:40-1","content":"Okay. How old were you?"},{"speaker":"Jimmy","time":"00:10:42-2","content":"When I went there I was 23."},{"speaker":"Marcus","time":"00:10:46-2","content":"Oh. Before that you were just kind of hustling and stuff?"},{"speaker":"Jimmy","time":"00:10:51-0","content":"Oh just floating through the city."},{"speaker":"Marcus","time":"00:10:51-8","content":"Floating through the city, and managing to stay out of trouble until you end up in Fort Benning at 23 with which branch of the armed services is that?"},{"speaker":"Jimmy","time":"00:11:04-9","content":"Oh well with that particular when I went in there I was joining not the Army no the reserves Army Reserve that's what I was going in as but we had to take our basic training in Fort Benning Georgia."},{"speaker":"Marcus","time":"00:11:29-2","content":"So you go to the basic training and then what?"},{"speaker":"Jimmy","time":"00:11:30-8","content":"Well I didn't finish the Basic training. While I was in the basic training one week before graduation I got in some trouble on the base. Man it's just so crazy now we just got paid and now I'm going to take this guy's money from him so me and another guy that was from Louisiana we was in basic together so we did that and then they bust us and they put us in the house arrest in the CO's office and then me and him we broke out of the CO's Office and eventually we ended up in Louisiana"},{"speaker":"Marcus","time":"00:12:12-9","content":"Oh."},{"speaker":"Jimmy","time":"00:12:13-9","content":"Right. So After I get here man I see that this ain't gone work so now all I can See now is getting me some money to go back home so then that's where I ended up on this charge."},{"speaker":"Marcus","time":"00:12:30-4","content":"Okay."},{"speaker":"Jimmy","time":"00:12:32-6","content":"Boy."},{"speaker":"Marcus","time":"00:12:34-5","content":"And what city was that in?"},{"speaker":"Jimmy","time":"00:12:37-4","content":"Here? Oh Gretna."},{"speaker":"Marcus","time":"00:12:40-5","content":"Oh got you."},{"speaker":"Jimmy","time":"00:12:40-5","content":"It's on the some kind of bank"},{"speaker":"Marcus","time":"00:12:42-3","content":"It's on the west bank. West bank"},{"speaker":"Jimmy","time":"00:12:49-3","content":"Yeah"},{"speaker":"Marcus","time":"00:12:50-8","content":"And that was you were involved with that just to get money to go back to Connecticut and be done with that little experiment."},{"speaker":"Jimmy","time":"00:12:57-2","content":"Absolutely yeah because man it was a well this guy was telling me how things were I mean he was from here so he was telling me how things were but after we got here I discovered well what he was talking bout I mean he didn't even have a place to stay when he got here I said oh so I got to get out of here so that ended up leading to this incident."},{"speaker":"Marcus","time":"00:13:25-2","content":"Yes, so let's put this incident aside for a second aside from this incident what you said that your life had gone down the wrong track by then?"},{"speaker":"Jimmy","time":"00:13:34-6","content":"Oh absolutely."},{"speaker":"Marcus","time":"00:13:35-5","content":"Okay."},{"speaker":"Jimmy","time":"00:13:36-5","content":"No doubt ,"},{"speaker":"Marcus","time":"00:13:38-1","content":"It sounds like you were kind of just getting further and further into things,"},{"speaker":"Jimmy","time":"00:13:42-7","content":"Right,"},{"speaker":"Marcus","time":"00:13:43-6","content":"Okay so this more serious thing happens how I assume during the trial and everything you were at OPP how was that?"},{"speaker":"Jimmy","time":"00:13:57-4","content":"Well OPP? Well I wasn't in New Orleans I was in Jefferson Parish,"},{"speaker":"Marcus","time":"00:14:02-2","content":"Oh I'm sorry you were in Jefferson right,"},{"speaker":"Jimmy","time":"00:14:03-8","content":"Right,"},{"speaker":"Marcus","time":"00:14:04-9","content":"But still that was pretty rough,"},{"speaker":"Jimmy","time":"00:14:06-8","content":"Well yeah,"},{"speaker":"Marcus","time":"00:14:08-1","content":"And you had nobody."},{"speaker":"Jimmy","time":"00:14:09-7","content":"Right."},{"speaker":"Marcus","time":"00:14:10-2","content":"You had no Friends in jail."},{"speaker":"Jimmy","time":"00:14:11-6","content":"None I knew no one but After when I first went to Jefferson Parish I went in and got situated Well I mean The way the person that I was at that time well when you come into jail you just got to prove who you are so I crossed that hurdle and then after I crossed that hurdle guys they automatically respect you so I went through that little era and then I left I left Jefferson parish January the 17th coming toward coming to Angola."},{"speaker":"Marcus","time":"00:15:10-7","content":"How old were you then?"},{"speaker":"Jimmy","time":"00:15:12-2","content":"I had made I just had made 25. And that was 83."},{"speaker":"Marcus","time":"00:15:23-7","content":"Okay so let's if you can think back to the Jimmy Robinson the 25 year old who came through those gates- describe that person for me please"},{"speaker":"Jimmy","time":"00:15:44-3","content":"Man where am I? And at that time I'm coming down this what they call it a this red clay cause the roads coming into Angola then was dirt. And man it's like it was taking forever to get here and it was dark and guys was talking bout we could fall of this into the ravine and all this man"},{"speaker":"Jimmy","time":"00:15:44-3","content":"And I'm listening to all this cause you hear all these stories in jail about this place about how will it is you could come in you could die so now you trying to prepare yourself for what the Angola stories and so now I'm coming and I don't know no one I'm on the bus"},{"speaker":"Jimmy","time":"00:15:44-3","content":"I don't know no one and I'm coming to a place I don't know no one but I got all these stories bestowed in my mind and I'm saying man now what I'm going to have to do when I get here I'm going to have to kill me somebody I mean that's off the top you had to kill somebody to make a statement so I get here man and I find that man it was rougher in the parish jail than it was here"},{"speaker":"Jimmy","time":"00:15:44-3","content":"I said. oh man so I come here and automatically you go in the field so I was working in the field and man it seemed like I couldn't get out of the field and I stayed in the field for two years and I caught a break and I got out of the field and I got a job working in the tag plant."},{"speaker":"Jimmy","time":"00:15:44-3","content":"And that's where I started that's where I started making my turnaround I got that job but when I first got here man I was just feeling around feeling my way around and after I found out I didn't have to kill nobody I just got that out of my head and man all kind of stuff was introduced to you by being in prison but I never was off in all this prison stuff but I started making my turnaround from going down to upward when I got the job in the tag plant."},{"speaker":"Marcus","time":"00:18:20-9","content":"Why?"},{"speaker":"Jimmy","time":"00:18:25-6","content":"They had a they had a anger light that was in here and it was showing how guys came here very young ages the before and this is the after and I looked at that anger light and I said man and they these guys still were here and man when I started on this journey I had no idea that my family was going to get together and get me a lawyer and they did that and that was that was phenomenal for me and I got from under the death sentence"},{"speaker":"Jimmy","time":"00:18:25-6","content":"I got a life sentence and then I started kind of I don't know maybe just kind of like loosening up in the prison system and then I got the job in the tag plant and one guy this guy named Russell Fowler he was off into the lord and he was trying to talk to him my lord and I didn't really want to hear nothing about oh but anyway he started talking to me and he invited me to come to church and all that so eventually I started going and from there from the tag plant and this experience with Russell Fowler man."},{"speaker":"Jimmy","time":"00:18:25-6","content":"I went on in this prison to accomplish what I consider personally the greatest accomplishment that you can accomplish in here and that is I travel in the street I go out to different places and talk and say I'm in the gospel traveling band. And we go all over the state singing and lifting up the name of Jesus and talking to the youth and I've I made that transition and I did something that no person should do because you shouldn't take a life cause we don't have the power to give a life and I did that but regardless to that and that's a fact now."},{"speaker":"Jimmy","time":"00:18:25-6","content":"I have something that I can give and for people that's going the wrong way I don't have to tell them what I think I can tell them what I know and here I am today very optimistic about getting out of prison is really at the forefront of my vision but now I also know that I committed a horrible crime. And if getting out of prison is in it for me well then praise God but I got peace about the fact well if I don't get out well I'm still going to live but now do I want to get out? Absolutely"},{"speaker":"Marcus","time":"00:21:44-2","content":"Of course of course I think what I'm hearing you say is that you can still have a complete and meaningful life"},{"speaker":"Jimmy","time":"00:21:52-2","content":"Absolutely."},{"speaker":"Marcus","time":"00:21:53-2","content":"And help other people."},{"speaker":"Jimmy","time":"00:21:54-9","content":"Right here yeah and I do."},{"speaker":"Marcus","time":"00:21:58-4","content":"Do you find yourself mentoring the young kids who are coming in with life sentences trying to get them?"},{"speaker":"Jimmy","time":"00:22:04-3","content":"Yeah."},{"speaker":"Marcus","time":"00:22:05-0","content":"Do they know what they're getting into?"},{"speaker":"Jimmy","time":"00:22:06-6","content":"Well no because they come here just like I was and they're much younger but they come here with their mind and their concepts still on the street. You've committed this act but you are here now and you're acting and conducting yourself as if you had never got in trouble."},{"speaker":"Jimmy","time":"00:22:06-6","content":"But you in trouble and I try to talk to a lot of these young guys so they don't have to go through the same pitfalls that I went through because its real and a lot of guys they be here ten 15 years and then they some of them start waking up like man you been getting up and going to bed for 15 years here percentagely you have from five to seven years that like a lot of these guys in here now they are their parents children."},{"speaker":"Jimmy","time":"00:22:06-6","content":"So they constantly running from it and they got a lot in their account and they still but after a while it starts to deteriorate you can't go to the commissary and spend 75 or a hundred dollars every weekend and life starts to change and then they want to wake up."},{"speaker":"Jimmy","time":"00:22:06-6","content":"And then they want to stop doing all the foolish stuff but prayerfully we can get a whole too in the early stages fore they spend all that time here doing a whole lot of irrational things and just mess their record up and then that's how you're judged so hopefully that's what we do and then when they introduce the reentry program here where the young guys come in and they go through this program from the courts we try to get a hold of them and work with them but I tell you man its these people are they're not the people that I do these young guys when they coming from another world"},{"speaker":"Marcus","time":"00:24:26-1","content":"Do you think that when you came in that the guys who had spent 30 years here already by then thought the same way about you guys?"},{"speaker":"Jimmy","time":"00:24:37-0","content":"Well."},{"speaker":"Marcus","time":"00:24:38-4","content":"How they say every generation complains about the next one"},{"speaker":"Jimmy","time":"00:24:41-0","content":"About the next one yeah absolutely well I would have to say maybe to an extent but in actuality man I don't' think we could light a candle to these guys there whew"},{"speaker":"Marcus","time":"00:25:02-2","content":"Yeah I hear that."},{"speaker":"Jimmy","time":"00:25:03-0","content":"Yeah cause a lot of these guys today well they didn't have the luxury of being raised by their parents or some family member that really showed some love and concern for they basically was raised by the TV the TV was the babysitter and there maybe they was just old enough to make it go fix some cereal for breakfast."},{"speaker":"Jimmy","time":"00:25:03-0","content":"I mean it was cause other people had other agendas than raising kids and it's kind of like they had been on they own forever and here they are here a larger percentage of them they don't know what it is to be exposed to a father figure a lot of them they in the night clubs with their mother and father they all kind of like just growing up together."},{"speaker":"Marcus","time":"00:26:08-9","content":"Did you do you have children?"},{"speaker":"Jimmy","time":"00:26:10-7","content":"No."},{"speaker":"Marcus","time":"00:26:15-7","content":"So you've been here 36 years you explained a little bit about getting in the tag shop and maybe also going to church some people find that there's one or 2 things specifically that changed sometimes it's a death in the family that sort of wakes them up sometimes it's just a mentor kind of straightens somebody out."},{"speaker":"Marcus","time":"00:26:15-7","content":"I imagine that you've been a mentor for a lot of folks yourself over the years was there somebody like that in your life somebody an older inmate who just kind of tried to teach you to wizen up when you first came here? Or did you kind of just gradually find out for yourself."},{"speaker":"Jimmy","time":"00:27:05-1","content":"I kind of I think I think that yeah it was more or less I kind of gravitated to straightening up but then then actually I didn't really have to go that far to get there because I mean even though I was wild and reckless I wasn't wild in the sense that I'm trying to hurt people or I mean I was just I just wanted to have a little money in my pocket I wanted to have a nice jacket or something something of that nature but as far as being like a problem child no that wasn't me."},{"speaker":"Jimmy","time":"00:27:05-1","content":"I mean and even growing up there was a lot of time that guys wanted to do certain things that I didn't want to have anything to do with that because I never really wanted to go to jail? Not that I had any idea that if you do this this what could happen because I had no idea what criminal code of procedure was it could explain to you if you do this crime this is the consequences but I really never jail wasn't really my thing and I didn't really like I said I didn't really have to go far to get to doing right"},{"speaker":"Marcus","time":"00:28:43-8","content":"Did you spend time on death row?"},{"speaker":"Jimmy","time":"00:28:46-7","content":"No I gave the death sentence back before I came."},{"speaker":"Marcus","time":"00:28:50-0","content":"Oh okay with help from the lawyer from your family?"},{"speaker":"Jimmy","time":"00:28:53-2","content":"Right."},{"speaker":"Marcus","time":"00:28:53-7","content":"Okay, I understood that so can you describe your typical day here now? I mean you started in the fields in the tag shop what is a typical day"},{"speaker":"Jimmy","time":"00:29:06-2","content":"Okay, well like my job now. I'm working legal program department and basically what I do is now this is the a professional name for my job is a I'm a copier technician yeah my day is filled with making copies for the entire inmate population for their legal work they would let me have transcripts motions whatever they need copies for and each copy is 5 cent per page."},{"speaker":"Jimmy","time":"00:29:06-2","content":"And that's what I do every day is run the copy machine and I'm the pastor of one of the local churches here in the prison and that's the gist of my day and of course I sing in the gospel band and we rehearse on Mondays and Fridays and Thursdays and Saturdays those are my church days so that's my daily routine"},{"speaker":"Marcus","time":"00:29:06-2","content":"Sure how long have you been doing that the work in the legal program"},{"speaker":"Jimmy","time":"00:30:32-3","content":"26 years."},{"speaker":"Marcus","time":"00:30:33-3","content":"Wow so and that's of course how you got to know Calvin Duncan."},{"speaker":"Jimmy","time":"00:30:37-8","content":"Right."},{"speaker":"Marcus","time":"00:30:43-6","content":"When you think about the possibility of getting out of here it would be through a pardon board after 36 years here you got so you got before a pardon board what would you want them to know about you?"},{"speaker":"Jimmy","time":"00:31:01-6","content":"Well I believe the first thing I would want them to know that you that I'm very remorseful for what I've done off the top because I wasn't raised like that and I believe I would want them to know that I just don't want to get out of prison just for the sake of getting out of prison I actually believe that once released from prison I have something that I could give back to society I haven't spent my life here in prison being bitter actually."},{"speaker":"Jimmy","time":"00:31:01-6","content":"I like to say that I spent my time here becoming better than the person I was when I first came not that that doesn't mean that I was some kind of rotten ruthless insensitive person but I matured since I've been here and I don't I really believe that if they would make the decision to release me it would be a betterment in whatever community that I would be released to. It wouldn't be no bad decision. I wouldn't be a liability on wherever I would go. I believe I would be an advancement."},{"speaker":"Marcus","time":"00:32:31-1","content":"Yeah let's talk a little bit about that so you must have spent a lot of time I would imagine envisioning your life should you be released what you'd be doing."},{"speaker":"Jimmy","time":"00:32:42-2","content":"Oh absolutely."},{"speaker":"Marcus","time":"00:32:43-3","content":"Right but can you tell me a little bit more about that? What's that vision?"},{"speaker":"Jimmy","time":"00:32:47-6","content":"Well actually my heart desire right now my mother's 81 years old and well of course all mothers want their children to be free but my number one objective is to get out of prison and really go and take care of my mother. Now that's the center that's the heart of what I want to do and things that revolve around that of course is being employed but that's what I want to do is go and take care of her forever how long she has to live being at 81 years old now."},{"speaker":"Marcus","time":"00:33:34-8","content":"Where is she?"},{"speaker":"Jimmy","time":"00:33:35-2","content":"She's in Connecticut."},{"speaker":"Marcus","time":"00:33:36-4","content":"Okay. Yeah, do you does it scare you a little bit the idea of being released and having to figure it all out this world that 36 years ago you left behind?"},{"speaker":"Jimmy","time":"00:33:51-4","content":"Well not actually and the reason is because like we was just mentioning before that I have help. I have a family that is always been here for me and they are they are there for me right now and upon me being released praise God I'm not just like how like a dog off a chain I wouldn't be running all over the neighborhood but I have some stability upon being released I have somewhere to go I have people to help me make that transition back into society and to function"},{"speaker":"Marcus","time":"00:34:51-3","content":"Yeah it's quite a transition."},{"speaker":"Jimmy","time":"00:34:55-8","content":"Oh yeah. Well I think also what helped me a lot is apart from my family is the fact that well since I've been locked up here being able to go and function in society with people and even the jobs that I've had here other than just working and leading the program department I've worked with the security here and different jobs that I've had that you had to have a working interaction even with them. Being placed in positions of trust and"},{"speaker":"Jimmy","time":"00:34:55-8","content":"I think a lot of the guys here that that like do a lot of time in cells or they don't have the workings with people and not only with offenders but with security and I think a lot of that helps me to make that transition because I haven't allowed myself to become institutionalized? I mean even though once you get out of here it's probably some small little things that you would do"},{"speaker":"Marcus","time":"00:36:27-4","content":"Of course."},{"speaker":"Jimmy","time":"00:36:28-2","content":"Yeah."},{"speaker":"Marcus","time":"00:36:32-2","content":"Of course what do you think is the hardest part about serving so much time for you? What has been the hardest part?"},{"speaker":"Jimmy","time":"00:36:42-4","content":"I'm going to say really being away from my family. Yeah that's what I have to say that's the hardest part because I have a baby sister that I really don't know I've just seen pictures and I had a few visits with her and then I have a lot of family members that have arrived over these years that's in my family who I don't even know. Really I talk to them on the phone but they talking to me about uncle and he all this and I really don't know them"},{"speaker":"Marcus","time":"00:37:25-4","content":"Nephews and nieces?"},{"speaker":"Jimmy","time":"00:37:26-3","content":"Yeah oh man it's unreal the family that I've accumulated since I've been gone but we talking years and I think the greatest thing that would be my greatest thing and a few family members just they gone on now that I was close with when I was there I didn't get a chance to be with them before they passed"},{"speaker":"Marcus","time":"00:38:03-2","content":"Yeah. I don't think this is a strange question but you might. There are some good things that happen in this prison"},{"speaker":"Jimmy","time":"00:38:10-1","content":"Oh absolutely."},{"speaker":"Marcus","time":"00:38:11-2","content":"And."},{"speaker":"Jimmy","time":"00:38:11-9","content":"I'm one of them."},{"speaker":"Marcus","time":"00:38:13-8","content":"I agree what's the best thing that Angola's doing?"},{"speaker":"Jimmy","time":"00:38:22-6","content":"The best thing that Angola's doing."},{"speaker":"Marcus","time":"00:38:24-5","content":"What's the best thing about this place?"},{"speaker":"Jimmy","time":"00:38:29-1","content":"I would have to say it helps one to grow up. It helps one to mature. And well since the changing of the warden we had warden Caine now we have warden Vinnoy well what I would have to say is they both like creating an atmosphere that you can better yourself and not only do they create that atmosphere they show themselves in helping you not just talking to you but they made they self-available by helping you in and what I say is just that like a lot of the guys now like when they go on the parole board or whatever all"},{"speaker":"Jimmy","time":"00:38:29-1","content":"I mean if you lived the kind of life that they can go and speak for you well then that's what they'll do and I mean it's on record already it its well these guys well they might have a long time before they get to that stage but that stage is that's afforded to you but now if you live the life of penitentiary here where they you don't get that you could and you can educate yourself man you can even go to college here they got the bible college you can get your degrees master degrees associates and the prison really has.."},{"speaker":"Jimmy","time":"00:38:29-1","content":"Things to offer that you that you can function once being release from here they got a lot of guys they never even knew how to read and its afforded that you can you can get your GED I mean they got all kind of academics you can get involved in the vocational and I really can turn you into a productive citizen. An adult productive citizen."},{"speaker":"Jimmy","time":"00:38:29-1","content":"And I think this I mean as far as reentering back in society you need to do something with yourself that'll demonstrate that you are not the same person. Once you came here you won't be the same person. I mean if you just come in just go to bed and go to trial and get back into bed you still won't be the same person but you can demonstrate in your life since coming here now I mean cause its they got a lot of guys that have gotten out of here that's gone on man to live productive lives they got guys that's left here within the last 10 years I mean they are very productive in society I mean."},{"speaker":"Jimmy","time":"00:38:29-1","content":"I mean that and honestly? Man I know I can be one of them persons. Yeah I mean I don't think that I really know it but I say I would say that that is a genuine goodness that Angola has to offer. I went to the hospital yesterday to see a guy that we was all up and down the wall together we run the clubs together in here and he was he was a guy he run the toastmaster club the speaker organization and man just all of a sudden he got these brain aneurisms he cancer in the bones I mean he just going through a storm right now and"},{"speaker":"Jimmy","time":"00:38:29-1","content":"I went to see him yesterday man and he was like- I mean you could just see his like wow thank you for coming to see me and he said man when something like this happen to who your friends are and I said yeah but sometime man it's just the simplest thing as I'm sorry and I mean they got a thing they say where what comes from the heart it don't have but one place to go if its coming from the heart it goes to the heart and you'll know when a sorry is really a sorry and if it's just words I mean its just something in us know that he's really sorry? You see only thing they know is what I done"},{"speaker":"Jimmy","time":"00:38:29-1","content":"But now if they could know how many nights after this incident took place if they could know how I was tormented in that cell. Not even being able to go to sleep because same nightmare every time I close my eyes that's the incident that I could see. And man I'm talking about being tormented and I'm in this one man cell and there aint nobody in there that I could talk to there aint nobody in there I could cry to there, aint nobody could tell me its gone be alright man I'm just in there by myself."},{"speaker":"Jimmy","time":"00:38:29-1","content":"And when I close my eyes man its been many nights that I just stayed up just thanking God for the breaking of the day. But it seem like when you go to sleep in the daytime things'll be alright but see at night when you go to sleep man its all kinda things just go on and I mean I used to be in that cell I'm talking about tormented and as time went on its like it lifted. But see they don't know that all they know is what I done."},{"speaker":"Marcus","time":"00:44:38-8","content":"I wanted to make sure that you had an opportunity to talk about anything you wanted."},{"speaker":"Jimmy","time":"00:44:42-6","content":"Yeah."},{"speaker":"Marcus","time":"00:44:44-3","content":"Is there something I should have asked you that I didn't ask you that you wanted to talk about something you want people to know that you think maybe they don't know?"},{"speaker":"Jimmy","time":"00:44:53-8","content":"Well I actually I think I just talked about it."},{"speaker":"Marcus","time":"00:44:58-5","content":"Yeah. I think you did."},{"speaker":"Jimmy","time":"00:45:00-0","content":"Yeah"},{"speaker":"Marcus","time":"00:45:01-4","content":"Alright thank you."}]}