{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:17",
      "content": "Jimmy Williams REDACTIONS FINAL"
    },
    {
      "speaker": " Jimmy",
      "time": "00:00:17",
      "upperBoundTime": "00:00:36",
      "content": "My name is Jimmy Williams, I was first convicted of 1st degree murder, attempt armed robbery, 16 years later after a sentence on death row, I was re-sentenced, re-convicted 2nd degree murder, and re-sentenced to life in prison."
    },
    {
      "speaker": " Marcus",
      "time": "00:00:36",
      "upperBoundTime": "00:00:54",
      "content": "And you can just look at me when while we're doing this. So, you spent 16 years on death row."
    },
    {
      "speaker": " Jimmy",
      "time": "00:00:54",
      "upperBoundTime": "00:00:56",
      "content": "Yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:00:56",
      "upperBoundTime": "00:00:58",
      "content": "In a one man cell."
    },
    {
      "speaker": " Jimmy",
      "time": "00:00:58",
      "upperBoundTime": "00:01:01",
      "content": "Yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:01:01",
      "upperBoundTime": "00:01:07",
      "content": "Which is a very unusual way to experience your first 16 years at Angola, in terms of being general population."
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:07",
      "upperBoundTime": "00:01:13",
      "content": "Yes absolutely."
    },
    {
      "speaker": " Marcus",
      "time": "00:01:13",
      "upperBoundTime": "00:01:14",
      "content": "How was that experience for you?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:14",
      "upperBoundTime": "00:03:17",
      "content": "I don't know a single word to describe it, I can only describe it in verbal pictures. I was 18 at the time of the crime, 19 when I arrived at death row. I think my first 4 or 5 years I was pretty much in a state of denial about the severity of my sentence on what I was facing."
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:14",
      "upperBoundTime": "00:03:17",
      "content": "I came to the point where I started seeing guys actually go and not come back. Going mean going to the death house to be executed. Listening to the pros and cons, the arguments in the media about the death penalty for and against. At some point during that period I woke up to the reality of my experience."
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:14",
      "upperBoundTime": "00:03:17",
      "content": "Being on death row, obviously we're limited in our movements. One man cell, we can only come out the cell 1 hour a day to shower or we can go outside and come back in and spend 15 minutes showering, then you're back in the cell for the rest of the time."
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:14",
      "upperBoundTime": "00:03:17",
      "content": "The only other exception is going to a hospital trip, whether it's the hospital here or a hospital on the street, a court trip. And that's pretty much it. Other times you're just in the cell. And then in the cell, limited like that, you only have a few things that you can do. You can read, you can write, you can paint, you can think, or you can go crazy."
    },
    {
      "speaker": " Jimmy",
      "time": "00:01:14",
      "upperBoundTime": "00:03:17",
      "content": "I spent most of my time early on, once I came out of the state of denial, realizing the reality of my situation, just really trying to understand how is it that an 18 year old kid get in a situation in which my mother was the same age I was when she had me, 19 years old on death row. So I spent a lot of time trying to educate myself, reading books. I got to a point in 1999."
    },
    {
      "speaker": " Marcus",
      "time": "00:03:17",
      "upperBoundTime": "00:03:13",
      "content": "Sorry, your mother was on death row?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:13",
      "upperBoundTime": "00:03:19",
      "content": "No, my mother had me when she at 19."
    },
    {
      "speaker": " Marcus",
      "time": "00:03:19",
      "upperBoundTime": "00:03:18",
      "content": "At 19, and you were on death row."
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:18",
      "upperBoundTime": "00:03:31",
      "content": "Yeah when I got to death row. So it's a long story, and I'm rambling right now trying to compile it."
    },
    {
      "speaker": " Marcus",
      "time": "00:03:31",
      "upperBoundTime": "00:03:34",
      "content": "No, its fine, I asked you about it. I've read Wilbert Rideau..."
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:34",
      "upperBoundTime": "00:03:33",
      "content": "I have that book."
    },
    {
      "speaker": " Marcus",
      "time": "00:03:33",
      "upperBoundTime": "00:03:58",
      "content": "And I've learned a lot from the way he described living on death row. Which he suggests saved his life. Because he didn't think he would describe the general population in the 60s in Angola."
    },
    {
      "speaker": " Marcus",
      "time": "00:03:33",
      "upperBoundTime": "00:03:58",
      "content": "I want to ask you some questions about growing up, and then we'll talk about Angola and some of the changes that you've gone through since you've been here. Can you tell me a little bit about your mom, dad, and the folks who raised you?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:58",
      "upperBoundTime": "00:05:35",
      "content": "Wilbert Rideau Okay, I was born to deaf parents. Both my mom and father are deaf. I often say when I talk about my dad, that I've seen my father, I can count on two hands how many times I've seen my father and still have fingers left to count on, but that's not quite the reality. But the times that I did see him were limited."
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:58",
      "upperBoundTime": "00:05:35",
      "content": "My mom and my dad never really lived together. My father is from New Orleans. And my mom, she's from Arkansas, she moved here to Baton Rouge at 18, 19. My grandmother decided that one of the limited things that she could do was sew. So she sent her to Delgado in New Orleans."
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:58",
      "upperBoundTime": "00:05:35",
      "content": "My father was a janitor there at the time, and they met each other and I came along later."
    },
    {
      "speaker": " Jimmy",
      "time": "00:03:58",
      "upperBoundTime": "00:05:35",
      "content": "My mom, she met and married this guy 1978, my stepfather. I vaguely remember that period, but I do remember as I got older, maybe 5, 6 years old, of him being physically abusive, verbally abusive towards her. He didn't start hitting her until later on. He was physically abusive towards me. My father was fearful of him, and I didn't really understand this till later on, as I got older, why he didn't come around."
    },
    {
      "speaker": " Marcus",
      "time": "00:05:35",
      "upperBoundTime": "00:05:40",
      "content": "Do you have siblings?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:05:40",
      "upperBoundTime": "00:05:41",
      "content": "I have 1 sister, and a half-brother. Well a half-sister and a half-brother."
    },
    {
      "speaker": " Marcus",
      "time": "00:05:41",
      "upperBoundTime": "00:05:42",
      "content": "They were growing up with you in the same house?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:05:42",
      "upperBoundTime": "00:05:45",
      "content": "Not my half-brother, my half-sister, we both grew up in the same house."
    },
    {
      "speaker": " Marcus",
      "time": "00:05:45",
      "upperBoundTime": "00:05:49",
      "content": "Did she also get some of the end of the abuse?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:05:49",
      "upperBoundTime": "00:06:21",
      "content": "No, the only time I seen my sister get a whipping, my stepfather told her to do something and she didn't do it. But he kind whipped her but he kind of babied her up after that. So it's mostly those two, they just exchanged words and he'd just go let her know her."
    },
    {
      "speaker": " Jimmy",
      "time": "00:05:49",
      "upperBoundTime": "00:06:21",
      "content": "But me, I thought, growing up, it was because I was a male, and that's the way boys are raised, you're tough on them, you talk tough to them, you beat them, and you make them manly. But I realized later on that's not the way you raise a child."
    },
    {
      "speaker": " Marcus",
      "time": "00:06:21",
      "upperBoundTime": "00:06:24",
      "content": "Do you communicate to your mother and father in sign language?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:06:24",
      "upperBoundTime": "00:06:27",
      "content": "Yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:06:27",
      "upperBoundTime": "00:06:33",
      "content": "So, would it be accurate than to say that for the most part you were mistreated by your step father?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:06:33",
      "upperBoundTime": "00:06:57",
      "content": "Absolutely. Actually he admitted to that later on when I went through the mitigation phase of my death penalty trial, doing state post-conviction. A mitigation specialist wanted to sit down and talk to my family, him being one of them, and he gave an affidavit expressing how hard he was on me as a child, and somewhat apologetic, I don't recall if he actually apologized but he was apologetic."
    },
    {
      "speaker": " Marcus",
      "time": "00:06:57",
      "upperBoundTime": "00:07:00",
      "content": "Do you have any kind of relationship with your mother and father today?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:07:00",
      "upperBoundTime": "00:07:23",
      "content": "My father passed away 6 months after I got off death row. He had cancer in 2011, he died in March 2012. I have a picture of the last time I saw him, I think he came to visit me in 2010, 2009, and that's the last memory I have, and I have an obituary of him."
    },
    {
      "speaker": " Marcus",
      "time": "00:07:23",
      "upperBoundTime": "00:07:26",
      "content": "What about your mom?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:07:26",
      "upperBoundTime": "00:08:04",
      "content": "My mom, I see her from time to time, maybe once a year. My sister has to bring her. She's not only disabled physically with her hearing impairment, but she's up in age, and she had a car accident some years ago, so she gets around on a walker. I's as strain for my sister, raising her kids, having her career, and whenever she can she'll bring my mom to visit. But most of the time when I call my sister and inquire about my mom, I'll talk to my grandmother, she'll let me know how my mom is doing."
    },
    {
      "speaker": " Marcus",
      "time": "00:08:04",
      "upperBoundTime": "00:08:13",
      "content": "Right. So, you were so young when this happened. But did you finish high school?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:08:13",
      "upperBoundTime": "00:08:15",
      "content": "No."
    },
    {
      "speaker": " Marcus",
      "time": "00:08:15",
      "upperBoundTime": "00:08:17",
      "content": "What was the highest grade that you?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:08:17",
      "upperBoundTime": "00:08:19",
      "content": "The highest grade that I attended was 10th grade."
    },
    {
      "speaker": " Marcus",
      "time": "00:08:19",
      "upperBoundTime": "00:08:29",
      "content": "10th, okay. Would you say that the abuse in your home was just fairly consistent all the way through until you left the house?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:08:29",
      "upperBoundTime": "00:09:13",
      "content": "The abuse in my home, I thought about this years ago, were between the ages of 4 and 14. The last beating I got, 2 of my fingers were fractured and the school called my grandmother. My grandmother had my mom and my stepfather come and pick me up, took me to the hospital and they bandaged it up."
    },
    {
      "speaker": " Jimmy",
      "time": "00:08:29",
      "upperBoundTime": "00:09:13",
      "content": "My mom, her being a passive woman, she kind of like over the years since my step father was beating me, she'll say \"Okay well, his father beat him, that's the reason why he's like that\" But when she thought that the state may take me away from her, then she put an end to it and that was the last beating I got, when I was 14."
    },
    {
      "speaker": " Marcus",
      "time": "00:09:13",
      "upperBoundTime": "00:09:25",
      "content": "Sure. So I want to just have a picture in my mind of your childhood home. Did you have a front porch?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:09:25",
      "upperBoundTime": "00:09:34",
      "content": "My childhood home actually wasn't one home. We moved like every 3 to 5 years so we didn't have a stable place."
    },
    {
      "speaker": " Marcus",
      "time": "00:09:34",
      "upperBoundTime": "00:09:36",
      "content": "Okay alright. When you were 18 were you living at home?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:09:36",
      "upperBoundTime": "00:09:42",
      "content": "No, I was living with a girlfriend at the time."
    },
    {
      "speaker": " Marcus",
      "time": "00:09:42",
      "upperBoundTime": "00:09:47",
      "content": "Okay did you like school?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:09:47",
      "upperBoundTime": "00:10:11",
      "content": "No, growing up in school. I was labeled learning disabled. I had a speech impediment, and that's one thing that being on the cell in death row allowed me to do it. It really read and kind of learn things in my own way, to try to develop in a way that the school wasn't really able to help me develop in. So I didn't too much care for school."
    },
    {
      "speaker": " Marcus",
      "time": "00:10:11",
      "upperBoundTime": "00:10:20",
      "content": "Did you have like a best friend growing up, someone you consider being real close to?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:10:20",
      "upperBoundTime": "00:10:31",
      "content": "I can't really think, I don't recall having a best friend, I had associates, not one that I can go and bear my soul to."
    },
    {
      "speaker": " Marcus",
      "time": "00:10:31",
      "upperBoundTime": "00:10:40",
      "content": "Sure, that's what I meant. Did you find yourself fighting a lot at school?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:10:40",
      "upperBoundTime": "00:11:50",
      "content": "Yeah well actually, elementary I can think back. I didn't fight back much, I was a fearful kid in elementary, so I'd get jumped on and I'd run. By the time I got in junior high, the group of guys I associated with, a lot of them same neighborhood, we had the neighborhood against neighborhood thing where we would fight against one another."
    },
    {
      "speaker": " Jimmy",
      "time": "00:10:40",
      "upperBoundTime": "00:11:50",
      "content": "And it was one of those things, if I wanted to associate with somebody, not smart enough to associate with the academic kids, and these kids I really don't sense that I should be here but I want to be accepted by someone."
    },
    {
      "speaker": " Jimmy",
      "time": "00:10:40",
      "upperBoundTime": "00:11:50",
      "content": "So I ended up associating with those guys and we got to a point where I actually learned how to fight with them. So that fighting it went from just fighting in school, after school, getting suspended whatever. To exposing, too exposed as a matter of fact. I got expelled from junior high in 7th grade, and expelled from 8th grade, and got expelled from high school in 10th grade."
    },
    {
      "speaker": " Marcus",
      "time": "00:11:50",
      "upperBoundTime": "00:11:55",
      "content": "Were you carrying around a lot of anger as an adolescent?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:11:55",
      "upperBoundTime": "00:12:03",
      "content": "Yes, anger, fear, rage, a lot of things just bottled up. Emotions I didn't know how to begin to understand, I didn't know how to describe."
    },
    {
      "speaker": " Marcus",
      "time": "00:12:03",
      "upperBoundTime": "00:12:09",
      "content": "Tell me a little bit about your relationship with your girlfriend."
    },
    {
      "speaker": " Jimmy",
      "time": "00:12:09",
      "upperBoundTime": "00:13:17",
      "content": "The girlfriend I had at the time? I met her when I was 16, she was 10 years my senior. She was a country girl from Louisiana. She had 4 kids at the time, later on after I come to prison, one of them was hit by a car and died. 2 older boys, the oldest boy, he didn't know who his father was, she don't remember who he is. The 2nd older, his father died of a drug overdose. So I kind of took a liking to them because they didn't have a father."
    },
    {
      "speaker": " Jimmy",
      "time": "00:12:09",
      "upperBoundTime": "00:13:17",
      "content": "The younger 2 had the same father and had a pretty much stable relationship with them. I did the shaking up thing with her, even though I was pretty much as my juvenile probation officer said, a 5th kid that she had. The one thing that I was able to do my grandmother always said that I was a kid with an old soul. I was more mature than my age indicated, and so I pretty much managed the household that we lived in."
    },
    {
      "speaker": " Marcus",
      "time": "00:13:17",
      "upperBoundTime": "00:13:19",
      "content": "Okay, were you working?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:13:19",
      "upperBoundTime": "00:13:30",
      "content": "I had a fast food restaurant job and I met her in '92, in 1993. Before I met her it was petty crime, before I got that job."
    },
    {
      "speaker": " Marcus",
      "time": "00:13:30",
      "upperBoundTime": "00:13:32",
      "content": "Okay, what kind of petty crime?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:13:32",
      "upperBoundTime": "00:13:36",
      "content": "Stealing, robbing, drugs."
    },
    {
      "speaker": " Marcus",
      "time": "00:13:36",
      "upperBoundTime": "00:13:42",
      "content": "Okay, and meeting her, was that the reason you stopped doing all that?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:13:42",
      "upperBoundTime": "00:14:14",
      "content": "Meeting her settled me down a little. It got me out of the streets, I used to run the streets a lot. My step father had this thing when I was living with them. I had a 9 o'clock curfew. And if I didn't come in at 9 o'clock, and this was not a curfew imposed by him it was a curfew imposed by the state juvenile. If you didn't come in at 9 o'clock then you don't come in at all. I'm like okay I'll stay with another family I don't like being in that house anyway. So I stayed out a lot at night running with friends. And when I met her I kind of came in and I stopped running so much."
    },
    {
      "speaker": " Marcus",
      "time": "00:14:14",
      "upperBoundTime": "00:14:19",
      "content": "Do you have any children of your own?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:14:19",
      "upperBoundTime": "00:14:21",
      "content": "No I don't have any children."
    },
    {
      "speaker": " Marcus",
      "time": "00:14:21",
      "upperBoundTime": "00:14:24",
      "content": "Do you remember the first time you got arrested?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:14:24",
      "upperBoundTime": "00:14:26",
      "content": "14."
    },
    {
      "speaker": " Marcus",
      "time": "00:14:26",
      "upperBoundTime": "00:14:27",
      "content": "Okay, what was that about?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:14:27",
      "upperBoundTime": "00:14:43",
      "content": "What was it? Transformers at the time, I went into Kmart with my mom and I was so into transformers, I saw a transformers toy at Kmart and I stole it and a security guard there saw me."
    },
    {
      "speaker": " Marcus",
      "time": "00:14:43",
      "upperBoundTime": "00:14:49",
      "content": "So were you convicted for anything before this charge that you're serving a sentence for?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:14:49",
      "upperBoundTime": "00:15:00",
      "content": "Before this charge, I was convicted of two counts of attempted robbery in 1993."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:00",
      "upperBoundTime": "00:15:10",
      "content": "Okay, so you're obviously, regardless of the charge that you're currently serving. In hindsight now, I would imagine you would say that you went down the wrong road."
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:10",
      "upperBoundTime": "00:15:12",
      "content": "Yes I did."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:12",
      "upperBoundTime": "00:15:17",
      "content": "Okay, so if you had to isolate one reason for that, what would it be?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:17",
      "upperBoundTime": "00:15:19",
      "content": "No guidance."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:19",
      "upperBoundTime": "00:15:30",
      "content": "Okay. Sure. Were drugs and alcohol a major part of your life in terms of consumption?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:30",
      "upperBoundTime": "00:15:39",
      "content": "Yes, between the age of 14 and when I came to prison, even for a short period after I come to prison, at least the drug part of it."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:39",
      "upperBoundTime": "00:15:39",
      "content": "What kind of drugs?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:39",
      "upperBoundTime": "00:15:44",
      "content": "Marijuana."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:44",
      "upperBoundTime": "00:15:47",
      "content": "Okay. Did you ever feel like it was taking control of your life?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:47",
      "upperBoundTime": "00:15:52",
      "content": "No, I always thought I had control of it."
    },
    {
      "speaker": " Marcus",
      "time": "00:15:52",
      "upperBoundTime": "00:15:59",
      "content": "Sure, aside from the physical abuse, were you ever sexually abused as a kid?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:15:59",
      "upperBoundTime": "00:16:00",
      "content": "Thank God no."
    },
    {
      "speaker": " Marcus",
      "time": "00:16:00",
      "upperBoundTime": "00:16:23",
      "content": "Thank God no. I can only imagine it must've been when you first got here. I just want to revisit that kid. How would you describe that kid coming into the gates of Angola and being escorted up to death row?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:16:23",
      "upperBoundTime": "00:16:52",
      "content": "I didn't know what to expect, like you said, I was absolutely frightened. I knew I was going to a cell, so I knew physical harm from other inmates wouldn't be a problem. I didn't understand the process of capital punishment and the appeals and how long it would be before either I got off death row or went to be executed at the time. So I had a lot of emotions going and I was very fearful."
    },
    {
      "speaker": " Marcus",
      "time": "00:16:52",
      "upperBoundTime": "00:16:58",
      "content": "Of course. And it was shortly after that that you met Calvin Duncan?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:16:58",
      "upperBoundTime": "00:17:06",
      "content": "I met Calvin I believe it was 1998, '99 sometime. He was inmate counsellor."
    },
    {
      "speaker": " Marcus",
      "time": "00:17:06",
      "upperBoundTime": "00:17:10",
      "content": "Yeah. So how're you a different person now from 2 decades later?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:17:10",
      "upperBoundTime": "00:17:41",
      "content": "Well I'm a lot less impulsive, I think things through now, I've done enough reading, studying, to be able to have a grasp of world views. Information to be able to make proper decisions that doesn't have a negative effect on not only myself but the community."
    },
    {
      "speaker": " Marcus",
      "time": "00:17:41",
      "upperBoundTime": "00:17:45",
      "content": "Sure, I understand. What's your typical day now here at Angola?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:17:45",
      "upperBoundTime": "00:18:32",
      "content": "Wow, my plate is full now. I'm a junior seminary here. I'm a part of leadership builder's ministry, its ministries inspirational, motivational group. I'm a moderator at the services. One of the things I am able to do, being a moderator is bring awareness and perspective to certain world issues."
    },
    {
      "speaker": " Jimmy",
      "time": "00:17:45",
      "upperBoundTime": "00:18:32",
      "content": "I read the Bible thorough a social lens, so when I'm talking about the Bible I'll talk about social issues. I pretty much can present that in a way that they can think about that instead of thinking about it in a purely religious sense. So that's been helpful."
    },
    {
      "speaker": " Marcus",
      "time": "00:18:32",
      "upperBoundTime": "00:18:38",
      "content": "Can you explain a little bit more about that distinction? The social verses religious."
    },
    {
      "speaker": " Jimmy",
      "time": "00:18:38",
      "upperBoundTime": "00:19:45",
      "content": "I think a lot of time people get hung up in following steps. Okay, say, I'm a Christian and we have certain creeds that we live by, okay, and I'm trying to think of an example that can relate to that."
    },
    {
      "speaker": " Jimmy",
      "time": "00:18:38",
      "upperBoundTime": "00:19:45",
      "content": "I think a lot of time, religious views, particularly fundamentalist views can choke a person from being able to see people, to see need, and to be able to address that need, not just from the perspective of my restrained beliefs, but through a perspective that's deeper than just my beliefs. To be able to recognize a person and accept their rights to believe as they want to believe."
    },
    {
      "speaker": " Marcus",
      "time": "00:19:45",
      "upperBoundTime": "00:19:52",
      "content": "So, I see, so rather than like a Biblical literalism it's more about what are the social justice issues we can get out of the Bible?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:19:52",
      "upperBoundTime": "00:19:54",
      "content": "Right."
    },
    {
      "speaker": " Marcus",
      "time": "00:19:54",
      "upperBoundTime": "00:20:03",
      "content": "Okay, I understand that. I wasn't sure but anyway. So, sorry, carry on, you were telling me about your typical day and I interrupted."
    },
    {
      "speaker": " Jimmy",
      "time": "00:20:03",
      "upperBoundTime": "00:21:29",
      "content": "Okay, seminary we just started a new semester yesterday, I do moderating the services. And right now I'm going through some testing to be become a tutor again for the guys on death row."
    },
    {
      "speaker": " Jimmy",
      "time": "00:20:03",
      "upperBoundTime": "00:21:29",
      "content": "I was the first person, according to the administration here, to get a GED while on death row. At that time, it wasn't easy to get that opportunity, the mind frame at the time was guys with life sentences and guys on death row didn't need education because the likelihood of them going home was zero to none."
    },
    {
      "speaker": " Jimmy",
      "time": "00:20:03",
      "upperBoundTime": "00:21:29",
      "content": "So I filed a judicial review, I went through the ARP process to find the judicial review and find one of the guys who's an inmate here. He and a formal warden, Warden Cain he had an open door policy with him. He went ahead and talked to him and said this will be a good thing for the guys being on death row and it'll keep them quiet, humble, and also help them to improve."
    },
    {
      "speaker": " Jimmy",
      "time": "00:20:03",
      "upperBoundTime": "00:21:29",
      "content": "They gave me the opportunity to study for a GED, but they didn't give me any resources, any tools or whatever. So I had to do that on my own. It took my like 4 years before I finally go to that place. But the new education director here, she knows about me being the first one to get a GED on death row and she's trying to set up a program on death row for guys that feel that they're ready to a degree."
    },
    {
      "speaker": " Marcus",
      "time": "00:21:29",
      "upperBoundTime": "00:21:34",
      "content": "Yeah, so right now, the things occupying most of your time is college."
    },
    {
      "speaker": " Jimmy",
      "time": "00:21:34",
      "upperBoundTime": "00:21:36",
      "content": "Schooling, absolutely yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:21:36",
      "upperBoundTime": "00:21:39",
      "content": "Okay, are there organizations that you devote a lot of time to?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:21:39",
      "upperBoundTime": "00:22:05",
      "content": "Not at the moment, there are organizations that I think about. I was talking to a guy this morning about starting programs, like starting nonprofit organizations to help people in the community with whatever they need help with. Whether its computer skills, or parenting skills, anything else. We were just talking about how to set that up."
    },
    {
      "speaker": " Marcus",
      "time": "00:22:05",
      "upperBoundTime": "00:22:42",
      "content": "So, many people go through transformations in prison. Sometimes it's an aging out; and other times it's a very deliberate sort of I'm turning my life around. Other times it's a mentor or a lightbulb goes off. As I said, you know, as you'd said, you had gone down the wrong road, a lack of guidance. You get here, you're in a one man cell, what led to your transformation?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:22:42",
      "upperBoundTime": "00:23:27",
      "content": "At the time I felt I had something to prove and that something was the jury said that I'm not worthy to live, I should die. Something in me is telling me although I made this horrible accident, this horrible mistake, that, I'm more than what the jury said I am, or what the DA is saying I am."
    },
    {
      "speaker": " Jimmy",
      "time": "00:22:42",
      "upperBoundTime": "00:23:27",
      "content": "So, there was something in me that said fight. And fighting for me was educating myself, reading, becoming aware of things, listening to people, really empathizing with people and I've won it."
    },
    {
      "speaker": " Marcus",
      "time": "00:23:27",
      "upperBoundTime": "00:23:50",
      "content": "Sure. When you think back on the crime, I mean you obviously you've been fighting your case for a long time. When you think back on the crime now with some distance from it, and the victim, victims. What's the emotion that comes up when you think about that now? Because it's been a long time."
    },
    {
      "speaker": " Jimmy",
      "time": "00:23:50",
      "upperBoundTime": "00:24:40",
      "content": "It has been a long time. Coincidentally, today marks 22 years I've been in this prison. I think of him, his name is Gordon Larves, I think of him a lot. I think he had a 9 month old son at the time. When I was going through the court process, I've seen his wife at the time testify once."
    },
    {
      "speaker": " Jimmy",
      "time": "00:23:50",
      "upperBoundTime": "00:24:40",
      "content": "Late on in the years, I hadn't seen her anymore, I've never seen the kid. I wonder how that kid grew up, I wonder what Gordon would be like if he would've lived. I think about all that when I'm thinking about this crime. Because it doesn't go away, it with you forever. I often think about him and what he would've been like if he had lived."
    },
    {
      "speaker": " Marcus",
      "time": "00:24:40",
      "upperBoundTime": "00:24:46",
      "content": "Yeah. Have you forgiven yourself?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:24:46",
      "upperBoundTime": "00:25:06",
      "content": "It took a long time for me to get to that point. I have forgiven myself. From time to time I have residue. I think that's more regret, upset, that I'm in this situation. But I think overall I have forgiven myself for that."
    },
    {
      "speaker": " Marcus",
      "time": "00:25:06",
      "upperBoundTime": "00:25:26",
      "content": "So one of the things about challenging the concept of life without the possibility of parole is we'll never assess you again. Is I guess grappling with the question as to how much punishment is enough? Have you been punished enough, 22 years?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:25:26",
      "upperBoundTime": "00:27:15",
      "content": "22 years. I feel like I've been punished enough. Coming in, I didn't understand, okay, there standard of punishment, life without parole, and when I first came in, the pardon system was still active. I think it was Governor Mike Foster, that group of correctional establishment was just started all them. They pretty much shut that system down in a way to where going home through the system was slim to none."
    },
    {
      "speaker": " Jimmy",
      "time": "00:25:26",
      "upperBoundTime": "00:27:15",
      "content": "So my mind frame at the time, okay, something is going to change, when, I don't know, I don't like to be delusional about things, I don't like to deceive myself, I just take things as they go. And I felt that if something did change it would be like 20, 30 years down the road. Here we are 20 years down the road, life without parole, I always felt that was in a sense, you don't know what a person will be like in the future."
    },
    {
      "speaker": " Jimmy",
      "time": "00:25:26",
      "upperBoundTime": "00:27:15",
      "content": "That's just like capital punishment, one of the arguments they had against it was, okay, you put a guy on death row today, you don't know what he'll be like a year from now, or 5 years from now or 10 years from now. You're not killing the same person, you're killing a different person."
    },
    {
      "speaker": " Jimmy",
      "time": "00:25:26",
      "upperBoundTime": "00:27:15",
      "content": "And I kind of feel that, when you put a person in prison, and give him resources that you have, educational trades or whatever, and you say okay, this is the best you can hope for, to become something in this environment. I think you limit the possibility of what that individual can do beyond these walls."
    },
    {
      "speaker": " Marcus",
      "time": "00:27:15",
      "upperBoundTime": "00:27:45",
      "content": "Yeah. If you were to come before a parole board, or a pardon board, they would have your rap sheet, they would have a conduct record, they would have some materials you might've supplied them. But you'll have a very small window to tell them who you are and why you should have a second chance. What do you tell them?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:27:45",
      "upperBoundTime": "00:29:45",
      "content": "I would tell them that I can't do anything to change what I've done. I'm very much remorseful for what I've done and I try to prove that in what I've done in the 20 plus years I've been here. Most of my time here, has been, as I mentioned, educating myself. I think of how to help other people who come in at the age that I've come in."
    },
    {
      "speaker": " Jimmy",
      "time": "00:27:45",
      "upperBoundTime": "00:29:45",
      "content": "This generation is, I see guys that pretty much made some of the same decisions I made coming in. I try to do what I can to speak life to them, to try to encourage them to go down a different path. To make not just this community better but to make them better individually."
    },
    {
      "speaker": " Jimmy",
      "time": "00:27:45",
      "upperBoundTime": "00:29:45",
      "content": "What I would like to do beyond this place is go back to the communities from which I was a part of, assess what's going on there, and actually see what I can do to try to improve the situation for them. I can remember being, my girlfriend, she lived in the Section 8 apartments, and I see these women, these children, fatherless apartments coming and going."
    },
    {
      "speaker": " Jimmy",
      "time": "00:27:45",
      "upperBoundTime": "00:29:45",
      "content": "And when I came here in 1995, one of the guys who was on death row with me, at the time he was starting a nonprofit organization. He had the idea of creating a community center to help people who were poor to find government entities that provide resources to help improve their situation. And I kept that with me for many years, and that's one of the things that I think I can do to try to pay for the life I took."
    },
    {
      "speaker": " Marcus",
      "time": "00:29:45",
      "upperBoundTime": "00:30:14",
      "content": "Yeah. I imagine that the worst parts of being on death are going to be a bit different from being in the general population today for you. Death row is a sort of thing unto itself, as you know better than anybody. Today, what would you consider the worst part of your experience Angola?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:30:14",
      "upperBoundTime": "00:30:48",
      "content": "The worst part of my experience at Angola? It would have to be the limited existence that is death row. Because you can't do anything, it's monotonous, its day to day same thing. And unless you have things that you're thinking about, goals that you've set for yourself to try to reach for that's realistic. But then that confinement, you just, say if like you go backwards."
    },
    {
      "speaker": " Marcus",
      "time": "00:30:48",
      "upperBoundTime": "00:30:53",
      "content": "Right, so you're saying that the worst part of being on death row."
    },
    {
      "speaker": " Jimmy",
      "time": "00:30:53",
      "upperBoundTime": "00:30:54",
      "content": "The worst part of this experience period."
    },
    {
      "speaker": " Marcus",
      "time": "00:30:54",
      "upperBoundTime": "00:31:13",
      "content": "Oh period is death row. What's the worst part of your daily life now? As you know, going back to your life, what's the thing that you find the most difficult to deal with?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:31:13",
      "upperBoundTime": "00:31:46",
      "content": "I think, sometimes I feel boxed in. There are things I would like to do, like I can have an idea of how to improve something but administration may, understandably for security reasons, they'll limit or restrict what we can or what we cannot do. So, I think that's difficult not being able to make free decisions and to having to be mindful of what I say and what I do constantly."
    },
    {
      "speaker": " Marcus",
      "time": "00:31:46",
      "upperBoundTime": "00:31:47",
      "content": "Having all these decisions made for you?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:31:47",
      "upperBoundTime": "00:31:50",
      "content": "For the most part, yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:31:50",
      "upperBoundTime": "00:31:55",
      "content": "If you had to point out something that is good about Angola. The best part of Angola."
    },
    {
      "speaker": " Jimmy",
      "time": "00:31:55",
      "upperBoundTime": "00:32:28",
      "content": "One of the things I'm glad that we here are the academic and vocational programs that they have. I believe that's highly important for guys coming in and I believe that's highly important if you're talking about real correction. A coming into a place where he can recognize the error in his ways, be given some kind of training, some type of vocational academic and have an opportunity to go back out there and exercise that training. So I think that's a good thing that they focus a lot on that."
    },
    {
      "speaker": " Marcus",
      "time": "00:32:28",
      "upperBoundTime": "00:33:12",
      "content": "Let me ask you a difficult question. You've gone from thinking that you'll be executed to going to have a life sentence without parole. I think that a lot of people maintain some kind of hope, sometimes people even, a couple guys I talk to refer to it as false hope, but it's some kind of hope."
    },
    {
      "speaker": " Marcus",
      "time": "00:32:28",
      "upperBoundTime": "00:33:12",
      "content": "There must be times when you, with all your education, the education that you continue to get, all the things you did to improve yourself. That, there's a good chance that you'll die here."
    },
    {
      "speaker": "Jimmy",
      "time": "00:33:12",
      "upperBoundTime": "00:33:14",
      "content": "Yes."
    },
    {
      "speaker": " Marcus",
      "time": "00:33:14",
      "upperBoundTime": "00:33:24",
      "content": "From the age of 18, to being an old person in hospice. I find it difficult to wrap my head around that. I even can't imagine it for you. How do you deal with that, how do you cope with that idea?"
    },
    {
      "speaker": "Jimmy",
      "time": "00:33:24",
      "upperBoundTime": "00:34:35",
      "content": "Hope is something I hold on to. I, take life one day at a time. I don't allow myself to wrap my mind around the possibility of never going home, because I believe that's self-defeating. I understand that's a reality, I go to church on Sundays and I see guys, one guy this past July, my age like 6 months older than I am, died of cancer, so I know that's a harsh reality of this environment."
    },
    {
      "speaker": "Jimmy",
      "time": "00:33:24",
      "upperBoundTime": "00:34:35",
      "content": "I still I refuse to say, okay well there's a possibility I will never go home. I just fight until I get to the place or if I get to the place to where okay well I'm never going home, this is it for me. And if I don't do that, if I allow myself to wrap my head around the possibility of never going home, I believe I'd start dying in this place."
    },
    {
      "speaker": " Marcus",
      "time": "00:34:35",
      "upperBoundTime": "00:34:36",
      "content": "Yeah, I think it's too much."
    },
    {
      "speaker": " Jimmy",
      "time": "00:34:36",
      "upperBoundTime": "00:34:38",
      "content": "It is."
    },
    {
      "speaker": " Marcus",
      "time": "00:34:38",
      "upperBoundTime": "00:35:09",
      "content": "Which is why it's inhumane. A lot of guys I talk to, they say they just turn to God. Okay, and actually there's a distinction between somebody who's 100% just taken in by this religious way of handling things. But I think that there are also some guys who feel what choice do I have, it's the only hope I can put it in God hands kind of thing."
    },
    {
      "speaker": "Jimmy",
      "time": "00:35:09",
      "upperBoundTime": "00:36:32",
      "content": "That's how I started out. In 1997 up until 1999. One of the main books I read was the Bible. I started out, I had this angry idea okay well if god is real he's in the Bible or the Quran. And I used to read both the Bible and the Quran and got to a place where I just felt something from the Bible so I read that."
    },
    {
      "speaker": "Jimmy",
      "time": "00:35:09",
      "upperBoundTime": "00:36:32",
      "content": "Once I started doing the academic thing, I wanted to balance spirituality with academia so I studied both. Right now, I have a strong faith in god, I believe the strength that I don't have to continue, he is my source of strength, and I'm not fundamentalist in my beliefs."
    },
    {
      "speaker": "Jimmy",
      "time": "00:35:09",
      "upperBoundTime": "00:36:32",
      "content": "As a matter of fact I tell some of the fella I fellowship with I have a new age beliefs. They probably look at me like wow you need to go repent. But I've read many different religions. Christianity is my religion of choice and I believe that that's where god wants me to be as far as how I think about faith. But he is mainly my source for enduring this situation."
    },
    {
      "speaker": " Marcus",
      "time": "00:36:32",
      "upperBoundTime": "00:36:49",
      "content": "Yeah, and don't get me wrong I'm not saying it's merely men fooling themselves, I'm saying it's genuinely a source of comfort, it's very real in that it comforts the suffering."
    },
    {
      "speaker": " Jimmy",
      "time": "00:36:49",
      "upperBoundTime": "00:37:02",
      "content": "Yeah. For many it is the only option. And actually, for guys who think about religion in a balanced way, it's really a good option because you really see genuine improvement in their lives, based on their faith."
    },
    {
      "speaker": " Marcus",
      "time": "00:37:02",
      "upperBoundTime": "00:37:15",
      "content": "Of all the things you've accomplished including just surviving. What are you the most proud of?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:37:15",
      "upperBoundTime": "00:37:46",
      "content": "My GED and the reason for that I can recall getting expelled from high school, and my grandmother took me to an alternative school and she looked at me, she said, \"boy you're going to have a hard life if you don't get an education\". And it wasn't her words that haunted me, it was the look she had in her eyes that haunted me."
    },
    {
      "speaker": " Jimmy",
      "time": "00:37:15",
      "upperBoundTime": "00:37:46",
      "content": "So when I got the GED, I sent her a copy of it and that was one of the things that made her most proudest, and that's one of the things I'm most proud of myself for."
    },
    {
      "speaker": " Marcus",
      "time": "00:37:46",
      "upperBoundTime": "00:38:12",
      "content": "Yeah. Is there a question that I should've asked you that I didn't? Something that you might've wanted an opportunity to talk about, share something about yourself that you didn't get, or even what you might want somebody to know about the reality of what your experience is?"
    },
    {
      "speaker": " Jimmy",
      "time": "00:38:12",
      "content": "Not really, actually I thank you for this opportunity. And I'm glad to see that there are people like you out there really thinking about this from an angle from which you're thinking about it. Because if you look at this place, about 60% of this place is female and we have tours come through with kids, babies."
    },
    {
      "speaker": " Jimmy",
      "time": "00:38:12",
      "content": "There hasn't been once incident that I can think of if people can come into what was once the most dangerous prison in the world as they said and be safe here. Then why is it that these guys are able to come into an environment and be safe around not have an opportunity to go out there and prove that they can be safe among them out there. So I thank you for this."
    }
  ]
}
