{"name":"","transcript":[{"content":"John Sheehan REDACTIONS FINAL"},{"speaker":"John","time":"00:00:00-0","content":"Ok my name John Anthony Sheehan I'm convicted of second degree murder I have been incarcerated now for 30 and a half years."},{"speaker":"Marcus","time":"00:00:14-7","content":"John I'm going to ask you a few questions about your childhood."},{"speaker":"John","time":"00:00:17-8","content":"Yes sir."},{"speaker":"Marcus","time":"00:00:20-5","content":"So can you tell me a little bit about the folks who raised you and what your home life was like?"},{"speaker":"John","time":"00:00:25-2","content":"I was raised by my grandparents my mom and dad were really not part of my life actually it's going to go into probably part of the story that later on if you asked a question some significance in prison I didn't know this until I was 25 years old and locked in prison. My mother was actually kidnapped and put into prostitution back in the 60s and that's what caused me to be go raised with my grandparents never knew why I never knew my mother whether she was alive or dead until I was 15 years old."},{"speaker":"John","time":"00:00:25-2","content":"So at that point whenever I found out where she was living and got in contact with her it was just the idea to be able to say that alright I wanted to know her and find out what was going on but I never knew why she wasn't part of my life. So that's why my grandparents raised me."},{"speaker":"John","time":"00:00:25-2","content":"My dad had been in and out of trouble been in prison himself wasn't really to say an instrumental part of my life because never really there except maybe a holiday or something like that coming back my grandparents were very loving very I would want to say your average American mom and dad that's what I call them I call my grandmother mom I call my grandfather pop."},{"speaker":"Marcus","time":"00:01:54-4","content":"Did they get along?"},{"speaker":"John","time":"00:01:57-4","content":"No they had their fights. Actual I mean I've seen them physically fight. I've seen my dad actually physically hit my grandfather actually one time went to hitting my grandmother and then him and I fought over that because that was kind of like the last straw you don't do that."},{"speaker":"Marcus","time":"00:02:22-5","content":"Are your grandparents still alive?"},{"speaker":"John","time":"00:02:27-6","content":"No."},{"speaker":"Marcus","time":"00:02:31-1","content":"Can you tell me about the last memory you have of your grandmother?"},{"speaker":"John","time":"00:02:42-8","content":"The good memories that I had of her is being able to say visit with her here but the actual last memory is that she was dying of she had kidney cancer, had it removed was put in a nursing home and then she went in a coma because she was dehydrated and they let me talk to my family from the prison at ray burn correctional center and all I could do was talk to her but she couldn't speak."},{"speaker":"John","time":"00:02:42-8","content":"My relatives were there in the room says that whenever I was speaking to her she had some type of reaction like she knew it was me or whatever and then a few hours later she passed away."},{"speaker":"Marcus","time":"00:03:37-1","content":"Well I mean she was your mum. Was this you're mum's parents or your dad's parents?"},{"speaker":"John","time":"00:03:45-6","content":"Dad."},{"speaker":"Marcus","time":"00:03:54-4","content":"Okay"},{"speaker":"Marcus","time":"00:03:54-4","content":". Would you think then being raised by your grandparents would it be safe to say that you felt cared for and loved and nurtured by adults who were taking an interest in your life even if it wasn't your parents?"},{"speaker":"John","time":"00:04:03-8","content":"I do yeah I mean."},{"speaker":"Marcus","time":"00:04:06-5","content":"Every family has its problems."},{"speaker":"John","time":"00:04:08-5","content":"Right."},{"speaker":"Marcus","time":"00:04:10-8","content":"The fighting was it more frequent than not or more infrequent than not?"},{"speaker":"John","time":"00:04:17-7","content":"More infrequent than not and I got to say if I had to say about my grandparents I mean they were probably two of the most loving people that I could say I mean they provided me with everything gave me a good home to live in I mean they always told me I could do whatever I wanted to do to be successful and through school my grandmother really took an interest in school I would say that I suffered at that time from dyslexic."},{"speaker":"John","time":"00:04:17-7","content":"But not a lot of people at that time back in the 70s really knew much about it in 7th grade my grandmother realized that I couldn't in the 6th grade realized I couldn't read and she got really mad because I was getting good grades in school so teachers were just passing me."},{"speaker":"John","time":"00:04:17-7","content":"So she took me out of the public school and she put me into a catholic school where I had to start going to after school tutoring and stuff like that but it all paid off I mean they worked with me and it wasn't a matter of me being dumb it was a matter of me having to understand what I had to do to learn and I just from that point I mean done well in school."},{"speaker":"Marcus","time":"00:05:39-0","content":"What about fights outside of school did you find yourself getting into fights?"},{"speaker":"John","time":"00:05:42-1","content":"Not really every now and then there would be probably in high school I count on one hand the number of fights that I had."},{"speaker":"Marcus","time":"00:05:55-1","content":"Yeah."},{"speaker":"John","time":"00:05:57-1","content":"So I mean not really but I did have a temper I was considered like the enforcer on the basketball team I mean nobody would try to hurt one of my players if they did then I was going to retaliate against their players I had a sense of okay you do something to me I'm going to do something to you right or wrong it's just the way that I thought I probably was very reactionary in the things that I did I actually became a bouncer at a nightclub at 17 years old and you got to remember we're back in Louisiana back in the early 80s."},{"speaker":"Marcus","time":"00:06:40-2","content":"Where 17 year olds can be bouncers yeah."},{"speaker":"John","time":"00:06:44-6","content":"Right. So I mean the part of me that had to say to have aggression and it was able to take aggression out whenever something took place to be able to stop it."},{"speaker":"Marcus","time":"00:07:03-1","content":"Do you think some of these some of that bottled up aggression has something to do with trying to figure out why you why your parents weren't raising you and was it part of that or was it."},{"speaker":"John","time":"00:07:16-9","content":"No I think now that I can look back and from going through seminary and going through the classes with psychology and abnormal psychology and things like that I can see that I mean a lot of it probably had to do that I mean being upset and not having my mother and my dad in my life."},{"speaker":"John","time":"00:07:16-9","content":"So there was aggression there in that even though I had love from my grandparents it still was a something inside of me that wanted more and felt aggravated or mad because I didn't have it as an adult now where I'm at I can look back and say necessarily I shouldn't have felt that way but I did."},{"speaker":"Marcus","time":"00:08:03-9","content":"Yeah so many years later you get perspective on those things. Did you have siblings do you have siblings?"},{"speaker":"John","time":"00:08:12-4","content":"Again going back to being raised by my grandparents my dad was married 8 times I have I'm the oldest from my dad's side there's Lynette, Shannon, Martin, Jerry, Nicholas and Tiffany and with me that would be 8 but none of us were I wasn't raised with any of them."},{"speaker":"Marcus","time":"00:08:44-2","content":"Ok what about children do you have children?"},{"speaker":"John","time":"00:08:44-5","content":"I have one son."},{"speaker":"Marcus","time":"00:08:47-8","content":"Tell me about him."},{"speaker":"John","time":"00:08:51-6","content":"He was the pride of my life the sad thing is I was locked up when he was 1 year old and we used to visit every month sometimes twice a month talked to him on the phone probably one of the worst experiences I had was when the age of 12 my in laws took him took me to court to sever my parental rights. The judge let them adopt him and keep him from seeing me. So now he's 32 I haven't seen him in 20 years."},{"speaker":"Marcus","time":"00:09:28-8","content":"Oh gosh."},{"speaker":"John","time":"00:09:29-1","content":"Up until that time I had 4 judges that gave me visitation rights with him. So that was very traumatic where a judge says you can't be a father because you're locked up."},{"speaker":"Marcus","time":"00:09:39-5","content":"Especially after developing a relationship with a 12 year old."},{"speaker":"John","time":"00:09:43-6","content":"Right."},{"speaker":"Marcus","time":"00:09:49-6","content":"Yeah did you have a best friend a couple best friends that you think of growing up?"},{"speaker":"John","time":"00:09:55-5","content":"Growing up oh yeah I mean I had some very good friends some friends I'm still in contact with today not as say as frequently as when I first got locked up I guess the longer you do time in here the farther you kind of grow apart in prison but yeah I had some very good friends when I was on the outside."},{"speaker":"Marcus","time":"00:10:19-8","content":"Who visits you here?"},{"speaker":"John","time":"00:10:24-1","content":"Mainly right now the person that visits me is my wife and my brother Nicholas those are the two that I'd say I see the most every now and then I do see other family members whenever I was first incarcerated again my grandmother my grandfather were here all the time I had other relatives or friends that would come more frequently but over time that all kind of just goes away."},{"speaker":"John","time":"00:10:24-1","content":"I got a sister that lives I mean not more than 40 miles from here and I've seen her twice in the past 6 years. I got a brother lives the same distance and I haven't seen him in the past 14 years."},{"speaker":"Marcus","time":"00:11:12-9","content":"I've learned that from quite a few of the guys I've talked to is that as time goes on its harder to maintain those relationships."},{"speaker":"John","time":"00:11:24-8","content":"Right."},{"speaker":"Marcus","time":"00:11:30-5","content":"Especially the ones who have relatives who are farther away to come here from New Orleans for this project all the time it's a drive."},{"speaker":"John","time":"00:11:35-6","content":"It's a long travel."},{"speaker":"Marcus","time":"00:11:39-4","content":"What was you're you graduated from high school."},{"speaker":"John","time":"00:11:43-5","content":"Yes I graduated."},{"speaker":"Marcus","time":"00:11:45-5","content":"Did you go on to college after that?"},{"speaker":"John","time":"00:11:47-8","content":"No I went into the air force after I graduated from high school."},{"speaker":"Marcus","time":"00:11:50-5","content":"Where were you stationed?"},{"speaker":"John","time":"00:11:52-8","content":"I was stationed at the base in fort Walden beach Florida."},{"speaker":"Marcus","time":"00:11:56-6","content":"Yeah were you ever kicked out of school?"},{"speaker":"John","time":"00:12:00-1","content":"No."},{"speaker":"Marcus","time":"00:12:03-5","content":"Okay."},{"speaker":"John","time":"00:12:05-1","content":"I had a fight in school but I mean I wasn't kicked out."},{"speaker":"Marcus","time":"00:12:08-1","content":"Sure how did you meet your wife you just mentioned a wife?"},{"speaker":"John","time":"00:12:10-5","content":"Actually my wife and I met my junior year of high school I was coming back from working offshore during the summer between my sophomore year and my junior year in high school and I was coming from Venice and I stopped in Baton Rouge at a cousin of mine house and she was friends with my cousin and that's how we originally met."},{"speaker":"John","time":"00:12:10-5","content":"We dated for a number of years probably would have been married then but didn't know how to treat yet each other then I mean being kids it was about sex it was about partying it was about things that really don't make a relationship. We broke apart I got married she got married to somebody else."},{"speaker":"John","time":"00:12:10-5","content":"My wife, first wife passed away and that's why I'm in here. Her husband was actually murdered in 1990 and she had 3 children and both our lives changed. I can say that but because she was still friends with my cousin and friends like that she got in touch with me in 1995 and then came back into my life and we've been together ever since we actually got married in 2002."},{"speaker":"John","time":"00:12:10-5","content":"So we been married now 15 years I would say that we've been together like 20 years and very wonderful woman very supportive. She's done everything that she can to help me be a better person inside of here and I think that we've worked at our relationship where when we were teenagers."},{"speaker":"John","time":"00:12:10-5","content":"It was about the sex it was about the things that don't make a relationship where now we understand it's about communication it's about supporting each other it's about building each other up. So we look at people and we see people living together and getting divorced and we been together 20 years and we're making a marriage work. So we think that we're really blessed."},{"speaker":"Marcus","time":"00:14:08-3","content":"Yes. Was this the for the crime for which you're serving time now is that the first your first brush with the law?"},{"speaker":"John","time":"00:14:17-5","content":"I'm a first offender yeah."},{"speaker":"Marcus","time":"00:14:20-8","content":"First offender."},{"speaker":"John","time":"00:14:23-1","content":"Never been in trouble before."},{"speaker":"Marcus","time":"00:14:25-5","content":"Were drugs and alcohol a major part of your life before coming here?"},{"speaker":"John","time":"00:14:27-9","content":"No sir that's one thing I can say."},{"speaker":"Marcus","time":"00:14:30-6","content":"Okay so John one of the reasons that we want to talk with you is that you are as a widely respected trusted member of this community"},{"speaker":"John","time":"00:14:38-9","content":"Right"},{"speaker":"Marcus","time":"00:14:42-7","content":"You have been running the reentry program for automotive certifications for a long time and are somebody who's turned their lives around and is a productive member of society."},{"speaker":"John","time":"00:14:56-5","content":"In here."},{"speaker":"Marcus","time":"00:14:58-8","content":"In here."},{"speaker":"John","time":"00:15:01-6","content":"Right."},{"speaker":"Marcus","time":"00:15:03-6","content":"But that's a process of changes that you've put yourself through."},{"speaker":"John","time":"00:15:07-0","content":"Right."},{"speaker":"Marcus","time":"00:15:09-3","content":"Can you just take a minute to describe the John who was driven through the gates of Angola?"},{"speaker":"John","time":"00:15:14-9","content":"Very selfish person a person that was more about what he wanted instead of taking into consideration what other people needed or were best for them almost to say that I was a god unto myself in a sense it was all about me."},{"speaker":"John","time":"00:15:14-9","content":"After and I can say from the moment that I was incarcerated I realized that my life needed to be changed and it wasn't about me anymore and so from that moment on I started to find ways that I can be a better person but as being a better person helping other people along the way."},{"speaker":"John","time":"00:15:14-9","content":"And so for the past 30 and a half years that I've been incarcerated I've tried to incorporate and do the things that will help other people that's why I went to seminary was to be able to serve people and minister to people went to be a missionary for 8 years at another prison was to be able to help people and I think that was a very good accomplishment while I was there at the other prison I had a guy came up to me another roommate."},{"speaker":"John","time":"00:15:14-9","content":"He says there's a guy in a cell block and he killed my brother and I want him to know that I mean I have no hard feelings toward him and I don't want him to feel that I'll do him anything if he comes in population or anything could you go talk to him?"},{"speaker":"John","time":"00:15:14-9","content":"So I did I went to the cell block to go talk to him and tell him that this guy is now in over here and he didn't want to have any trouble with him or anything by the time that I left there from that prison they had both gone through chiros which is a prison ministry and they were both kneeling by each other and praying with each other."},{"speaker":"John","time":"00:15:14-9","content":"So from somebody that had his brother that was murdered by a guy to actually sitting down and be able to hold his hand and pray with him that let me know that what I had done was worthy. To see the healing brought to both the guy that was had his brother murdered but also to the guy that done the killing and I guess I can go back and I say that and I understood that from where I was telling you that I knew about my mother my mother when I was 25 years old I was incarcerated here at"},{"speaker":"John","time":"00:15:14-9","content":"Angola my grandparents told me if I ever heard the name Bonnie Ray Guy to stay away from this guy. Didn't know why. And then one day when I come in the visiting room I heard the name Bonnie Ray Guy and I pointed to my grandmother and I said who that is? And said this is the guy and he was about 56 years old I would say five foot six five foot 7 grey hair 180 lbs. So a pretty big guy I don't really fear much of anything if anybody see me riding the rodeo and you got a 1000 lb. cow charging at me I jump on it but I was thinking to myself why is this."},{"speaker":"John","time":"00:15:14-9","content":"So I asked my grandmother and so that's when I found out for the first time like I'm saying to know why my mother wasn't in my life. She told me that he was the guy that was responsible for holding my mother in prostitution and that's not why he was incarcerated he was actually incarcerated on another murder and kidnapping charge and stuff like that but at that moment I wanted to kill him."},{"speaker":"John","time":"00:15:14-9","content":"I literally I mean my blood pressure shot through the roof thinking that this was the guy that was reason that I didn't have my mom in my life and he didn't know who I was. So I was able to say when I left the visiting room for three days I thought about how I'm going to get him. I got a life sentence here what have I got to lose? At the end of the third day and mind you I am a Christian at this point but that's how I was thinking."},{"speaker":"John","time":"00:15:14-9","content":"At the end of the third day it was like I just I cried out to god help me and literally he said forgive him. And when he I got that word from god and I did that all my animosity all my anger went away. It disappeared from him and so I was able to walk up and down the walk talk to him he knew nothing about this. Some years later when I became an inmate chaplain at Camp C after graduating from the seminary he was in hospice dying of Cirrhosis the liver."},{"speaker":"John","time":"00:15:14-9","content":"So I went to colonel at the time who was a Christian man and I told him what I'm telling you and I told him I want you to take me to the hospital and I want to go talk to this guy and now confront him but not to confront him to say anything bad I wanted him to know that I forgave him. So we went to his bedside brought him a bible and I told him look I don't need you to confess to anything I don't need you to admit anything I says I know this is what happened and I says but I want you to know that I forgive you."},{"speaker":"John","time":"00:15:14-9","content":"Gods forgiven you. I wanted him to understand that to me salvation is real. And I wanted him to have the same opportunity that I have. So him the colonel and I prayed together and a couple of days later he called the Colonel back and talked about what took place and made a confession of faith with the Colonel."},{"speaker":"John","time":"00:15:14-9","content":"So I believe he's in heaven. So that what understanding that forgiveness frees you and it freed me from inside of here even though I was staying in prison I was still a victim from being a small child and understanding that helped me deal with the two guys that were together."},{"speaker":"Marcus","time":"00:21:48-9","content":"That's extraordinary you're a better man than I'm not sure, I would be able to do that."},{"speaker":"John","time":"00:21:52-8","content":"I didn't think I could because I was ready to kill him but I mean it was just something that I cried out for help and that's what god told me to do and when I done it literally I mean it was this like awe."},{"speaker":"Marcus","time":"00:22:07-4","content":"Yeah. Have you forgiven yourself john?"},{"speaker":"John","time":"00:22:15-8","content":"I want to say yeah. Other times when you see other people suffer because I'm still incarcerated it's kind of hard."},{"speaker":"Marcus","time":"00:22:35-0","content":"There are lots of victims."},{"speaker":"John","time":"00:22:35-0","content":"Yes."},{"speaker":"Marcus","time":"00:22:43-7","content":"Yeah. What was your typical day like here when you first came there?"},{"speaker":"John","time":"00:22:52-8","content":"Yes."},{"speaker":"Marcus","time":"00:22:56-7","content":"It's got to be different from your day to day."},{"speaker":"John","time":"00:22:59-5","content":"Yeah when I first came here I was assigned to camp J bass I was a yard work up in the morning went to breakfast got a lawnmower which was not a gas mower at the time it was what we called the weed whacker the whole time spinning wheels and I cut grass all day long Monday through Friday. But I did it to the best of my ability."},{"speaker":"John","time":"00:22:59-5","content":"So in 1990 is whenever they first started the first tier walkers here because there was a rash of suicides and they wanted people to be able to spend six hours at a time working the tiers working with guys that were mentally ill and again that goes back to from the moment I was locked up trying to help others."},{"speaker":"John","time":"00:22:59-5","content":"So I interviewed for the position of a tier walker and I became the very first tier walker here at Angola working with the mentally ill patients to just observe them talk to them try to be a friend and then help them if they started to get really bad off GED social work and tell them well this guy need some help."},{"speaker":"John","time":"00:22:59-5","content":"So I went and done that for 18 months and then you just kind of get burnt out some so at that point is whenever I got into the automotive school and went through school thinking if I ever got out of prison and a small church calls me and as Paul said be a tent maker. If the church couldn't afford to pay me I'd have a job little knowing where its bringing me too."},{"speaker":"John","time":"00:22:59-5","content":"Today I graduated from automotive school and then got in seminary stopped doing automotive work went to ray burn that's when I found out you could get your certifications and I got ASE certified little knowing that 2010 the reentry court was going to start and they needed somebody to take over and teach and be an instructor in school."},{"speaker":"Marcus","time":"00:24:48-9","content":"Tell us about that."},{"speaker":"John","time":"00:24:52-6","content":"So they brought be back from ray burn correctional center to be the instructor of the automotive school. And at first you're kind of questioning yourself because you've never done this before as far as being the instructor of a school like that but it was the idea that it was ministry work again trying to help individuals to become both technologically advanced."},{"speaker":"John","time":"00:24:52-6","content":"So they can work on today's automobiles but at the same time trying to change their behavior to understand what it's going to be to keep that job. Because if all I did was teach them the skill and they still had the same tendencies that they had before they came to prison sort of like me being selfish or whatever instead of thinking about others is to try to get them to tart to think differently while they're going through this process."},{"speaker":"John","time":"00:24:52-6","content":"So now 7 years later I've seen the results of the men who have graduated from the school that are working in the automotive school that are providing for their families it gives me hope and again purpose to know that I'm doing something good from inside of prison. When young men can get out of here and stay out of here then you've given back to society even from inside of the prison system."},{"speaker":"Marcus","time":"00:26:08-7","content":"Yes indeed. How do you deal with the possibility that you may never leave here."},{"speaker":"John","time":"00:26:19-4","content":"I think that the idea that you have a life sentence in a sense yeah its life and they say you're going to die in prison but at the same time as you come to do a self-actualization on yourself you realize that you still have choices to make while you're in prison."},{"speaker":"John","time":"00:26:19-4","content":"You can live a very good life and do the right thing and help other people or you can live a life that is destructive even inside a prison I mean you could have been somebody that did drugs in prison sold drugs raped somebody participated in all the things that are wrong and for myself it was to realize to help others I have to do the right thing and its made my life fulfilling even inside of the prison system."},{"speaker":"John","time":"00:26:19-4","content":"With a life sentence and yeah I may die in prison do I hope that I die in prison? No I hope that I get out but I know that getting education was going to be beneficial to me and to others what gods done inside of my life and being involved in church again beneficial helping heal me and to help others at the same time. So I try to I guess look at the glass always half full instead of half empty."},{"speaker":"John","time":"00:26:19-4","content":"You can accomplish things even from inside of prison and I've done more from inside of prison than a lot of people have ever done on the outside of prison. I've been able to speak to ambassadors from 21 different countries about what god's been able to do."},{"speaker":"John","time":"00:26:19-4","content":"Never would I have thought that we would've been able to have inmates over a program to help other inmates when I first got here but I just knew that we just got to keep going along and keep doing the right thing and good things are going to happen. And so if I die in prison I know I'm dying worthy of doing the right thing and my life is worthwhile."},{"speaker":"Marcus","time":"00:28:33-4","content":"Yeah and that makes sense to me. Against that backdrop of making the best of a bad situation."},{"speaker":"John","time":"00:28:49-7","content":"Right."},{"speaker":"Marcus","time":"00:28:52-8","content":"What is the worst part of being here for you?"},{"speaker":"John","time":"00:28:57-7","content":"The worst part is being away from family members being away from my son being away from my wife my cousins my grandparents since they passed away my brother Nicholas and he just got married. So expecting to have a niece or a nephew I mean that's part of the relationship and not being able to be there as that uncle should be."},{"speaker":"John","time":"00:28:57-7","content":"Being able to I guess just to be back on the outside again and to not have bars slammed or to hear bars slam to not hear the guards holler and say you got to do this or do that but even in society I mean there's things and that's what I'm trying to show the reentry guys we still have people that are an authority over us if you go to work for a dealership you got a service manager he's going to assign you to this car and you need to do this this and this. So you're never completely away from authority but it's to learn to deal with it."},{"speaker":"Marcus","time":"00:30:07-0","content":"This place is dramatically different from when you arrived."},{"speaker":"John","time":"00:30:15-0","content":"Yes."},{"speaker":"Marcus","time":"00:30:18-1","content":"What do you think the best thing about Angola is? What would you want people outside what are the things that we know is that very few people some people come to the rodeo but very few civilians go into prisons."},{"speaker":"John","time":"00:30:28-3","content":"Right."},{"speaker":"Marcus","time":"00:30:31-5","content":"So people don't really know unless they're interested or they're in law enforcement people just don't know what's going on here what do you what's good here that you would like people to know?"},{"speaker":"John","time":"00:30:45-4","content":"The good things is that people are making a difference. When I say people I mean inmates that are in here that are incarcerated for a very long time that have stood up and said enough is enough over time and started to be the leaders and instead of bad leaders you have good leaders and that's what's changed Angola is to have enough people to buy in like."},{"speaker":"John","time":"00:30:45-4","content":"I'm saying is to live and do the right thing even if you're incarcerated instead of like what you see on the prison movies on TV or the documentaries where you see all the gang violence and stuff like that we don't have gang violence here in the prison."},{"speaker":"John","time":"00:30:45-4","content":"This prison has morally changed from one that was very violent because when I first got here I mean it was nothing to have a couple of killings a year to have people stabbed or cut every week now it's very rare that it happens. It does happen I mean when you get 5000 men or 6000 men that live together no matter where you're at some violence happens but it's not on the magnitude of what it was when I first got here. I mean it's decreased dramatically."},{"speaker":"John","time":"00:30:45-4","content":"And so that's why the judges and the administration from the department of corrections says ok we've seen something different taking place and they're having us now try to retrain men to go back out in society. So you're using the antidote of what was bad to mix in to be able to bring something healing and put back out in society and say this is a better product. And Angola has definitely done that."},{"speaker":"Marcus","time":"00:32:42-2","content":"I'm curious about something."},{"speaker":"John","time":"00:32:45-4","content":"Yeah."},{"speaker":"Marcus","time":"00:32:47-5","content":"I've been interviewing people who have served over 20 years who have reached a certain status in my viewing as being leader's people that mentors people that every younger guys look up to. Does security treat you all differently than the other guys?"},{"speaker":"John","time":"00:33:04-7","content":"Yeah they do."},{"speaker":"Marcus","time":"00:33:07-0","content":"Is it a certain amount of respect?"},{"speaker":"John","time":"00:33:09-4","content":"It's a certain amount of respect but it's because over the past 30 years that I've lived my life inside of here again I'll go back to when I was cutting grass the officer that I had as my supervisor seen that I had done it to the best of my ability and I had done a good job. So you got a promotion. You do the job right you put yourself into it and do that and people take notice and so right now I would say that"},{"speaker":"John","time":"00:33:09-4","content":"I'm probably at the pinnacle of being at the top inside of prison system. So when officers talk to me it's Mr. John or Mr. Sheehan a lot of them I say and I don't expect them to I it's not something I expect but I mean they do give me that respect if I go to them with a problem they know that I'm not going to them with something that doesn't really matter. If I go to them and bring them a problem it's something that really needs to be dealt with."},{"speaker":"John","time":"00:33:09-4","content":"So I find that when I do bring that to them then its dealt with and lot of things get done. That's the good thing about being in the position that I'm in right now it's not just that they treat me a bit different and give me a little bit more respect it's that when I have and I'm not necessarily going to say for me it's a problem but it's a problem for others that are around me and need to try to correct that then I can get something done."},{"speaker":"Marcus","time":"00:34:45-3","content":"Is there something that you've seen over the years that prison administrators could do security could do to aid and abet the rehabilitation of folks as opposed to at or doing certain things that may hinder that?"},{"speaker":"John","time":"00:35:01-9","content":"One of the things that I think they could get help out is consistency. Consistency from shift to shift if this officer is doing it this way and so then inmates start to do it this way and then tomorrow the next officer wants it different and you get hollered at because you were doing it this way there's conflicts in that and so that just makes people aggravated brings up their blood pressure."},{"speaker":"John","time":"00:35:01-9","content":"I always find that consistency is the thing that helps the most in like this when we're doing with reentry I have to be consistent in the way that I treat all of them I can't necessarily pick out one or two and be buddy with them I have to treat all of them across the board with firmness but gentleness, kindness, direction and keep it the same all the time."},{"speaker":"John","time":"00:35:01-9","content":"So if the security would do that it would be a lot better following the posted policies that are there Angola is an institution that is kind of laxed in that and sometimes that's good for our benefit but there has to be some guidance to following that. The other thing is to know that everybody that's in prison has made a mistake correct. They've done something wrong."},{"speaker":"John","time":"00:35:01-9","content":"But none of us want to be known for our worst mistake in life and I don't care whether you're in prison or you're out of prison nobody wants to be known for their worst mistake. What are they doing with themselves since that terrible thing that they done? Are they trying to rehabilitate them self can you see that? And if they are then tell them ok you doing a good job. Reinforce that. Those are the things that I think help bring people."},{"speaker":"Marcus","time":"00:37:10-5","content":"Sure. And then again I just come back to the absurdity where in the context of a life sentence it doesn't really matter."},{"speaker":"John","time":"00:37:25-3","content":"Yes."},{"speaker":"Marcus","time":"00:37:26-9","content":"Of course it matters to you right?"},{"speaker":"John","time":"00:37:30-3","content":"Right."},{"speaker":"Marcus","time":"00:37:32-6","content":"I mean you made a very eloquent point about the fact that I can lead a meaningful life in here but from the standpoint of increasing the odds of being an incentive for good behavior."},{"speaker":"John","time":"00:37:44-0","content":"I think the incentive for good behavior if there was some way to keep better track of it to be able to put in a person's record ok what the parole board and pardon board looks at more than anything I think is to see what you done wrong instead of what you done right."},{"speaker":"John","time":"00:37:44-0","content":"So if you had made one or two write ups and had 20 things that are good they're going to key on the two things that you done wrong. So that's one of the things is helping to realize and promote ok look at the things the guy has done right from inside of prison."},{"speaker":"John","time":"00:37:44-0","content":"I guess it's easy to say why not just say to hell with it and live like the devil but if I'd done that or and I see others do that0 they live a miserable life inside of here. I mean really they're crabby they're you don't like being around them. So even in that that's a reason why not to do that. Why be around that type of environment? I'm losing my hair I'm going gray sometime in the next month I'm going to have my thyroid cut out. I'm getting older I'm starting to fall apart."},{"speaker":"John","time":"00:37:44-0","content":"So now these guys that are in reentry that are doing short time actually see what takes place if you're going to spend the rest of your life in prison it ain't fun. It ain't fun and games."},{"speaker":"Marcus","time":"00:39:27-1","content":"One of the things they surely learn is that life in Louisiana means life because the evidence around them at Angola is everywhere."},{"speaker":"John","time":"00:39:33-8","content":"It's everywhere. Yes and so that's I mean and I try to be honest with them I mean to the extent to show them but despite what we have I went in front of the pardon board this November will be two years ago I was voted down. I had 3 that voted for me 2 against me you have to have 4. So that means that again you don't even have hope but I go back to the school and I show them look this is what I want you to do to look at john."},{"speaker":"John","time":"00:39:33-8","content":"No matter what somebody else does towards you still have that choice what I'm going back to do right or to do wrong and you're life is going to be measured like that. The character of a man is not known by how he does when things are going well but how he does when things are not going right."},{"speaker":"John","time":"00:39:33-8","content":"When you get back out in society you might not start off at $20 an hour on your job you might start off at $12 and hour it might seem unfair but you have to persevere just as I have to persevere in here to keep doing the things that I need to do to maybe get a shot at release."},{"speaker":"Marcus","time":"00:40:48-9","content":"Yeah. What are you most proud of?"},{"speaker":"John","time":"00:40:51-9","content":"The thing I'm most proud of just to be able to give back and I know that's kind of broad but for the time that I've been incarcerated there's so many things that I mean a lot to me just like with the individual helping them find forgiveness for each other being able to do things like that on a constant basis to help these individuals understand that they can change."},{"speaker":"John","time":"00:40:51-9","content":"So the whole purpose of being proud is to give it back again getting away from the selfishness that I had before I was incarcerated to something to me that's meaningful and its fulfilling I mean my life is fulfilling each and every day is it always easy? No"},{"speaker":"John","time":"00:40:51-9","content":"I mean just like yesterday when talking to the doctor about having my thyroid out that's just another point of growing old and hopefully you're going to get out of prison but at the same time I mean I realize that I'm still involved with school and still helping these guys become better people."},{"speaker":"Marcus","time":"00:42:06-5","content":"Sure absolutely. Last question then."},{"speaker":"John","time":"00:42:09-6","content":"Okay."},{"speaker":"Marcus","time":"00:42:11-9","content":"So is there a question that I should have asked you that I didn't that you might have wanted an opportunity to talk about something that you think people should know?"},{"speaker":"John","time":"00:42:21-0","content":"I'm going to try to think on that. People should know."},{"speaker":"Marcus","time":"00:42:25-2","content":"We covered quite a lot of different things."},{"speaker":"John","time":"00:42:27-2","content":"Right yeah I think the thing that people should know is that yes everybody that's incarcerated has done something wrong. And I hear people often say that well you don't know how I feel as a victim. I know how you feel as a victim. I've been a victim. And I understand that the only thing that's helped me is to come to forgiveness and one thing I didn't share with the other back in 2011. My sister was murdered. While I was here."},{"speaker":"John","time":"00:42:27-2","content":"And so whenever I call my family and the chaplain was with me one of the things I was telling them was look I says if you want to have mercy come toward me I want y'all to show mercy toward him. I don't want him to be convicted of second degree murder I want him to have a chance to be able to rehabilitate himself and get out. So he was able to get a manslaughter charge. So he will have a chance at freedom one day."},{"speaker":"John","time":"00:42:27-2","content":"So I've been in the part of the victims shoes. Is it easy? No you're going to have pain. But if I was to hold onto the pain I would be miserable. I had to let that go."},{"speaker":"Marcus","time":"00:43:56-7","content":"Yeah. Seems like you've done that quite a bit. And that's a good place to stop. John I'm very grateful for you talking to me."}]}