{"name":"","transcript":[{"content":"Julius Holden Transcription REDACTIONS FINAL"},{"speaker":"Julius","time":"00:00:10-6","content":"My name is Julius Holden. I got convicted for 2nd degree murder. I was 22 years old when I committed the crime, and I've been incarcerated for 22 years."},{"speaker":"Marcus","time":"00:00:26-3","content":"So, I'm going to ask you a few questions, as I said about you coming up. I understand that you were in a military family and you travelled quite a bit, moved from place to place. Can you tell me a little bit about your family, the folks who were closest to you, the folks who raised you?"},{"speaker":"Julius","time":"00:00:46-3","content":"Well, my mom and dad, of course, my dad being in the service and especially in Europe, he was gone an awful lot. So I think that I certainly spent more time with my mother when I was growing up than I did with my father. I have 2 younger sister, were 5 years apart. So the youngest is 10 years younger than me and the middle is 5 years younger than me. Outside of my parents."},{"speaker":"Marcus","time":"00:01:17-9","content":"What were they like?"},{"speaker":"Julius","time":"00:01:21-0","content":"Well let me see, my dad, I think the military had a lot to do with it. My dad, I think was really strict, I want to say he was, this is sort of hard nose, I guess, this is the way it's going to be. He was very strict and rule oriented. My mother, my mother I think was a tad bit more lax, I want to say, I loved my mother but I think sometimes, yeah she was a lot more lax, I think she needed breaks from us every now and again."},{"speaker":"Marcus","time":"00:02:02-4","content":"Did they get along?"},{"speaker":"Julius","time":"00:02:05-1","content":"My parents got along good. I think that they had a really good relationship."},{"speaker":"Marcus","time":"00:02:11-0","content":"So fighting wasn't part of your home life, is that right?"},{"speaker":"Julius","time":"00:02:15-3","content":"No, almost never."},{"speaker":"Marcus","time":"00:02:17-3","content":"How about outside the home. Did you find yourself getting in fights growing up?"},{"speaker":"Julius","time":"00:02:23-0","content":"Well yes because I would constantly find myself in a, well, in a new environment. It seems like, okay, every 3 years we would pack up and we'd leave. So you find yourself in a new place, with people that you don't know, kids are, I don't know, it seems like kids are not very accepting of outsider. So every 3 years I was an outsider. Throw that into foreign country, and so yeah there was a lot of, it was a decent amount of fights when I was young."},{"speaker":"Marcus","time":"00:03:09-0","content":"What was the highest year of school that you completed?"},{"speaker":"Julius","time":"00:03:14-0","content":"I went to Covington High school for, I got suspended for smoking actually in my 11th grade year, and at that point, me and my father had gotten in a big argument, so I didn't go back to school. I got my GED, 5 or 6 months later. I actually went for 11th grade and ended up with my GED. I had to get out, I had to get jobs."},{"speaker":"Marcus","time":"00:03:43-1","content":"What was your job?"},{"speaker":"Julius","time":"00:03:44-6","content":"My very first job, I worked at a brake shop. A brake and muffler shop. I learned how to work on cars."},{"speaker":"Marcus","time":"00:03:54-1","content":"Have you, taken advantage of some of the certifications that are available, some of the training here at Angola?"},{"speaker":"Julius","time":"00:04:00-5","content":"Here at Angola? Let's see, I've been to, I've got 2 degrees from the New Orleans Baptist Theological Seminary. My associates and my bachelors. And um, currently I'm in generator school, and learning how to repair generators. So, it's kind of cool."},{"speaker":"Marcus","time":"00:04:22-4","content":"Yeah, it is kind of cool. I'm familiar with the reentry program, and some of the programs that they have here. State of the art. So you were kicked out of school for smoking. But otherwise you had a pretty ordinary high school experience?"},{"speaker":"Julius","time":"00:04:42-5","content":"Yes. Once you get past that initial having to, it seems like, especially in high school. I came here, I want to say it was '85, I came back from Germany, and again it was Covington high, a lot of these kids they've known each other all their lives."},{"speaker":"Julius","time":"00:04:42-5","content":"And then you have me and I don't know anybody because I've been in another country. So I think the first year I want to say, or maybe half a year, once I was meeting people and then once I was no longer on the outside, once I was more accepted. Yeah actually it es a pretty good experience."},{"speaker":"Marcus","time":"00:05:28-1","content":"Did you play sports?"},{"speaker":"Julius","time":"00:05:29-6","content":"Yes I did, I played football. That actually helped a lot too. I think I would've had a much harder time if I would've played sports."},{"speaker":"Marcus","time":"00:05:45-0","content":"Did you have a girlfriend you were really close to before you were incarcerated?"},{"speaker":"Julius","time":"00:05:51-0","content":"Well actually I was married, so yes."},{"speaker":"Marcus","time":"00:05:56-3","content":"And do you have children?"},{"speaker":"Julius","time":"00:05:57-7","content":"I do, I have 2 sons."},{"speaker":"Marcus","time":"00:05:58-6","content":"Can you tell me a little bit about them?"},{"speaker":"Julius","time":"00:06:01-0","content":"Well, let's see, my oldest son is 27, my youngest son is 23. The oldest one is, he just, he works as a chef in New Orleans, to different restaurants. Him and his wife, they just gave me my first grandson, so that's kind of cool. I got my first grandson, didn't really think I was older enough to be a grandfather, but it is what it is."},{"speaker":"Julius","time":"00:06:01-0","content":"My youngest son is, he just got out of Baton Rouge technical college, he joined the welders union in New Orleans. He's not married yet but he's got a long term girlfriend who is going to LSU medical school. I'm really proud of them for doing something with their lives and not ending up here like me."},{"speaker":"Marcus","time":"00:07:02-7","content":"What was the relationship like between you and your wife?"},{"speaker":"Julius","time":"00:07:13-3","content":"Well, it started out, I'd like to say it started out well. We met in high school. As a matter of fact we met in 10th grade in high school. We didn't get married until we I got suspended in 11th grade she stayed and continued, she went ahead and got her high school diploma when I started working."},{"speaker":"Julius","time":"00:07:13-3","content":"And we got married after she got out of high school. And I think we had a pretty good relationship until I started using drugs, actually. I think that had a lot to do with some of our separation at the end. Because I started doing, I started snorting cocaine, I'd smoke marijuana. That led to going out to the bars and drinking and I wasn't home as much."},{"speaker":"Julius","time":"00:07:13-3","content":"I was spending a lot of our money that we could've been using for better things. So toward the end it was kind of rocky, and again, I picked up several bad habits and I'm reasonably sure that's what caused all the problems."},{"speaker":"Marcus","time":"00:08:33-0","content":"So, drugs and alcohol, what role did that play in what ended up bringing you here?"},{"speaker":"Julius","time":"00:08:43-1","content":"Well, okay, as stated before, I had a drug problem, a relatively serious one. As time went on, it became more and more expensive, Strangely enough, one of the, I'm convicted for the death of one of those friends. It wasn't, in my case, it was one of my friends, we had a falling out behind drugs. So, yeah it played a fairly large part."},{"speaker":"Marcus","time":"00:09:18-2","content":"Sure. So, let's just go back 22 years for a minute and revisit the person who came here, the young Julius. What was he like, can you describe him?"},{"speaker":"Julius","time":"00:09:33-1","content":"Wow. Rebellious, I had problems with authority, when I first got here I was constantly in trouble. If you could think of it, I got locked up for, I was in a lot of trouble when I first got there. I was angry, I was bitter, I was constantly lashing out at everybody around me. Had actually, the first almost 5 years I was here before I managed to wake up and start changing."},{"speaker":"Marcus","time":"00:10:18-5","content":"So what was that waking up? So some people arrive at these changes gradually and others it's a light bulb goes off. What was it for you?"},{"speaker":"Julius","time":"00:10:29-6","content":"They had a couple people, all convicts. They'd been here for quite some time. And I met when while we was working in the kitchen together. He was an older guy, and he actually pulled me to the side one day and he's like, \"What are you doing? Why are you constantly banging your head against the all? You're here, you need to come to terms with that, accept it. You can make this journey hard or you can make it a little easier.\""},{"speaker":"Julius","time":"00:10:29-6","content":"He had a big positive impact on my life because he's the one that convinced me to enroll in the Bible College up here, it was a newly emerging program. He was really instrumental in getting me in the Bible college and making me open my eyes and actually that just because I was here didn't mean that I couldn't control my life, it wasn't too late to turn my life around in other words. Because I figure since I first got here okay now I'm here, now there's no reason to change."},{"speaker":"Julius","time":"00:10:29-6","content":"So he was really instrumental in that. He let me know that it was not too late to change."},{"speaker":"Marcus","time":"00:11:50-6","content":"Do you find yourself now mentoring younger inmates?"},{"speaker":"Julius","time":"00:11:54-3","content":"I try. I do because especially the young inmates and especially the reentry program. Because a lot of them will come up here and they'll have the same mindset I had. I try to do the same thing that was done for me."},{"speaker":"Julius","time":"00:11:54-3","content":"I try to pull them aside and say, \"Look, I've been here over 20 years, this is serious, you're having a chance to go back out in society, a chance that we really don't have. You really need to start surrounding yourself around people with a positive mindset instead of hanging around with the same people you hung around with one the street, the ones that got you here, you need to break free from that.\""},{"speaker":"Julius","time":"00:11:54-3","content":"I try to counsel them and lead them towards, you know, a better behavior, a better mindset is what it is. Because, I understand, I've been there and I've been surrounded with those people, and if you're always surrounded by people with a negative attitude, then it's a hard struggle out of there. However if you are lucky enough to encounter people with a positive mindset and want to change your life for the better, its a lot easier to do. I couldn't have done it without outside influences."},{"speaker":"Marcus","time":"00:13:23-2","content":"Okay."},{"speaker":"Julius","time":"00:13:24-0","content":"At least I don't think I could've done it, or it definitely would've taken longer."},{"speaker":"Marcus","time":"00:13:28-4","content":"Sure. So for you it was about 5 years into your sentence that you kind of, made the change."},{"speaker":"Julius","time":"00:13:32-8","content":"It was."},{"speaker":"Marcus","time":"00:13:36-6","content":"So what's your daily life like here, what's your routine?"},{"speaker":"Julius","time":"00:13:41-8","content":"Well, I'm in generator school, okay. So I, basically I get up, I fix me some coffee and I go to class. We stay in class all day, we get out at 2:30 or so. After that, it depends. Some days, like tomorrow, I've got a class up here, I'm a member of sober group, and we give classes to the reentry students, the kids that are only going to be here for a couple years."},{"speaker":"Julius","time":"00:13:41-8","content":"So every Tuesday I get to go and I get to help them and walk them through the 12 step program. So yeah I try to mentor with them a little bit. Um, that's Tuesdays. Well that's about it. Other than that, just trying to find something to do."},{"speaker":"Marcus","time":"00:14:40-1","content":"Sure. What would you say your job is right now?"},{"speaker":"Julius","time":"00:14:46-4","content":"My job?"},{"speaker":"Marcus","time":"00:14:49-8","content":"Everybody here has a job."},{"speaker":"Julius","time":"00:14:53-9","content":"Okay well yes, but my job is this case actually is generator repair school."},{"speaker":"Marcus","time":"00:14:59-9","content":"Right, that's your job right now. Then after you've graduated from that program you'll probably be putting those skills to work here."},{"speaker":"Julius","time":"00:15:07-8","content":"Its possible yes."},{"speaker":"Marcus","time":"00:15:08-5","content":"Right. Then your other job is mentoring reentry kids through sobriety classes."},{"speaker":"Julius","time":"00:15:14-9","content":"That's right."},{"speaker":"Marcus","time":"00:15:15-5","content":"Okay."},{"speaker":"Julius","time":"00:15:15-9","content":"Now for a while after I got out of. After I graduated Bible College. I was a peer minister. And part of my job then was to go around and I would speak to the people who were in the extended lockdown, that were on the closed cell restriction, CCR, and again try to help them make a positive change and trying to get people to wake up."},{"speaker":"Julius","time":"00:15:15-9","content":"I would tell them, look at me, if I can wake up, if I can make changes in my life, all the things that I've done, the serious problems that I had, then you can do the same thing, you have no excuse. I try to motivate them that way, I'm like look at me man, I was really messed up and if I can pull that out anybody can."},{"speaker":"Julius","time":"00:15:15-9","content":"So yes I try to exert a positive influence on people and again I try to focus mostly on the younger people because they're more likely to listen and you know somebody who's been here for 30 years they've not really wanted to listen about any kind of change but the younger ones I try to catch."},{"speaker":"Marcus","time":"00:16:31-7","content":"Sure. Do you still have close relationships, or let me ask, close as it can be with your 2 sons?"},{"speaker":"Julius","time":"00:16:38-3","content":"Absolutely, I do. I was really lucky in that regard. My sons have been coming up here to visit me, unfortunately their entire lives. They've always come up here, at least once a month. Okay so yes I've had really lucky in that aspect."},{"speaker":"Marcus","time":"00:17:02-5","content":"So, let's take your oldest son.."},{"speaker":"Julius","time":"00:17:07-9","content":"27."},{"speaker":"Marcus","time":"00:17:08-7","content":"The chef. How would he describe you, if I were to go talk to him?"},{"speaker":"Julius","time":"00:17:19-9","content":"I don't know. I'm not sure. Like I said, his whole life he's been coming up here to visit me, when I first got up here. He was only 4. Okay so he was really kind of young and so if he noticed all the trouble that I stayed in, I'm kind of thinking he was too young to notice."},{"speaker":"Julius","time":"00:17:19-9","content":"Now, I think when he was older was when I was either in the Bible college, studying for my degrees, or afterwards when I was a peer minister and I was going around I tried as much as possible to also talk to him and explain to him \"Look, see me, I'm here, this is what I've done to get here, this is what you really need to avoid cause these people are serious, they don't want to let us out."},{"speaker":"Julius","time":"00:17:19-9","content":"You don't want to come up here. I try to use myself as a bad example. Telling him look kid look this is what I used to do and this what you don't need to do. And they came out okay so, you know. Hopefully I was able to influence that a little bit. I guess a total loss."},{"speaker":"Marcus","time":"00:18:41-5","content":"So I know you spent some time growing up in Germany, you're probably aware that there isn't such thing as life without parole in Europe in fact its seen as unconstitutional."},{"speaker":"Julius","time":"00:18:55-6","content":"Okay."},{"speaker":"Marcus","time":"00:18:57-7","content":"Can you help me understand, from your perspective, how people deal with life without parole?"},{"speaker":"Julius","time":"00:19:11-5","content":"Well, it's kind of hard. What it is its, when you have a life sentence and you realize that they're serious about it, life means life, it's hard to want to change because realistically there's not many reasons to change if you tell me \"okay, you're going to prison, you're going to do, 20 years if you make positive changes in your life you'll make parole\" well that gives you incentive to not be a knucklehead and just stay out of trouble and to get your GED if you need it or get a trade from the Vortex schools up here if you need it."},{"speaker":"Julius","time":"00:19:11-5","content":"But if you tell that same person, \"What, this is your home for the rest of your life, you're going to live and die here, well, why do I need to come out of my comfort zone and change my life, why? You just told me I was going to die here, seems to me that I should be able to do whatever I want to do\" So, yeah, it's just, it's hard to find motivation to change with a life sentence."},{"speaker":"Marcus","time":"00:20:45-2","content":"Right so, and yet you have decided that in spite of a life sentence that you're going to get your GED, get your associate's degree, go through the Bible College, no you're going through generator school. Do you hold some hope that parole eligibility may be extended to those serving life sentences? To some of those serving life sentences?"},{"speaker":"Julius","time":"00:21:14-2","content":"Yes, I do hold that hope. And I would love to see changes in the future because as it stand right now, I have a life sentence, as it stand right now this is it. And so yeah I really do hope that legislation changes in the future because, I don't know how to accurately express this, it's just, I think I've already said it, it's really hard for people to want to change in an environment where no one's going home."},{"speaker":"Julius","time":"00:21:14-2","content":"There's only a limited amount of incentives up here to make you want to have good behavior; and I've heard that a lot of times over the years also, especially people that are in trouble in cell blocks and stuff, well why can't I get high? It makes me happy."},{"speaker":"Julius","time":"00:21:14-2","content":"We were always getting in trouble every time they'd come around they drug test, here you are got to come over here and I got to see you over here, it's like so what, why not? And unfortunately you get a lotta that, a lot more than you would think."},{"speaker":"Marcus","time":"00:22:50-4","content":"A sort of sense of hopelessness about it."},{"speaker":"Julius","time":"00:22:53-5","content":"There is, and it's pretty pervasive. It really is."},{"speaker":"Marcus","time":"00:23:03-2","content":"This may seem like a silly questions, but, what's the worst part about being here, for you?"},{"speaker":"Julius","time":"00:23:21-3","content":"The worst part about being here for me, is having to watch my children grow up through photographs. I think that's the hardest part for me."},{"speaker":"Marcus","time":"00:23:38-8","content":"Of course. What's the best part?"},{"speaker":"Julius","time":"00:23:51-1","content":"What, I think the best part of being here is that when, my children are grown now, I want to say when they were younger, when they were going to high school. Sometimes, when you're that age, you're kind of rebellious and maybe get in a little minor trouble here and there."},{"speaker":"Julius","time":"00:23:51-1","content":"I think the best part of my being up here their entire lives was what I've been pointing at myself and say \"Look, you really want to end up like me?\" They could actually picture that, like \"Well yeah, wait a minute, he has been there our whole lives.\" So maybe I was able to have some positive impact there because they could look at me and say yeah you know what we'll not get in trouble."},{"speaker":"Marcus","time":"00:24:38-4","content":"It seems that your children, in spite of being separated from you are still very sort of central part of your life."},{"speaker":"Julius","time":"00:24:47-3","content":"They are, they are. They're one of the reasons that I continue to attempt to avoid trouble at all costs. Because I don't want to lose my, I want to see my children, and I got a grandchild, so it's even, now it's even more. Now, they come to visit, I play with the, I got a little grandkid. So yeah they've had a huge impact as far as keeping me out of trouble."},{"speaker":"Marcus","time":"00:25:18-3","content":"Is this grandchild a boy or a girl?"},{"speaker":"Julius","time":"00:25:20-5","content":"He's a boy."},{"speaker":"Marcus","time":"00:25:21-4","content":"What's his name?"},{"speaker":"Julius","time":"00:25:22-0","content":"His name is Rocco."},{"speaker":"Marcus","time":"00:25:23-2","content":"Rocco."},{"speaker":"Julius","time":"00:25:24-0","content":"Yes."},{"speaker":"Marcus","time":"00:25:25-5","content":"And they're in New Orleans?"},{"speaker":"Julius","time":"00:25:28-0","content":"They live in Mandeville, he actually works, he goes across the causeway every day. One of the places he works for is New Orleans Hamburger and Seafood Company, and the other one, I forget the name, they just opened it up last month, its more of a tapas style restaurant, so."},{"speaker":"Marcus","time":"00:25:51-0","content":"When you hold out hope for leaving this place one day, how do you envision your life being? Let's say you were granted a pardon or parole."},{"speaker":"Julius","time":"00:26:05-7","content":"Well, I would like sometimes it's hard to envision exactly what would we do because we're not getting any younger. Sometimes it's intimidating to actually think about getting out after all this time. But, I would like to be able to work with troubled youth, with people that are younger that have drug problems, that have alcohol problems, I think that I would like to bring my message to them."},{"speaker":"Julius","time":"00:26:05-7","content":"And again use myself as that bad example, \"You now, look, I was just like you, I spent over 20 years in prison, so this is what you need to do, because it's real serious.\" I think that I would like to continue work along those lines, I think that I could have a positive impact on troubled people."},{"speaker":"Marcus","time":"00:27:17-7","content":"Is there a question that I should've asked you but I didn't? Something that I should be asking folks like yourself? Or is there something else you would like to tell me about your experience here?"},{"speaker":"Julius","time":"00:27:48-5","content":"I don't really know, I can't think of much. I thought you had some really good questions."},{"speaker":"Marcus","time":"00:27:58-3","content":"No, I've really enjoyed talking with you. Sometimes, I feel like somebody might've wanted to talk about something I didn't give them an opportunity to so I usually end with that question."},{"speaker":"Julius","time":"00:28:10-0","content":"No, I think I've gotten- I've actually enjoyed our conversation."},{"speaker":"Marcus","time":"00:28:15-4","content":"I have too, thank you very much."}]}