{"name":"","transcript":[{"content":"Keith Byes_Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-3","content":"So if you can go ahead, and start by stating your name, the crime of conviction, how old you were and how much time you've served."},{"speaker":"Keith","time":"00:00:06-6","content":"Keith Byes, I was 22 when I came here and second degree murder."},{"speaker":"Marcus","time":"00:00:14-0","content":"How much time have you served?"},{"speaker":"Keith","time":"00:00:15-9","content":"32."},{"speaker":"Marcus","time":"00:00:17-1","content":"32 years. All right, as I said earlier, I'm just going to start by asking you some questions about the time before coming here so can we, let's start with childhood. If you could tell me about the folks who raised you?"},{"speaker":"Keith","time":"00:00:28-3","content":"Well, my mom and my dad, I was 4 years old. At the age of 5, Dad left in the Fisher Project. Housing project, age of 5, I looked dad was gone. I got 5 brothers and 1 sister. That's who raised me and my mom."},{"speaker":"Marcus","time":"00:00:53-3","content":"Okay where are you in the birth order with your siblings? Are you the oldest or the youngest?"},{"speaker":"Keith","time":"00:01:00-0","content":"No. I got a twin brother, we are identical. I got one youngest and all the rest of them are older."},{"speaker":"Marcus","time":"00:01:07-0","content":"Okay and did some of your older siblings raise you as well? Especially your sister maybe?"},{"speaker":"Keith","time":"00:01:13-3","content":"Yes."},{"speaker":"Marcus","time":"00:01:14-3","content":"Tell me a little bit about her."},{"speaker":"Keith","time":"00:01:16-9","content":"She came to the rodeo. She's a good person and she's always telling me wrong from right."},{"speaker":"Marcus","time":"00:01:25-5","content":"What about your mom?"},{"speaker":"Keith","time":"00:01:27-0","content":"She's straight an angel."},{"speaker":"Marcus","time":"00:01:31-5","content":"Is she still alive?"},{"speaker":"Keith","time":"00:01:32-4","content":"Yes."},{"speaker":"Marcus","time":"00:01:33-1","content":"Can you tell me a little bit about her?"},{"speaker":"Keith","time":"00:01:38-1","content":"Well, she was a strong woman coming up. She raised 7 of us and it was hard and so when I got to be a teen, I had to go get a job. I used to work at fast food restaurants kept the job and my downfall was drugs, alcohol."},{"speaker":"Marcus","time":"00:02:02-8","content":"Sure, and we are going to get to that here in a bit. I understand that it's not easy to raise 7 kids in the Fisher Projects. But, is it accurate to say that, aside from some economic hardships, is it fair to say that you felt loved and cared for coming up or did you feel more neglected?"},{"speaker":"Keith","time":"00:02:26-5","content":"I felt neglected."},{"speaker":"Marcus","time":"00:02:29-3","content":"So, explain that a little bit to me please."},{"speaker":"Keith","time":"00:02:31-9","content":"Well, I felt like- I felt neglected because when I was small, my dad left. At the age of 13, he come back. Me and my sibling, me and my twin, we went out of town and lived in Detroit, MI with him for about a year and a half and we come back. My mom said we were gone too long, time to come on home."},{"speaker":"Marcus","time":"00:03:02-1","content":"Right, what was Detroit, MI like?"},{"speaker":"Keith","time":"00:03:03-8","content":"Oh man, it was beautiful. It was straight. Cold, nice. If I would have stayed up there, I wouldn't've got caught up in this institution."},{"speaker":"Marcus","time":"00:03:14-0","content":"Sure, I understand that. So you come back from Detroit. Did you have any difficulty with school?"},{"speaker":"Keith","time":"00:03:23-0","content":"No, I was yeah, I was a slow learner."},{"speaker":"Marcus","time":"00:03:26-1","content":"Okay, what about your brother?"},{"speaker":"Keith","time":"00:03:29-0","content":"Yeah, he was more smarter than me."},{"speaker":"Marcus","time":"00:03:32-4","content":"What's he doing now?"},{"speaker":"Keith","time":"00:03:33-4","content":"He's living in Arkridge he's doing good. He's a married man. He working at some lumber company. He loves it out there. He moved Arkrigde, when Katrina hit. And that's where he's staying."},{"speaker":"Marcus","time":"00:03:51-0","content":"Were you guys close? Are you close?"},{"speaker":"Keith","time":"00:03:53-8","content":"Yeah, I'm 11 minutes older than him."},{"speaker":"Marcus","time":"00:03:58-2","content":"I imagine that it's particularly difficult of all of your siblings, it must have particularly difficult for him to watch you go through all this because, I hear from twins sometimes that it's almost like a part of you."},{"speaker":"Keith","time":"00:04:11-6","content":"Well, it is because he came to the rodeo and he was messed when I caught the charge \"Why, why?\" Stuff that happened, I had no control of."},{"speaker":"Marcus","time":"00:04:27-1","content":"Yeah, can you tell me a little bit more about the impact of this particular incident on your family, on your siblings, on your mom and dad?"},{"speaker":"Keith","time":"00:04:38-2","content":"Well, it was like a drug connection. He saw me come like, initially on Algiers, if they come down, where I live at, it was like a drug connection they either want drugs or pills and I had a connection."},{"speaker":"Marcus","time":"00:04:59-4","content":"I see. And did you know this person?"},{"speaker":"Keith","time":"00:05:04-4","content":"Well, yeah, from elementary school. We stayed in the same neighborhood and when we got to like junior high, we used to like, every Friday, they have like keg parties, like little parties and we used to show up and we'd be all at the party. Well this guy, he was always straight with me, but one day he had pistol whipped my twin, pistol whipped him. And it was behind."},{"speaker":"Keith","time":"00:05:04-4","content":"When I heard about it, I was in high school, I was walking through the school and two guys walked by and they said \"Man, have you heard about Jack pistol whipped\" I forgot about him. I just left it alone because I used to tell my little, watch who you hang around with. When he came home and I look and I've seen again, I asked my \"what's wrong with your face? How you got it\" He said he fell but he lied to me. But that had nothing to do why I caught this charge. I caught this charge dealing with,"},{"speaker":"Marcus","time":"00:06:20-8","content":"Sure, let's go back to a few things before we get there. I appreciate you filling me in with all of that. So, you obviously were close to your twin brother. Who visits you up here?"},{"speaker":"Keith","time":"00:06:34-3","content":"Yeah, we were close. My mom and one of my friends that just got out. He's in a wheelchair, you know Edwin Johnson?"},{"speaker":"Marcus","time":"00:06:45-8","content":"I think I do. Is he in Orleans?"},{"speaker":"Keith","time":"00:06:47-3","content":"Yeah. He's in a red wheel chair."},{"speaker":"Marcus","time":"00:06:50-9","content":"He comes to the re-entry program?"},{"speaker":"Keith","time":"00:06:52-8","content":"Yeah, he part of that with Norris and them."},{"speaker":"Marcus","time":"00:06:56-7","content":"Okay, that's great and he still manages to come up to see you."},{"speaker":"Keith","time":"00:07:00-1","content":"Well, I got his phone number. We used to live on the same street. And when he was on the east yard with, he got out at disability because he fell."},{"speaker":"Marcus","time":"00:07:14-0","content":"He was paralyzed was what got him here right?"},{"speaker":"Keith","time":"00:07:17-4","content":"He got out, yeah, during 10 years and got out and then caught another charges and the police shot him up."},{"speaker":"Marcus","time":"00:07:24-6","content":"Alright, yeah, that's right. You had said that you grew up in the Fisher housing projects, then your dad came down, you spent some time in Detroit and then incidentally where you caught this charge was in Algiers. So tell me like you were in your 20s by then, so where were you living?"},{"speaker":"Keith","time":"00:07:52-2","content":"In my mom house."},{"speaker":"Marcus","time":"00:07:53-2","content":"Okay so she, the whole family moved to Algiers."},{"speaker":"Keith","time":"00:07:55-8","content":"The whole family moved into a 5 room bedroom house."},{"speaker":"Marcus","time":"00:07:59-5","content":"Okay, can you. I am somewhat familiar with Algiers, but not when it gets down to Chalmette Fairy that area so can you please paint a picture of your neighborhood for me so if I was standing in front of the door to your house when you're around this time, you're living with your mom around your early 20s so what's the neighborhood like? What's going on around? What am I seeing and hearing?"},{"speaker":"Keith","time":"00:08:23-9","content":"It's a lot of tractor. It's the same guy. It was like always, he'll come by during this time, he was selling little, quarter ounce of weed. He'll come by. He would want to swap weed for pills."},{"speaker":"Keith","time":"00:08:23-9","content":"So, one incident where I was in front of the house, he pulled up. He tell me he got a quarter ounce, he trying to get some pills. I'm sitting there front of the house. I agreed to do it for him. So when he gave me the package, I gave him the pills. He took the marijuana and dipped it in ammonia. Playing games so one of my buyers came by and said \"man, you want to roll up a joint?\""},{"speaker":"Keith","time":"00:08:23-9","content":"So he rolls a joint up and he tastes it and says \"something don't taste right about it.\" So I hit it. It was so bad where the ammonia- it was worse than PCP. No it was affecting my brain because at this time, my momma was pulling in the driveway. She had just got off from work, so she sees me sitting there, and she's getting out the car and I grabbed a pistol and I done like this here."},{"speaker":"Keith","time":"00:08:23-9","content":"And my mom said, \"Keith,\" because she knew I wasn't the type to just flip out like that. She said, \"Boy, give me that gun. What's wrong with you?\" And I said \"Ma. I'll take myself out.\" Messed my brain up. She ran inside, called the police. Police come by the house. They took. I had two rifles and I had a pistol. Took that. They was aware I was the victim and they told me to go across the river to the courthouse and press charges. You know, pull out like a peace bond where he got to stick around."},{"speaker":"Marcus","time":"00:10:29-9","content":"Okay, so can you tell me the prior to this, you have a history with this person."},{"speaker":"Keith","time":"00:10:35-2","content":"Yeah, growing up."},{"speaker":"Marcus","time":"00:10:36-3","content":"Yes, okay. And you kind of knew what he was up to."},{"speaker":"Keith","time":"00:10:39-7","content":"Well, he was always up to playing on the weed. Yeah, he used to use the mess over you."},{"speaker":"Marcus","time":"00:10:49-4","content":"Were you did you have run ins with the law prior to this particular charge?"},{"speaker":"Keith","time":"00:10:56-1","content":"My sister was, she had got a job at East Jefferson Hospital. And me and my twin decide, if my momma call, to bring her to work and when we got across the river from the West Bank, like where the Superdome at, we caught a flat tire. We went in some neighborhood to get a spare tire, so as we got the spare tire going back the car, some guy run out his house with a pistol and he's pointing it at my twin."},{"speaker":"Keith","time":"00:10:56-1","content":"So I'm looking at him. So I turn around to bring the tire back to him. So when I brought the tire back, he understood why we was doing what we were doing then he said \"man, I understand but usually I call the police.\" Here they come. So, that was our first time ever getting in trouble."},{"speaker":"Marcus","time":"00:11:54-2","content":"Okay, for what? Stealing a tire?"},{"speaker":"Keith","time":"00:11:56-7","content":"Yeah, theft."},{"speaker":"Marcus","time":"00:11:59-3","content":"Other than that, any other serious incidents with the law?"},{"speaker":"Keith","time":"00:12:03-2","content":"The deputies come in the neighborhood where I was like me and you hanging out the neighborhood, a busier area and a car pull up in front of me and they said \"you, come here.\" I'm not familiar with that car so I'm really don't even want to go and see what was going on there so when I walked up to the car, two more cars circled me."},{"speaker":"Keith","time":"00:12:03-2","content":"And they just throw me in the car. It's a levy road, the Mississippi, what I was telling you about. It's a levy road. When they brought me by the levy road, they had my twin in another car, the informant had put out a saying that we was armed and dangerous, had powder cocaine."},{"speaker":"Keith","time":"00:12:03-2","content":"So when they throw me in the car with my brother, I'm telling him, they don't have nothing. I said he went off while we was in the backseat handcuffed, he went off. He went to kicking me, spitting on me, the way I was living. And he was messed up. And I kept telling him \"Man, you have nothing on us.\" So they took us to the four district precinct and we went to central lock-up. We stayed in there about 5-6 months, and they just throwed it out."},{"speaker":"Marcus","time":"00:13:25-1","content":"Gosh. So your brother thought that you got him in trouble. And that's why he was so mad at you."},{"speaker":"Keith","time":"00:13:31-0","content":"Yeah, the way I was living. Well, I had the type of friends- I didn't have nobody for no weapon. They had- all my friends coming up was more white and really you didn't see one without a gun."},{"speaker":"Marcus","time":"00:13:48-5","content":"Yeah, it sounds like you guys are kind of going slightly different paths"},{"speaker":"Keith","time":"00:13:54-8","content":"Yeah, he's real mad."},{"speaker":"Marcus","time":"00:13:56-3","content":"I understand that. Your relationship with him is good though today?"},{"speaker":"Keith","time":"00:14:00-0","content":"Yeah, straight."},{"speaker":"Marcus","time":"00:14:02-5","content":"You mentioned that he and your sister still come to see you up at the radio."},{"speaker":"Keith","time":"00:14:06-3","content":"The whole family. One day, my mom gave the clarification that and he was walking around with the cameras, he asked my mom if she wanted an interview."},{"speaker":"Marcus","time":"00:14:18-2","content":"Is that Francis Abbot?"},{"speaker":"Keith","time":"00:14:20-4","content":"Yeah, no not Francis, the black dude, the little sharpie. And he asked my mom what do she like about the rodeo and she said she after 30 years, she loved coming here to see me."},{"speaker":"Marcus","time":"00:14:34-7","content":"Yeah, of course. It's the only way she can really see you out away from the visiting shed. Yeah, what's your favorite part of the rodeo?"},{"speaker":"Keith","time":"00:14:45-0","content":"Making money. I work in and Fender. I done paint everything but the car. I pull the carpet out, detail them, do the whole 9 yards and I learned a lot since I been in there. I been in there 3 years and I got into the hobby shop once I learned how to read a ruler, I build whatever you want. Whatever you want, I can build it, paint it."},{"speaker":"Marcus","time":"00:15:20-1","content":"What about fighting? Was there a lot of fighting in your- when you were coming up?"},{"speaker":"Keith","time":"00:15:26-4","content":"No, not really."},{"speaker":"Marcus","time":"00:15:28-3","content":"What about in school? Any fighting in school?"},{"speaker":"Keith","time":"00:15:30-7","content":"Every now and then."},{"speaker":"Marcus","time":"00:15:32-1","content":"Right. Did you graduate from high school? Did you finish?"},{"speaker":"Keith","time":"00:15:34-7","content":"No, I was a special Ed. I grew up I was real slow coming up. I never had a chance."},{"speaker":"Marcus","time":"00:15:43-1","content":"What was the highest grade that you finished?"},{"speaker":"Keith","time":"00:15:46-1","content":"11th."},{"speaker":"Marcus","time":"00:15:46-4","content":"Oh, okay, well, almost. Yeah and your twin, did he finish?"},{"speaker":"Keith","time":"00:15:51-0","content":"Yeah. Well, he got a GED."},{"speaker":"Marcus","time":"00:15:54-6","content":"Okay, what's your twin's name?"},{"speaker":"Keith","time":"00:15:56-8","content":"Kurt."},{"speaker":"Marcus","time":"00:16:00-6","content":"What about girlfriends. Tell me a little bit about girlfriends before you come up here."},{"speaker":"Keith","time":"00:16:05-0","content":"I had a few of them, wham bam thank you ma'am. It wasn't nothing serious. No kids."},{"speaker":"Marcus","time":"00:16:16-9","content":"Do you remember the last time that you were visited up here? When was the last visit you had up here in the visiting shed?"},{"speaker":"Keith","time":"00:16:28-5","content":"Well about 4 months ago, 3 months ago. Yeah, my mom and the guy I was telling you about, the ex-con that got out on disabled, he brought my mom up here, well, she's going to come up but she didn't want to drive."},{"speaker":"Marcus","time":"00:16:47-9","content":"How are those visits? Are they difficult for your mom?"},{"speaker":"Keith","time":"00:16:51-8","content":"Yeah, yeah, it's difficult for her but she be glad to see me. She knows when she come to the rodeo, you know, every time she asks me, \"You need money?\" I tell her no. She said how good I'm doing. I ain't going backwards and getting in trouble or fighting you know. She just wants to see me come home."},{"speaker":"Marcus","time":"00:17:18-7","content":"Yeah, does she believe that you are going to come home at some point?"},{"speaker":"Keith","time":"00:17:23-2","content":"Yeah, no doubt in my mind."},{"speaker":"Marcus","time":"00:17:25-0","content":"Okay, so, you had mentioned that you were using drugs, heroine, and alcohol. Can you explain a little bit more about now that you have all this time, I mean, 30 years you're looking back on this incident. To what extent was your life defined by the use of drugs and alcohol at the time? Was it a big part of your life?"},{"speaker":"Keith","time":"00:17:49-5","content":"Yeah, it was. I'm drug free now. I'm on- my last year, I had 2011, I had with marijuana. Cyprus 4."},{"speaker":"Marcus","time":"00:18:12-0","content":"So for the last 7 years, you've been clean."},{"speaker":"Keith","time":"00:18:14-7","content":"Drug free."},{"speaker":"Marcus","time":"00:18:15-6","content":"Sure, if you had to identify one, you know, sometimes there's many complicated things that get people into trouble, but if you had to identify one thing that got you into trouble, what would you say it was?"},{"speaker":"Keith","time":"00:18:30-1","content":"Guns."},{"speaker":"Marcus","time":"00:18:30-9","content":"Okay, firearms?"},{"speaker":"Keith","time":"00:18:33-8","content":"Firearms, drugs."},{"speaker":"Marcus","time":"00:18:37-1","content":"Okay. Is that more or less how you were supporting yourself at this time was through just hustling with drugs?"},{"speaker":"Keith","time":"00:18:42-5","content":"Yeah."},{"speaker":"Marcus","time":"00:18:46-3","content":"Let me ask you a question you know, I, you know, this is you can only be based on your imagination. If this hadn't happened. Let's say this particular incident with this guy didn't happen. You didn't get out of bed that morning. You didn't come by. How do you think the rest of your life would have gone?"},{"speaker":"Keith","time":"00:19:06-7","content":"I would have been straight. Because I kept a job. A job wasn't nothing. I kept working."},{"speaker":"Marcus","time":"00:19:14-7","content":"Where were you working at the time?"},{"speaker":"Keith","time":"00:19:17-5","content":"During that time, I had little side jobs cutting grass, one of my friend, his daddy used the houses. I would help. Narco refinery had a little job at Narco."},{"speaker":"Marcus","time":"00:19:33-9","content":"So you think you would have just kept more or less worked your way through, but you were saying you know, the reason I asked is because using drugs, you're kind of dealing drugs to support yourself. That's not a very safe lifestyle."},{"speaker":"Keith","time":"00:19:46-9","content":"Well, I was the type. I didn't like dealing- I was more like a user. I liked to party."},{"speaker":"Marcus","time":"00:19:56-2","content":"Okay and do you think you would have just gotten off of that and straightened your life out? Or do you think you might have gone down that path?"},{"speaker":"Keith","time":"00:20:03-1","content":"Well, at that time, I was trying to and I used to try to like get in contact with my daddy to you know, get him to talk to me, he walk away from me. Yeah, I was a mess at that time."},{"speaker":"Marcus","time":"00:20:18-0","content":"Sure, I understand that. Alright, I'm going to switch gears and start to talk a little bit about you coming here to Angola and some of the things you've been through since you've been here. I mean, 30 years is a life time. But, is there something else about you? I want to make sure I'm capturing Keith Byes before he came to Angola."},{"speaker":"Marcus","time":"00:20:18-0","content":"Is there something else I should have asked you about or I should know about you before you came here? Alright, I think we talked about. Alright, so let's go back. I want to talk about some of the things you've done here. You mentioned you're a good worker and got some skills."},{"speaker":"Keith","time":"00:20:58-3","content":"I was as a matter of fact, I do. I make locker boxes."},{"speaker":"Marcus","time":"00:20:58-3","content":"Okay sure, and I want to get to some of that, but after you were arrested, I imagine you spent a little bit of time in the parish?"},{"speaker":"Keith","time":"00:21:11-4","content":"Parish Prison."},{"speaker":"Marcus","time":"00:21:12-8","content":"How long were you there for?"},{"speaker":"Keith","time":"00:21:15-6","content":"Right after. They got a time limitation. 2 years they got to get you out of there. It got close to two years."},{"speaker":"Marcus","time":"00:21:21-9","content":"Okay, so you're now close to 24 years old when you come to Angola."},{"speaker":"Keith","time":"00:21:27-1","content":"No, I was 22."},{"speaker":"Marcus","time":"00:21:27-9","content":"22. Okay, alright. Okay- the reason I ask is that, the day that, I mean, you were 22 when you were arrested. Maybe I got that wrong."},{"speaker":"Keith","time":"00:21:41-2","content":"You got that wrong. I think I was 19 or 20. I think I was 19 or 18, something like that."},{"speaker":"Marcus","time":"00:21:48-8","content":"Okay, so you're 22 when you get here to Angola. 30 years ago, this was a very different place, so can you tell me about that bus ride coming here? What's on your mind?"},{"speaker":"Keith","time":"00:22:03-5","content":"Oh man, it was like scared, you'd be scared, but it was the type of this was the type of prison that if you mind your own business, and do what you got to do, you won't have no problems. That was it. But if you off into drugs, and chaos and mess, you going to get what's coming to you."},{"speaker":"Marcus","time":"00:22:25-2","content":"Sure. So did you find it fairly easy to stay out of trouble when you got here?"},{"speaker":"Keith","time":"00:22:30-5","content":"Yes, all you need to do it that will get you- whatever job you work at, just do what you got to do."},{"speaker":"Marcus","time":"00:22:35-3","content":"Okay, alright. Yeah, they put you in the working cell block when you first get here is that right?"},{"speaker":"Marcus","time":"00:22:35-3","content":""},{"speaker":"Keith","time":"00:22:42-2","content":"Well he had a church where my record from the parish, I was straight. I had one fight. So he got the choice to either put you in general population or put you in the blocks. He put me in population. I went across the street at the Camp A. Camp A population."},{"speaker":"Marcus","time":"00:23:01-7","content":"Okay, what was your first job here? The field?"},{"speaker":"Keith","time":"00:23:04-8","content":"Yeah. Picking cotton. Vegetables. It was a part of the one time. When you go out the gates, you know you got a job to do. You got to do your job, keep from getting locked up."},{"speaker":"Marcus","time":"00:23:20-6","content":"Right, sure, 30 years have passed. How different are you today from that young man that was brought here?"},{"speaker":"Keith","time":"00:23:37-3","content":"Well, I'm grown up now because I'm 54 years old. I was young and at that time, it was a fresh life sentence. You know, I had to, I locked it in my mind when I got here that I wasn't going to get caught up in the system, extended lockdown, blocks, you know I wasn't about going you know putting my mom through that."},{"speaker":"Marcus","time":"00:24:06-3","content":"Sure, you want to make sure when she comes to visit you, you can visit with her, right?"},{"speaker":"Keith","time":"00:24:13-0","content":"Right. She won't be worried?"},{"speaker":"Marcus","time":"00:24:16-0","content":"Sure, if you, you know, it sounds like you straighten yourself out real quick and just did you know, put your head down and did what you had to do, okay, and so you didn't- you managed to stay away from any kind of write up, things like that when you first arrived?"},{"speaker":"Keith","time":"00:24:33-4","content":"No write-ups."},{"speaker":"Marcus","time":"00:24:33-9","content":"Wow, okay. If you could give that person some advice. If you could go back in time and give that person some advice based on the wisdom that you have now, is there anything that you would have told them to differently?"},{"speaker":"Keith","time":"00:24:51-4","content":"If I had to, got class, finish school."},{"speaker":"Marcus","time":"00:24:53-9","content":"Okay, yeah, alright, I get it. So, can you describe what your typical day is like now? Today I interrupted your day with this project."},{"speaker":"Keith","time":"00:25:05-2","content":"Before I come over here, at 6 o'clock, I go to Body and Fender, I go to work. I get ready for, they got a Chevy just got painted. I would put the bed. You know, we take the bed off, we paint the frame of the truck, I would put the bed back on it. I buff the truck out, today I was going to put the bed back on, wash it, get it ready to leave because I'm going to go."},{"speaker":"Marcus","time":"00:25:36-7","content":"Okay so do you work with some of the re-entry guys?"},{"speaker":"Keith","time":"00:25:39-4","content":"Yeah, we got a bunch of them."},{"speaker":"Marcus","time":"00:25:41-2","content":"Yeah, who runs the Body Fender shop?"},{"speaker":"Keith","time":"00:25:45-0","content":"Well, they got two guys. For the reentry, they got Jared Lanclow. Yeah."},{"speaker":"Marcus","time":"00:25:50-3","content":"I know him. Okay, and so you kind of work with him and the other reentry guys on whatever needs to be done."},{"speaker":"Keith","time":"00:25:57-5","content":"Yeah, but see, they got their own projects just like me and Edwards. We got our own project or we do like we do stuff like for your friends."},{"speaker":"Marcus","time":"00:26:07-7","content":"I got it. Okay. So are there some other organizations that you've been a part of here at Angola? Did you get your GED since you've come here?"},{"speaker":"Keith","time":"00:26:15-6","content":"No."},{"speaker":"Marcus","time":"00:26:16-4","content":"What about any other rehabilitation programs?"},{"speaker":"Keith","time":"00:26:18-3","content":"I got 100 hours. I'm trying to get anger management."},{"speaker":"Marcus","time":"00:26:29-3","content":"So, is that like a 9-5- actually, sorry, like a 6 to how long is that?"},{"speaker":"Keith","time":"00:26:33-4","content":"I go from 6 to after the 4 o'clock count but they do a count. Every evening, I go to the dorm. I could get a 24 hour stick out if you have a project like that I'm working on for you, that's going to leave tomorrow, I can stay all night. Class A."},{"speaker":"Marcus","time":"00:26:33-4","content":"Sure, so if you were released, you have a whole bunch of skills. You could go work in the body shop, you said you'd do some metal fabrication…"},{"speaker":"Keith","time":"00:27:04-5","content":"Yeah, I used to cut sheet metal and when I was telling you about Edwin, he got me lined up with a job 1- I'm already ready to get a job as soon as I get out of here."},{"speaker":"Marcus","time":"00:27:18-9","content":"So, 100, Anger Management, are you involved in any other organizations here?"},{"speaker":"Keith","time":"00:27:24-8","content":"Nope."},{"speaker":"Marcus","time":"00:27:24-9","content":"Okay, so this is a couple hard questions, okay, so when you look back after so many years, 32 years you've been punished for this, what are your feelings about what happened and the victim and the victim's family? Do you think about those things?"},{"speaker":"Keith","time":"00:27:50-5","content":"Yeah, I feel remorseful for the victim, his mom and his dad. And it's something that happened that wasn't supposed to happen."},{"speaker":"Marcus","time":"00:28:02-3","content":"Sure."},{"speaker":"Keith","time":"00:28:02-9","content":"We come up together."},{"speaker":"Marcus","time":"00:28:04-6","content":"Right. I asked you a little bit about the impact on your family. When something like this happens, it's 2 families at least that get affected by it. Your mom lost a son in some ways. She visits you but that's not the same thing. What happened to the rest of your family when this happened? Did it kind of create problems for everybody?"},{"speaker":"Keith","time":"00:28:31-6","content":"No, because everybody was still. One rodeo the whole family was out there and I was walking around the rodeo and when I left the streets, my third to the oldest brother had got married, he had a family, he had three daughters. So I'm walking around the rodeo and little girl \"Hey mister, what they call you?\" My nickname on the street was \"pee-wee.\" My twin nickname was \"Big face\" So I told her \"I'm pee-wee\" and she tell her that was my niece."},{"speaker":"Marcus","time":"00:29:12-1","content":"Wow. That was the first time you met your niece?"},{"speaker":"Keith","time":"00:29:17-4","content":"Well when I got locked up, they was born. But now they done grown up and they doing good out there."},{"speaker":"Marcus","time":"00:29:24-6","content":"Yeah, I imagine it's kind of hard watching them grow up from in here. So, if you go before a parole board, my understanding is that you will go before a pardon board. What do you want them to know about you?"},{"speaker":"Keith","time":"00:29:50-4","content":"I'm a changed man. Angola- this is where I grew up at and I felt like- the incident wasn't supposed to happen. I feel like I deserve a second chance."},{"speaker":"Marcus","time":"00:30:08-4","content":"At different points in your life, there are different things challenging here at Angola. First, when people come in. A guy was telling me that it's all about self-preservation, you know, protect the self and then over time, you know, things kind of get into a rhythm and now Angola is a much safer place than it was."},{"speaker":"Marcus","time":"00:30:08-4","content":"Right, so can you tell me a little bit about, to this day, what's the worst part for you about being here? You've been here so long but what is the thing that still bothers you here? It may seem like a crazy question because you're in prison. But I mean, is there something that stands out as being particularly difficult?"},{"speaker":"Keith","time":"00:30:55-0","content":"There were days where I got to be locked in a dorm and can't go to work."},{"speaker":"Marcus","time":"00:31:05-1","content":"Okay and why would you be locked in a dorm?"},{"speaker":"Keith","time":"00:31:11-1","content":"They got the power go out, lock everybody in."},{"speaker":"Marcus","time":"00:31:14-5","content":"Okay, so you don't like being in the dorms?"},{"speaker":"Keith","time":"00:31:16-9","content":"No. They got a bunch of- one dorm that they be miserable in them dorm."},{"speaker":"Marcus","time":"00:31:24-3","content":"Okay I understand. Just being locked up with a bunch of other guys. And this also may seem like a strange question but is there anything good about Angola? What the- if you had to identify- what's the best part about Angola?"},{"speaker":"Keith","time":"00:31:43-1","content":"Getting learning different stuff, getting all kinds of trades. You got opportunity of variety. Whatever you want to learn. You can get, you can get hands on or you can do both. Just like the re-entry program. I think that's a good program for the youngsters."},{"speaker":"Marcus","time":"00:32:02-6","content":"Yeah, sure, okay so this is the hardest question that I think I asked any of the guys actually because it's hard because you kind of have to think about the possibility of not leaving here. A life sentence without parole in Louisiana means you're sentenced to die in prison and we've talked a little bit about this before the interview. There must be some part of you as you watch these guys get older that thinks that maybe you won't get out. Do you think that sometimes?"},{"speaker":"Keith","time":"00:32:39-6","content":"No. I try not to."},{"speaker":"Marcus","time":"00:32:43-5","content":"What do you think of that possibility that this might be the end for you? Because for me, it's very difficult, I can't even imagine trying to wrap my head around life without parole. And yet people cope with it somehow. You know, I mean some people cope with it by denying it or just distracting themselves from it so how do you cope with it?"},{"speaker":"Keith","time":"00:33:08-9","content":"I just try not to, just I try to think that Ima get out of here."},{"speaker":"Marcus","time":"00:33:19-2","content":"You must have spent some time imagining what your life would be like if you are on clemency and you get another chance and you go out. You go home, can you tell me what you imagine yourself doing?"},{"speaker":"Keith","time":"00:33:34-3","content":"Just enjoying my family and trying to stay busy, think positive. I ain't coming back here."},{"speaker":"Marcus","time":"00:33:41-8","content":"Sure, and do you see yourself working in the automotive industry?"},{"speaker":"Keith","time":"00:33:46-8","content":"Maybe. I got a variety of skills."},{"speaker":"Marcus","time":"00:33:53-9","content":"So, is there something else that I should have asked you about your experiences here at Angola? I guess is there something you want the legislature to know or people on the outside to know about the reality of what it is to serve a life sentence without parole here in Louisiana?"},{"speaker":"Keith","time":"00:34:13-2","content":"The reality of serving a life sentence at Angola? Keep your head up and doing the right thing."},{"speaker":"Marcus","time":"00:34:25-7","content":"Yeah, that's the way you've approached this whole thing."},{"speaker":"Keith","time":"00:34:28-7","content":"Yeah, and never getting caught up in the system."},{"speaker":"Marcus","time":"00:34:28-7","content":"Anything else we should know about you sir?"},{"speaker":"Keith","time":"00:34:34-9","content":""},{"speaker":"Marcus","time":"00:34:37-9","content":"Okay, alright, well I am very grateful to you for your time this morning and thank you for doing an interview with me."},{"speaker":"Keith","time":"00:34:44-9","content":"You're welcome."}]}