{"name":"","transcript":[{"content":"Kendrick Fisher REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Mr. Fisher thank you very much for agreeing to sit with us today. I would like you to start if you don't mind, by stating your name, the crime of conviction, your age at the time and how much time you've served."},{"speaker":"Kendrick","time":"00:00:13-2","content":"My name is Kendrick Fisher, the crime I was convicted of was 2nd degree murder, I was 18 at the time and I'm serving a life sentence."},{"speaker":"Marcus","time":"00:00:23-0","content":"How much time have you served?"},{"speaker":"Kendrick","time":"00:00:24-5","content":"24 and ½ years."},{"speaker":"Marcus","time":"00:00:28-2","content":"Okay, so as I said, I'd like to learn more about you and seems to make sense to start with your childhood. So I'll ask you a few questions about your time before this happened, the first 18 years of your life, then we'll move on to Angola. Okay, can you just start by telling me a little bit about the folks who raised you?"},{"speaker":"Kendrick","time":"00:00:49-1","content":"Well I was raised by my grandmother. My parents were, I was born in Houston, my grandmother stayed in Galveston. I don't want to say my mother or my father couldn't raise me. But it was chosen by my grandmother for me to be raised by her. I was raised in a single parent home. I had an uncle that was in and out of the penitentiary."},{"speaker":"Kendrick","time":"00:00:49-1","content":"My grandmother was an alcoholic at the time, she smoked a lot of cigarettes. But she did the best she could to raise me. You know it was good. My parents came in and out. My mother and father for some reason, they didn't get along. So my mother would come during certain times, and my father would pop up certain times. So it was back and forth between them. Other than that, we was in a good neighborhood, like middle class."},{"speaker":"Marcus","time":"00:00:49-1","content":"What about siblings? Do you have brothers and sister?"},{"speaker":"Kendrick","time":"00:01:42-5","content":"I have a sister by my father, but I didn't meet her until I was like 13."},{"speaker":"Marcus","time":"00:01:48-0","content":"So you were an only child in your grandmother's house?"},{"speaker":"Kendrick","time":"00:01:51-5","content":"Right."},{"speaker":"Marcus","time":"00:01:53-7","content":"Tell me a little bit more about your grandmother. You said she drank a bit?"},{"speaker":"Kendrick","time":"00:02:00-6","content":"A real country girl. Was raised in Caldwell, Texas. Got a chance, moved to Galveston. She was a good woman, but she was out there. She had an interesting life until she settled down."},{"speaker":"Marcus","time":"00:02:19-9","content":"All right. Is she still alive?"},{"speaker":"Kendrick","time":"00:02:23-8","content":"No she isn't."},{"speaker":"Marcus","time":"00:02:28-0","content":"Do you remember your last interaction with her?"},{"speaker":"Kendrick","time":"00:02:33-4","content":"It was 2011, she came to visit me."},{"speaker":"Marcus","time":"00:02:35-6","content":"Okay, wow. Tell me about that visit."},{"speaker":"Kendrick","time":"00:02:38-1","content":"It was a good visit. When I first got incarcerated. I didn't allow my family to come up here for like the first 7 years. So you know I was really dealing with this. Medea was all I had. I really didn't consider nobody else. It was just always me and her, because through our difficulties and our good days, it was still always me and her."},{"speaker":"Kendrick","time":"00:02:38-1","content":"When we had things available for us and when we didn't have things available."},{"speaker":"Kendrick","time":"00:02:38-1","content":"It was just us. So our time together was always unique, it was always cherished. It was always taken advantage of because, this the only time I have with her."},{"speaker":"Kendrick","time":"00:02:38-1","content":"My mother, I really never really counted on her too much. Because I looked at, if anything happened to Medea, I probably wouldn't see her again no way. So every chance I got with my grandmother."},{"speaker":"Marcus","time":"00:03:32-0","content":"Tell me about your visit with her."},{"speaker":"Kendrick","time":"00:03:34-4","content":"The visit. Just a normal visit. We had a thing, she asked, \"Are you okay?\" \"If you're okay, I'm okay.\" And we'd go back and forth with that. We talked about the legal issues, we talked about what I was doing at the time. We just loved on each other. A typical visit."},{"speaker":"Marcus","time":"00:03:57-3","content":"Yeah that's great. It's nice that you have that as your last memory. When did she pass away?"},{"speaker":"Kendrick","time":"00:04:03-8","content":"She passed away in 2013. She passed away, I called and my cousin was an in-house nurse. I called, she's like Medea's asleep right now. We always had the thing, it didn't matter if I called, she'd wake up or whatever. But for some reason she wouldn't wake up this time. 2 days later they called, and said I had a death in the family, call home. So I already knew what it was and that was my last experience,"},{"speaker":"Marcus","time":"00:04:34-2","content":"You called her Medea?"},{"speaker":"Kendrick","time":"00:04:36-9","content":"Yeah Medea, everybody called her Medea."},{"speaker":"Marcus","time":"00:04:40-8","content":"Do you have other people who visit you here?"},{"speaker":"Kendrick","time":"00:04:41-2","content":"Yeah, I have friends. Friends I met while I was in Louisiana. Female associates. Friends that I have met, their families check in on me. People that have accepted me as part of their family now from getting to know them throughout the years, seeing me, and knowing my situation."},{"speaker":"Marcus","time":"00:05:06-5","content":"Sure. How old were you when you moved to Louisiana?"},{"speaker":"Kendrick","time":"00:05:07-5","content":"18."},{"speaker":"Marcus","time":"00:05:11-7","content":"Okay alright. So for the most part, your relationship with your grandmother coming up was clearly something special. Would it be accurate to say that while your parents were not present in your life you grew up knowing that you were cared for and loved?"},{"speaker":"Kendrick","time":"00:05:30-3","content":"Right."},{"speaker":"Marcus","time":"00:05:30-9","content":"So abuse was not part of your experience?"},{"speaker":"Kendrick","time":"00:05:33-5","content":"No."},{"speaker":"Marcus","time":"00:05:36-1","content":"Alright. What about school?"},{"speaker":"Kendrick","time":"00:05:38-9","content":"School, it was good it was good. I had a fortunate time. I think I went through school because my grandmother felt like it was the thing for me to do. Like I said, in the house, we had a good environment. But outside the house, that's where a lot of differences occurred. Because my focal point became the streets, society."},{"speaker":"Kendrick","time":"00:05:38-9","content":"The neighborhood that I was venturing off into because of my friends and me running into guys that knew my uncle or my cousins. Even though we wasn't raised in the ghetto, well I wasn't raised in the ghetto. It was like, everything that I came in contact with came from the ghetto, so I was attracted to the ghetto. So I kept going back when, we never stayed there. But it was like I was drawn to it."},{"speaker":"Kendrick","time":"00:05:38-9","content":"Because my grandmother, like I said, we was living on a fixed income, she tried her best. She gave me what she had. In her feeling like I'm giving him my last, I'm doing what I can, that should be highly appreciated. Which it was, but at that time, me dealing with the dudes that I was hanging with, and trying to keep up with my peer group at the time. It wasn't enough. So I kept venturing off and doing things I wasn't supposed to."},{"speaker":"Marcus","time":"00:07:18-8","content":"Okay. Like what?"},{"speaker":"Kendrick","time":"00:07:21-6","content":"Selling drugs, stealing, you know. Just doing things that the particular groups that I was hanging with. Whatever they got involved in, I got involved in."},{"speaker":"Marcus","time":"00:07:34-3","content":"Sure. This is in Galveston?"},{"speaker":"Kendrick","time":"00:07:36-8","content":"Right. I didn't move back to Houston until, well I moved to Dallas, and then from Dallas I moved to Houston, then I moved back to Galveston."},{"speaker":"Marcus","time":"00:07:46-3","content":"Who were you living with in Dallas and Houston?"},{"speaker":"Kendrick","time":"00:07:49-3","content":"In Dallas I stayed with my father, 6 months. That's when I was in the 10th grade. And it didn't work out. I was acting out in school and I was away from my grandmother, it was too far. I was homesick, I didn't like the crowd of people I was hanging out with."},{"speaker":"Kendrick","time":"00:07:49-3","content":"I was used to the people I had already established an understanding with. I guess, trying to bond with him. But being grown up so many years without him, it was like, I don't know whether to call you dad or Ken. Because I called my parents by they first name."},{"speaker":"Marcus","time":"00:08:33-1","content":"Perhaps Too late to catch up."},{"speaker":"Kendrick","time":"00:08:37-1","content":"Right. Because I had been through so much at a young age."},{"speaker":"Marcus","time":"00:08:42-9","content":"Sure. So you said you started getting into things you shouldn't have been doing. Did you end up with any arrests or brushes with the law?"},{"speaker":"Kendrick","time":"00:08:52-0","content":"No. Well I got pulled over, searched a lot of times. I didn't get arrested till I was like 17. And that was on the curfew. That was in Galveston."},{"speaker":"Marcus","time":"00:09:05-5","content":"Okay. So tell me about coming to New Orleans."},{"speaker":"Kendrick","time":"00:09:13-2","content":"Well I went to New Orleans for a Bayou Classic Mardi Gras and that was it. I caught this charge in Baton Rouge."},{"speaker":"Marcus","time":"00:09:21-6","content":"Okay, so tell me a little bit about that."},{"speaker":"Kendrick","time":"00:09:24-4","content":"Well my first encounter with Baton Rouge was when I was graduating out of high school. We had a class and they told us to write letters to different colleges to see where you would get accepted. And Southern was one of the colleges that accepted me. And I just went on with the flow. I filled out a pell grant, filled out all the application, and when they accepted me I ended up going. And that's how I started going to Baton Rouge."},{"speaker":"Marcus","time":"00:09:56-2","content":"Sure. So that was you first year of college?"},{"speaker":"Kendrick","time":"00:09:58-8","content":"Yeah, first semester freshman."},{"speaker":"Marcus","time":"00:10:01-1","content":"First semester. And you're living in the dorms?"},{"speaker":"Kendrick","time":"00:10:03-2","content":"Right in Jones Hall."},{"speaker":"Marcus","time":"00:10:07-0","content":"Did you feel the need to carry a firearm?"},{"speaker":"Kendrick","time":"00:10:09-8","content":"Yes. And that was because of my previous lifestyle. Because of the things that I was involved in and the lifestyle I was living. I was irrational, I wasn't processing things right. I felt like I was part of the streets. And me going to school was just something to do. I didn't have no majors, I wasn't focused on nothing. I was still trying to impress people. I was still wanting to be accepted by certain peer groups."},{"speaker":"Marcus","time":"00:10:42-3","content":"Sure. Did you have any part time jobs?"},{"speaker":"Kendrick","time":"00:10:44-3","content":"Yes. But they didn't last long."},{"speaker":"Marcus","time":"00:10:49-1","content":"So did you find yourself also doing things you shouldn't have been doing to support yourself your first year of college?"},{"speaker":"Kendrick","time":"00:10:55-3","content":"Right. And it didn't last that long because I came to Southern of January, in February I caught this charge."},{"speaker":"Marcus","time":"00:11:02-6","content":"Okay, tell me a little about that. What happened?"},{"speaker":"Kendrick","time":"00:11:07-4","content":"With the charge or going to school? Well one night me and a few guys were talking and we decided to go hang out and we went downstairs and we was talking with a group of other guys. I heard somebody say don't shoot him, don't kill him just shoot him in the leg. And I'm focused, like I got paranoid I'm trying to figure out what's going on."},{"speaker":"Kendrick","time":"00:11:07-4","content":"Before I know it, a guy come running from around the corner, that's when I pulled the gun and I shot. I didn't know the guy, never seen the guy before. Probably 1 or 2 times before that, we never had no communication with each other. I took out running after that. Everything happened so fast."},{"speaker":"Marcus","time":"00:11:57-8","content":"Sure, okay. Alright, so, you get arrested, and the rest of your life kind of goes in a totally different direction."},{"speaker":"Kendrick","time":"00:12:08-0","content":"Totally different direction."},{"speaker":"Marcus","time":"00:12:10-0","content":"I imagine you spent some time in parish going through the trial. How long did it take from arrest to coming to Angola?"},{"speaker":"Kendrick","time":"00:12:17-6","content":"Probably a year, right under a year."},{"speaker":"Marcus","time":"00:12:31-1","content":"Okay, all right. One thing I didn't ask you, did you have any close girlfriends before?"},{"speaker":"Kendrick","time":"00:12:43-3","content":"Before, yes I did. But I lost contact with a lot of people in Texas."},{"speaker":"Marcus","time":"00:12:49-4","content":"I also wanted to ask you if you had any children."},{"speaker":"Kendrick","time":"00:12:52-5","content":"No, children."},{"speaker":"Marcus","time":"00:12:55-9","content":"So, can you. Do you remember that bus ride from Baton Rouge to here?"},{"speaker":"Kendrick","time":"00:13:02-4","content":"From Hunt's?"},{"speaker":"Marcus","time":"00:13:04-7","content":"From Hunts?"},{"speaker":"Kendrick","time":"00:13:06-1","content":"I was in Hunts. Yeah I remember."},{"speaker":"Marcus","time":"00:13:10-2","content":"What's going through your mind?"},{"speaker":"Kendrick","time":"00:13:13-6","content":"Well the night before, when you getting ready to leave, they come lay jeans in front of your cell. So I was nervous because I didn't know what to expect. All I was hearing was different stories about this happened, this going on, and you might have to do this."},{"speaker":"Kendrick","time":"00:13:13-6","content":""},{"speaker":"Kendrick","time":"00:13:13-6","content":"So basically I was just preparing myself for the environment. I wanted to make sure I came in healthy, I always had hope. If I came in healthy then I'm going to leave healthy. And whatever, by any means necessary. I'm going to do what I have to do. And that was my mind state."},{"speaker":"Marcus","time":"00:13:47-8","content":"So what were the first few months like here for you?"},{"speaker":"Kendrick","time":"00:13:52-5","content":"The first few months was, it wasn't what I expected. Because I had over prepared and when I finally got adjusted here, I still was acting out because I still had that chip on my shoulder. Now, I realized I didn't have to do none of the things I did back then."},{"speaker":"Marcus","time":"00:14:14-6","content":"Like what?"},{"speaker":"Kendrick","time":"00:14:16-8","content":"Like I felt like I had to voice my opinion a lot. I felt like when certain people asked me different things I automatically took it as you were playing on my intelligence, so I acted out based on what I felt like you might be trying to do, your hidden motive. All the while there wasn't never a hidden motive, it was just me fighting with myself, you know."},{"speaker":"Marcus","time":"00:14:41-9","content":"Did you find yourself getting in to a few fights?"},{"speaker":"Kendrick","time":"00:14:44-5","content":"Yes. I had a fight within the first 3 months I was up here I had one fight with a guy in the cell and a majority of my other writeups were like work offenses, really trying to adjust. Because I never had used the tools that they had us using."},{"speaker":"Kendrick","time":"00:14:44-5","content":""},{"speaker":"Kendrick","time":"00:14:44-5","content":"And then walking so far to the worksite, it was like man I'm not going to make it. Because once we get out there and then try to keep up with the pace of the line, I'm like I got to go. I don't even know the name of this tool and man these dudes like they've been working 20 years with that tool, I can't keep up with them. And that's a majority of a lot of my write ups were work offenses."},{"speaker":"Marcus","time":"00:15:35-0","content":"Okay. Were drugs and alcohol part of your own life, in terms of consuming?"},{"speaker":"Kendrick","time":"00:15:43-7","content":"I tried, but no, it wasn't a factor."},{"speaker":"Marcus","time":"00:15:47-9","content":"Okay, and here at Angola neither. Let me ask you this, you're enrolled in college, if this incident didn't happen, how do you anticipate the rest of your life would've gone? I mean you must've thought about the what if, a lot."},{"speaker":"Kendrick","time":"00:16:12-1","content":"Well know, it could've gone 2 ways. Either me catching another charge, or me getting killed. Because I still was, you know, I still was involved with things that I should've have been participating in and college, it should've been my first priority and it wasn't. You know, I was just at Southern, I was just going through the motions, I didn't understand, when I graduated my next step was college. But I wasn't prepared for what college was preparing me for."},{"speaker":"Marcus","time":"00:16:47-6","content":"Sure. So one of the reasons that we wanted to talk with you is that, you know, you're another example of a person who came here very, very young, a kid, and you've spent 24 and ½ years here, you have turned your life around."},{"speaker":"Marcus","time":"00:16:47-6","content":"None of us are the same as we were after 21 years. So, how are you different from that young man who came in through the Angola gates there, 24 years ago?"},{"speaker":"Kendrick","time":"00:17:28-7","content":"Well, instead of, like I said earlier, instead of me believing in people playing on my intelligence, I appreciate the help that they was offering, that's what I do now. I realized that eventually, the dreams that I had, I wanted to be successful, I wanted to be a graphic artist, I wanted to travel, I wanted to start a family. I had to reestablish me as an individual because the path that I was going down, I wasn't going to make it. I was either going to be here the rest of my life or get out and get killed."},{"speaker":"Kendrick","time":"00:17:28-7","content":"So I had to evaluate myself to see, what did I really want. And from that point, I started taking a self-help development class. I re-established myself in school because I started all over again. I went to college; but when I came here I told people that my last grade completed was a first semester freshman. But I enrolled back in the GED program and I started all over again. Because I felt like I had to. Because in society, I was in special Ed in society too."},{"speaker":"Kendrick","time":"00:17:28-7","content":"When I was in school. So I had a lot of help. But I didn't appreciate the help that people were offering me when I was in society. It went in one ear and out the other ear. Because I did what I wanted to do because I felt like I was being responsible as a man. When I was really being irrational. So when I came here and when I decided I had to change. I started from the beginning and worked my way all the way up."},{"speaker":"Marcus","time":"00:19:06-6","content":"So when did that start?"},{"speaker":"Kendrick","time":"00:19:08-8","content":"I entered GED in I want to say '96. But when I graduated, at that time I couldn't take none of the trays on the compound because they wasn't offering it to lifers. So I had a gap all the way from '97 all the way to 2002. And that's when I got enrolled in the Bible College."},{"speaker":"Marcus","time":"00:19:36-1","content":"Okay. Did you end up finishing that?"},{"speaker":"Kendrick","time":"00:19:39-7","content":"Right. I ended up getting bachelor's degree in Bible College. After I graduated from the seminary. I got my graphic arts. And after I graduated from graphic arts, I started using my life as an example. I started tutoring, I started mentoring. I started getting more involved in different programs, to show that it became a recovery process. To show that even though I did do some things I had no business doing, I still can change."},{"speaker":"Kendrick","time":"00:19:39-7","content":"So I dedicated my life to change, as much as possible."},{"speaker":"Marcus","time":"00:20:20-8","content":"Did you design the shirt you're wearing?"},{"speaker":"Kendrick","time":"00:20:22-8","content":"Yeah this my logo in graphic arts."},{"speaker":"Marcus","time":"00:20:25-0","content":"I like it."},{"speaker":"Kendrick","time":"00:20:26-7","content":"Kendrick Fisher."},{"speaker":"Marcus","time":"00:20:30-0","content":"It's good I like it a lot. Tell me a little bit more about some of those activities. So you've been tutoring and mentoring. What other clubs or organizations or other activities are you involved in?"},{"speaker":"Kendrick","time":"00:20:43-7","content":"Angola Special Civics project. That's basically dealing with laws, dealing with the political aspect of understanding bills, the government, the legislature. The process you would have to go through in helping change a law and helping file in court. I was involved in sober group."},{"speaker":"Kendrick","time":"00:20:43-7","content":"I was involved in substance abuse. I was involved in the re-entry program. I was involved in concept. And basically all these clubs are just clubs that give back to the community here by facilitating class self-help development class."},{"speaker":"Marcus","time":"00:21:30-5","content":"So what's your typical day look like now? You're a trustee over in camp F."},{"speaker":"Kendrick","time":"00:21:36-7","content":"Well now I'm in carpenter school. So my typical day is every Monday through Friday I go to school. I come back from school, I go in the hobby shop, because that's where I support myself, financially support myself."},{"speaker":"Kendrick","time":"00:21:36-7","content":"I go in the hobby shop and I talk to different guys about my situation and I try to show them, I try to encourage them through my situation of what you can do. Because a lot of guys at camp F, they been here longer than me, but they haven't took the necessary classes that they going to have to take. They haven't even tried to establish an education development process for themselves."},{"speaker":"Kendrick","time":"00:21:36-7","content":"So I try to encourage them through doing the things that I'm doing and showing them the end result. I have a hearing. You've been here 30 years and you don't even have a hearing, you don't even have a GED, you don't have any pre-release you don't have any of the self-help development class that are required. Here it is, you have the opportunity to take advantage of all this, but you didn't."},{"speaker":"Marcus","time":"00:22:39-1","content":"Why do you think that is? Why do some people not take advantage of that?"},{"speaker":"Kendrick","time":"00:22:41-0","content":"I think sometimes dealing with the current situation we lose hope. You lose family members that means you don't have no support, you don't have nobody to comfort you, the court system is denying all your writs. So it's like you just give up and you make the penitentiary your home."},{"speaker":"Kendrick","time":"00:22:41-0","content":"So it don't matter. And to me that's bad. Because I always felt like, well when I started changing I felt like for the system to have this many programs, something eventually is going to happen. And it don't make no sense to wait till later when it happens, when I could be prepared right before it happens."},{"speaker":"Marcus","time":"00:23:37-1","content":"Sure. One of the things that we're exploring here is how people grapple with the reality of life without parole. And I think, you know, I guess what we're talking about is coping mechanisms. When you contemplate the possibility that you may spend the rest of your life here, even while you're maintaining some hope that that won't be the case, how do you cope with that?"},{"speaker":"Kendrick","time":"00:24:11-7","content":"I cope, I try to always think, them were words that man created, you know. I believe that it's always a chance or opportunity that's going to develop itself. Because again I feel like this prison system has too many programs offered for you not to take advantage of, in means of an expectation of release."},{"speaker":"Kendrick","time":"00:24:11-7","content":"I feel like if you meant life without parole, I mean life with no possibility of parole, probation or nothing, you wouldn't offer us these programs. And that encouraged me when I started facing reality. I felt like I had 2 paths, I could be a traffic driver for the rest of my life, get old, end up on the hospice ward and die and go to point lookout where the white crosses at. Or I can do something about it."},{"speaker":"Kendrick","time":"00:24:11-7","content":"I chose to do something about it. And that's what I held onto. Because there's nothing else here for you, it's just a system that's going to keep going in circles. Once you obtain everything it's like the only thing you can do is try to help your fellow prisoner."},{"speaker":"Marcus","time":"00:25:34-7","content":"Sure. So I'm sure you're well aware of the changes in the law with respect to juvenile's offenders. Since Montgomery you have hundreds of people who now have a shot at parole after 25 years. You're left with also, while you're seeing that positive development for those folks. You're also confronted with the fact that you were 18."},{"speaker":"Kendrick","time":"00:26:08-9","content":"Yeah I missed it."},{"speaker":"Marcus","time":"00:26:10-3","content":"You missed it."},{"speaker":"Kendrick","time":"00:26:13-2","content":"I'm still trying to, I believe this here, the opportunity came about for the juveniles, then the opportunity came about for the 20 years lifers and the 40 year lifers. So that's 3 situations that occurred and I'm still stuck in the middle. And again, to me that showed development based on, its still going to be an opportunity."},{"speaker":"Kendrick","time":"00:26:13-2","content":"And I'm glad that I took the initiative to prepare myself for that thing, because eventually it has to come. Like with the program that have created, you're giving an eye opener to people with our life story, showing them that man you know, at 17, 18, 19, 20, 21, and so forth. The brains state of development, you know a lot of us made difficult choices at ages that we shouldn't have had no business thinking like that."},{"speaker":"Kendrick","time":"00:26:13-2","content":"And it had an impact on our lives that led us down the wrong road and these the consequences of that wrong road, we never had an opportunity to re-establish ourselves, to face our challenges productively because we didn't know no better. And then we had become mature in an abnormal environment. So it was like I had to raise myself in the penitentiary."},{"speaker":"Marcus","time":"00:27:47-5","content":"Yeah. What are the challenges there?"},{"speaker":"Kendrick","time":"00:27:52-2","content":"There's so many challenges because you'll have security that'll wake up on the wrong side of the bed, so that mean I got to bite my tongue. Then you have prisoners that don't want to be bothered that just feel like acting out. And I might get caught up in that situation, that's just like alright."},{"speaker":"Kendrick","time":"00:27:52-2","content":"I at first, Calvin Dunkin had a law class and my friends had already told me about Calvin Dunkin, he's good he going to help you, he going to show you the ropes."},{"speaker":"Kendrick","time":"00:27:52-2","content":"So I got into class, the first day I went to the class, security came and got me and said that they had an incident report. I'm fresh in the penitentiary, I don't know what an incident report is, so they locked me up, finally go to court. They said they had 2 confidential informers said that I was supposed to have a knife buried in the yard and I was supposed to do it somebody."},{"speaker":"Kendrick","time":"00:27:52-2","content":"I don't even know nobody up here man, but just showing you how easy it was for you to get caught up. I was found guilty for the write up but I later won it on appeal, the decision was reversed on appeal. So, I didn't come back to population till that one happened in '97, I didn't get back in population till '99. So that mean I lost 2 years."},{"speaker":"Marcus","time":"00:29:19-1","content":"In the cell blocks."},{"speaker":"Kendrick","time":"00:29:21-7","content":"In the cell blocks. And I had a fight in the cellblock. So that mean, because of 2 confidential informants, I was set back 2 years, I picked up another write up that I should have ever received because I shouldn't have been in the cell block. So you know the penitentiary have all kinds of consequences just based on your action. Because you've got to think for yourself as well was the other dudes."},{"speaker":"Marcus","time":"00:29:50-7","content":"How many people are in the cell blocks at any given time, do you know that?"},{"speaker":"Kendrick","time":"00:29:56-2","content":"On each tier I want to say 14 cells, 2 to a cell. So that's 28 to each tier."},{"speaker":"Marcus","time":"00:30:01-1","content":"And how many tiers?"},{"speaker":"Kendrick","time":"00:30:04-4","content":"4 tiers."},{"speaker":"Marcus","time":"00:30:07-2","content":"Okay, so it's a minority of folks. I mean the vast majority of people are not in the cell blocks."},{"speaker":"Kendrick","time":"00:30:12-6","content":"No, well when you add up all the cell blocks together now, you have A block, B block, C block, Tiger 3 and 4. Tiger 1 and 2. J 3 and 4. Raven 1 and 2, raven 3 and 4. You got all of camp J. That's a lot of guys."},{"speaker":"Marcus","time":"00:30:35-4","content":"Yeah that is a lot of guys. Did they shut down camp J?"},{"speaker":"Kendrick","time":"00:30:39-0","content":"Yeah they shut it down but they made other spots."},{"speaker":"Marcus","time":"00:30:43-9","content":"Sure. Yeah and then I'm sure that there are additional challenges to just coping in that environment."},{"speaker":"Kendrick","time":"00:30:50-5","content":"Right. 2 people in a 10 by 10, this is a dude you've never been around before. You have to make your adjustments right there. You don't know what type of dude this is, he might don't want to be rehabilitated. So where that leave you?"},{"speaker":"Marcus","time":"00:31:09-3","content":"Yeah. So let me ask you something that I think is a difficult question but something that undoubtedly you've thought about but also that you may even have to speak about when you come up to the pardon board in October. What, when you look back 25 years ago and you think about what happened, very few people really know exactly what happened, but you're one of them. How do you feel about it after all these years?"},{"speaker":"Kendrick","time":"00:31:54-5","content":"I feel like that situation, the crime could have been handled out differently because I acted on what I was believing at that moment. While I was allowing to play out. I believe that a family is going through a lot of pain and suffering because of my actions. And irrational actions at the time because of the lifestyle that I had chosen. It created difficulties for them as well as for me."},{"speaker":"Kendrick","time":"00:31:54-5","content":"Bad decision making for me caused me 24 and ½ years to go through a prison system. Bad decision making for me also caused a family to lose a loved one that they can never get back. A loved one that had kids that they have to explain what transpired that night. And I feel a lot of sympathy and remorse for that family because I try to think of different ways of how I can apologize to that family because of my actions."},{"speaker":"Kendrick","time":"00:31:54-5","content":"How can I tell that family, look them face to face and say I'm sorry because I was responsible for you losing your loved one. And that's the difficulty and hard part because just to say you're sorry, well I lost my family member. It's a lot of emotions there, and I've lost friends since I've been here, I lost my grandmother since I've been here, I lost 2 aunts since I've been here."},{"speaker":"Kendrick","time":"00:31:54-5","content":"I can understand what happens, when that occurs and now it's me being responsible for that action to say would you please forgive me because of my irrational decision at that time. Because I chose to live a bad lifestyle. And I try to think of how can I tell, how can I look them people face to face, you know. And actually just, you know, vent out, open up and tell them how deeply sorry I am for what I did to them."},{"speaker":"Marcus","time":"00:34:29-2","content":"Yeah and there's also your family that was impacted by this, right. And I suspect, most acutely felt by your grandmother. Would you say that she was the person who was most affected by your incarceration?"},{"speaker":"Kendrick","time":"00:34:46-9","content":"She was."},{"speaker":"Marcus","time":"00:34:48-8","content":"What did that do to her?"},{"speaker":"Kendrick","time":"00:34:52-1","content":"It hurt her, like I said, my grandmother used to be an alcoholic and she smoked cigarettes. I watched my grandmother have a paradigm shift. Stopped smoking cigarettes, stopped drinking."},{"speaker":"Kendrick","time":"00:34:52-1","content":"Right now, if my mother hadn't moved her china cabinet they have a bottle of wild turkey that been there it's probably gasoline now. But I watched that woman for real just change her life, started going to church, started participating, sending me scriptures, giving me encouragement, motivation and hope not to give up."},{"speaker":"Kendrick","time":"00:34:52-1","content":"Using her son as an example, he done went to the penitentiary many times and he done came home many times. Just because people say this what you have been sentenced to, don't mean you have to believe in it. And I took that and I ran with it. I made that a part of my life. Like I said, mentoring, I opened up to guys and I showed them, this what's going to happen if you continue down that road."},{"speaker":"Kendrick","time":"00:34:52-1","content":"One of my teaching methods was from 1994 to now, what did your life consist of? You have a few guys, I was born, I went to school, I went to juvie, I come out, I end up catching a few little misdemeanors, then I caught this charge and now I'm in the re-entry program. I showed them, from '94 till now I was here, first offense. So while you was trying to re-establish yourself, and bring order to your life, look where I was the whole while."},{"speaker":"Marcus","time":"00:36:53-1","content":"Yeah, I think it's. People say 25 years, but it's amazing how long that actually is. When you start to put it in perspective like that for them."},{"speaker":"Kendrick","time":"00:37:06-5","content":"That's what I did, and I showed dudes, you have a 3 time lose, 4 time lose. And you went to the penitentiary, you got out, you went back to the penitentiary, you got out, you went back to the penitentiary again and got out. I'm still here. When are you going to learn?"},{"speaker":"Marcus","time":"00:37:28-6","content":"Right, right, sure."},{"speaker":"Kendrick","time":"00:37:34-1","content":"When you going to really take the time to figure out your situation and start setting goals to accomplish your dreams man. Ask yourself what you really want to be and what you need to do to accomplish that because if you don't this going to be the rest of your life. I mean the guys that's in the ward. Things happen. Uncontrollable things, and that's where they ended up."},{"speaker":"Marcus","time":"00:38:02-7","content":"Do you see yourself in them sometimes? Who you were back then?"},{"speaker":"Kendrick","time":"00:38:10-9","content":"Yeah the ones that just come, yes. And I'm glad they listen to me because I didn't listen to the guys that was talking to me back then. I'm glad they willing to accept what I'm offering them. They allow me to show them my experience and that's the most hopeful event for me."},{"speaker":"Kendrick","time":"00:38:10-9","content":"To see somebody change because I shared my life with them. Because I gave myself. That's the most encouraging thing to me because I never considered myself being a person that was going to be able to reach out and help somebody, genuinely help somebody. And here I've done it."},{"speaker":"Kendrick","time":"00:38:10-9","content":"The re-entry program and the re-entry program in camp C. I played a big part in each of them programs, and I used my life experiences."},{"speaker":"Kendrick","time":"00:38:10-9","content":"That's one charge that I was convicted of, to show guys, if you keep going down that road."},{"speaker":"Marcus","time":"00:39:15-5","content":"Yeah. And you've already said that if it wasn't that charge you think it would be something else, so. Shows how you turn around, how you get off that road."},{"speaker":"Kendrick","time":"00:39:30-9","content":"I showed dudes, the only way that you going to understand that is to first understand your consequences behind the actions you're going to get involved in."},{"speaker":"Marcus","time":"00:39:42-4","content":"So then the question is, how much is enough punishment?"},{"speaker":"Kendrick","time":"00:39:45-5","content":"Man, when you look and that's a question I was asked about a month ago. The fact of the matter is a life was taken. And you can't really put no time on no life. But, you know, how do you go about being judgmental to a person that's re-established himself. How long does it take a person to change? Especially when you invest in the system that provides self-help programs and better development for a person to re-establish himself back into society."},{"speaker":"Kendrick","time":"00:39:45-5","content":"When I talk to people, I basically especially Christians, I basically tell them my favorite book in the Bible is, it's just 1 chapter, if you just read that one chapter you'll understand. And they go well, just wrote a simple little letter to a guy in society about a prisoner that was going to be released. You're not doing this for him, but do this for the things that I have done for you."},{"speaker":"Kendrick","time":"00:39:45-5","content":"Have consideration based on what you owe me. Because we all have done something in our lives that we going to eventually be held accountable for, but because of our actions now, do you take away all our chances? Do we never get a chance? We have been put in a situation here to where we send prisoners back into society productively."},{"speaker":"Kendrick","time":"00:39:45-5","content":"We teach them how not to come back to the penitentiary, and it's been successful. But you saying that you won't trust us in society? And here it is, we're in here making sure they don't go back out there with the wrong mentality. So I can't really put a time limitation on that because it's hard."},{"speaker":"Marcus","time":"00:42:02-9","content":"Yeah. I don't think there is an answer to the question when you think of, if you're trying to equate the number of years with the value of a life. But in terms of what makes sense, I guess the question is does it make sense to keep people incarcerated past the point where they have clearly changed and certainly have been punished, I mean 25 years, it's hard to imagine that that's not a punishment."},{"speaker":"Kendrick","time":"00:42:40-7","content":"It is because when you look at society today, you look at retirement age, what, 60 years old, 55 if you're doing good for yourself. And when you put somebody back into society, you want them to be equipped with tools necessary to be able to produce for themselves."},{"speaker":"Kendrick","time":"00:42:40-7","content":"And today's society is rapidly changing compared to the prison system and the classes that they offer. I mean, they offer some good programs, but to keep up with guys coming fresh out of college with more experience, I mean who you think society is going to hire first. You 60 years old and this guy is 22, who do you think I'm going to hire first."},{"speaker":"Marcus","time":"00:43:24-5","content":"Sure."},{"speaker":"Kendrick","time":"00:43:26-8","content":"So, in not being rational with that decision making, you putting us in a worse situation, because if we don't have no support that mean we going to be back fixed income or minimum wage income."},{"speaker":"Kendrick","time":"00:43:26-8","content":"So I would really love to see that people taking consideration of the values that we still offer before they just throw us away or put us in a situation down the line where I'm 70 years old with no family, everybody died off, now what am I supposed to do."},{"speaker":"Marcus","time":"00:44:07-8","content":"That's a great question. This may seem like an odd question because it's prison, but I thin at different points in your life in prison, the 24 years you've been here. There are different things that are challenging. The challenges are there but they change. What's the worst thing about the prison experience for you now?"},{"speaker":"Kendrick","time":"00:44:31-0","content":"The worst is adapting to the new prisoners. Because they styles constantly changes, the mind state it's like, how do you tell 10 dudes that a change going to come and they've just come into the prison system and feel like man I don't want to hear that, you ain't talking about nothing. It's so many other things that's happening. The drugs and everything else, you know. It's trying to weave through all the stuff that's being piled up on, piled up on, because you know we double bunk now."},{"speaker":"Kendrick","time":"00:44:31-0","content":"So it's more guys now and there's more attitudes now. Trying to stay out the way, trying to think for all these people and make sure my business situated. Man, just trying to be ready, just trying to be focused, trying to keep everything up to par because it's so easy, it's like you're walking on eggshells cause at any given moment if anything happen, that means we're all subject to be held accountable and I don't want to be put amongst the group when I'm individually doing what I'm supposed to do."},{"speaker":"Marcus","time":"00:45:53-0","content":"What about the best thing about it? Is there anything good?"},{"speaker":"Kendrick","time":"00:45:57-1","content":"Man to see one of them guys change. To see one of them guys give up they old ways.to see one of them guys reach back to their peers and say look man you need to come to this class. You need to take advantage of this because this our future. Look, this our future. So you complain every morning, you mad about what they serve in the kitchen. Keep doing what you're doing, this what you going to have to accept."},{"speaker":"Marcus","time":"00:46:27-6","content":"Sure, yeah. Seeing that change."},{"speaker":"Kendrick","time":"00:46:30-5","content":"Seeing that change man."},{"speaker":"Marcus","time":"00:46:32-9","content":"So you've accomplished a whole lot in the 24 years. As you've said, guy here or you're going to change your life around and take advantage of all these opportunities. What are you proudest of?"},{"speaker":"Kendrick","time":"00:46:51-4","content":"I am proudest that I was able to change. That I was able to recognize my flaws and I was able to understand why I am here and why I don't need to be here. I was mad at myself at first but then I understood that I can't fault nobody but me for taking them actions. So the only way I could rectify the situation was to correct everything about me."},{"speaker":"Kendrick","time":"00:46:51-4","content":"Now that I've accomplished all these educational achievements as well as self-help development, just participating, applying myself when I thought I couldn't do none of this stuff, I felt like putting my life in detrimental situations was the best thing for me when reality said all I had to do was just study."},{"speaker":"Marcus","time":"00:47:41-4","content":"Let's say you get a favorable decision for a pardon board, if not this time maybe next time, who knows. What's your plan?"},{"speaker":"Kendrick","time":"00:47:48-5","content":"My plan is to go back to Texas and re-establish myself. I have a friend that works in an oil refinery, I have another friend that has a string of barber shops, basically just my re-entry is kind of slow but I'm willing because for the last 20 some years, well I'm not going to say the last 20 something years."},{"speaker":"Kendrick","time":"00:47:48-5","content":"Let's say the last, the first 10 years, I worked for 4 cents an hour, I mean $8 a day for 4 cents. So I can accept in society differently. But through the classes I have taken, I learned how to budget, I learned how to manage my money. Through managing my money, I can understand once I make my net value for each month, everything else is what I save."},{"speaker":"Kendrick","time":"00:47:48-5","content":"So I'm saving my money now in preparation for later because if I'm worth, say it cost me $800 a month to live. If I have $1,600 in my account that means the first 2 months are already paid for. Everything I make then, before them 2 months is almost to the good."},{"speaker":"Marcus","time":"00:49:05-3","content":"Sure, what do you make in the hobby shop?"},{"speaker":"Kendrick","time":"00:49:08-3","content":"Well, rocking chairs, purses, belts, anything I can get my hand on."},{"speaker":"Marcus","time":"00:49:14-3","content":"And then you sell them at the rodeo."},{"speaker":"Kendrick","time":"00:49:16-3","content":"Right."},{"speaker":"Marcus","time":"00:49:18-2","content":"I am grateful for you opening up and sharing your life with me this morning out of the blue. Is there something that I should've asked you about your life or something that we should've talked about that we didn't get a chance to?"},{"speaker":"Kendrick","time":"00:49:32-8","content":"No, we covered a lot."},{"speaker":"Marcus","time":"00:49:37-1","content":"Yeah, we did."},{"speaker":"Kendrick","time":"00:49:39-1","content":"We covered a lot."},{"speaker":"Marcus","time":"00:49:41-1","content":"Okay, well that's a good place to stop. Thank you. I really appreciate it."}]}