{"name":"","transcript":[{"content":"Kendrick Howard_Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"So, name current conviction, how old you are and how much time you've served."},{"speaker":"Kendrick","time":"00:00:06-8","content":"My name is Kendrick Lee Howard. I'm convicted for principle to first degree murder and I was 19 years old when the conviction happened."},{"speaker":"Marcus","time":"00:00:15-7","content":"How much time have you served?"},{"speaker":"Kendrick","time":"00:00:17-6","content":"I have a natural life sentence."},{"speaker":"Marcus","time":"00:00:19-3","content":"How much of that life sentence have you serve already?"},{"speaker":"Kendrick","time":"00:00:21-4","content":"Twenty four years."},{"speaker":"Marcus","time":"00:00:24-8","content":"When you say you're a principal of course Louisiana doesn't make a distinction between principals and perpetrators."},{"speaker":"Kendrick","time":"00:00:34-0","content":"You are guilty. That's it. In Louisiana you're just guilty."},{"speaker":"Marcus","time":"00:00:38-6","content":"Do people here at Angola, do they make a distinction between folks who are principals and folks who aren't? I mean do they have a way of like, do they think differently?"},{"speaker":"Kendrick","time":"00:00:48-8","content":"No sir."},{"speaker":"Marcus","time":"00:00:50-4","content":"No? Okay."},{"speaker":"Kendrick","time":"00:00:52-6","content":"It's just you're guilty."},{"speaker":"Marcus","time":"00:00:55-3","content":"So as I explained earlier the purpose of this is just to learn about your life. So I'm going to start with those first 19 years. So tell me a little bit about the folks who raised you. And where are you from?"},{"speaker":"Kendrick","time":"00:01:06-4","content":"I'm from New Orleans, Louisiana from the Abbeville housing development. It's a project right outside, right in behind Canal Street. I had a pretty good upbringing. You wouldn't see it leading to, I have an older brother named Edward Howard. I have an older sister named Merlene Banks and I have a younger brother name Troy Dalian who actually just left Angola two years ago."},{"speaker":"Marcus","time":"00:01:32-4","content":"Okay. All right. But he's gone home?"},{"speaker":"Kendrick","time":"00:01:34-5","content":"Yes sir."},{"speaker":"Marcus","time":"00:01:36-2","content":"Was it nice to have him here even though you don't ever want your brother here?"},{"speaker":"Kendrick","time":"00:01:38-5","content":"I cried like a big old baby because I felt like I led him here. That's my best friend."},{"speaker":"Marcus","time":"00:01:45-8","content":"Were you able to spend some time with him at least?"},{"speaker":"Kendrick","time":"00:01:48-7","content":"A lot of time."},{"speaker":"Marcus","time":"00:01:50-5","content":"You know I mean that's the silver lining if there is one."},{"speaker":"Kendrick","time":"00:01:53-4","content":"A lot of time. I got to spend a lot of time. We always were close as kids but we got a lot more bonding and I kind of helped create what he is now. He's a better person."},{"speaker":"Marcus","time":"00:02:04-9","content":"Sure. How much time did he end up spending here?"},{"speaker":"Kendrick","time":"00:02:08-6","content":"Sixteen years and ten months."},{"speaker":"Marcus","time":"00:02:10-8","content":"Wow. So tell me about your parents."},{"speaker":"Kendrick","time":"00:02:15-4","content":"My father my father's name was Fred Lee Monde. He was from Mississippi. He messed with trucks, he drove rigs for like 15 years. Then he drove the public bus in New Orleans. He moved to New Orleans like right out of high school after he made 17, 18 years old and he graduated, he moved to New Orleans. I don't' know when he met mama but they moved to New Orleans. I know both of them are the same age and it just so happened he was a real good dude."},{"speaker":"Kendrick","time":"00:02:15-4","content":"I had to do a lot of stuff like to get my little clothes and stuff. He was an agriculture gentleman. Growing up on a farm with a lot of, I've got more aunties than uncles. I've got two uncles and I got more aunties than anything. So I had to cut grass and stuff to give my clothes. He taught me a lot of good stuff. I just they didn't have the bond that I wanted him."},{"speaker":"Marcus","time":"00:03:15-4","content":"Yeah he made you earn it."},{"speaker":"Kendrick","time":"00:03:17-8","content":"He made earn it. He taught me how to work."},{"speaker":"Marcus","time":"00:03:19-9","content":"But he wasn't in the house."},{"speaker":"Kendrick","time":"00:03:22-7","content":"He wasn't in a household we lived with my mama. He kind of raised my brother my sister until they were ten or eleven years old. He's been with my mama and when I was two he left. He married another woman."},{"speaker":"Marcus","time":"00:03:32-9","content":"Okay so you and Troy are the youngest?"},{"speaker":"Kendrick","time":"00:03:35-3","content":"Me and Troy are the youngest too. I was the baby until Troy came. He took my spot."},{"speaker":"Marcus","time":"00:03:40-1","content":"Growing up in the projects that can be kind of difficult staying out of trouble with, was trouble going on around you all the time in the neighborhood coming up?"},{"speaker":"Kendrick","time":"00:03:54-0","content":"Yes well my older brother had like his own ills. He was going through his own transformation probably into adolescence and all that there so he didn't really done a lot of stuff with me or Troy. He'd done things but not probably like he was supposed to. I hung out my sister a lot. I went to gymnastics with my sister."},{"speaker":"Kendrick","time":"00:03:54-0","content":"Different stuff like that there. I took karate one time as a kid probably one day a year. But that was kind of what made me want to make sure I'd be there for my little brother because our big brother never was just right there. All in all he was really the man in the house."},{"speaker":"Marcus","time":"00:04:34-4","content":"So let me ask you this. Is it fair to say that you grew up in a home where you felt safe and cared for? Or is it fair to say that you kind of came up knowing that you kind of had to make it on your own?"},{"speaker":"Kendrick","time":"00:04:55-1","content":"I had a real loving environment. My mother was more my father. My mom was the disciplinarian in the house. My mom was a rough lady. She was from the Desire housing development. She moved later on to the St. Bernard when she had my brother and sister and then she'd wind up moving to the Iberville area."},{"speaker":"Kendrick","time":"00:04:55-1","content":"My grandmother was my nurturer. That was my mother. She nurtured me like I was just her world. She wanted to take me when I was a kid. But my mama wouldn't have it. I was her baby. But we had a pretty good household."},{"speaker":"Marcus","time":"00:05:29-9","content":"Okay. Tell me about your grandmother."},{"speaker":"Kendrick","time":"00:05:32-2","content":"Man. Raya Allen Butler. That was the most beautiful, my grandmother is a product of African American and Caucasian descent. My great grandmother they say was Caucasian period. She was the best thing you could ever have."},{"speaker":"Kendrick","time":"00:05:32-2","content":"I think she had a second grade education but she learned how to read and write real good from reading the paper. She used to read the paper a lot. She was allergic to seafood and cooked the best pie and cake that you could ever want to eat."},{"speaker":"Marcus","time":"00:06:09-2","content":"What was your favorite pie?"},{"speaker":"Kendrick","time":"00:06:10-6","content":"My favorite pie is, what they call that? Pecan. That's my favorite pie and she'd make me a yellow cake. I'm not too into chocolate icing. I eat a lot of chocolate. But she'd put some other kind of icing on it."},{"speaker":"Marcus","time":"00:06:28-3","content":"So did she live close by?"},{"speaker":"Kendrick","time":"00:06:30-5","content":"Yes she lived like say about 15 or 20 blocks from where we are but a lot of time my mama would get sick. You know my mama suffered from deep depression a lot. I don't know if it was from a lot of the abusive relationships she had with my father, my stepfather, or whatever. But she would be in and out of hospitals, there for her nerves."},{"speaker":"Kendrick","time":"00:06:30-5","content":"She took medicine for her nerves and since she's had my grandmother either we'll go to my grandmother's house or my grandmother come to our house. A lot of time my grandmother come to the project and stay with us."},{"speaker":"Marcus","time":"00:07:04-5","content":"I was going to ask you about that. So were there other men that came into your mother's life that then came into your life and created some conflict?"},{"speaker":"Kendrick","time":"00:07:12-7","content":"Conflict like?"},{"speaker":"Marcus","time":"00:07:15-3","content":"Fights."},{"speaker":"Kendrick","time":"00:07:17-3","content":"Well I don't know who the aggressor was. But my mother and my father had done a lot of fighting. I just know stories about it but I know that my mama used to tell me like I'm kind of fortunate to be here, because my mother was eight months pregnant with me, my dad had a real bad fight. He beat her up. He whipped her with a bow, and poured a pitcher of hot water on her, and pushed her down some steps. So I'm kind of fortunate to be here, that she didn't miscarry me."},{"speaker":"Marcus","time":"00:07:49-9","content":"So there was a lot of abuse in that relationship?"},{"speaker":"Kendrick","time":"00:07:52-7","content":"In that relationship there was a lot. I don't know if that was, that was toxic for them. I don't know if that was why my daddy left or what. That may be why my daddy left."},{"speaker":"Marcus","time":"00:08:03-6","content":"But you don't have any memories of seeing it?"},{"speaker":"Kendrick","time":"00:08:06-3","content":"No I've never seen him. I never seen him. I'd seen my stepfather, my brother daddy, Troy daddy, because my mama was alone when she died. But his daddy, yeah. I actually witnessed her almost kill him before."},{"speaker":"Marcus","time":"00:08:19-4","content":"Has that left kind of an impression on you seeing that?"},{"speaker":"Kendrick","time":"00:08:29-6","content":"I ain't really look at mom in a different way. I don't know what he was doing that day but he was a real good dude. As long as he not drunk, he's real, he's the best dad in the world. He'd not abuse to us anyway. He barely whipped me because I wasn't his son but he still love me and when he'd take my brothers away he'd take me too because I was his son too."},{"speaker":"Kendrick","time":"00:08:29-6","content":"But whenever he's on the alcohol, he's a humbug and he was an active window cleaner for a long time. He would be up there on them scaffolds cleaning the windows. And one day just came home and he was messing with my mom. I was like five, six I had to be about seven because Troy was two. I had to be about seven years old. We had just moved out. I was like a firebug. I started playing with matches when I was a kid."},{"speaker":"Kendrick","time":"00:08:29-6","content":"And I just burned, I'd just make a mistake and something would go up in flame and I had just burnt our project housing. So we in two twenty three crosette. We're in this house and dad come over there, feeling, I don't know how he feeling and he's messing with mom and mom just don't want to be bothered with him. So I'm just you know, you hear your mama. Sounding like she hitting somebody or something and I go down the steps and I look from upstairs."},{"speaker":"Kendrick","time":"00:08:29-6","content":"The kitchen and the living room are downstairs. Upstairs you got bedrooms and the bathroom. In the project we had three bedrooms at the time because you got me and my big brother and the little brother stay in one room. We got all the boys in one room. My mama got her room and my sister got her room because she was the only girl."},{"speaker":"Kendrick","time":"00:08:29-6","content":"What happened was this is just my memory that I went to look through the thing and my mama seen me so mama tells me, \"Boy go upstairs. Go upstairs.\" Daddy's just looking at me and he ain't really, I don't know if he recognize me or what. And now this is Thomas. That's my little brother's daddy. So I went upstairs for a minute but I'm not gone because I still hear them fighting and I don't want them to fight."},{"speaker":"Kendrick","time":"00:08:29-6","content":"It just happened. My mom had a whole bunch of serving trays like dinner trays, different little things, someone of them glass, someone of them steel, or copper or whatever it may be. And what happened was, I could hear she had a big ole butcher knife, a nice size butcher knife. Probably about a four inch handle but my knife probably about eight inches. One of them big old butcher's knives you see the butchers be having. And I hear it coming from out. It's almost like it was in the sheet because it come from on the shelf and it's right over the sink where the dishes at. And all I heard was pop. \"Ah! Timmy! Shit!\""},{"speaker":"Kendrick","time":"00:08:29-6","content":"I heard him fell and I ran back to the step because the steps are long. We got the long little thing to go upstairs. Probably about 15, 20 steps to get upstairs and I look over there and see my step-daddy with a knife sticking out of his chest. She looked and told me, \"Boy, didn't I tell you to go upstairs.\" Ran upstairs so scared not knowing if Mom just had lost it."},{"speaker":"Kendrick","time":"00:08:29-6","content":"So I grabbed my little brother out of the bed, the baby bed and just held him. I'm big brother now. I just held my baby brother. I'm just scared. I'm thinking, \"Well mama going to do me something now.\" But she came up there and tell me, I can hear her coming up the steps. I can hear her footsteps coming up the steps. So when she get in there and she like, \"Boy, come here.\" I tell her, \"Don't kill me!\" \"I ain't going to kill you, boy. I love you, boy. You're my baby. Come here man. Put your brother down.\""},{"speaker":"Kendrick","time":"00:08:29-6","content":"She just looked at me in my eyes and telling me she might have to go away for a while. \"I'm sorry you, I might have to go away for a while.\""},{"speaker":"Marcus","time":"00:12:05-6","content":"Did she actually have to go away for a while?"},{"speaker":"Kendrick","time":"00:12:08-9","content":"No, self-defense. They had a history of domestic abuse. She had called the police a couple of times. I don't know if they gave her probation or something like that. They probably did. I was about only seven, I don't remember at the time."},{"speaker":"Marcus","time":"00:12:24-5","content":"Was that the end of that relationship?"},{"speaker":"Kendrick","time":"00:12:27-0","content":"No they were married now. They got married after that. They got married when I was like the year I made nineteen the year I made seventeen. They got married in 1999."},{"speaker":"Marcus","time":"00:12:39-2","content":"Are they still together?"},{"speaker":"Kendrick","time":"00:12:41-7","content":"No both of them pass away unfortunately. He pass away first probably from cirrhosis of liver through all the drinking and my mother passed away January 23rd, 2015."},{"speaker":"Marcus","time":"00:12:50-8","content":"Were they able to come up here and visit you? Your mom, your brother?"},{"speaker":"Kendrick","time":"00:12:56-7","content":"My stepfather had passed away before I got here but my mom used to come. My mom and my grandma came until they passed away. I hadn't seen my mother when she passed away in like ten years, thirteen years, almost thirteen years. I'd seen her April 2003. She died there almost twelve years. Because she had moved and went to for Katrina, she went to California. That's where my grandfather, my uncles, and her other sister was. She had moved out there."},{"speaker":"Marcus","time":"00:13:33-6","content":"Do you remember the last interaction that you had with your grandmother before she passed?"},{"speaker":"Kendrick","time":"00:13:36-9","content":"Yes."},{"speaker":"Marcus","time":"00:13:40-3","content":"Tell me about that."},{"speaker":"Kendrick","time":"00:13:42-5","content":"Well it was a visit. I was at Camp C in the cafeteria visiting shed. It was either December the first or December the second of 2001. And my deceased girlfriend, she on the back of my arm, my fiancée, she had brought mom and my, they loved her to death."},{"speaker":"Kendrick","time":"00:13:42-5","content":"I don't have too many girls that my mom and everybody liked, even my kids. This was the one. Her name was Cassandra Dodgheart. So anyway she had brought moms and my grandmother. So we just was, we had a nice visit. But I was seeing that my baby was old, my mama was old. She was eighty-five."},{"speaker":"Marcus","time":"00:14:31-3","content":"Sorry. So it's always the moms and grandmas that get you."},{"speaker":"Kendrick","time":"00:14:42-4","content":"You never know."},{"speaker":"Marcus","time":"00:14:45-0","content":"I like that you have nice memory though of her and the pies. What about your friends? Tell me a little bit about your friends growing up, the guys you ran with."},{"speaker":"Kendrick","time":"00:15:02-3","content":"From the neighborhood?"},{"speaker":"Marcus","time":"00:15:03-8","content":"Yeah."},{"speaker":"Kendrick","time":"00:15:04-8","content":"I hung with my baby brother too much. Well there was Dale but Ronnie, Dale, Ronnie, Nicky are brothers and to the world they're brothers. Everybody think they're my biological brothers but they're not. We had a lot of good things we'd done. I had Bolo. I had Kirk. Who else? Booby. They were some good guys. A lot of us, we were into sports together too. We'd done a lot of sport things."},{"speaker":"Marcus","time":"00:15:40-9","content":"Did you play sports in school?"},{"speaker":"Kendrick","time":"00:15:43-4","content":"Really."},{"speaker":"Marcus","time":"00:15:47-1","content":"Yeah. Tell me about school where did you go to school and what was it like for you?"},{"speaker":"Kendrick","time":"00:15:49-1","content":"I went to, I didn't make it to high school because I got put out of all public schools for fighting. I was a fighter. I mean a fighter probably from my mom's side. My mom is just a fighter. But I played baseball, basketball, and football. Basketball was just something I did because all my partners did it but football and baseball I was really good it. I was really good at football."},{"speaker":"Marcus","time":"00:16:15-7","content":"How old were you when you got put out of school?"},{"speaker":"Kendrick","time":"00:16:18-6","content":"Oh fourteen. I was in eighth grade. I got kept back in the first grade for being hyperactive. I got kept back in the eighth because I wasn't going to school. I was cutting a lot, messing with the girls. But I made it to the ninth grade."},{"speaker":"Marcus","time":"00:16:39-3","content":"Then what were you doing when you stopped going to school?"},{"speaker":"Kendrick","time":"00:16:44-2","content":"Just hanging in hood."},{"speaker":"Marcus","time":"00:16:45-9","content":"Yeah."},{"speaker":"Kendrick","time":"00:16:47-3","content":"Just hanging in the hood."},{"speaker":"Marcus","time":"00:16:48-6","content":"What are you doing to support yourself?"},{"speaker":"Kendrick","time":"00:16:50-6","content":"I was a drug dealer. I really was an enforcer. I really was muscle, more muscle guy out there you know. A lot of people didn't mess with me in my neighborhood because I fought a lot."},{"speaker":"Marcus","time":"00:17:01-0","content":"Right."},{"speaker":"Kendrick","time":"00:17:02-7","content":"They knew I could fight. I was a kid. I've been probably this size since I was like eleven or twelve, the same size. I've been a big kid all my life without, my baby son, if you looked at him you'd be like, \"Man!\" Because he'd been that big since like 13. He cut up a little bit more but we all was big kids. Our grandfather was 6'6 though. My mama's daddy, he was like 6'6, 280 lbs."},{"speaker":"Marcus","time":"00:17:35-2","content":"Did you have relatively easy access to firearms? Everybody who tells me that at some point they're dealing drugs, you're not going to have somebody dealing drugs in New Orleans who's not armed."},{"speaker":"Kendrick","time":"00:17:43-2","content":"Yeah. All right so you're saying what would."},{"speaker":"Marcus","time":"00:17:50-1","content":"It's easy for you to get firearms?"},{"speaker":"Kendrick","time":"00:17:52-5","content":"Easy. It's too easy. They had like a couple of guys, older guys, one of them was actually in this prison with me for a while and he was one of the first person to help me get in school up here. Because when he first came to Angola it was hard for you to get in school if you ain't had numbers. Because they had some people with numbers, they were actually placed."},{"speaker":"Kendrick","time":"00:17:52-5","content":"If you had numbers, they weren't putting lifers in school. Anyway this guy was like he was my friend but he was one of these dudes that go different places, steal cars, and come to other places beside New Orleans, run one car into a pawnshop or something and put the guns or whatever merchandise he can make off with in the other car. So he used to sell a lot of guns."},{"speaker":"Marcus","time":"00:17:52-5","content":"They were around you?"},{"speaker":"Kendrick","time":"00:17:52-5","content":"They were around me as kids and, see instead of hanging and idolizing my big brother, I'd seen the dudes in the hood that was into all kinds of stuff. They took care of me. Done all kind of different stuff for me. They bought me clothing. They tried their best to deter me from that life but it is something I gravitated to."},{"speaker":"Marcus","time":"00:18:54-6","content":"They become your role models."},{"speaker":"Kendrick","time":"00:18:58-0","content":"That's what had actually happened. That's what happened to my brother. I was a role model."},{"speaker":"Marcus","time":"00:19:02-1","content":"Yeah I see."},{"speaker":"Kendrick","time":"00:19:04-3","content":"That's what hurt me when I see him."},{"speaker":"Marcus","time":"00:19:07-5","content":"I understand that. Was there, aside from your grandmother, was there another adult that took an interest in you, so it's not an older brother, could have been a teacher or a coach..."},{"speaker":"Kendrick","time":"00:19:22-3","content":"Whoa man."},{"speaker":"Marcus","time":"00:19:24-5","content":"who kind of looked out for you?"},{"speaker":"Kendrick","time":"00:19:28-3","content":"had two teachers. They were the best teachers in the world. Mr. Crusoe. God bless the dead. And Coach Smith. Coach Mill Smith was a teacher at McDonough 28 the school I got put out and Coach Smith almost lost his wife, his first kid's mother because he had so much interest in me, he actually wanted me to come stay with him because he'd seen me as a kid that had so much potential. We've never been dummies or illiterate kids."},{"speaker":"Kendrick","time":"00:19:28-3","content":"Our mama had nothing but a tenth grade education. She was a substitute cafeteria worker. I have an aunt, my grandmother's oldest child, my Aunt Catherine, she worked at one of the schools I went to, Bell, in the cafeteria for forty-seven years. She's eighty-two right now. But Coach Smith he was my daddy. He was my daddy in school, my daddy away from home. He's a real good dude."},{"speaker":"Kendrick","time":"00:19:28-3","content":"And believe it or not, I work at the rodeo here now. I've been working at the rodeo since 2009. I cook shrimp pasta out there. Coach Smith came out there twice and brought his new wife and his family, sister I'm assuming. For this charge, I was facing the death penalty. So he was one of my character witnesses. He wanted to be a character witness to let everybody know that I shouldn't die because I'm a good person."},{"speaker":"Marcus","time":"00:20:51-0","content":"Do you have a lot of people come see you at the rodeo?"},{"speaker":"Kendrick","time":"00:20:55-7","content":"Not the people I want. I really want to see my kids."},{"speaker":"Marcus","time":"00:20:58-9","content":"So who visits you up here?"},{"speaker":"Kendrick","time":"00:21:03-1","content":"My girl. My girlfriend, her name is Angel."},{"speaker":"Marcus","time":"00:21:07-4","content":"Angel."},{"speaker":"Kendrick","time":"00:21:10-4","content":"Angel Garlerie."},{"speaker":"Marcus","time":"00:21:08-4","content":"Is that somebody you met since you've been here?"},{"speaker":"Kendrick","time":"00:21:11-4","content":"No that's someone I've known all my life. She's from out the project with me. Childhood sweetheart. Beautiful young woman here. She just was crazy about me as a kid. Her mama thought I was just a bad guy. She didn't feel that I was a bad guy but she just by my reputation you know in the hood. But she called me one day."},{"speaker":"Kendrick","time":"00:21:11-4","content":"She scared me half to death. Because she told her mama she was in love with me, then her mama like, \"Who now? Ain't he mess with all the girls in the neighborhood? And he a bad boy?\" She just gave me a schooling about, \"My daughter's in love with you. Break my daughter, if you hurt my daughter, I'm going to do this to you.\" \"Yes ma'am. I ain't messing with your daughter\""},{"speaker":"Marcus","time":"00:21:56-3","content":"So you still have that childhood connection. So you know you described some things that suddenly were some domestic violence in the house. Were you ever a target for any of that violence? It doesn't sound like you were. I'm just checking."},{"speaker":"Kendrick","time":"00:22:20-4","content":"Well I was molested."},{"speaker":"Marcus","time":"00:22:22-5","content":"Okay."},{"speaker":"Kendrick","time":"00:22:24-0","content":"By a fourteen year old girl when I was like eight."},{"speaker":"Marcus","time":"00:22:26-2","content":"All right."},{"speaker":"Kendrick","time":"00:22:27-6","content":"Yeah this broad she was like, she was kind of how do you put? She wasn't retarded or nothing but she had a little problem. She stayed across the porch from us. Other than that she was all right. We played on out again and all that but she was a big girl. She was like 6'2, 220-230 pounds. She'd want me to be, I'm the biggest one out of everybody, so she want me to be her husband. And I wind up get molested by her."},{"speaker":"Marcus","time":"00:23:01-1","content":"So is that something that you think had a kind of a defining effect on your life?"},{"speaker":"Kendrick","time":"00:23:14-2","content":"Sexually. Because an eight year old is not supposed to have to go through nothing like that, man or woman. I was fortunate but unfortunate. I was fortunate that it wasn't a man who molested me, but unfortunate just to have to go through the experience period."},{"speaker":"Kendrick","time":"00:23:14-2","content":"So like as I got older, this was like from eight years old which was like, I was born in '73, 8 years old to, so it's like what '80, '81. From '81 to '88, me and this is girl did that like three or four times a week sometimes five times because her grandmother was real religious and her grandmother go to church a lot, and her mama was kind of slow."},{"speaker":"Kendrick","time":"00:23:14-2","content":"So her mom won't be able to catch her doing what she's doing. But I was somebody, by me being across the porch, and her mama and my mama being friends, they would let me come in the house. I can come in the house. No other boy can come in the house but I can come in the house. So I'm getting, we really getting away with murder because now she's sneaking me in the house to do that. I done just got used to it. So I just go over here."},{"speaker":"Marcus","time":"00:24:26-4","content":"So from eight to fifteen?"},{"speaker":"Kendrick","time":"00:24:28-4","content":"Yeah, eight to fifteen."},{"speaker":"Marcus","time":"00:24:31-6","content":"Yeah. So that's pretty."},{"speaker":"Kendrick","time":"00:24:33-9","content":"Yeah about eight to fifteen you know I had sex with this big old woman like three to five times a week. At first I just thought I just was, she was making me do it too until I just started liking it."},{"speaker":"Marcus","time":"00:24:50-4","content":"Yeah, you're a child."},{"speaker":"Kendrick","time":"00:24:52-7","content":"Yeah. I'm a child."},{"speaker":"Marcus","time":"00:24:54-6","content":"So what was the first time you got in trouble with the law? Do you remember the first time you got arrested?"},{"speaker":"Kendrick","time":"00:25:04-2","content":"I probably stole something. I can't remember but it was probably around. Right around when I was eight."},{"speaker":"Marcus","time":"00:25:08-4","content":"When you were that young?"},{"speaker":"Kendrick","time":"00:25:10-6","content":"I probably stole something out of the store and got caught."},{"speaker":"Marcus","time":"00:25:13-0","content":"Okay, anything after that?"},{"speaker":"Kendrick","time":"00:25:15-2","content":"Yeah I've been in and out of juvenile since I was a kid. I even I was on a school. I've been in and out of juvenile jail"},{"speaker":"Marcus","time":"00:25:29-7","content":"Okay. So let me ask you this if this didn't happen this particular charge from everything that you told me you were going down the wrong path took the wrong path I should say you were going down a path that's going to get you in trouble. So if this hadn't happened that day. Let's say you just didn't get out of bed that day. What do you think the next few months and years of your life would have been like? How would you have imagined it all kind of?"},{"speaker":"Kendrick","time":"00:25:56-8","content":"Do you want to know what would have happened to me?"},{"speaker":"Marcus","time":"00:25:58-7","content":"Yeah. I mean obviously there's no way to be certain."},{"speaker":"Kendrick","time":"00:26:02-6","content":"I would have, at the time, I'm not lying to you. I had some ambitions as far as, I got a clothing line that I drew. I could draw I just don't draw for people. And I go a clothing line down in the drawer. It's called Cleft but I had my youngest son cousin, her father was into this like entrepreneur thing and I had seen that."},{"speaker":"Marcus","time":"00:26:34-9","content":"So you would have gone into that?"},{"speaker":"Kendrick","time":"00:26:36-7","content":"That's what I would have gotten into but if I wouldn't have actually, if I wouldn't have caught this charge, two things would have actually happened, somebody would have killed me or I would have died of AIDS from all the women I used to mess with."},{"speaker":"Marcus","time":"00:26:51-9","content":"So in some strange way coming to prison may have saved your life?"},{"speaker":"Kendrick","time":"00:27:01-7","content":"It did. It gave me a whole new outlook on life. Since I've been here I've been a part of multiple, I've got so many, I'm a first year graduate of Malachi Dads. I've been in so many different things. My only thing is I'm working on many right now. As a matter a fact in a few years I'll blitz again before I get my GED. I have a trade already. We certify car people. That's just in my family."},{"speaker":"Marcus","time":"00:27:27-6","content":"I'm going to ask you about all of those things. I really do want to know what you've been up to and how you've been sort of transformed your life here since you've been here. But it is an interesting thing. So this thing, in some ways prison ends up saving people's lives in a really strange way. Drugs and alcohol, were they part of your life."},{"speaker":"Kendrick","time":"00:27:48-1","content":"No."},{"speaker":"Marcus","time":"00:27:52-3","content":"In terms of your lifestyle?"},{"speaker":"Kendrick","time":"00:27:54-7","content":"I smoked a little weed at one time. At one time, I don't know how. I was violent. That was my adrenaline. I boxed for ten years up here. That was my adrenaline. It kept me out of trouble though. But that was my adrenaline at one time."},{"speaker":"Marcus","time":"00:28:11-4","content":"I want to move on to your time. I assume you spent a couple of years or so in the parish when you caught charge and then coming up to Angola."},{"speaker":"Kendrick","time":"00:28:19-6","content":"That's about two and half. I've been in Angola twenty, twenty-two and a half years something like that."},{"speaker":"Marcus","time":"00:28:25-9","content":"Okay. So what I want I want to do is I want to move on to that part of your life and talk about the changes that you've gone through since you've been here. But first is there's something else about your childhood or something about your life story before you came here that I didn't ask you about. It's kind of an important part of who you are that I missed?"},{"speaker":"Kendrick","time":"00:28:46-6","content":"No."},{"speaker":"Marcus","time":"00:28:48-3","content":"Okay we covered quite a lot. So let's get to Angola. Do you remember that bus ride?"},{"speaker":"Kendrick","time":"00:28:53-0","content":"Wow yeah that's a scary bus ride because you done heard so much things. The parent, the father that who named my, he's not my biological but he's my big brother and sister biological father. He'd been here couple of times. I used to hear all the stories when I was a kid about, \"Don't go to Angola, son. Blah blah blah blah.\""},{"speaker":"Kendrick","time":"00:28:53-0","content":"The other parents as far as my brother's and sister's fathers they always were nurturing with me too. They were never no bad like, \"You ain't my son.\" They ain't messing with me but they love my mom enough to mess with me too, but on the way up here man I probably wasn't scared."},{"speaker":"Kendrick","time":"00:28:53-0","content":"I just was uncertain to what to expect because you don't what kind of world you're coming into. You'd heard so many different stories about so. I was kind of leery like, \"What am I going to have to do because?\" Because I'm going to have to prove myself again. I don't got to prove myself where I just come from because they already know."},{"speaker":"Marcus","time":"00:29:57-7","content":"Did you have to...?"},{"speaker":"Kendrick","time":"00:30:00-7","content":"You would be surprised. To be honest with you, I might have had one fight, two fights since I've been here. I might've had two fights since I've been here. I did my fighting in the ring for real. I might have two fights since I've been here for real."},{"speaker":"Marcus","time":"00:30:18-3","content":"So can you describe for me your first few months here? What was it like? I mean obviously you're hearing all these stories but many, not all those stories are true."},{"speaker":"Kendrick","time":"00:30:29-3","content":"True."},{"speaker":"Marcus","time":"00:30:30-7","content":"I imagine that they put you in the working cell?"},{"speaker":"Kendrick","time":"00:30:33-6","content":"No I went straight down the wall. I mean being so big, by me being big even though I was--how old I was how old? Twenty-two? I thought I was 22 when I came here? Yeah I was twenty-two when I came to Angola. I came, I went to this dorm I'm in right now. That's my first dorm in, well that's my second dorm. I went to J Bass. J Bass is like a little secluded you know as well. They house all the bad people at but I went to the dormitory in there because I was young."},{"speaker":"Kendrick","time":"00:30:33-6","content":"That was my cell block. Giving me an opportunity to be able to do some positive while I'm here. But you know the camp was so small that I couldn't get the help I needed because I didn't have no finances or nobody with the kind of money to give me a lawyer. So I know I really couldn't be there but I went to J Bass. I was an orderly for the cells where the dudes were housed at. In the cells were the bad dudes."},{"speaker":"Marcus","time":"00:31:30-8","content":"This is Camp J?"},{"speaker":"Kendrick","time":"00:31:32-0","content":"This is a Camp J. I was there for a month. I let myself get caught with some cigarettes, some contraband just to get from back there. So I wound up getting shipped to dungeon in two weeks and I went to the dorm I'm in right now 02."},{"speaker":"Marcus","time":"00:31:44-9","content":"In the main prison?"},{"speaker":"Kendrick","time":"00:31:47-4","content":"In the main prison. 02, when I got to that dorm, it was a different scene they got about eight dorms on each side. You got a lot of different things and I knew a lot of different people from the past, and people I had just met in a parish."},{"speaker":"Kendrick","time":"00:31:47-4","content":"And the first couple of months I was here was really a transition thing. It was crazy though because a lot of stuff I knew from being in and out of jail all my life, you hear one thing and you're seeing a different thing from the rah, rah stuff you heard, the stuff that's supposed to scare you to the stuff that's supposed to be. How you're supposed to live? It's not really like that."},{"speaker":"Kendrick","time":"00:31:47-4","content":"Yeah so that was crazy for me. I had to get in my mind because certain stuff that I wanted to react to in a negative way my partners would be like, \"Man, don't do that man. That's not nothing. That was going on when I got here. So don't even worry about that. You don't want to get stuck out here?\""},{"speaker":"Marcus","time":"00:32:51-2","content":"Right sure. So tell me a little bit about, you mentioned earlier that you're part of Malachi Dads. You're the first group of that. So tell me a little bit about some of the other things you've been up to since you've been here. Some of the organizations you talked about certifications inmechanics."},{"speaker":"Kendrick","time":"00:33:01-0","content":"Well I've got a certification. I'm a certified auto mechanic. It's fun for me, it's fun for me. I got that because my older brother had a motorbike shop for 20 years. I was going to go out there."},{"speaker":"Marcus","time":"00:33:15-4","content":"Did you ride?"},{"speaker":"Kendrick","time":"00:33:17-3","content":"Yes I know how to ride. Actually my co-defendants taught me how to ride but he had been riding since he was about seven but I learned how to ride when I was like 14. But my older brother had a, so that's why I really want to get that in my jacket just knowing I always knew about cars. But I always knew about cars because my brother He used to be trying to teach me."},{"speaker":"Kendrick","time":"00:33:17-3","content":"When he did have time for me, my older brother he would try to teach me something like that. But I was so good with electronics some kind of way he and I, the old people that throw stuff away that was electronic. I get it to work. And he wanted me to go to school for that. He'd be trying to get me to go to school for that, and probably for when he have his own business which wound up having later on down the line."},{"speaker":"Marcus","time":"00:34:00-8","content":"So you're a certified auto mechanic?"},{"speaker":"Kendrick","time":"00:34:00-8","content":"I'm a certified auto mechanic."},{"speaker":"Marcus","time":"00:34:03-3","content":"What else have you been doing?"},{"speaker":"Kendrick","time":"00:34:05-9","content":"I'm in a lot of self-help groups. I'm a member of literary arts. I've been the president of that club as well. The vice president, president, all the way up. I done went from the bottom to the top. Right now I cook for them. I cook. I cook a dish called shrimp pasta."},{"speaker":"Marcus","time":"00:34:22-1","content":"Oh like the rodeo too?"},{"speaker":"Kendrick","time":"00:34:23-8","content":"Yeah I cook it at the rodeo and I cook it in the A building too as well. Malachi Dads. Substance abuse. This one is now defunct. It's not anymore. New AA. I've been a part of the Lifers. We just did Thinking for a Change. A beautiful program."},{"speaker":"Marcus","time":"00:34:45-6","content":"That's what I've heard."},{"speaker":"Kendrick","time":"00:34:49-1","content":"Yeah. That's a beautiful program."},{"speaker":"Marcus","time":"00:34:54-0","content":"So you've done a lot. So I mean this is one of the reasons that we wanted to talk to you. You've been here for two decades and nobody's the same after 20 years. And some people make the best of every opportunity here and just rehabilitated. And you're a trusted member of the community and I assume you're a trustee."},{"speaker":"Kendrick","time":"00:35:19-5","content":"Class B."},{"speaker":"Marcus","time":"00:35:21-4","content":"So can you tell me what is the distinction, they make a big deal about the distinction between class B and class A, but isn't that sometimes where you prefer to be?"},{"speaker":"Kendrick","time":"00:35:31-4","content":"That's why I prefer to be right here in Class B. I've been Class B since '09.The only distinction to me is that some of the Class A trustees, they get to be statewide trustees and they go outside the gate right there. Class B have the, we could do a lot of stuff on our but certain stuff we need at least a security person with us. Class A can drive a truck around here. They don't need nobody with them."},{"speaker":"Marcus","time":"00:36:04-4","content":"But my understanding also is that sometimes people won't pursue a particular Class A status because they don't want to be moved to Camp F."},{"speaker":"Kendrick","time":"00:36:12-9","content":"They don't. I don't want to be moved to Camp F because it's like an old folk's home."},{"speaker":"Marcus","time":"00:36:17-1","content":"Well okay so I mean the thing is that there are more things that people consider other than just the status."},{"speaker":"Kendrick","time":"00:36:23-5","content":"Yeah the status."},{"speaker":"Marcus","time":"00:36:25-0","content":"But anyway my point is that you're a trusted member of the community and so forth. So what I'd like to do is if you can go back to the Kendrick the 22 year old that came here, what kind of person is that? What kind of person was he?"},{"speaker":"Kendrick","time":"00:36:42-7","content":"What kind of person he was? He was a schemer. He still was violent too. He was really agitated with a lot. He was agitated. He was mad because someone, some his kids mothers that kept his kids out of his life, so he was bickering with them. He was hurt for the fact that he left moms out there unattended to."},{"speaker":"Kendrick","time":"00:36:42-7","content":"You know he just a lot of mischief if he could, he got away with a lot of mischief. If he was into and it was around him he probably was into it. Certain things that he was into, if it would float his boat he was into it especially if it had to do with fighting or something."},{"speaker":"Marcus","time":"00:37:33-4","content":"Sure. So how are you different now?"},{"speaker":"Kendrick","time":"00:37:35-3","content":"Wow. I'm more patient. I had no patience when I first came here and that was part of the, I was angry at everybody and I didn't it took one day. One day, Kendrick and Kendrick mama met and they told me something that blew my mind and it stuck with me. It was probably the moment my brother come up here."},{"speaker":"Kendrick","time":"00:37:35-3","content":"February 2002. I was talking to her on the phone. She was, as a matter of fact, she was with her last kid daddy. He was in the house. I wanted to talk to him so I talked to him for a minute. She went to flashing out because I heard him tell them, I'm really trying to tell him, \"Don't think I'm trying to holler at your old lady bro. I'm just talking about my kid's booboo.\" So she just went off telling him that, \"He don't pay no bills here. You can't tell him what to know. I want you to call here. He know I love you. Don't worry about that, you hear?\""},{"speaker":"Kendrick","time":"00:37:35-3","content":"So but all in all she had told him one of my friends had gave us some money for me and she told me she'd do it for my son which just with good or my daughter. Whatever ones you want to use it for. It was cool. So she would like, \"You're mad with the dude.\" The dude had told him to give her the number give me the number. \"Give him the number and tell him to call me.\" Because he's supposed to be trying to help me get out of jail."},{"speaker":"Kendrick","time":"00:37:35-3","content":"And I would tell her like, \"Fuck the dude. Fuck that dude.\" She sat down and said, \"Listen I want tell you one thing. When you was out them dudes were your friends. You fell like them dudes your friends. I understand you've been in jail these years that have passed.\" That was like my ninth year in jail. It was like my eighth or ninth year in jail."},{"speaker":"Kendrick","time":"00:37:35-3","content":""},{"speaker":"Kendrick","time":"00:37:35-3","content":"\"See this is what I'm telling you. Anything you've done for those gentlemen, that was because you loved them or you had, you felt like they were your friends. You can't be mad if they don't feel the same way.\" And that stuck with me ever since. And then all of a sudden that stuck with me. Because they don't feel the same way about you, you don't have no reason to be mad, though you feel different about them than they feel about you. That was an eye opener for me."},{"speaker":"Marcus","time":"00:39:43-9","content":"Yeah so if you can love somebody. It doesn't automatically make them love you back."},{"speaker":"Kendrick","time":"00:39:49-8","content":"Love you back, yeah. That was something real that stuck with me all these years. I will never forget that."},{"speaker":"Marcus","time":"00:39:54-6","content":"So about eight years into your incarceration, is that when you know things start to turn around for you?"},{"speaker":"Kendrick","time":"00:40:06-3","content":"I met a lot, I had knew and met some individuals early on that helped shape and mold me to who I am today but a lot of more people started taking an interest in me like beside for my family members, certain family members I got an older cousin who was more my brother than my older brother. His name is Allen and he."},{"speaker":"Marcus","time":"00:40:31-3","content":"Is he here?"},{"speaker":"Kendrick","time":"00:40:33-1","content":"No I don't think he's ever been to jail but you know I forgot what he do. He do something with a big old company driving from state to state dropping off some kind of stuff. But anyway Allen was always, he was always there for me as a kid as a brother. He and my older aunt. He's in the same order as our mama's children. He's the third child. And my aunt got four children too. She just had two boys and two girls."},{"speaker":"Kendrick","time":"00:40:33-1","content":"He was one of them people that, like beside for him out there, in here I had dudes that started showing me, \"Man, get into this. It's going to help you.\" And a lot of what they help me, they helped me with my anger and that's what helped me be more patient with people because a lot of stuff that, what got me into a lot of fights as a kid and as an adult was the fact that people do stuff they know they not supposed to do. and I can't handle that and just so happened that I'd snap. I had a bad temper as a kid."},{"speaker":"Kendrick","time":"00:40:33-1","content":"And being here and going through this transformation, it really helped me with that patience. I'm totally different because of that."},{"speaker":"Marcus","time":"00:41:39-6","content":"Sure. Yeah I mean you're older now."},{"speaker":"Kendrick","time":"00:41:44-2","content":"Mature."},{"speaker":"Marcus","time":"00:41:45-5","content":"Mature. Yeah sure. So can you describe what your typical day is like here? What's your routine?"},{"speaker":"Kendrick","time":"00:41:51-7","content":"I'm a yard orderly. I'm a yard orderly. I wake up. Take my, I don't go to breakfast too much. I eat in the middle, I eat like one I'm Muslim. That's my religious belief. But I do go to church. I go to church every Sunday morning. I get both of them because as a kid I was raised up because my mother was a Catholic. My grandmother was a Catholic."},{"speaker":"Kendrick","time":"00:41:51-7","content":"My mother had a catholic church that we always went to right across the street from our house. So it was convenient for us to just go there instead of going to the Baptist church that my mom was a member of. We had to go there too but it was like five or ten blocks away. But the other church was right across the street so we could just go out the project and go straight across the street to the church."},{"speaker":"Marcus","time":"00:42:39-1","content":"What was the other church?"},{"speaker":"Kendrick","time":"00:42:44-2","content":"St. Jude."},{"speaker":"Marcus","time":"00:42:45-3","content":"St. Jude, okay."},{"speaker":"Kendrick","time":"00:42:47-3","content":"St. Jude. So I go to Sound Doctrine. It's a beautiful church. And our brother you just finished talking with, he's the pastor of it."},{"speaker":"Marcus","time":"00:42:57-7","content":"Pastor Hicks? Pastor George?"},{"speaker":"Kendrick","time":"00:43:00-3","content":"Yes Pastor George. And he be bringing some beautiful messages. This weekend, this past weekend, this past Sunday the message was what you sow? What you sow? You will get back what you sow. That was the message."},{"speaker":"Marcus","time":"00:43:20-8","content":"So you do that. You go to a service."},{"speaker":"Kendrick","time":"00:43:28-7","content":"Yeah I go to service every Sunday. I wake up, this is like my typical day. I wake up, take care of my hygiene, I go and check and make sure my yard work is straight, I work out a lot. So I'm going to be involved in some kind of sporting activity. I'm a go run the yard. I'm a go lift weights."},{"speaker":"Kendrick","time":"00:43:28-7","content":"Sometimes I coach basketball up here. I like that. I've won ten championships as the basketball coach. I ain't never lost a championship as coach. I stopped doing it about two years ago but yean that's one of my passions. Sports, I love sports."},{"speaker":"Marcus","time":"00:44:09-6","content":"What about boxing? Do you coach boxing?"},{"speaker":"Kendrick","time":"00:44:12-5","content":"I don't coach boxing. I was, I wanted to get on the team as a boxing coach but they got so many politics in it. So much politics with the other trainers and I'm not, that was kind of part of why our boxing team be going up and down because these trainers are mad with these trainers. All of us on one team. We're supposed to be one team and that was kind of crazy."},{"speaker":"Marcus","time":"00:44:34-3","content":"I get that. There's a lot of that in prison."},{"speaker":"Kendrick","time":"00:44:36-6","content":"Yeah that was kind of crazy."},{"speaker":"Marcus","time":"00:44:38-2","content":"There's a lot of that everywhere."},{"speaker":"Kendrick","time":"00:44:40-1","content":"There's a lot of that everywhere. \"I want to be the best trainer!\" All that stuff."},{"speaker":"Marcus","time":"00:44:43-2","content":"Yeah. I get it. So you do some sports and then."},{"speaker":"Kendrick","time":"00:44:49-9","content":"I go to different classes too. What was the last thing I took? Last thing I took was I'm waiting on something else because I want to get it's some kind of, it deals with telecommunication. I pick what I want to get in. That's what I'm waiting on. I'm waiting on this class to come but I'm trying to, right now I'm more focused on hurrying up and getting..."},{"speaker":"Marcus","time":"00:45:12-3","content":"Get the GED."},{"speaker":"Kendrick","time":"00:45:13-8","content":"...get the GED because it take up, when the people trying get me to do these other things when I want to do these other things, I be studying trying to get this GED."},{"speaker":"Marcus","time":"00:45:22-9","content":"Okay. Yeah. And that would be good to get it."},{"speaker":"Kendrick","time":"00:45:24-4","content":"That's why I want to get it out of the way because I got another trade that I want. I really want."},{"speaker":"Marcus","time":"00:45:28-2","content":"That makes sense. So let me ask you this. Well you know obviously there's--when you look back on the events that brought you here there's the victim and the victim's family and people tend to concentrate on that. But there's also your family right? And all of the folks that you left behind who have to watch you go through the prison. How was that for your family?"},{"speaker":"Kendrick","time":"00:45:59-7","content":"Oh that was traumatic especially my mom. Moms even though me and mom was two peas in a pod we just ain't kind of mix. We love each other to death. So much alike you know how they say."},{"speaker":"Marcus","time":"00:46:14-0","content":"You're both fighters."},{"speaker":"Kendrick","time":"00:46:15-4","content":"Yeah we so much alike so we got them strong spirits. But my mother actually didn't know how I got found guilty. The people had told her that they could leave and come back next day and they were going to read the verdict. So I called Mom just to make sure she was all right. \"Are you alright? Baby what's up?\" \"I'm alright. Well.\" So I'm thinking that the lawyer had called already, my lawyer done called and told her because I know how she is about me."},{"speaker":"Kendrick","time":"00:46:15-4","content":"So the lawyer hadn't called her so I'm just trying to make sure I'm just telling her it's going to be alright. We're going to appeal and all that. She doesn't really know what all of that is. All the years she had been messing with me in and out of juvenile jail. This is actually my first conviction."},{"speaker":"Kendrick","time":"00:46:15-4","content":"So it's like, just so happened she told me to hold on and she clicked over. So when she clicked over, that was my lawyer. My lawyer was calling like when they let everybody out of the courthouse because they had like everybody from the neighborhood like just came in the courthouse for some reason. It was in the courthouse the day that the trial was going on which was from the 14th to the 16th."},{"speaker":"Kendrick","time":"00:46:15-4","content":"I don't know if they felt like it was too rowdy or whatever and they just let everybody out of court that last day. And what they did was they read the verdict to us. Just us and our lawyers. No family or nothing. So we knew we were found guilty already which was the end of the 15th just so happened the next day everybody came back in there."},{"speaker":"Kendrick","time":"00:46:15-4","content":"But moms was, she come back to the thing and she was quiet, real quiet."},{"speaker":"Kendrick","time":"00:46:15-4","content":"So I was like, \"Man, what's happening?\" She just went berserk. She just started crying and wailing. I would tell her, \"Man, you know how that make me feel. Don't do that. That'll cause me to get into a fight.\" She was going crazy, can't believe,\" I can't believe they did that to you!\" Because they don't have no evidence on me. I ain't, they already knew that."},{"speaker":"Marcus","time":"00:48:16-9","content":"Then they understand that she has a son going to death row."},{"speaker":"Kendrick","time":"00:48:25-2","content":"Going to death row. Facing the possibility of death row because then next day was the penalty offense. Yeah the next day was the penalty offense."},{"speaker":"Marcus","time":"00:48:33-0","content":"So you were never on death row?"},{"speaker":"Kendrick","time":"00:48:34-4","content":"I ain't never been on death row."},{"speaker":"Marcus","time":"00:48:36-2","content":"But she knew she understood the seriousness of it."},{"speaker":"Kendrick","time":"00:48:38-8","content":"She understood the seriousness of it."},{"speaker":"Marcus","time":"00:48:41-9","content":"Yeah. And of course I would imagine that it was very difficult for your grandmother as well. And I don't want to take you down a sad path. I'm just trying to get a picture of what's going on."},{"speaker":"Kendrick","time":"00:48:51-7","content":"My grandmother was tough. My mama was tough. She ain't really cry too much that I know of. She didn't cry when I called her, I called her to make sure she was alright too. She didn't actually attend the trial. By being older, I don't think she actually wanted to see me like that. She came in out of jail all the years I was in there, came and got me from court when I got to B roll or whatever."},{"speaker":"Kendrick","time":"00:48:51-7","content":"But she didn't want to see me in the court room like that, so she didn't attend that. She was alright. When I talked to her she just told me, \"You know what got to do. We going to be praying.\" She was real Christian you know. \"We're going to be praying for God to let you out.\""},{"speaker":"Marcus","time":"00:49:31-2","content":"You mentioned earlier that you identify as a Muslim. Was that something that you're exposed to when you're here when you got here?"},{"speaker":"Kendrick","time":"00:49:39-5","content":"Well before I got here. Really in the parish, I read a lot of really different books. I love reading. So I just was studying and I found myself, I had been studying different Buddhism all that different stuff. I was reading a lot of different things and I actually accepted it in Angola because I was sitting by, I found myself I had a fight? No, I call it defiance. A defiance is a rule three."},{"speaker":"Marcus","time":"00:50:09-0","content":"When security tells you to do something and you don't do it?"},{"speaker":"Kendrick","time":"00:50:11-4","content":"They'll say you cursed them out or something. And that's what happened. And I wound up, I was in the dungeon in September of 2000, and I was sitting in that dungeon and I was thinking. That's really when everything really transformed real for me."},{"speaker":"Kendrick","time":"00:50:11-4","content":"But anyway I was sitting in the dungeon I was saying to myself, \"Man, I'm tired I don't want to be going through this. I want to get out of here so I so I got to do something. I got to make a change. Something ain't right for me to because I still had some of that aggression. Not the whole aggression but a lot of aggression but in that dungeon, I see that no matter what it is whether it's Christianity, Islam, Buddhism, or I've got to find something to stand on, some kind of faith."},{"speaker":"Kendrick","time":"00:50:11-4","content":"I don't want to say I was an atheist as a kid but man a lot of good stuff ain't happen. So you know you be like, \"Man why God?\" You know you don't want to question God now. I'm a grown man I understand that but you know as a kid when certain things be happening you be like, sometime you tend not to believe in certain things."},{"speaker":"Kendrick","time":"00:50:11-4","content":"When I sit down and wish while I wait for my dad to come for Christmas just to drop by and holler at me and he'll never come and I'll be crying. Man that hurt me. Why would God let Daddy do me that? As I was sitting in that dungeon I said it. Believe it or not Islam helped me understand Christianity. It really helped me understand the Bible because it's the Bible. It's the Bible. It's just another form of the Bible."},{"speaker":"Marcus","time":"00:52:00-5","content":"Yeah it's interesting. So let me ask you a difficult question. Okay so the fact of the matter is that you're serving life without parole. And even though I obviously have, I'm very hopeful that things are going to continue to reform. I believe in this project."},{"speaker":"Marcus","time":"00:52:00-5","content":"I also realize that for many of you the possibility of never leaving here is a possibility that you have to deal with and one of the things that I've said earlier to you that I want to explore in this project is how people cope with that. How have you coped, and how do you cope with the possibility that you won't get out?"},{"speaker":"Kendrick","time":"00:52:50-1","content":"God. Straight like that. God. Just God. You know God have his work. He do what he would he do for us. You know he'd been doing that since he made everything. And what I feel is that if I have to stay here it's just His will. Although I don't want to stay here I just got to what I'm going to do for my time on the rest of this earth hopefully I could later be old as my grandmother out in New Orleans but I just want to make sure I do everything I can possible to help people."},{"speaker":"Kendrick","time":"00:52:50-1","content":"I really you know that's from my heart. I just want people to see me, as a youngster in my neighborhood, a lot of people feared me and I didn't realize that till I came here. I mean I actually talked to a few people that actually was acquaintances and they actually have a Psalm that I would like you all to read when you get home. I forgot who gave it to me but man it fit me so much. Psalm 31. Just read it and that was me."},{"speaker":"Marcus","time":"00:54:01-4","content":"Do you remember it?"},{"speaker":"Kendrick","time":"00:54:03-2","content":"I don't know it by heart. It's long. Psalm 31. Like I told you and my mother. I read that psalm every chance I get."},{"speaker":"Marcus","time":"00:54:11-1","content":"Alright I'll go look it up. So let me push back a little bit okay. When you say God all right. Is that a coping mechanism or is that something that you genuinely believe?"},{"speaker":"Kendrick","time":"00:54:24-6","content":"No I genuinely believe in God."},{"speaker":"Marcus","time":"00:54:27-1","content":"I'm not questioning it, I'm just pushing it."},{"speaker":"Kendrick","time":"00:54:29-7","content":"It's not coping it's just that he soothes you. He make you know that it's going to be all right. He just give me a different outlook on different things. I asked him for forgiveness. I know he forgave me for whatever. I just want, I would just want him you know to know that. My goal right now is to worship him every chance I get."},{"speaker":"Marcus","time":"00:54:53-3","content":"When you say you know what you really want to do is help people, and be known as somebody who helped people, you're talking about people who are here? The guys in reentry for example but also just your fellow person here, is that who you're talking about?"},{"speaker":"Kendrick","time":"00:55:08-5","content":"I'm going to tell you this here. A lot of people have misconceptions of certain people until they actually engage in what we're doing right now, dialogue with them. I didn't notice at one time but one of my former Imams in our thing, his name was Joe Wheyhey, he had come to me one time and was telling me, \"Man come here.\" I went on court order. I could have went home in 2005."},{"speaker":"Kendrick","time":"00:55:08-5","content":"I went on court order. I was down there for Katrina and everything. I'm a Katrina victim. So what happened was I left January 11th which is my baby birthday, and I came back December the 2nd. I wound up in Hunt's for a few days. They rescued us, brought us to Hunts for about a week, and that Friday I went to Fort Wade for like three months and then I made it back Angola."},{"speaker":"Kendrick","time":"00:55:08-5","content":"So anyway while I was down there I met a lot of young dudes who uncles and daddies or whoever I knew. The families I knew. A lot of them heard a lot of stuff about me. But they was really tripping on how much I've changed. You know they are young, they're young enough to be my kids. My kids. But they were just they'd heard all them different things."},{"speaker":"Kendrick","time":"00:55:08-5","content":"But they see everything I'm talking about is God and, \"Don't do this man. That's going to get you in trouble.\" And they was tripping because they feel like I'm going to be with that. Man that's not cool because a lot of us didn't have the opportunity to have positive role models as a kid."},{"speaker":"Kendrick","time":"00:55:08-5","content":"Although Coach Smith was my positive role model, I probably needed him there, right there, hands on. And that was my whole problem because if you're not right there I'm probably going to lose attention. I'm probably going to lose attention to it. And a lot of people need somebody that can pull them the right way."},{"speaker":"Marcus","time":"00:57:02-6","content":"Absolutely. When you look at the guys coming in for a short term, you know like the reentry guys, do you see a little bit of yourself in them? Like your old self? Your young self?"},{"speaker":"Kendrick","time":"00:57:19-4","content":"I see a lot of myself in them but I see a totally different. Some of them is more they proudly thought I was bad. Some of them cats is wild. Yeah I ain't lying. But I do see a lot of myself in a lot of them but that's why I've been wanting to help because you all going back out there."},{"speaker":"Kendrick","time":"00:57:19-4","content":"Matter of fact this room was, they had a class in this room which I don't know if it's still it's probably not held in here anymore but it was called Self-Help Therapy. It's every Sunday. It was founded by Kenly Rose. One of my childhood friends. There was a dude I actually was beefing with on the street but he was coo, my twins mama and just so happened from beefing and not hurting each other on the street we came to jail and we became best friends."},{"speaker":"Kendrick","time":"00:57:19-4","content":"But this class was started because of a brother named David Honoree. David Honoree was a good dude. He was in here for a murder charge as well. Just so happened he wound up hanging himself a couple of years ago. And to us it was like he was screaming out to be able to talk to somebody, and he couldn't express what he wanted to express to nobody, and us as his peers and friends and whatever, it's just like we wasn't catching the signs or nothing and that's the only reason why we feel like he did."},{"speaker":"Kendrick","time":"00:57:19-4","content":"So my friend Kenly started the program. It gave black, white, Hispanic, whatever and a lot of the younger dudes really was trying to reach the reentry too because a lot of them was coming because we wanted them to know, \"Man if we had the opportunity y'all have? Man! I'm going to get everything\" Because we were actually seeing some of them dudes do everything they can to mess up. Some of them want to come on the side with us instead of being in reentry."},{"speaker":"Kendrick","time":"00:57:19-4","content":"They talk about the mental they're trying to help you, they're trying to help you better yourself. Man if I had to get my GED, I could get a trade and all that, go back out there with a job with the skills to get a job, man I'd do that so fast and be able of cut time off my sentence? Man a lot of them, they just, I don't know. But the program was so good because they help a lot of dudes in it. And they was saying I forgot this little white guy's name."},{"speaker":"Kendrick","time":"00:57:19-4","content":"He used to be real quiet. He'd sit to the back of this room and he was like, \"Man, I'm not going to lie to you bro. Man I really appreciate you.\" One day he talked because you had to say your name and stuff like that. You don't have to talk about nothing you don't want to talk about, just talk. This was just somewhere where dudes could let their hair down, talk about what you want to talk about. What are you feeling? What have you been through today? You smoking weed? Be real. Don't lie. Or whatever. \"Dude like no.\""},{"speaker":"Kendrick","time":"00:57:19-4","content":"But dudes might be coping with the fact that they just left one year old, two year old kids or different stuff and we'll tell them how we had to deal with it and what you need to do."},{"speaker":"Marcus","time":"01:00:22-4","content":"I mean just communicating like you said."},{"speaker":"Kendrick","time":"01:00:24-2","content":"That's the way you really explain something."},{"speaker":"Marcus","time":"01:00:26-8","content":"So this is going to sound like an odd question because you're in prison but what is the worst part of this for you? You know and I ask that with the idea that when you first came here it might have been something different. What is the hardest part of dealing with Angola now for you?"},{"speaker":"Kendrick","time":"01:00:48-3","content":"The hardest part is, just Angola or just period?"},{"speaker":"Marcus","time":"01:00:49-6","content":"Of your experience here in prison."},{"speaker":"Kendrick","time":"01:00:54-8","content":"Leaving my family."},{"speaker":"Marcus","time":"01:00:56-8","content":"Yeah."},{"speaker":"Kendrick","time":"01:00:59-4","content":"Leaving my family. I left my family out there and I missed a lot of good years of their life. Some of them done passed away. My kids grew up without me. I already was in and out of jail through their births. I have eight grandkids now. I don't even think I've seen all of them. Face to face, I haven't seen all of them. I'd seen at least four of them at my mama's funeral but man just leaving my family."},{"speaker":"Marcus","time":"01:01:33-4","content":"Yeah sure I get that. If there is a best thing about Angola what would that be?"},{"speaker":"Kendrick","time":"01:01:38-8","content":"Believe it or not, in this prison, in this prison, in these walls there are a lot of beautiful bonded people and they let off that energy and it's really genuine from the heart."},{"speaker":"Marcus","time":"01:01:58-9","content":"Yeah right. I've met quite a few."},{"speaker":"Kendrick","time":"01:02:02-7","content":"Yeah they're genuine."},{"speaker":"Marcus","time":"01:02:04-1","content":"All right. Well than the other thing I want to know is of the various things that you've done to change your life. What are you the most proud of?"},{"speaker":"Kendrick","time":"01:02:14-1","content":"What am I the most proud of? I'm proud of my auto mechanic. I'm proud of that because it's something I can stand on. More or less I'm proud of my change and my change is like you actually have to know who I was to actually know where I'm at right now. If you'd have seen the violence and you know I could have commanded violence, I don't think like that. It's not a thinking process for me anymore."},{"speaker":"Kendrick","time":"01:02:14-1","content":"I'm a peaceful dude. I have peace. This helped me get peace within itself. Not just through religion. Just meeting a lot of beautiful people. Just talking with these people and learning and reading different stuff."},{"speaker":"Marcus","time":"01:03:13-9","content":"Sometimes people answer that question by saying that they're most proud that they have their sanity. That they kept their head on straight amidst all the craziness."},{"speaker":"Kendrick","time":"01:03:24-6","content":"Know what a lot of us say when we enter this place jail period, you've got to guard your mind because if you don't guard your mind you could lose it."},{"speaker":"Marcus","time":"01:03:34-9","content":"So if you do get pardoned, what do you see yourself doing? What's that chapter of your life going to look like?"},{"speaker":"Kendrick","time":"01:03:45-9","content":"Oh man. I'm going to spend a lot of time with my family. I think, I love, my other hobby is to cook. I know that food is the way to people's stomach and it look like it make so many people happy. And from messing with this food in Angola, I see so many to smile."},{"speaker":"Kendrick","time":"01:03:45-9","content":"I see so many from ladies asking for the recipe and wondering, \"How does this man cook like this? I can't cook it like this. I am trying to make mine taste like this.\" But that's why I'm trying to hurry up and get my GED because I want to get into cooking school. I want to get a culinary arts so I could have that and I'd probably getting a secondary part of that on the street because I want to start something there too."},{"speaker":"Marcus","time":"01:04:43-1","content":"Okay yeah. You'll have the skills. I'm going to have to try to come and find you at the rodeo and try some of that shrimp pasta."},{"speaker":"Kendrick","time":"01:04:50-4","content":"Booth 56."},{"speaker":"Marcus","time":"01:04:52-1","content":"Booth 56. Is there something, I've really enjoyed learning about you and talking with you, I really appreciate you sitting with me."}]}