{"name":"","transcript":[{"content":"Kennedy Thompson REDACTIONS FINAL"},{"speaker":"Kennedy","time":"00:00:00-0","content":"My name is Kennedy Wayne Thompson I've been in prison 35 years I'm 54 years old I was 18 at the time of the crime I was 19 at the time of the arrest second degree murder and armed robbery that's what I was convicted of."},{"speaker":"Marcus","time":"00:00:22-0","content":"Ok and where was this."},{"speaker":"Kennedy","time":"00:00:24-4","content":"Baton Rouge, Louisiana."},{"speaker":"Marcus","time":"00:00:25-7","content":"Ok and is that where you grew up."},{"speaker":"Kennedy","time":"00:00:27-2","content":"That's where I grew up."},{"speaker":"Marcus","time":"00:00:28-0","content":"Tell me a little bit about the folks who raised you."},{"speaker":"Kennedy","time":"00:00:30-8","content":"Well my mother and my father they was real old fashioned good people. I was raised in a real tight knitted family and we went to church every Sunday we went to family reunions went to school just about had everything a kid could want. I've never been in trouble before this is my first arrest."},{"speaker":"Marcus","time":"00:00:59-7","content":"Okay do you have siblings?"},{"speaker":"Kennedy","time":"00:01:02-2","content":"I had it was 8 of us but its 3 of us have died since I've been in prison matter of fact one my baby brother just died mother's day he was the baby we was real close."},{"speaker":"Marcus","time":"00:01:02-2","content":"Okay I'm sorry."},{"speaker":"Kennedy","time":"00:01:15-9","content":"He died mother's day of last year I was waiting on a visit from him that day too."},{"speaker":"Marcus","time":"00:01:20-8","content":"Oh wow."},{"speaker":"Kennedy","time":"00:01:22-0","content":"So that's disturbing."},{"speaker":"Marcus","time":"00:01:23-4","content":"What happened to him?"},{"speaker":"Kennedy","time":"00:01:24-5","content":"He Od-eed."},{"speaker":"Marcus","time":"00:01:25-5","content":"Oh okay."},{"speaker":"Kennedy","time":"00:01:26-4","content":"He Od-eed smoking crack cocaine."},{"speaker":"Marcus","time":"00:01:28-4","content":"Okay."},{"speaker":"Kennedy","time":"00:01:29-2","content":"He Od-eed and I think that was one of the hardest things that's the only time I ever really thought about taking my own life after his death and I lost my fiancé in 2012 and we had grew up from little kids."},{"speaker":"Marcus","time":"00:01:44-4","content":"Oh wow I'm so sorry."},{"speaker":"Kennedy","time":"00:01:46-9","content":"Yeah it was rough and my sister lost her and my brother and my dad I've lost all of them since I been in prison my mother still living she's 84."},{"speaker":"Marcus","time":"00:01:58-6","content":"Yeah I think it must be especially difficult to lose family members when you're in here you can't really participate even in the grieving you have to grieve alone."},{"speaker":"Kennedy","time":"00:02:09-3","content":"It is real hard especially if you were close with them me and my little brother was real close I basically raised him cause we was the babies I'm 6 years older than him and when I left he was 13 but me and him was real close."},{"speaker":"Marcus","time":"00:02:27-7","content":"Right do you think he his overdosing was triggered in anyway by his visit with you?"},{"speaker":"Kennedy","time":"00:02:35-8","content":"Well he used to always tell me being in prison and leaving him at a young age like that that did something to his life it really made him have something he just he knew this was my first time ever being in trouble and he seen so many dudes come home from so many different things and he figure I just never had a chance so it took a bit make him angry a lot at the system."},{"speaker":"Marcus","time":"00:03:05-3","content":"Sure."},{"speaker":"Kennedy","time":"00:03:06-1","content":"My baby brother it made him angry a lot with the system he had been in trouble multiple times after he started getting in trouble and I used to always tell him he was a 7 time convicted felon and he kept getting opportunities and he know this was my first arrest."},{"speaker":"Marcus","time":"00:03:25-3","content":"Right. And here you are without another an opportunity for parole"},{"speaker":"Kennedy","time":"00:03:29-5","content":"Exactly after all these years and I don't even have a juvenile record no ticket nothing first arrest don't have no criminal background at all its clean so that took a lot on my little brother that really made him angry."},{"speaker":"Marcus","time":"00:03:45-9","content":"Sure I understand I really do I'm sorry to hear about your fiancé passing tell me a little bit about her?"},{"speaker":"Kennedy","time":"00:03:54-0","content":"Well she came back into my life in 2009 she had moved out of state moved to Portland Oregon after she graduated and got her degree she moved on and stayed gone 13 years she got back in touch with me when she came back and started coming to visit."},{"speaker":"Kennedy","time":"00:03:54-0","content":"She started she wanted me since we had we been known each other since children and we got back together and she started gathering all my paperwork she hired me a lawyer hired me an investigator things like this and that's when things started opening up that's when we started discovering new information with my case."},{"speaker":"Marcus","time":"00:04:39-2","content":"Do you have a codefendant in the case?"},{"speaker":"Kennedy","time":"00:04:41-2","content":"I had one he went home he made parole."},{"speaker":"Kennedy","time":"00:04:44-2","content":"He had armed robbery."},{"speaker":"Marcus","time":"00:04:46-1","content":"Oh I see."},{"speaker":"Kennedy","time":"00:04:47-0","content":"He went home in 2014. He had 99 years but he made parole in 2014."},{"speaker":" Marcus","time":"00:04:55-2","content":"Ok so coming up you've got a lot of siblings mum and dad in the house was their marriage good?"},{"speaker":"Kennedy","time":"00:05:03-7","content":"Oh yeah really good every now and then they used to have arguments and fights when I was a kid."},{"speaker":" Marcus","time":"00:05:13-1","content":"So were those fights physical?"},{"speaker":"Kennedy","time":"00:05:17-1","content":"Sometimes not too much but sometimes."},{"speaker":" Marcus","time":"00:05:21-1","content":"Was there much fighting in the house in general?"},{"speaker":"Kennedy","time":"00:05:23-8","content":"No."},{"speaker":" Marcus","time":"00:05:24-2","content":"Between siblings and parents and so forth?"},{"speaker":"Kennedy","time":"00:05:26-8","content":"No."},{"speaker":" Marcus","time":"00:05:27-7","content":"Ok what about fighting outside the house did you find yourself getting in fights coming up?"},{"speaker":"Kennedy","time":"00:05:35-3","content":"Not really. At school every now and then you might have a fight I played basketball a lot."},{"speaker":" Marcus","time":"00:05:42-2","content":"Yeah how was school for you?"},{"speaker":"Kennedy","time":"00:05:44-5","content":"Well I really enjoyed school because I loved basketball but I end up not finishing school because my girlfriend got pregnant when we was in 10th grade really 9th grade in 9th grade I got her she got pregnant so I didn't have to quit school because but I end up getting a summer job and just kept the summer job and didn't go back to school."},{"speaker":" Marcus","time":"00:06:09-2","content":"I see."},{"speaker":"Kennedy","time":"00:06:09-7","content":"But I didn't have to do that because my mother and father and her mother, they understood that we was just so young and made babies too early."},{"speaker":"Marcus","time":"00:06:17-9","content":"Sure so do you have one child?"},{"speaker":"Kennedy","time":"00:06:20-9","content":"Two boys."},{"speaker":" Marcus","time":"00:06:21-5","content":"Tell me about them."},{"speaker":"Kennedy","time":"00:06:22-9","content":"Well ones 37 and ones 36 two boys when I come in prison one was 16 months old one was 6 weeks old."},{"speaker":" Marcus","time":"00:06:32-8","content":"Right"},{"speaker":"Kennedy","time":"00:06:33-6","content":"And by now they got 3 children each I got 6 grandkids matter of fact my oldest son he started too early he had his first kid when he was 14 he 37 now so my oldest grandson will be 22 in December so it's a generation but I see the youngest ones, but my sons they came up in an environment with young mothers me not being there and they mothers was young so they end up getting in a little trouble but not nothing really serious both of them they been in trouble before but good thing they have never really been in nothing serious."},{"speaker":" Marcus","time":"00:07:14-6","content":"Ok any of them end up here?"},{"speaker":"Kennedy","time":"00:07:16-5","content":"Not here but they been to the other little."},{"speaker":" Marcus","time":"00:07:18-8","content":"Sure."},{"speaker":"Kennedy","time":"00:07:19-2","content":"Places."},{"speaker":" Marcus","time":"00:07:21-0","content":"Sure did you grow in the city?"},{"speaker":"Kennedy","time":"00:07:23-8","content":"Of Baton Rouge."},{"speaker":" Marcus","time":"00:07:24-7","content":"In Baton Rouge."},{"speaker":"Kennedy","time":"00:07:25-6","content":"In Baton Rouge."},{"speaker":" Marcus","time":"00:07:27-2","content":"What was your neighborhood like?"},{"speaker":"Kennedy","time":"00:07:29-7","content":"Well I would say it was kind of like well it was a poor neighborhood I mean it was a ghetto a ghetto but everybody basically knew each other I'm saying you grew up right there and all the kids in the neighborhood they basically played basketball together and football and stuff like that and everybody family basically knew each other."},{"speaker":" Marcus","time":"00:07:56-7","content":"Ok did you feel safe?"},{"speaker":"Kennedy","time":"00:07:59-5","content":"I would say I felt safe."},{"speaker":" Marcus","time":"00:08:01-0","content":"Ok what about friends did you have a tight group of friends or was it just folks in the neighborhood anybody you still think about when you look back on those days."},{"speaker":"Kennedy","time":"00:08:16-3","content":"Matter of fact I got a friend at I'm going to probably be trying to get in touch with in a minute I seen his name in the newspaper on a DWI and that's the only way that I probably get in touch with him because his address was in there. So I was going to tell him that I was going to be at the rodeo we was pretty tight when we was going to school but since I been in prison I've never heard nothing from him I never really tried to contact him my little brother used to see him but I heard his mother he only had one brother and his brother died and his mother died so really just him out there now so I was thinking about writing him and telling him to come to the rodeo because I'll be at the rodeo this year."},{"speaker":" Marcus","time":"00:09:00-7","content":"Right do you get visits up here still after 35 years?"},{"speaker":"Kennedy","time":"00:09:04-9","content":"I still get visits I see my mother twice this year I got a sister that come she come like once a month one of my sisters that's one of my daddy daughters from another wife that was me and her was always kind of tight so she come like once a month and bring my niece but I used to go visit kind of regular when I had girlfriends."},{"speaker":" Marcus","time":"00:09:31-1","content":"Right."},{"speaker":"Kennedy","time":"00:09:31-1","content":"I used to go kind of regular."},{"speaker":" Marcus","time":"00:09:33-7","content":"You were just so young when you come here."},{"speaker":"Kennedy","time":"00:09:36-5","content":"Yeah I was."},{"speaker":" Marcus","time":"00:09:39-5","content":"I was talking to somebody who similarly came here very young and he was talking about the way you hold onto old memories do you have a do you have a particularly good memory that you go to at times when you need to just kind of focus on something positive."},{"speaker":"Kennedy","time":"00:09:55-7","content":"Well."},{"speaker":" Marcus","time":"00:09:58-0","content":"From your early years."},{"speaker":"Kennedy","time":"00:09:59-3","content":"Me and my little brother most of them he gone be in just about all that my little brother me and my little brother was real close and like I said his death really did something to me. I had been talking to him just about then I was waiting on a visit from him and man it was real close but coming up we was real close. I can think about a lot of things that we did together me and my little brother."},{"speaker":"Kennedy","time":"00:09:59-3","content":"I'm six years older than him so we was young we used to go to the show together every Sunday the theaters every Sunday we used to go like 50 cent then so we used to it was like round the corner from where we live all the old movies we know all the movies that they be showing now we seen them in the 70s when they came out so we used talk about it laugh about that a lot me and my little brother."},{"speaker":" Marcus","time":"00:10:54-8","content":"Sure."},{"speaker":"Kennedy","time":"00:10:55-2","content":"About those movies."},{"speaker":" Marcus","time":"00:10:56-6","content":"Sure so were you ever kicked out of school before you stopped going?"},{"speaker":"Kennedy","time":"00:11:07-9","content":"Kicked out? Maybe suspended. Yeah. May be suspended for maybe fighting or something 2 3 days suspended not never expelled."},{"speaker":" Marcus","time":"00:11:16-9","content":"Ok and what was you're that summer job that you first started what were you doing."},{"speaker":"Kennedy","time":"00:11:22-3","content":"I was working at green oaks cemetery in Baton Rouge it's a real large cemetery it's right there in front of town mall. it's real big out there it's like a park got streets in it and stuff like that modern lamps and ponds its real large and that was my job I started cutting grass, what a riding lawn I was like with the pushing one"},{"speaker":" Marcus","time":"00:11:52-8","content":"Sure."},{"speaker":"Kennedy","time":"00:11:54-0","content":"And I end up not going back to school when it was time to go back even though I should have went back."},{"speaker":" Marcus","time":"00:12:03-4","content":"Yeah no I understand that. So you mentioned earlier that this was your first arrest. Did you ever feel the need to carry a firearm?"},{"speaker":"Kennedy","time":"00:12:13-5","content":"Well back then it was like when you go to these schools back then they had all these territories far as like they don't want you over here going to these classes this and that because you don't and I used to see a lot of dudes get jumped on like maybe 10 dudes might jump on a dude because he from somewhere else what"},{"speaker":"Kennedy","time":"00:12:13-5","content":"I'm saying so only thing what made me felt like I wanted a firearm back then cause they used to fight a lot then but they would fight fair like I said it was so many of them jumping on you so that was the only reason why I felt like I wanted one back then for when I used to be going to those games stuff like that with my girlfriend and I didn't want no ten dudes jumping on me cause I wasn't from over that way."},{"speaker":" Marcus","time":"00:13:09-4","content":"Yeah."},{"speaker":"Kennedy","time":"00:13:10-7","content":"That was the only reason."},{"speaker":" Marcus","time":"00:13:11-1","content":"Did you carry a firearm with you?"},{"speaker":"Kennedy","time":"00:13:13-2","content":"When I got locked up?"},{"speaker":"Marcus","time":"00:13:14-4","content":"Yeah I mean around when you were around 18 did you routinely carry a firearm."},{"speaker":"Kennedy","time":"00:13:19-0","content":"Yeah basically."},{"speaker":" Marcus","time":"00:13:23-4","content":"So I don't want to get too far into the details of the offense itself."},{"speaker":"Kennedy","time":"00:13:29-1","content":"Okay but you can."},{"speaker":" Marcus","time":"00:13:30-4","content":"Well it its fine I mean mainly because this is about the story of your life and not the one even that."},{"speaker":"Kennedy","time":"00:13:38-8","content":"Put me in here."},{"speaker":" Marcus","time":"00:13:39-4","content":"Should define you right."},{"speaker":"Kennedy","time":"00:13:40-1","content":"Exactly."},{"speaker":" Marcus","time":"00:13:40-8","content":"So but it would be hard for me to be doing a life history interview with you and not have some reference to it."},{"speaker":"Kennedy","time":"00:13:47-7","content":"Exactly."},{"speaker":" Marcus","time":"00:13:48-0","content":"Can you briefly summarize what happened?"},{"speaker":"Kennedy","time":"00:13:50-1","content":"Well what happened was I lost my job and from not going to work that morning that late. I had two small kids. I had my own apartment on the next street from my mother and my father and I lost my job and this this man that I had been knowing all my life name was Mr. Joe."},{"speaker":"Kennedy","time":"00:13:50-1","content":"Mr. Joe used to sell lawn mowers and weed eaters and things like that so I had a lawnmower that I wanted to sold Mr. Joe and when he got ready to pay me I seen he had a lot of money right but I didn't do him nothing or think about nothing at that time but I seen it. So this was like 6 months later."},{"speaker":"Kennedy","time":"00:13:50-1","content":"6 months later I didn't have no money and needed felt like I wanted to get some money and I told my partner I said man Mr. Joe he carry a lot of money he said yeah man but Mr. Joe carry guns because he carried guns I said well we gone have to sneak up behind him and hit him with a stick and take his wallet and take his gun and that's what we did. We snuck up behind him hit him with a stick took his wallet took his gun and ran off. And that's the nature of the crime that's what happened."},{"speaker":"Marcus","time":"00:15:20-8","content":"Sure and were you arrested fairly shortly after that?"},{"speaker":"Kennedy","time":"00:15:25-4","content":"A month later."},{"speaker":"Marcus","time":"00:15:26-4","content":"A month, were drugs and alcohol part a big part of your life coming up?"},{"speaker":"Kennedy","time":"00:15:31-6","content":"No I've never used to smoke a little marijuana that's all I did when I was a kid."},{"speaker":" Marcus","time":"00:15:38-3","content":"So you have two kids you're trying to make it with cutting grass and jobs here and there then this happens and it defines the rest of your life and what I want to ask you is how do you think your life would have unfolded if this didn't happen let's say you didn't' lost your job or you didn't decide to do this how do you picture those months years turning out I mean I'm sure you must imagine like what if this didn't happen."},{"speaker":"Kennedy","time":"00:16:07-3","content":"Well I could imagine it like this because I was back then the city parish was paying you pretty good and I had applications in for the city parish after I got arrested it had came in where I got the job."},{"speaker":" Marcus","time":"00:16:22-0","content":"Wow."},{"speaker":"Kennedy","time":"00:16:23-5","content":"And so I would have been good like I said I didn't have no problems cause like I said it's my first arrest so for stealing and breaking in houses I never did nothing else first crime I ever committed cause that the way I was raised I wasn't raised like that I actually just made a foolish move this particular day even when I seen the money the first time when I sold him the lawnmower it wasn't a six months later that this thought came to mind. So I don't have a problem because I wasn't raised the way to first be stealing or robbing nobody that's why I never been in trouble you know what I'm saying. Sometimes you might say well I got away with a lot and just never got caught but it wasn't that type of situation in my case"},{"speaker":" Marcus","time":"00:17:17-6","content":"Okay sure. So I want to change direction s here a little bit and talk about life here but before we move on is there something else about your first 18 years of your life that's important to understanding who you are now that we didn't talk about."},{"speaker":"Kennedy","time":"00:17:39-2","content":"Well I was 18 I was like the average youngsters what I mean you don't have no wisdom at 18 I'm saying 18 you just basically go. I'm saying and that's how I got my other son I'm saying so I just you just go you know you don't have no sense of well this is my girl. She is not going be messed up about do this too much."},{"speaker":"Kennedy","time":"00:17:39-2","content":"She barely laid but its cheating you know what I'm saying you wouldn't want here to do that to you so you don't understand that when you 18 but when you get older though you do you're like cheating is cheating I'm saying I don't want to do it I don't want you to do it what I'm saying it don't make it right where I can do it and you can't so you gone understand that when you get older but when you 18 you don't know about that you know what I'm saying."},{"speaker":" Marcus","time":"00:18:33-0","content":"Right more impulsive."},{"speaker":"Kennedy","time":"00:18:35-2","content":"That's right you more impulsive."},{"speaker":" Marcus","time":"00:18:38-4","content":"Sure so you spent some time in east Baton Rouge parish jail or Baton Rouge parish jail."},{"speaker":"Kennedy","time":"00:18:45-3","content":"That's what it was east Baton Rouge parish."},{"speaker":" Marcus","time":"00:18:47-7","content":"And again you're so young I mean how was that experience for you first time in jail."},{"speaker":"Kennedy","time":"00:18:55-2","content":"Well when I first went to jail they put us they had us all in age group together like first timers and maximum 17-21 so I was basically round a lot of young dudes but I had never been in jail before but it wasn't I'm around all these youngsters and I was I was pretty strong. It wasn't like I was scared or nothing like that what I mean."},{"speaker":" Marcus","time":"00:19:24-6","content":"Sure do you remember the bus ride from hunt to here?"},{"speaker":"Kennedy","time":"00:19:29-8","content":"Yeah I remember it real good."},{"speaker":" Marcus","time":"00:19:31-1","content":"Yeah tell me about how was that what were you thinking about."},{"speaker":"Kennedy","time":"00:19:34-6","content":"Well always the guy that drove us here he still work here matter of fact he still work here he been here 47 years and I always see him and I always tell him about how he was kind of like wheeling us the youngsters on the bus on the way up here about dudes gone get you this and that stuff like that and I was wheeling him back what I mean I was like I wouldn't I wasn't afraid like that."},{"speaker":"Kennedy","time":"00:19:34-6","content":"I'm saying it's like you don't know certain things but just being afraid I wasn't afraid like that and I was just the unknown what I mean but I had a brother had been to prison so I knew a lot about prison even though I had never been in trouble cause like my brother came home when I was 16 from up here."},{"speaker":"Kennedy","time":"00:19:34-6","content":"And I used to hang with him a lot so I knew a lot about prison and I had never been to jail and he was here then my brother had come back to prison so he was already here he had came back so I knew a lot about prison in a way"},{"speaker":" Marcus","time":"00:20:50-6","content":"Right it was a dirt road in those days wasn't it."},{"speaker":"Kennedy","time":"00:20:52-9","content":"It was it was a dirt road a lot of things the man was saying on the bus it was true."},{"speaker":" Marcus","time":"00:21:01-0","content":"What was he saying?"},{"speaker":"Kennedy","time":"00:21:01-3","content":"Because most of those guys didn't make it what I mean a lot of them that was on the bus they didn't make it they end up getting raped and doing a lot of things that they didn't want to do what I mean so he was right the one on the bus the man that was driving the bus and I always see him and mess with him about that even today that was 35 years ago"},{"speaker":" Marcus","time":"00:21:28-0","content":"Sure so do they your first few months here were you working in the field."},{"speaker":"Kennedy","time":"00:21:34-4","content":"Yeah I was working in the field and during that time we was really working what I mean but like I said by me having a job on the street and it's basically like same kind of outside work I never really had a problem working always been in shape kept myself up I was an athlete really basketball for years so I always I never smoked cigarettes I never did hard drugs or nothing I always worked out even when I was on the street."},{"speaker":"Marcus","time":"00:22:07-0","content":"Right."},{"speaker":"Kennedy","time":"00:22:07-9","content":"So I was nothing physically was never hard for me."},{"speaker":"Marcus","time":"00:22:13-9","content":"Right so said that a lot of the guys who came in on the bus with you didn't make it how are they doing now."},{"speaker":"Kennedy","time":"00:22:24-4","content":"Well a lot of them gone home. A lot of them gone home or maybe another prison somewhere what I mean but I don't see too many of them maybe its 1 or 2 of them we rode the bus together that I still see."},{"speaker":"Marcus","time":"00:22:42-9","content":"Sure so one of the reasons that we're talking with you is that. You're again you fit that group of very young folks who came here to serve a very long time and you're also a trustee and you've been here 35 years and you mentioned before we started filming that you became a trustee last year?"},{"speaker":"Kennedy","time":"00:23:10-0","content":"Yeah class B trustee I was class C the year before"},{"speaker":"Marcus","time":"00:23:14-1","content":"Okay."},{"speaker":"Kennedy","time":"00:23:14-8","content":"Maybe I been a trustee a couple years but I don't really consider c cause c is like almost like big scrap but you a trustee."},{"speaker":" Marcus","time":"00:23:25-1","content":"Okay and so had you been interested in being a trustee before that in all these other years that passed."},{"speaker":"Kennedy","time":"00:23:32-0","content":"Well I was but I couldn't really make it then because I was still getting in a lot of trouble."},{"speaker":" Marcus","time":"00:23:40-1","content":"Okay yeah tell them a little bit about that?"},{"speaker":"Kennedy","time":"00:23:41-3","content":"For a lot of years for a lot of years I was getting in trouble going to camp j for- they was picking me up a lot they was picking me a lot saying that I was basically selling weed I'm saying basically hats what it was always about all the years but they all know me the prison all the top wardens here and stuff."},{"speaker":" Marcus","time":"00:24:11-9","content":"Yeah you've been here 35 years."},{"speaker":"Kennedy","time":"00:24:13-8","content":"They all know me they know me by my name my nickname they know me real well which is a good thing because they know what I'm capable of doing and what I'm capable of not doing you know what I mean?"},{"speaker":"Marcus","time":"00:24:23-9","content":"So all these years you, what's your nickname by the way?"},{"speaker":"Kennedy","time":"00:24:25-9","content":"Skeebo."},{"speaker":"Marcus","time":"00:24:26-8","content":"Skeebo?"},{"speaker":"Kennedy","time":"00:24:27-5","content":"Yeah Skeebo."},{"speaker":"Marcus","time":"00:24:28-8","content":"So all these years the disciplinary issues have been about selling drugs?"},{"speaker":"Kennedy","time":"00:24:35-5","content":"Yeah weed."},{"speaker":"Marcus","time":"00:24:36-1","content":"Okay, so why did you stop doing that?"},{"speaker":"Kennedy","time":"00:24:36-1","content":"Well like I said I got older and I need to get home I need to put myself in a position to get with my family and my grandkids and my mother and my mother is 84 what I mean and that's a blessing that's my biggest blessing is her still be breathing at 84."},{"speaker":"Marcus","time":"00:24:58-9","content":"Right."},{"speaker":"Kennedy","time":"00:24:59-4","content":"So I'm it's like I'm trying everything I can take it to her even more so since my little brother died he was her baby and they was real close and it's like nothing else matter that's my passion make it to my mother when I left the streets she was like 49 you know what I mean."},{"speaker":"Kennedy","time":"00:24:59-4","content":"So in all my younger years here I just I wasted too many years here with the foolishness even though I knew that maybe one day or someday they come with eligibility for lifers I knew it was all over other places in the world but I didn't have no they was always talking about it and just nothing ever when I came to prison they was talking about parole for lifers and they still talking about it you see what I'm saying so for so many years it was like well when they do it they'll do it and then we'll change when they do something"},{"speaker":"Marcus","time":"00:26:05-3","content":"Well I imagine that it seemed pretty hopeless when you first came here."},{"speaker":"Kennedy","time":"00:26:09-6","content":"Exactly."},{"speaker":"Marcus","time":"00:26:10-2","content":"Yeah now there's a little bit of hope."},{"speaker":"Kennedy","time":"00:26:11-9","content":"It is."},{"speaker":"Marcus","time":"00:26:12-5","content":"Maybe because of what's happened with the juveniles."},{"speaker":"Kennedy","time":"00:26:14-4","content":"It is it's more people going home now than ever even though it's been a lot of they haven't ever really did nothing for what you call violent offenders they been letting a lot of what I mean it this is really what Angola the mass is violent offender."},{"speaker":"Marcus","time":"00:26:39-3","content":"Yeah which is also a misleading way to characterize things the violent offender."},{"speaker":"Kennedy","time":"00:26:47-4","content":"Yeah exactly."},{"speaker":"Marcus","time":"00:26:48-1","content":"But when you so we all look back and have some regrets in our lives and think oh I would have done this differently since your time in prison if you could go back and visit the young the 18 19 20 year old Kennedy what advice would you give him."},{"speaker":"Kennedy","time":"00:27:10-6","content":"Well I would definitely tell him that hey man stay free don't violate the law."},{"speaker":"Marcus","time":"00:27:17-6","content":"Right but I mean after you'd been incarcerated what would advise would you give the 20 year old?"},{"speaker":"Kennedy","time":"00:27:23-1","content":"Right now."},{"speaker":"Marcus","time":"00:27:23-4","content":"Yeah what advice would you give him?"},{"speaker":"Kennedy","time":"00:27:25-8","content":"That's coming to prison or out there."},{"speaker":"Marcus","time":"00:27:27-5","content":"Well I'm thinking if you could go back and look at yourself as a 20 year old man what advice would you give him?"},{"speaker":"Kennedy","time":"00:27:34-6","content":"And he free?"},{"speaker":"Marcus","time":"00:27:35-4","content":"No."},{"speaker":"Kennedy","time":"00:27:35-8","content":"He in prison."},{"speaker":"Marcus","time":"00:27:36-4","content":"He's here at Angola."},{"speaker":"Kennedy","time":"00:27:37-4","content":"Oh man I do that all the time I'm a basketball coach here so all I do is deal with young dudes."},{"speaker":"Marcus","time":"00:27:44-3","content":"So what advice do you give them?"},{"speaker":"Kennedy","time":"00:27:46-3","content":"Oh I tell them man I say you need to stay in the law library you need to keep yourself don't smoke the mojo what I mean keep yourself physically strong spiritually strong you got to pray because we all need god you heard me you got to pray each and every day to keep the flesh to keep the holy spirit strong in you because your flesh go running wild that's what I tell them and if you let your flesh just guide you then every day you gone be wanting to smoke that mojo."},{"speaker":"Kennedy","time":"00:27:46-3","content":"And you ain't gone want to do nothing that's what I tell them but you have to stay strong you got to pray can't do it by yourself that's what I tell them what I'm saying you can't do it by yourself a lot of things you think you can do by yourself cause you just not strong enough cause you not stronger than the devil and the devil he at work all the time see what I'm saying so that's basically what I tell youngsters all the time I know that you want to do it but you can't do it by yourself that's what I that'd be my advice to them all the time"},{"speaker":"Marcus","time":"00:28:51-2","content":"Yeah we all age differently how are you different from the man you were when you came here?"},{"speaker":"Kennedy","time":"00:28:58-7","content":"Oh I'm much different I'm obviously I'm older 54 with 6 grandkids oldest grandkid is 22 in December so I been a grandpa a long time I was a grandpa at 32 see what I'm saying so it's obvious that I was a kid when I come to jail. You know what I mean."},{"speaker":"Kennedy","time":"00:28:58-7","content":"I'm probably a great grandfather now my oldest grandson he probably got some kids now he's in Houston I haven't been talking to him but I'm sure he got children now so that would make me a great grandpa so it's just things where that I'm not the same person because of my age wisdom and you have to seek wisdom what I mean if you live long enough what I mean like I said I didn't never have no bad habits that I really had to change."},{"speaker":"Kennedy","time":"00:28:58-7","content":"I just made a mistake one day, what I'm saying, so I guess that really credit to my family my father and my mother they was good parents and they had never been in trouble they was good people so it just me getting caught in prison doing something anything else I would have never been in prison I'd have got probation or something whatever what I mean"},{"speaker":"Marcus","time":"00:30:18-0","content":"Yeah no I get it yes."},{"speaker":"Kennedy","time":"00:30:20-4","content":"Cause I had never been in trouble I mean so anything else I wouldn't never been in prison this far."},{"speaker":"Marcus","time":"00:30:28-0","content":"Yeah can you describe your typical day here can you walk me through the routine of your day like what's your day like tomorrow when you get up in the morning to when you go to bed."},{"speaker":"Kennedy","time":"00:30:38-6","content":"Tomorrow is Friday? Well tomorrow probably ain't gone be too much going on with the rodeo going on we should be off."},{"speaker":"Marcus","time":"00:30:47-5","content":"Okay, on a typical day what do you do?"},{"speaker":"Kennedy","time":"00:30:49-0","content":"Well I get up and go to work I work in line 15a that's the hardest working line in the prison and you are a trustee."},{"speaker":"Marcus","time":"00:30:55-8","content":"And what do you do there."},{"speaker":"Kennedy","time":"00:30:57-1","content":"It's a weed eater gang. They go all over the prison weed eating it's like maybe 15 of us go on a bus yellow bus that rides all around Angola"},{"speaker":"Marcus","time":"00:31:10-5","content":"Okay and because you're a trustee you're allowed to be out is that what you were saying"},{"speaker":"Kennedy","time":"00:31:15-2","content":"Yeah basically I'm a trustee so we go places that."},{"speaker":"Marcus","time":"00:31:20-0","content":"You're not supervised all the time is that what it is?"},{"speaker":"Kennedy","time":"00:31:24-0","content":"Yeah not supervised all the time you can we have one officer with us that don't have a gun let's just say that."},{"speaker":"Marcus","time":"00:31:32-0","content":"Right."},{"speaker":"Kennedy","time":"00:31:33-0","content":"One officer that don't have a gun."},{"speaker":"Marcus","time":"00:31:34-4","content":"So you do weed eating all around the prison."},{"speaker":"Kennedy","time":"00:31:34-4","content":"All around the prison up even round where the free folks live at in b land and stuff like that they basically they trust you when they put you around they people, you know what I mean."},{"speaker":"Marcus","time":"00:31:48-2","content":"Yes."},{"speaker":"Kennedy","time":"00:31:48-4","content":"Key and everything like that they trust you."},{"speaker":"Marcus","time":"00:31:52-6","content":"Right and so how long do you do that for every day?"},{"speaker":"Kennedy","time":"00:31:56-9","content":"We go to work at 7 now we gone be getting off at 3 we was getting off at 2."},{"speaker":"Marcus","time":"00:32:02-4","content":"Okay rain or shine?"},{"speaker":"Kennedy","time":"00:32:03-5","content":"Yeah rain or shine that's the thing about it you might sit there they wait till you start raining start raining they put you on the bus till it stop raining and then you go back to work. That's basically my day if I have a little time to work out for 30 40 minutes I go up and give me a little workout come in and shower and probably be sleep kind of early cause we kind of tired working out there 15a. You cut a lot of grass"},{"speaker":"Marcus","time":"00:32:34-4","content":"Oh I'm sure."},{"speaker":"Kennedy","time":"00:32:35-4","content":"Yeah you cut a lot of grass but it's all that's probably going to change though maybe next month I get a job change get something that probably not so demanding but physically all day."},{"speaker":"Marcus","time":"00:32:48-9","content":"Yeah what job would you like to have?"},{"speaker":"Kennedy","time":"00:32:53-8","content":"Well I really want to drive trucks I want to get that skill because my nephew got a trucking company out there and maybe if I go home I could drive with him."},{"speaker":"Marcus","time":"00:33:10-2","content":"Can you tell me a little bit about some of the educational opportunities and clubs and organizations and things that you've done since you've been here?"},{"speaker":"Kennedy","time":"00:33:17-4","content":"Basically I have a the 100 hours I have the JCs I have the Malachi dads I have the higher ground I finished all them."},{"speaker":"Marcus","time":"00:33:36-0","content":"Did you your GED?"},{"speaker":"Kennedy","time":"00:33:36-9","content":"No I never finished I never got it I've been in school a few times got there but I was still getting in trouble then but I finally go back and get it that's about the only thing I don't have."},{"speaker":"Marcus","time":"00:33:48-1","content":"Okay alright what about any vocational certificates"},{"speaker":"Kennedy","time":"00:33:48-1","content":"That's what I'm saying now you have to"},{"speaker":"Marcus","time":"00:33:54-6","content":"You have to get the GED first."},{"speaker":"Kennedy","time":"00:33:55-7","content":"You have to get the GED first but like by me being a trustee they'll give me a I can go get a second job to learn how to drive machines and all that so it'll be like on the job training you see what I'm saying I can get those jobs now that I'm a trustee"},{"speaker":"Marcus","time":"00:34:15-4","content":"So its 35 years later when you look back on the crime and the victim and the victim's family how do you feel after 35 years."},{"speaker":"Kennedy","time":"00:34:29-3","content":"I feel bad yea heard me I feel extremely bad cause and I just it was because in my heart I knew that I wasn't like that I shouldn't have done it was wrong what I mean that could have been my grandfather what I'm saying or my great uncle something like that I mean but like I said when you kind of young you don't see these things but I'm older now and I understand that at my age I would have never done nothing like that."},{"speaker":"Marcus","time":"00:35:02-4","content":"Of course."},{"speaker":"Kennedy","time":"00:35:04-7","content":"What I'm saying and it hurt my mother and my father because I wasn't raised like that what I'm saying."},{"speaker":"Marcus","time":"00:35:09-4","content":"Right I want to ask you about that too so when something like this happens there's the victim and the victim's family but there's also another family which is yours and a community what can you tell me a little bit about the impact that this had on your family over the years."},{"speaker":"Kennedy","time":"00:35:26-4","content":"Oh it was rough it was rough because like I said I wasn't that kind of child I'm saying I was 18 I was but I had never been involved in nothing like that so it was like he just made a bad choice one day I mean so it surprised the community it surprised it hurt my mother real bad she almost had a heart she had a stroke when that happened when I first went to jail she had a stroke and so that really destroyed her."},{"speaker":"Kennedy","time":"00:35:26-4","content":"Then I lost my dad after I had been in jail maybe like a year he got killed what I mean I had been in jail maybe 18 months and my dad got killed so that was that was something all that was it was just hard on me and yeah that was hard on me he got killed right around the same time that I was getting ready to go to trial and my mother they was trying to get me to plead guilty to manslaughter which it carry but 21 years at the time it was drugged armed robbery let me plead guilty to manslaughter but I was hard headed I didn't want to listen to my mom."},{"speaker":"Kennedy","time":"00:35:26-4","content":"And she was going through things my dad had just got killed and I went to trial but I say you live and learn what I'm saying you live and learn when you don't listen to your parents because they know more than"},{"speaker":"Marcus","time":"00:37:01-3","content":"Yep over the years who do you thinks had the toughest time dealing with it all in your family"},{"speaker":"Kennedy","time":"00:37:12-4","content":"It's got to be my mother or my little brother my mother and my little brother my little brother before he died it was rough for him real rough he used to cry man he used to cry a lot about that I never did come back home."},{"speaker":"Marcus","time":"00:37:32-1","content":"Yeah I think that's very difficult."},{"speaker":"Kennedy","time":"00:37:33-6","content":"Yeah I never did come back home and like I said I had moved on the next street. And I left my mother and my dad and my little brother was still around so he used to come round my house every day what I mean he missed me so much"},{"speaker":"Marcus","time":"00:37:48-8","content":"Sure."},{"speaker":"Kennedy","time":"00:37:49-1","content":"With me leaving."},{"speaker":"Marcus","time":"00:37:51-2","content":"What's his name?"},{"speaker":"Kennedy","time":"00:37:51-7","content":"His name was Latrell Thompson his name was Latrell."},{"speaker":"Marcus","time":"00:37:58-3","content":"What's your mother's name?"},{"speaker":"Kennedy","time":"00:37:59-3","content":"Her name is Loyce yeah her name is Loyce Hudson and she got married again in the 90s when she married remarried a soldier and yeah soldier that's in the army 30 years her husband he was 30 year military man."},{"speaker":"Marcus","time":"00:38:16-3","content":"Ok are they still together?"},{"speaker":"Kennedy","time":"00:38:17-5","content":"They still together he is 85, she is 84."},{"speaker":"Marcus","time":"00:38:20-3","content":"Okay so she has some support."},{"speaker":"Kennedy","time":"00:38:21-1","content":"Oh yeah well he sickly now her husband he sickly he real sickly so he but one of my brothers live with them one of my brothers live with them but that's basically all like I said my passion is trying to get home for her everything else in prison all the prison stuff that don't mean nothing to me."},{"speaker":"Kennedy","time":"00:38:21-1","content":"I done just about everything here and had the and I had my time here what they stay all the stuff they be trying to do around here and they have here well I done did all that so I made my mind up to get back what I'm saying and just try to focus on a home freedom."},{"speaker":"Marcus","time":"00:39:14-5","content":"Got it yeah the way for you to get out is through the pardon board and if you did come before them to ask for years numbers and a chance of parole after 35 years what would you want to tell them?"},{"speaker":"Kennedy","time":"00:39:32-6","content":"Well basically I would just tell them that obviously I'm not the same 18 year old that made that bad decision that day the things I hope and pray for is things that to be free with my family and to be able to mentor other youngsters mainly that's what I do in the prison and try to start communities with sports and try to keep them out of prison and they don't make the same mistake I made one day I'm that's really my thing passion with kids I mean because like I say I'm a prime example one mistake."},{"speaker":"Marcus","time":"00:40:21-3","content":"Yeah."},{"speaker":"Kennedy","time":"00:40:22-4","content":"One mistake and your whole life could be gone I'm not a person telling them that that been in trouble doing a lot of different things so one mistake you see I'm saying so basically that's what I want that opportunity to be and to share that with them you got to listen to your parents you got to go to school you got to finish school don't try to entertain nothing man because of one mistake."},{"speaker":"Marcus","time":"00:40:48-6","content":"Yeah I noticed that you're wearing a wedding ring are you married."},{"speaker":"Kennedy","time":"00:40:51-8","content":"No I ain't married this is for the one that died, we was finally get married and she died, so I always just keep it on I never let go of her."},{"speaker":"Marcus","time":"00:41:01-9","content":"Yeah no I understand I was just."},{"speaker":"Kennedy","time":"00:41:02-9","content":"Yeah Tracy never let go of Tracy."},{"speaker":"Marcus","time":"00:41:07-5","content":"Ok so what what's the worst part of being in prison for you?"},{"speaker":"Kennedy","time":"00:41:13-8","content":"The worst part of being in prison well like I said being away from my family for so long so many summers but I see my grandkids a lot matter of fact I'm a see them Sunday they grandmother gone bring them my oldest son mother which who I was with when I came and got arrested now I haven't seen her in 20 years."},{"speaker":"Kennedy","time":"00:41:13-8","content":"And I haven't talked to her maybe in 10 years till the other day we talked and she told me that she have our grandsons a lot which they two 8 year olds the two eight year olds boys and she told me that I asked her would she bring them to the rodeo Sunday and she told me she would ask for more time I told her come a little."},{"speaker":"Kennedy","time":"00:41:13-8","content":"So I could spend a little time with them before the rodeo start so she told me she would and that's be a good thing that I have more opportunities to spend with them now when me and her start back communicating. So that's a good thing"},{"speaker":"Marcus","time":"00:42:16-2","content":"It opens at nine? It opens at nine?"},{"speaker":"Kennedy","time":"00:42:19-3","content":"Yeah it opens at nine."},{"speaker":"Marcus","time":"00:42:20-6","content":"Nine yeah, and the rodeos at 2"},{"speaker":"Kennedy","time":"00:42:22-6","content":"At 2."},{"speaker":"Marcus","time":"00:42:23-7","content":"So it's yeah it's it makes sense to come early."},{"speaker":"Kennedy","time":"00:42:25-8","content":"Come early and I can spend some time with them because I'mma be busy once the rodeo start moving the hobby crafts so I'm looking forward to that."},{"speaker":"Marcus","time":"00:42:36-0","content":"Sure so one of the things I'm trying to explore with this project is the things that people do to cope with life without parole because it's this sort of impossible sort of situation and some people turn to religion some people create some kind of hope or they deny that they're going to be here there's all these things that you have to but I how have you when you think about the possibility of not leaving here how do you cope with that idea."},{"speaker":"Kennedy","time":"00:43:11-0","content":"Well it's like this after I started losing people that was real close to me. like my sister I lost her in 88 we was real close my baby sister and I lost my brother in 2005 and I lost my girl in 2012 what I'm saying and I lost my little brother last year so it's like I'm almost it was like immune to losing people I really love and it was like what's going to happen it's just gone happen."},{"speaker":"Kennedy","time":"00:43:11-0","content":"I'm saying like I said they have since I've been here they been talking about parole but they never done it what I'm saying for lifers and those ones 2nd degree murders what I mean so I'm the kind of guy that don't nothing too much move me until it happen till things happen I don't worry about things I can't really control no more and like I said now my biggest thing is I want to be there for my mom in her golden years don't nothing else too much really bother me other than what I'm saying."},{"speaker":"Marcus","time":"00:44:30-6","content":"I understand that."},{"speaker":"Kennedy","time":"00:44:31-8","content":"And that's basically what it is how I am it's like if it's for me to die in prison I'm going to die in prison if it's for me to be released I'm going to do the things and be in position if they come with something then I'll be in position but that ain't nothing that I really worry about what I mean because that's just the way it is what I mean you can't change certain things it's nothing to worry about it"},{"speaker":"Marcus","time":"00:44:57-4","content":"Makes sense to me."},{"speaker":"Kennedy","time":"00:44:58-7","content":"And that's how I am it's like I don't worry about it I hope they do."},{"speaker":"Marcus","time":"00:45:06-3","content":"Yeah so of the various things you've gone through and done in your life what are you the most proud of."},{"speaker":"Kennedy","time":"00:45:13-6","content":"Since I been in prison."},{"speaker":"Marcus","time":"00:45:14-7","content":"Yeah could be."},{"speaker":"Kennedy","time":"00:45:17-3","content":"Well the things I'm most proud of probably making trustee because I was the type of guy that you probably would have figured would have never made trustee and a lot of these wardens see me and stuff and they know me they be like man Skeebo you really come a long ways cause they really know me."},{"speaker":"Kennedy","time":"00:45:17-3","content":"And so when they see me on the out there with the trustees that's basically the first things they say cause they really know me, you know what I'm saying, but so that's basically I can say probably my biggest being proud of making trustee it's serious to make trustee here if you've been a certain type of prisoner for so long it's real serious."},{"speaker":"Marcus","time":"00:46:05-2","content":"Yeah make that change."},{"speaker":"Kennedy","time":"00:46:06-0","content":"Oh yeah definitely."},{"speaker":"Marcus","time":"00:46:08-5","content":"So I'm really grateful that you sat with me to talk about your life a little bit is there something that I didn't ask you that I should have asked you."},{"speaker":"Kennedy","time":"00:46:20-5","content":"There's not nothing I could really think of we just had a nice conversation."},{"speaker":"Marcus","time":"00:46:24-9","content":"Yeah."},{"speaker":"Kennedy","time":"00:46:25-1","content":"And I'm glad that you picked me."},{"speaker":"Marcus","time":"00:46:28-7","content":"Yeah well Kennedy let me then end with asking you to do something. Can you explain to somebody who is completely uninterested in prison doesn't really think about it just gets on with their life outside and they are busy can you explain to that person why they should care and why living with a sentence and maybe what it's like to live with a sentence of life without parole ."},{"speaker":"Kennedy","time":"00:47:00-5","content":"Yeah I could I could basically tell them that it could be someone in your family it could be your child it could be your grandchild what I mean I could be someone that you really love could get into some trouble for the first time and never have the opportunity to redeem himself you see what I'm saying."},{"speaker":"Kennedy","time":"00:47:00-5","content":"So you have to always think about things like that it could be you it could be your family it don't even necessarily have to be the victim's I'm saying your kid could make one bad choice and like I said coming from me it's what it is one bad choice I mean it's not that you a bad child bad kid see what I'm saying and so people who live like that they had a situation with a judge a few years ago in baton rouge and she was kind of like a tough judge and her son ended up getting in trouble."},{"speaker":"Kennedy","time":"00:47:00-5","content":"And it was a big thing and she her motherly concern came out then cause it was her child she had a different outlook on things what I mean after her son got in trouble you see so sometimes things like that happen you see what I'm saying to make you realize that you should be fair with certain society for them to put you in prison and throw away the key what kind of society is that what I mean you should have the opportunity to rehab, what I'm saying is rehabilitate yourself and try your hand again in society I'm saying."},{"speaker":"Marcus","time":"00:48:51-9","content":"Yeah I agree."},{"speaker":"Kennedy","time":"00:48:52-8","content":"So basically that's what it is that's what I would tell them that it could be your family member I mean cause you never know."},{"speaker":"Marcus","time":"00:49:03-9","content":"Right. That's actually a good place to stop."}]}