{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Kenneth Woodburn_Transcriptionn REDACTIONS FINAL"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:00:00",
      "upperBoundTime": "00:00:39",
      "content": "My name is Kenneth Lee Woodburn Jr. My family and friends have always called me Buddy. I had recently just turned eighteen years old, maybe six months prior to committing second degree murder in 1992. So that would be, I'm working on my twenty-seventh year after May 31st that just passed."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:00:39",
      "upperBoundTime": "00:01:04",
      "content": "So I'm going to, my goal today is just to learn about you and your experiences both before this happened but also afterwards and your time here at Angola as well. I want to start by just learning a little bit about your childhood and the best place for me to start with that is to learn about the folks who raised you."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:01:04",
      "upperBoundTime": "00:01:04",
      "content": "Sure."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:01:04",
      "upperBoundTime": "00:01:06",
      "content": "Tell me about your family."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:01:06",
      "upperBoundTime": "00:02:19",
      "content": "Well growing up I remember thinking that I had a pretty decent family, thinking that I had a family that was moral. Didn't believe in lying, or stealing, or cheating, or anything like that. Believed in hard work. But at the same time, I struggled with both my mother and my father being alcoholics."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:01:06",
      "upperBoundTime": "00:02:19",
      "content": "My dad worked construction work. My mom pretty much stayed at home and tried to take care of the trailer that we lived in. So we wasn't exactly totally poor, I would say probably lower middle class. So we struggled from time to time."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:01:06",
      "upperBoundTime": "00:02:19",
      "content": "That was all understandable to me."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:01:06",
      "upperBoundTime": "00:02:19",
      "content": "Probably my biggest problem was me and my father's relationship because he had a hard time with his father of course. I've learned all of this since I've been here. Back then I didn't understand why we couldn't have some type of loving relationship. He never did tell me he loved me and he was all about, you know, what I'm doing wrong and stuff like that. So ultimately."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:19",
      "upperBoundTime": "00:02:21",
      "content": "Sorry, do you have siblings?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:21",
      "upperBoundTime": "00:02:31",
      "content": "Well it's funny you say that. That comes like way later after prison type thing you know so, but not before prison no."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:31",
      "upperBoundTime": "00:02:33",
      "content": "So you're an only child?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:33",
      "upperBoundTime": "00:02:39",
      "content": "I'm sorry. I'm thinking children."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:39",
      "upperBoundTime": "00:02:40",
      "content": "Oh, yes. Siblings."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:40",
      "upperBoundTime": "00:02:45",
      "content": "Yeah I have a younger sister. She's four years younger than me. Yeah me and my younger sister. She's four years younger than me."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:45",
      "upperBoundTime": "00:02:46",
      "content": "What's her name?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:46",
      "upperBoundTime": "00:02:48",
      "content": "Her name's Rachel."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:48",
      "upperBoundTime": "00:02:49",
      "content": "Rachel. What's Rachel doing now?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:49",
      "upperBoundTime": "00:02:57",
      "content": "She's doing pretty good. She's married. She has her own children. She basically takes care of me now."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:02:57",
      "upperBoundTime": "00:02:59",
      "content": "Are your mom and dad still alive?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:02:59",
      "upperBoundTime": "00:03:01",
      "content": "Yeah."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:03:01",
      "upperBoundTime": "00:03:32",
      "content": "So I'm getting a picture of this, sometimes it's good for me to have a visual in my mind about where you're living and how you're living. I know where Destrehan as we were talking about biking up there."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:03:01",
      "upperBoundTime": "00:03:32",
      "content": "So if I'm standing right outside your trailer looking out, is it a trailer park? Can you describe what I'm seeing and smelling and hearing?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:03:32",
      "upperBoundTime": "00:03:42",
      "content": "Well let me tell you. I'm sorry if I'm crying."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:03:42",
      "upperBoundTime": "00:03:43",
      "content": "No you take your time."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:03:43",
      "upperBoundTime": "00:03:44",
      "content": "My mom just died."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:03:44",
      "upperBoundTime": "00:03:50",
      "content": "I'm so sorry."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:03:50",
      "upperBoundTime": "00:05:04",
      "content": "Unfortunately the place where I was raised, it divided the line between Destrehan and New Sarpy so like it's kind of rich subdivision on Ormand estates and then there was a street they called Carolyne Dr in which they had a gas station front and of course it was mostly trailers. Probably the older part of St. Charles Parish before they started , you know, building many other houses and places. It's probably the old settlement."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:03:50",
      "upperBoundTime": "00:05:04",
      "content": "It ultimately ended up earning a pretty bad reputation like poor white trash type thing, you know, you don't go down Carolyne Dr unless you live there or unless you're looking for drugs or something like that. So it had a bad reputation. you know. And so, [shrugs] what can I say? I don't know. We--I'm still thinking about what you asked me earlier but it's.--"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:03:50",
      "upperBoundTime": "00:05:04",
      "content": "[5:05]"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:05:04",
      "upperBoundTime": "00:05:14",
      "content": "It's okay. I was asking about your siblings and you told me a little bit about Rachel and something kind of triggered you and --what's your relationship like with her now?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:14",
      "upperBoundTime": "00:05:15",
      "content": "It's very good. She's my heart."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:05:15",
      "upperBoundTime": "00:05:19",
      "content": "She visit you up here?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:19",
      "upperBoundTime": "00:05:22",
      "content": "Yes [nods] Mhm."
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:05:22",
      "upperBoundTime": "00:05:25",
      "content": "/ And Are you exposed,I suppose , --are you an active uncle to her kids?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:25",
      "upperBoundTime": "00:05:33",
      "content": "[nods] Mhm. Yeah absolutely. Actually I'll bring th'em to Returning Hearts celebration. They come spend the day with me there."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:05:33",
      "upperBoundTime": "00:05:34",
      "content": "Tell me about them."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:34",
      "upperBoundTime": "00:05:39",
      "content": "They 're great kids. They're just great kids."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:05:39",
      "upperBoundTime": "00:05:41",
      "content": "Boy and a girl?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:41",
      "upperBoundTime": "00:05:44",
      "content": "Actually two boys and a girl."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:05:44",
      "upperBoundTime": "00:05:45",
      "content": "What are their names?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:05:45",
      "upperBoundTime": "00:06:13",
      "content": "Chaz who is twenty-years old now, Cameron who's about nine, and Skylar, who is the person's that she'd married daughter, she's about fourteen."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:06:13",
      "upperBoundTime": "00:06:28",
      "content": "So you had mentioned that you had a slightly tense relationship with your father, that you've come to reflect on now as reflective of his relationship with his father.--"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:06:28",
      "upperBoundTime": "00:06:31",
      "content": "Yeah."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:06:31",
      "upperBoundTime": "00:06:34",
      "content": "What about your relationship with your mother?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:06:34",
      "upperBoundTime": "00:06:41",
      "content": "Me and my mom had a great relationship. She done everything she could do, you know, to love me, and to help me and everything. , you know, Sshe was my best friend."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:06:41",
      "upperBoundTime": "00:06:49",
      "content": "Right, and I'm sorry to hear that she recently passed away. Before that, was she also a very present part of your life? She'd visit you here?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:06:49",
      "upperBoundTime": "00:06:51",
      "content": "Oh yeah."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:06:51",
      "upperBoundTime": "00:07:20",
      "content": "Is it --maybe you could let me know if I'm assuming this correctly. While all families have their problems, for the most part is it accurate to say that you grew up knowing that there were adults in your life who were taking an interest in you and who loved you, cared for you? Or did you feel like you kind of had to make it on your own?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:07:20",
      "upperBoundTime": "00:07:37",
      "content": "I definitely felt like I had to make it on my own for the most part. I mean I had ...maybe an aunt who would kind of reach out to me but.t…"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:07:37",
      "upperBoundTime": "00:07:53",
      "content": "Well let me ask you this. If you had to identify one person who was, --you were closest to, who you could confide in, who took an interest in you as a child, all the way through your teens, --who would that be?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:07:53",
      "upperBoundTime": "00:07:55",
      "content": "It would be my Aunt Connie."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:07:55",
      "upperBoundTime": "00:08:05",
      "content": "Okay tell me a little bit about school. Where were you in school and what was the latest year that you graduated, --I mean that you completed, sorry school."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:08:05",
      "upperBoundTime": "00:10:06",
      "content": "Well we --I have to say --let me finish by saying that my father beat me a lot.; heHe whooped me a lot and that really probably was the main thing that molded me into who I was at the time, extremely angry. He created a lot of hardness in me so to speak, and so I just --I wasn't doing good in school. As far as making the grade and stuff, no problem. I was always pretty intelligent when it came to academics."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:08:05",
      "upperBoundTime": "00:10:06",
      "content": "But my mom, she'd be drunk all night because my dad would fight with her, and then she would cry to me, and I'd be up all night and a lot of times I would just miss school. Anand I failed a few times because I missed too many days, not because of my academics. Aand so I ended up getting in a few fights in Destrehan High School. and"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:08:05",
      "upperBoundTime": "00:10:06",
      "content": "So --one of the questions was, \"Have you got kicked out of school?\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:08:05",
      "upperBoundTime": "00:10:06",
      "content": "Yeah I got kicked out of Destrehan so I tried to finish by my Aunt Linda's place which was in Mississippi, and so I went to a whole another area and school and got out there and I was in the eleventh grade at that time which would've been like six months prior to the incident of this crime that I was ...I ended up dropping out of there too. It just didn't work out for me."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:10:06",
      "upperBoundTime": "00:10:13",
      "content": "That's fine. Was there a teacher that took particular interest in you that you remember or anything? Any good things about school that you remember or no?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "Well they had some good teachers. That's for sure. You know I was just a stupid kid. When you have somebody --I remember --when you have somebody that really cared for you I guess sometimes maybe as a stupid kid you might take advantage of that a little bit by, you know, I remember maybe acting out unnecessarily maybe just for attention or just to be able to go talk to the counselor."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "I remember this one teacher, Mr. Allen, I don't know if he was from the military or what not, but he would recognize how angry I would get for whatever reason."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "Of course it was all home based and he didn't realize that and instead of doing what the school would normally do by writing me up or suspending me because if they suspend me then I'm gonnagoing to beat again."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "Seventh grade I couldn't even dress out for P.E. because my legs was all bruised up from not cutting the grass properly, you know, I missed a couple blades of grass and I get beat with a bullwhip and I got bruises all over and so I didn't wannawant to get my parents in trouble."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "So I couldn't dress out for P.E. so I got suspended and so I got whooped again."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "And then I go and try to put two pairs of shorts on to cover the bruises and they wouldn't allow me to do that, told me to take one of the pairs off and it's like, \"I gottagot to listen to him or else I'm gonnagoing to get suspended again.,\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "and So I went to take th'em off and the Coach seen the bruises and called the police then my mom and dad was brought in and they was both drunk and we went through a whole ordeal of child abuse type things and six months of counseling and all kind of stuff. Of course I protected them by saying, \"Oh no. They only whip me when it's necessary.…\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "and This kind of stuff because they were trying to send me to Rivarde, to a home to take me away, so I didn't want to do that but it's because of things like that. --So and then after that right there, my mom and dad called me a rat. They swore that I had did that ...we didn't ...you know...seventh grade you know. I don't even know how old I was. Maybe ten? CauseBecause I was like thirteen when I went to the ninth grade. I went to school early."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "[15:01}"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:10:13",
      "upperBoundTime": "00:13:12",
      "content": "= So I remember high school, Coach Allen, instead of suspending me for any little thing or just detention, he would take more time with me and talk to me and he would say, \"You know If you're angry, go run around. --I want you to go run around the track. Go run around the track and get whatever it is off your mind and I want you to come back in here. and--\" And So he would encourage me."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:13:12",
      "upperBoundTime": "00:13:23",
      "content": "What about your sister? Was your sister also a target for a lot of that physical abuse?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:13:23",
      "upperBoundTime": "00:13:39",
      "content": "Not at all. Not at all. I don't know if it was because she was the girl or she was four years later. I don't know, but she seemed, --she didn't have the problems I had, for sure."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:13:39",
      "upperBoundTime": "00:13:43",
      "content": "It's very common for one child to be targeted and not the other."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:13:43",
      "upperBoundTime": "00:14:45",
      "content": "Yeah. My dad pretty much loved her. I mean I can recall the memory and which it has always affected me. I can remember being like six or seven years old and seeing my dad play with my sister on the couch and for the first time I'm seeing him being loving and affectionate and smiling, and so you know I try to join in like, \"Hey Dad! I want to wrestle too!\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:13:43",
      "upperBoundTime": "00:14:45",
      "content": "and He immediately stopped me and he said, \"Boys don't do that. Boys don't show affection,\" and This type of thing. And I'm just looking at him like, \"I'm six, seven years old. I'm a kid. You can't hug me? You can't play with me? You can only play with a girl?\" And So you know I was just confused from that point. I never remember us, him or me, showing any type of affection whatsoever and I think that affected me a lot."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:14:45",
      "upperBoundTime": "00:14:47",
      "content": "Yeah of course. He's still alive?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:14:47",
      "upperBoundTime": "00:14:51",
      "content": "Yes [nods] Mhm."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:14:51",
      "upperBoundTime": "00:14:53",
      "content": "Do you have any kind of relationship with him?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:14:53",
      "upperBoundTime": "00:15:08",
      "content": "Yeah I mean I'm able to talk to him now. He's changed a lot. He's definitely had some transformations in his life especially after my mom dying."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:15:08",
      "upperBoundTime": "00:15:11",
      "content": "When did your mother pass away?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:15:11",
      "upperBoundTime": "00:15:14",
      "content": "October. Past October."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:15:14",
      "upperBoundTime": "00:15:22",
      "content": "Do you guys ever talk about some of these things from your childhood?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:15:22",
      "upperBoundTime": "00:16:19",
      "content": "No, no he don't want to talk about anything. He just don't want to talk about it. He just expects me to understand. I mean I've tried to talk to him but it discourages him from visiting. You've gottagot to realize I've been up here 26 years and so he used to come visit early on as I was a teenager, as I was a kid and try to be there with me, with my mom and everything."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:15:22",
      "upperBoundTime": "00:16:19",
      "content": "And I would tell him, you know,. \"I mean it wasn't until after I was behind the glass in jail for this crime that you told me that you loved me, you know,. I'm getting sentenced to life. And you say you love me. Now you're trying to tell me that?\""
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:16:19",
      "upperBoundTime": "00:16:38",
      "content": "Right, right, right sure. I understand. So a lot of fighting in the house. You said you got kicked out of school for fighting in school, I mean that's a very often and common link. Any other trouble with the law prior to this particular charge?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:16:38",
      "upperBoundTime": "00:17:03",
      "content": "No, I didn't. --I got arrested for contributing to the delinquency of a juvenile. I mean all my friends are teenagers. Sso when I turned seventeen years old, my best friend was sixteen. So a cop stopped and got our ID's after ten o'clock at night. you know…"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:17:03",
      "upperBoundTime": "00:17:06",
      "content": "I see. Curfew."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:17:06",
      "upperBoundTime": "00:17:10",
      "content": "Curfew, right. So I went to jail for contributing to the delinquency of a minor."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:17:10",
      "upperBoundTime": "00:17:10",
      "content": "I have a very clear understanding that physical abuse was a part of your childhood.…"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:17:10",
      "upperBoundTime": "00:17:13",
      "content": "Yeah absolutely."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:17:13",
      "upperBoundTime": "00:17:20",
      "content": "Was sexual abuse a part of it as well?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:17:20",
      "upperBoundTime": "00:17:58",
      "content": "I experienced that as well. It wasn't much. I was about twelve I guess. Eleven or twelve years old. It wasn't anybody in my family. It was a friend, outside friend, older guy just trying to be a friend. It's a long story but basically he tried to do some things, but I fought him, I fought it. I didn't allow it to happen or anything like that."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:17:20",
      "upperBoundTime": "00:17:58",
      "content": "[20:22]"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:17:58",
      "upperBoundTime": "00:17:59",
      "content": "And There was nothing in the family?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:17:59",
      "upperBoundTime": "00:18:01",
      "content": "No, no, not really. Not really."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:18:01",
      "upperBoundTime": "00:18:13",
      "content": "So I mean in terms of thinking about the abuse in your childhood, you associate that more with your father physically whipping you as opposed to anything else?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:18:13",
      "upperBoundTime": "00:18:49",
      "content": "Yeah the physical abuse, that. I'd also say the emotional abuse. You know like I said, being rejected, being unaccepted by my mother and father. I mean they didn't listen. All they did was drink and they just wanted me to do what they wanted me to do and so I don't know. ...It just wasn't, ...it definitely --he would tell me I had a slow comprehension. He would say, \"You've got a slow comprehension.\" And I'm thinking, \"Yeah well evidently I do because there's a lot I don't understand, [inaudible 21:12] what's going on.\""
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:18:49",
      "upperBoundTime": "00:18:55",
      "content": "Sure. What about girlfriends?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:18:55",
      "upperBoundTime": "00:18:59",
      "content": "I never had a problem having or getting a girlfriend."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:18:59",
      "upperBoundTime": "00:19:00",
      "content": "Any children?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:00",
      "upperBoundTime": "00:19:20",
      "content": "You know, Again, when I was out there,.. .no I didn't have any children. Wasn't trying to have children at the time. I was planning to go to the service to get my GED or something and get out of there.--"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:19:20",
      "upperBoundTime": "00:19:23",
      "content": "Right, you're eighteen when this happened."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:23",
      "upperBoundTime": "00:19:27",
      "content": "Right, right, right."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:19:27",
      "upperBoundTime": "00:19:37",
      "content": "Okay so maybe you could just tell me a little bit about what led up to this incident?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "Well like I said I came back from Mississippi from school, and I realized that I had messed up again in a more conducive environment. There was no excuse for me to mess up in Mississippi. My Aunt Linda was loving., I was in a loving home, loving environment. It wasn't the havoc that I was into around that area. There's no excuse, so I was realizing that it was more of myself."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "There was so much built up anger and emotional scarring I guess maybe from my father's relationship --and just learning people, just about fighting all the time with people, always taking up for people. Every time I got into trouble, it was taking up for somebody, you know it was never something directly for me."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "So I was always helping people."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "People in the neighborhood would --they just couldn't believe what happened because I was just a good kid to them. I would always do the right thing and I would always be respectful to everyone and help out and cut grass and do different things."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "And So realizing I'm eighteen now, I obviously can't finish school, I can't continue to hold my father responsible for how I was raised and what I'm gonnagoing to do with my life so I need to do something with my life and so what is the alternative?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "What can I do? I have to get my GED if I can't finish regular high school."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "Sso that was my next viable step in which I came home and I began going to GED class, and then I decided that I was going to join the Air Force for various reasons and thought maybe they would mold me into the man that I needed to be, and then my life would change but I just didn't make it that far."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:19:37",
      "upperBoundTime": "00:21:56",
      "content": "I was doing good, staying out of the neighborhood stuff, separate myself from a lot of stuff. I was definitely feeling a change coming on myself, trying to grow up, but just wasn't there."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:21:56",
      "upperBoundTime": "00:22:04",
      "content": "and Your whole life is now spiraled because of this event. You spend some time in the parish, I guess you're with a trial. How long did it take between getting arrested and coming to Angola?"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:21:56",
      "upperBoundTime": "00:22:04",
      "content": "[38:20]"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:22:04",
      "upperBoundTime": "00:22:05",
      "content": "About a year."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:22:05",
      "upperBoundTime": "00:22:07",
      "content": "Okay."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:22:07",
      "upperBoundTime": "00:22:09",
      "content": "About a year. I came to Angola the next year, 1993."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:22:09",
      "upperBoundTime": "00:22:23",
      "content": "So ...can I--I didn't ask you about this.this? You said that both of your parents were alcoholics. Were drugs and alcohol part of your own lifestyle?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:22:23",
      "upperBoundTime": "00:22:54",
      "content": "Eh It was in and out. At first I was so much against it, because they was drinking and stuff so. I experimented with drugs and alcohol here and there but it wasn't, ...I can't blame ...I didn't do any more than any other kid would've done."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:22:54",
      "upperBoundTime": "00:23:08",
      "content": "Sure, sure. So I want to talk a little bit about everything since then, but before I do, is there that I should have asked you about your life up to that point that's important in terms of who you are that we didn't get to touch on, that you want to tell me about?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:23:08",
      "upperBoundTime": "00:23:10",
      "content": "Just pre- incarceration?"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:23:10",
      "upperBoundTime": "00:23:19",
      "content": "Yes. There may not be, but I just want to give you a chance to say something we may not have had the chance to."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:23:19",
      "upperBoundTime": "00:23:24",
      "content": "No I don't think so. We've pretty much did hit most of the highlights of.--"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:23:24",
      "upperBoundTime": "00:23:36",
      "content": "Well tell me about that bus ride. What's going on in your mind as you're coming down to Angola? Well first of all did it hit you that life-without-parole..."
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "= Oh Absolutely not. I mean I was eighteen years old. What's the most I'm gonnagoing to do? Twenty-years at the most? I mean that's what I was thinking. Even though I was sentenced to life and realized under the law I didn't have parole I just didn't believe that because I was good even in the parish jail. The police and stuff, they liked me, so they would encourage me."
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "They would tell me, \"Man, you know, it's gonnagoing to be alright. You go up there, you do the right thing, and you get good behavior and you could get a clemency after like seven years..\" S"
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "So I was kind of hopeful to that because we just --through my trial, it was amazing how theyI didn't get manslaughter. Sso that was the biggest shock to everyone, my lawyer included."
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "He was like, \"Don't worry about it. You're gonnagoing to get manslaughter and this and that,\""
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "But I didn't so I'm like, \"What's happening now??!,\" Aand they're like, \"Oh it's gonnagoing to be okay. You're gonnagoing to go up there, do the right thing, and then you'll get a clemencyy…\" More or less."
    },
    {
      "speaker": "Resp:Kenneth",
      "time": "00:23:36",
      "upperBoundTime": "00:24:49",
      "content": "[41:05]"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:24:49",
      "upperBoundTime": "00:24:53",
      "content": "So when do you think, over these years, that it hit you that, \"Wow this is life\"?\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "[long pause] I mean it's just like one of those things you just can't accept. You're gonnagoing to always have some time of hope that something's gonnagoing to change because you know that it's not the right thing. I mean you have to believe in the right thing. You know just like I knew in my heart that juveniles would one day get a chance because I knew that it just wasn't right. When I came up here and I realized --I would talk to guys like, \"Yeah I've been up here since I was fifteenn…,\" Or \"...Sixteen,\" and That just ain't right you know. \"I've been up here for forty-years…,\" Or \"...Thirty-years.\" ,\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "Like man that's crazy. And I'm like well I'd tried to encourage them like, \"Just hang on because sooner or later somebody will realize that you can't hold a kid accountable for something like that --the rest of their life, one mistake like that..\" I mean it's crazy."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "You always have some kind of hope and in my case, my hope was the fact that the way that the incident took place, it wasn't like a gruesome premeditated murder. It's like there's got to be a chance in this."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "I'm eighteen years old and I realize what I did was a hard thing. I took someone's life whether it be accidental or not I'm still responsible for that., b"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "utBut as I grow older through Angola I start to see more about the law and what's what and realize that clemency isn't happening,; that's fictitious. So my hope then lied in the fact that I was charged with second degree murder, and so then I went to thinking, \"How could people not see you have someone who might rape somebody and kill seven people, and have the same sentence as me?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "How is that possible?\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "Someone has to be able to differentiate. Is this it? Like you say, I've questioned that, \"Is this it? That's it? You don't care? There's no chance?\" I never could believe that. I never could believe that I'd have no chance. So so I focused on --in the meantime I felt that society would catch up with that concept, because I realize that all, most of the states were so different. Texas. Florida. California. New York or ."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "wWhatever."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "I think, I felt like we're just behind in time and we're just, --it's just an evolution that's gonnagoing to take place and it may take ten or twenty years, so what're you gonnagoing to do those ten or twenty years? Are you gonnagoing to wait for it to happen or are you gonnagoing to prepare for it? And so that's what I did, I prepared for it. I did things that --you know I still have to live my life in here, that's what I thought. I have a chance to get educated."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "soSo the first thing I did was get my GED and I didn't stop from that point. I graduated auto mechanics."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "I came here and got a bachelor's degree in general studies, christianChristian ministry, through the Bbible Ccollege. I graduated HVAC. I mean I took advantage of every opportunity there was. I went through every school, every class, I became a certified GED teacher. Anything I could get to better myself, to learn, to grow, all of those things.,"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "I just focused on that just becoming a better person for my mom and understanding why my dad was the way he was and just learning more about myself in psychology and different things."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "Educating myself and rehabilitating myself and that one day maybe someone would look at me and say, \"Wow.Man, h How long have you been here,\" and w\"What did you do?\" So I've always believed in that, but you know it came with time."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "After twenty years passed, I mean I'm working on twenty-seven now, I would say probably about four years ago is when I really started, it to --it started setting in that, \"Man these people don't care. It don't matter.\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "There is no, --I can't even go to another class. I mean I've taken every class there is. I've taught every class. I became a mentor. There's nothing here that I haven't done."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "I mean I've done it, taught it, and tired of it so what else can I do? There's nothing else I can do, but now I ponder that you know, \"These people are serious."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:24:53",
      "upperBoundTime": "00:30:43",
      "content": "They don't care nothing about what I did or what I'm doing now, and\" and I'm gonnagoing to die here.\" And The past three or four years has been depressing, it's been hard. It's been very hard. Realizing that if I have no chance of parole, why am I even living? Why should I continue to live? That's been my thoughts."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:30:43",
      "upperBoundTime": "00:31:04",
      "content": "Yeah I think that you sort of put your head down and with the faith that something will change and you're confronted with the fact that it's not changing. Although having said that, as you've noticed, it's changing for juveniles."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:04",
      "upperBoundTime": "00:31:11",
      "content": "You know, Again, all of this just recently came about within the past year and a half to two years."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:31:11",
      "upperBoundTime": "00:31:13",
      "content": "With Montgomery."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "Yes, well I mean everything. It's more than just Montgomery. It's everything,: the economy, the governor. It's just so many things just like you could see so many things coming together. People caring. I mean we've never had anyone really care or come together."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "You could just see it. You have to believe."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "Some people believe that there is a Ggod, but you have to believe that someone or something, in my case I would say God, is bringing this thing together to bring it to a point and you see how things are working, and it encourages you to see that you're not by yourself, you're not alone, and that he cares."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "Aand it's because he cares --he works through other people to shed some light and allow them to care. Aand then you begin to start doing things and advocating and I'm sad to say that I don't think Louisiana would have made that change if it would not have been for the Supreme Court, as simple as that."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "I mean I know the history of Louisiana and if you wannawant to talk about a sad story, I don't know if you know about all that, but I mean just how Angola came about and how they used slave labor and how they treated them guys."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "We think we got it bad? And it's still inhumane at this point, but the evolution, seventy-five years ago these guys were in chain gangs and everything else. I mean they couldn't even get anything to eat. It was terrible. Total racist situation here."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "= Louisiana is the most massive incarcerated state for that purpose. Most people got locked up because they was black and post people don't want to let people out because they're black and that's how they look at it. I would have to say that racism is still strongly involved."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:31:13",
      "upperBoundTime": "00:33:44",
      "content": "They might sentence see a few white people here, but that's just our bad luck of, ...they look at it like, I don't know w…we shouldn't have got caught up, but we're not gonnagoing to let these violent people out because it--it's just so many misconceptions."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:33:44",
      "upperBoundTime": "00:33:58",
      "content": "What I'm hearing you say is that the white folks who are here, ironically, aren't gonnagoing to get any leniency because they're gonnagoing to be treated the same way that black guys.…"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:33:58",
      "upperBoundTime": "00:34:00",
      "content": "No actually we get treated worse at this point."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:00",
      "upperBoundTime": "00:34:04",
      "content": "Oh really? Explain that."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:00",
      "upperBoundTime": "00:34:04",
      "content": "[50:23]"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:04",
      "upperBoundTime": "00:34:13",
      "content": "When I first got here, I mean it was like they were mad that I was here. You know, \"You look like a good, young, white kid from a good family. What are you doing here?\""
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:13",
      "upperBoundTime": "00:34:20",
      "content": "I see."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:20",
      "upperBoundTime": "00:34:33",
      "content": "But anyway."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:20",
      "upperBoundTime": "00:34:33",
      "content": "= whiteWhite free folks hate them as black inmates so they take it out on us in a sense. And I've been can prove that because in 1998 I was crowded by forty black people.--"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:33",
      "upperBoundTime": "00:34:35",
      "content": "Forty?!"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:35",
      "upperBoundTime": "00:34:52",
      "content": "Forty. Broke my jaw. Knocked out my teethsteeth's and stuff. I was hospitalized simply because I was white, because of what a white Captain was doing to a black inmate, and they wanted to prove a point, and I ended up getting caught up as an example."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:52",
      "upperBoundTime": "00:34:54",
      "content": "Sure."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:54",
      "upperBoundTime": "00:34:59",
      "content": "And So ...yeah you know it's just crazy. It's always something."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:34:54",
      "upperBoundTime": "00:34:59",
      "content": ""
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:34:59",
      "upperBoundTime": "00:35:18",
      "content": "So can you…--you've also seen a lot of change.change? You're sort of a little bit of a living historian of 27 years. You've seen a lot of changes here. What do you think the biggest changes are since you came here?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "Well I'll say this. When I first got here there was no women that worked here. That's number one. You always say there's pros and cons to everything but just off the top of my head I remember that there was no women here."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "There was a lot more respect, but at the same time there was a lot more violence and a lot more sexual stuff of predators, you know, which was probably my hardest thing of just to be able to be man enough to you know, \"Don't do me nothing in the shower,\" t"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "Type thing, but when the women came they kind of switched their focus from homosexuality to. , \"Oh okay they got women here so we could play with ourselves to them,\" Instead of taking advantage of younger boys and stuff so that kind of helped. But then as change.--"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": ""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": ""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "= They was all about people not ratting whatever is they were doing and this is where Warden Caine probably got his prestige because he took an angle to protect the rats and you know if you did a rat something you're going straight to extended lockdown whatever and that's where I've been beginning to see a change. People are able to tell on inmates without getting killed or without getting severely beaten because they have more protection and peoples were like, \"Man.…,\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "They didn't really wannawant to go through that so then more and more people who were willing to tell came out and it kind of started to take over in a sense and then of course that led to --one thing led to another. It's kind of like khaki backs back then and even then today, you know I hate to compare that because you'd have to talk about the full scope of things but I mean we have mentors today."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "You have mentors that help these kids that are coming through the Re-Entry program, but really their job is to tell on anything that they do."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "That's part of their job and that's acceptable now. They don't have to worry about somebody doing them something and all that kind of stuff."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "Aand so people think twice about committing an act of violence or whatever when they have to face those types of consequences like that. I don't know, that's just a part of the change that I saw."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:35:18",
      "upperBoundTime": "00:38:18",
      "content": "So much change, but like I said some good, some bad. But it's much better now than it was twenty years ago for sure."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:38:18",
      "upperBoundTime": "00:38:20",
      "content": "Certainly in terms of the violence from everything I've understood."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:38:20",
      "upperBoundTime": "00:39:10",
      "content": "Yeah, definitely. And I just think that generation, ...I mean our generation coming through here ...we know that violence isn't the answer. We didn't come here as violent people really. We came here with the hope of rehabilitating ourselves and going home, our generation. So we wasn't here to hurt anybody or continue in this type of world. Just because we committed a criminal act, that didn't make us criminals."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:38:20",
      "upperBoundTime": "00:39:10",
      "content": "Just because we committed a violent act, that didn't make us violent. I think it was more people like that that had the same hope as me and said, \"Hey man, I'm trying to go home. I'm not tringtrying to get caught up in all of this stuff around here.\"."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:39:10",
      "upperBoundTime": "00:39:18",
      "content": "Yeah I get it. You've already described --I was going to ask you about the various organizations you've been a part of. Is thatYou've done everythingeverything. You've done this, you've done that, like you said?--"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:39:18",
      "upperBoundTime": "00:39:32",
      "content": "Yeah I'm President of sober group, AA. I've been a 'm a very active member of Dale Carnegie. Many different churches. I mean so many different programs."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:39:32",
      "upperBoundTime": "00:39:32",
      "content": "Like you said, \"I've done it. I've taught it. I'm tired of it..\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:39:32",
      "upperBoundTime": "00:39:34",
      "content": "Yeah it's true."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:39:34",
      "upperBoundTime": "00:39:37",
      "content": "So I'll skip over that."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:39:37",
      "upperBoundTime": "00:39:42",
      "content": "That is true. I've done it all, I'm telling you, I have done so much stuff."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:39:42",
      "upperBoundTime": "00:40:13",
      "content": "So let's get into slightly more difficult territory here. It's been twenty-seven years and I ask folks, you know, when they look back on the victim and the crime how they feel and I feel like people are sort of ...there's a [inaudible 57:32] type of script of remorse, right? Which I understand, I think it's genuine. But I also feel that after twenty-seven years of being punished."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:40:13",
      "upperBoundTime": "00:41:26",
      "content": "No,, you know, I can totally understand. I put myself, ...I shot a seventeen year old kid and you know he didn't do me anything. And He had a mother and he had a sister. He was basically just like me only he was the one that died and not me. And I put myself in his mother's position realizing that she lost her son to this and I just would want her to understand and realize that that wasn't intentional. I feel your pain. I feel your pain even more so now than I did then."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:40:13",
      "upperBoundTime": "00:41:26",
      "content": "I have cried many a nights. I have prayed many a nights. I would love to see his mother and just be able to hug her and tell her how sorry I am, and I know there's nothing I can do to bring him back, but killing me is not gonnagoing to help the situation at all."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:41:26",
      "upperBoundTime": "00:41:45",
      "content": "Yeah, sure. I understand. Did you have any kind of contact or any knowledge about the victim's family after this all happened? I assume you saw some of them in the trial.…"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:41:45",
      "upperBoundTime": "00:41:52",
      "content": "Yeah that's it. I'd seen them in court. I'd seen that they had a mother, and appeared to be maybe a sister, and maybe a brother."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:41:52",
      "upperBoundTime": "00:41:55",
      "content": "But no contact since then?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:41:55",
      "upperBoundTime": "00:41:57",
      "content": "It's illegal. You can't have contact."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:41:57",
      "upperBoundTime": "00:42:02",
      "content": "I understand. And no information? Any information about them since them?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:42:02",
      "upperBoundTime": "00:42:12",
      "content": "Not at all and I haven't tried because it's illegal. They tell us that we can't attempt to contact them in anyway, so I have to respect that whether it be good or bad."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:42:12",
      "upperBoundTime": "00:42:25",
      "content": "So there's another family obviously that's been completely affected by this and that's yours ."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:42:12",
      "upperBoundTime": "00:42:25",
      "content": "[01:00:00]o"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:42:12",
      "upperBoundTime": "00:42:25",
      "content": "/ Of all, the folks in your family, who do you think it's been hardest on?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:42:25",
      "upperBoundTime": "00:42:49",
      "content": "[tears up] Definitely my mom."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:42:49",
      "upperBoundTime": "00:43:04",
      "content": "Yeah I mean I had a guy who I was talking to who said, \"If your family loves you, they do day-for-day in here with you.\" And I don't think people pay much attention to those folks, they didn't do anything."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "You know I'm going to tell you. Overall when I look at this, this is torture. It really is. I can understand a mom losing her son and she can hold it against me the rest of her life with no forgiveness, but she's not living what I've been living. She ...she...Nno one can understand what I have to go through to live in this place, and what I've been through and it's torture."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "I would have rather been the one who got shot than to go through this. If I would have known then that I would have to go through all of what I went through up to this point, I would not have done it."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "I would've immediately committed suicide. It's just to me, it's torture to spend the rest of ...your whole life, --forty, fifty years, --your whole life in prison."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "I think it'd be better, you have to decide as a society, they just decide to hang you and what not and at least then you have no thought, you have no consciousness, you have no pain, you have no sorrow."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "It's much different than, ...I mean i'dI'd rather be dead and you know I'm living for another chance to do good but I feel like you just don't understand that this is much worse than dying, especially knowing that this is it, that you're gonnagoing to stay in prison you're whole life."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:43:04",
      "upperBoundTime": "00:44:56",
      "content": "I mean if I knew that for a fact I would have immediately killed myself. I just can't even believe that."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:44:56",
      "upperBoundTime": "00:45:05",
      "content": "I understand."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:45:05",
      "upperBoundTime": "00:45:42",
      "content": "Some people I know have done gruesome crimes and gruesome things and some people may not change. Some people may have the same attitude, but some people do change. I mean I was totally uneducated and now I have over eight years of college and so many --so much stuff that I have learned. I'm so far from being that same kid at eighteen years old. I'll be forty-five years old in a couple months in November and it's just so different, so different."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:45:42",
      "upperBoundTime": "00:45:55",
      "content": "Of course, and I think you know that holding out that hope is probably the way to survive. I was going to ask you about coping mechanisms here."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:45:55",
      "upperBoundTime": "00:47:40",
      "content": "Yeah it's difficult. It's really difficult. People cope in many different ways. The first way I coped was, first of all I didn't accept it, and so I coped I guess by me being young and still in physical shape, I played sports a lot and educate myself."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:45:55",
      "upperBoundTime": "00:47:40",
      "content": "soSo I did things to accomplish things to ...not only for the experience of learning and becoming a better person but also as a young kid I wanted to make my mom proud of me. Just because I was in a bad place that didn't mean iI couldn't do good things."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:45:55",
      "upperBoundTime": "00:47:40",
      "content": "So coping with it, people find God. We go to church and we realize that if you really believe in God and all that thatthat, that this little life that we're going through is not gonnagoing to be very long. You're gonnagoing to do less than a hundred years, and then you have all of eternity. When you really believe that, then this don't seem that bad. It's just an experience, a short experience that you're gonnagoing to go through and it's all to allow you to grow and to become closer to God and there's so much to learn for eternal reasons."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:45:55",
      "upperBoundTime": "00:47:40",
      "content": "[01:05:17]"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:47:40",
      "upperBoundTime": "00:47:46",
      "content": "Do you believe that?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:47:46",
      "upperBoundTime": "00:48:45",
      "content": "Not as much as I used to. I used to be 100% all about it. I actually at some point was pretty happy and content. I felt so close to God that it didn't matter if I got out or not because I valued the eternity of it but I don't know it's a little harder now. Not that I don't believe that I just don't believe this."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:47:46",
      "upperBoundTime": "00:48:45",
      "content": "It's crazy, it's like this is ridiculous. I'm just ready to end this right now if y'all are not gonnagoing to do anything about this and y'all see it this way, I think you 'all are stupid, and I don't even want to be here anymore. That's just how I feel."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:48:45",
      "upperBoundTime": "00:49:23",
      "content": "Sometimes people can point to something specific in the change in their lives. It seems to me --tell me if I'm wrong --it seems to me a common story is that someone goes down the wrong road, they're just really screwing up, and if it's not this thing it'll be the next that'll bring them down."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:48:45",
      "upperBoundTime": "00:49:23",
      "content": "You end up here [inaudible 01:07:22] the system for awhilea while and then something happens. A change inside or a change from [inaudible 01:07:32] whatever it is and you kind of turn your life around. It sounds to me that that's not what your story really is. Your story is more that you came here and you're like, \"I've gottagot to figure out something worthwhile to do,\"--"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:23",
      "upperBoundTime": "00:49:28",
      "content": "I think, yeah."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:49:28",
      "upperBoundTime": "00:49:32",
      "content": "-- and You kind of just started doing. It was more of an even process for you. Is that right?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "Yeah, I think my life was turned around three days after what had happened because three days later I'm in jail realizing I am in here for killing somebody and that I am possibly facing a life sentence and it hit me so hard I couldn't believe it. I wanted to commit suicide, ; that's what I wanted to do."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "I didn't have a personal relationship with God at the time and I think right there in that parish jail, at that point iI sincerely prayed, \"If there was a God, hear me."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "What am I supposed to do here?\" And I believe that he reached down with His spirit and showed me that he is real and that I've just been so blind and ignorant and get something that I wouldn't have normally done if I wasn't under the influence of other people and different things. I was blinded and I got set up."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "I started reading the bible for the first time in which I was able to understand it and I started looking at the life of Jesus and what he went through and was like, \"Wow."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "This man didn't even do anything wrong and look at the ridicule he faced and look what he went through.,\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "and Then they ultimately put him to death and I was able to relate to him in a sense and I've read that part about being born again and to me it was like starting over. Aand I wanted to start over right there and I did. It's not like I just became this completely different person or anything. I felt like I was always good natured and just always been led into some crap because of the way we live as people, the way things are."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "I'm always defending somebody or he's picking on him or this or that. So many things wasn't right. If things was the way they'd supposed to be I wouldn't be in trouble. We'd all be happy and we'd do what we're supposed to do. I wasn't the bad guy but I did a bad thing."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "I've realized how far I went, again I would have to say that God saved me at that point, opened up my eyes, and I felt that I had experienced genuine salvation at that time."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "I got on my knees and I prayed and I said I gave my life to God and said, \"I've done messed my life up. I don't know what I'm doing. I done killed somebody and now I want to kill myself because that's just how stupid I am. If you want me to continue to live then you're gonnagoing to have to show me how to do it.\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:49:32",
      "upperBoundTime": "00:52:39",
      "content": "[01:11:03]"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:52:39",
      "upperBoundTime": "00:52:44",
      "content": "This was three days into the parish?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:52:44",
      "upperBoundTime": "00:53:09",
      "content": "[nods] Mhm. Yeah. itIt was June 3rd, 1992 and I remember. At that point on I decided I'm not living for me anymore I'm living for God and living for God is living for other people so it ain't about me anymore so I just tried to do the best I could, so that was my change."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:53:09",
      "upperBoundTime": "00:53:41",
      "content": "What is the, --I think you've explained things very clearly to me about some of the extraordinary difficulties of coping with a life sentence. I think it's come through very clearly, and I would imagine that, that's more difficult than dealing with the physical aspects of being in prison. But the physical aspects of being in prison are pretty rough as well."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:53:41",
      "upperBoundTime": "00:53:46",
      "content": "It was. It's not anymore, but it was definitely."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:53:46",
      "upperBoundTime": "00:54:01",
      "content": "We talked about that incident in 1998 and you were brushed rushed [to the hospital] as an example. For the most part, were you able to protect yourself from violence other than that incident?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "Well I mean 1994-1995, people are fighting every day and we was working hard. And you'd sleep in your bed and you could listen to who's walking shoes, I mean you was very aware of what was going on around you. People was getting [inaudible 01:12:37] with stuck with locks in their sleep, throwing hot water on th'em, for whatever reason."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "Some people were crazy here. Some people were trying to, as they say, \"Check out,\" Which means that they wanted to leave and go to a different location."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "They might not want to live at Camp C, they might want to live in the Main Prison, or they want to go to Camp D, or they want to, --there's different places they was trying to move about, so they'll use you up for whatever reason. Maybe you're white or maybe it's something else, but it's fighting."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "People fighting every day so I was on guard all the time."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "I had to sleep with my shoes on sometimes because I was scared, and then it was so bad with people taking advantage of people, the homosexuality was ridiculous and you had to,--you know when you're taking a shower and you see who's in there with you and how they're looking at you and you know that was a concern because if they're gonnagoing to, --it's just so o disrespectful."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:54:01",
      "upperBoundTime": "00:55:36",
      "content": "There are just some things that you had to do. If you allowed this guy to get an erection on you while you were in the shower and you didn't do him nothing you was gonnagoing to be a punk one way or another, so now you're making me have to.……"
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:55:36",
      "upperBoundTime": "00:55:42",
      "content": "Be violent."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:55:42",
      "upperBoundTime": "00:56:13",
      "content": "… bBe violent. Exactly. Or be a punk and that made me realize what a lot of guys went through in the seventies and stuff. I mean they used to have to sleep with a phone book on their chest because they was afraid of being stabbed. It's just so crazy. So I'm just glad to be able to lay down and have peace and be able to walk away from violence and thank God, you know, in twenty-seven years I haven't gotten into a fight."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:56:13",
      "upperBoundTime": "00:56:15",
      "content": "Yeah it's amazing."
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:56:15",
      "upperBoundTime": "00:56:48",
      "content": "Yeah I was able to get around every single thing. I don't think I have a, --I had never been written up for a fight. I think one time I was written up for a fight but it was, --we was playing tackle football and it wasn't really a fight. They just made it out to be something but as far as me actually fighting somebody for whatever reason I was able to avoid all that violence."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:56:48",
      "upperBoundTime": "00:56:50",
      "content": "Yeah that's amazing."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:56:48",
      "upperBoundTime": "00:56:50",
      "content": "[01:15:09]"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:56:50",
      "upperBoundTime": "00:56:59",
      "content": "I mean don't get me wrong there's people here that I could fight every day. I mean every day it's something. I just walk away from it. I'm like look I'm trying to go home, I don't care."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:56:59",
      "upperBoundTime": "00:57:09",
      "content": "Yeah I get it. I get it. Have you ever filled out the paperwork to go before the pardon board?"
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:57:09",
      "upperBoundTime": "00:58:00",
      "content": "Yeah it's funny. I had just did that at six months ago and the only reason I had any type of hope of doing that was because of the new administration because it's always been a joke. I mean it's clemency for what? Even if you get it, the governor's not gonnagoing to sign it. I mean it'sits reality. There's not a clemency process, but this governor has proven that, \"Hey if you show me you've if you got this and you get a recommendation worthy, I'll sign something..\""
    },
    {
      "speaker": "=Resp:Kenneth",
      "time": "00:57:09",
      "upperBoundTime": "00:58:00",
      "content": "So hey, that's a little bit of hope and after twenty-six years and I have two pages of accomplishments, I mean the things that I have done? I stand out. I'm like probably one of the top twenty inmates in Angola that has the credentials and the things that I have done here. And so I feel that I am like the cream of the crop, and I should get a chance here."
    },
    {
      "speaker": "/Intvr:Marcus",
      "time": "00:58:00",
      "content": "That's actually a good place to stop."
    }
  ]
}
