{"name":"","transcript":[{"content":"Kenneth McGee_Transcription REDACTIONS FINAL"},{"speaker":"Kenneth","time":"00:00:02-3","content":"Okay my name's Kenneth McGee. I'm convicted of first degree murder. I was at the age of 19 from Orleans Parish."},{"speaker":"Marcus","time":"00:00:13-3","content":"How much time have you served?"},{"speaker":"Kenneth","time":"00:00:16-8","content":"I've served 37 years it'll be October."},{"speaker":"Marcus","time":"00:00:18-6","content":"So the purpose of this is to learn more about your life. So I'm probably going to start with some questions about your childhood. Before that where in Orleans did you grow up?"},{"speaker":"Kenneth","time":"00:00:34-6","content":"I grew up in the Lower Ninth Ward of New Orleans."},{"speaker":"Marcus","time":"00:00:39-0","content":"What street?"},{"speaker":"Kenneth","time":"00:00:40-9","content":"Mazyck."},{"speaker":"Marcus","time":"00:00:43-2","content":"Okay yeah. I'm familiar. So tell me a little bit about the folks who raised you."},{"speaker":"Kenneth","time":"00:00:47-2","content":"Okay I was raised by my grandmother and grandfather in Tylertown Mississippi. I come from a broken family. So my father sent me to Mississippi, my brother and I. So I really was raised by them in Mississippi until my grandmother died in 1976."},{"speaker":"Marcus","time":"00:01:09-1","content":"So you're a teenager."},{"speaker":"Kenneth","time":"00:01:11-4","content":"Oh yeah. So when I left Mississippi I came to stay with my father in New Orleans where I went to junior high school at Joseph Cohen middle school. I excelled in football leading me to a scholarship to go to St. Augustine. So I excelled in football, had a full time scholarship to play football."},{"speaker":"Marcus","time":"00:01:34-8","content":"At St. Aug?"},{"speaker":"Kenneth","time":"00:01:37-6","content":"At St. Augustine."},{"speaker":"Marcus","time":"00:01:39-9","content":"So let's go back then. So really your early childhood was in Mississippi."},{"speaker":"Kenneth","time":"00:01:43-5","content":"Oh yeah."},{"speaker":"Marcus","time":"00:01:44-9","content":"Tell me about your grandparents."},{"speaker":"Kenneth","time":"00:01:52-1","content":"Oh I have a wonderful grandmother and grandfather. Loved me dearly. Established a lot of morals and principles in my life because I really had no one to look up to and dwelled in me the good morals and principles and they really accepted me from my broken family, and gave me the love of a mother and father so."},{"speaker":"Marcus","time":"00:02:11-6","content":"Is this your mother's parents?"},{"speaker":"Kenneth","time":"00:02:12-8","content":"That was my father's parents."},{"speaker":"Marcus","time":"00:02:14-0","content":"So tell me about your grandmother."},{"speaker":"Kenneth","time":"00:02:19-0","content":"My grandmother. She was born in 1905 by the name of Freddie Mae Wilson which later on in married life was McGee, and she had a fifth grade education and talking to her and the knowledge that she shared or shown, you would think she had a master's degree. She knew how to cook everything, knew how to preserve things, and she just was a scholar in her own way."},{"speaker":"Marcus","time":"00:02:49-4","content":"So she died, she must have been quite young when she died."},{"speaker":"Kenneth","time":"00:02:58-3","content":"No she's, my grandmother was in, she was born in 1905 and that happened in '76."},{"speaker":"Marcus","time":"00:03:04-1","content":"Oh I'm sorry, she was 71."},{"speaker":"Kenneth","time":"00:03:06-7","content":"I witnessed her death. We were watching TV one night and in those days we had an outside pouch, she asked my brother to go out, the TV was acting up, to turn the pole to get some of the TV ready. And soon as she left out she just kicked her slippers off of the rocker, and she was dead."},{"speaker":"Marcus","time":"00:03:23-8","content":"Wow."},{"speaker":"Kenneth","time":"00:03:26-4","content":"No one knew CPR at the time. I was relatively young so."},{"speaker":"Marcus","time":"00:03:32-1","content":"Right. It's odd that she wasn't in pain or she didn't."},{"speaker":"Kenneth","time":"00:03:33-5","content":"No she didn't suffer at all."},{"speaker":"Marcus","time":"00:03:37-6","content":"Which is a blessing."},{"speaker":"Kenneth","time":"00:03:38-8","content":"Yeah right."},{"speaker":"Marcus","time":"00:03:40-8","content":"Of the various adults who were a part of your childhood, which adult would you say has had the biggest impact on who you are today?"},{"speaker":"Kenneth","time":"00:03:55-5","content":"It would probably be an uncle of mine, Uncle Al, because he used to take me hunting and fishing and just telling me the do's and don'ts riding me on the tractor while he was doing the field and stuff and the reason why he pretty much like sharecropping. He'd done this."},{"speaker":"Marcus","time":"00:04:17-8","content":"So this would be your father's brother?"},{"speaker":"Kenneth","time":"00:04:19-4","content":"My father's brother."},{"speaker":"Marcus","time":"00:04:21-8","content":"What brought your father to the Lower Ninth Ward? Was it work?"},{"speaker":"Kenneth","time":"00:04:26-2","content":"It was work. He didn't have work in Mississippi or where jobs was. Everybody pretty much had farming and so he moved to New Orleans trying to find work and got injured on the job that left him kind of disabled in his latter years. But it left an opening, when my grandmother that my grandfather asked dad, did I want to stay or move to a city where opportunity might be better?"},{"speaker":"Marcus","time":"00:05:00-9","content":"Sure. What about siblings? Brothers and sisters?"},{"speaker":"Kenneth","time":"00:05:05-7","content":"I have a brother. Really one brother. And we both were born in the same year. That's the only two kids my mom had. I was born in February, he in November. So we were pretty much like twins. We knew each other all our lives. That was my closest friend."},{"speaker":"Marcus","time":"00:05:26-0","content":"You were in Mississippi with him together?"},{"speaker":"Kenneth","time":"00:05:27-9","content":"Oh yeah. Together."},{"speaker":"Marcus","time":"00:05:30-7","content":"What is his name?"},{"speaker":"Kenneth","time":"00:05:32-9","content":"John. John McGee."},{"speaker":"Marcus","time":"00:05:34-1","content":"Okay. What is he doing?"},{"speaker":"Kenneth","time":"00:05:35-6","content":"He recently died. He died of a heart attack last, he's been dead about 13 months now. He had a pacemaker that was wrongfully put in. They didn't do it right and it caused some trouble and it finally played out and he had a heart attack."},{"speaker":"Marcus","time":"00:05:54-7","content":"How did his life unroll for him?"},{"speaker":"Kenneth","time":"00:05:57-4","content":"He was kind of a problem brother, and he kind of contributed to our broken home. He kind of blamed my mother and father about them not being together. He always had problems. Not accepting the differences and kind of lashed out at everybody because of it."},{"speaker":"Kenneth","time":"00:05:57-4","content":"And we discussed it and I understood him but I was trying to show him that even though they didn't stay together we really don't know the reason of it we all here and we're grown now. We just have to fend for ourselves."},{"speaker":"Marcus","time":"00:06:36-9","content":"Did he end up coming here?"},{"speaker":"Kenneth","time":"00:06:40-2","content":"No he went to, he had charges. He'd done time different times. The last time he'd done time about eight years in feds for an automatic weapon, and after that he just, when he got out through my advice and others."},{"speaker":"Marcus","time":"00:06:57-0","content":"He was done."},{"speaker":"Kenneth","time":"00:06:58-4","content":"He was done."},{"speaker":"Marcus","time":"00:07:02-2","content":"Did you spend any time at all in foster care?"},{"speaker":"Kenneth","time":"00:07:03-1","content":"No."},{"speaker":"Marcus","time":"00:07:05-2","content":"So you're with your grandmother and then back to your dad?"},{"speaker":"Kenneth","time":"00:07:08-1","content":"Oh no. No foster care."},{"speaker":"Marcus","time":"00:07:09-4","content":"Let me ask you this. Is It fair to say that you grew up, even though it's not a very traditional home in terms of your grandparents, but you grew up with adults who cared for you and loved you and you knew that or do you think it's more accurate to say that you kind of had to fend for yourself?"},{"speaker":"Kenneth","time":"00:07:40-3","content":"Well after coming back, after going back to New Orleans after I had gotten to my teen years it was kind of fend for self. My father respect, he was kind of functionally illiterate. He knew how to read and write but not well. So he was a hustler. So I was kind of in between trying to learn the street game and going to St. Aug where everything was kind of straight."},{"speaker":"Marcus","time":"00:08:04-4","content":"Did you graduate from St. Aug?"},{"speaker":"Kenneth","time":"00:08:07-4","content":"My last year, trying to hustle, got busted with a joint of weed and then lost out on almost everything because I was pretty much a star running back at the time. And that led me to go to a public school to go on and to graduate. Right."},{"speaker":"Marcus","time":"00:08:27-5","content":"Did you graduate?"},{"speaker":"Kenneth","time":"00:08:29-5","content":"Oh yeah. I did graduate."},{"speaker":"Marcus","time":"00:08:32-9","content":"So what school did you finally graduate?"},{"speaker":"Kenneth","time":"00:08:34-4","content":"F T Nicholls."},{"speaker":"Marcus","time":"00:08:36-7","content":"Yeah which was down closer to home."},{"speaker":"Kenneth","time":"00:08:39-2","content":"Right. It was right around my area."},{"speaker":"Marcus","time":"00:08:41-6","content":"Yeah. Okay. You must know A.C.?"},{"speaker":"Kenneth","time":"00:08:44-5","content":"Oh yes. A.C. and I went to junior high together. Cohen, Joseph Cohen."},{"speaker":"Marcus","time":"00:08:50-0","content":"Yeah that's right. So your uncle Al, did he stay in your life when you became an adult?"},{"speaker":"Kenneth","time":"00:09:00-5","content":"Oh he died. Yeah he did support some things after I came back to New Orleans he stayed on my father about supporting me in school. I was kind of a standout athlete. My dad had no real you know."},{"speaker":"Marcus","time":"00:09:19-4","content":"Real way of understanding to encourage?"},{"speaker":"Kenneth","time":"00:09:22-0","content":"People telling him, \"Man, you need to go watch your son play ball\" And this and that and he would say, \"Yeah.\" But never supported it so my Uncle Al used to be on him about supporting me. He had his own family in Mississippi so he really couldn't go back and forth you supporting me in that manner."},{"speaker":"Marcus","time":"00:09:37-9","content":"Did your brother play ball?"},{"speaker":"Kenneth","time":"00:09:41-8","content":"Oh yeah. He played ball as well but he never really took to it that pretty much was trying to follow my footsteps."},{"speaker":"Marcus","time":"00:09:47-2","content":"What about any particular memory of a teacher?"},{"speaker":"Kenneth","time":"00:09:53-8","content":"Oh yes. In my younger days or later?"},{"speaker":"Marcus","time":"00:09:57-7","content":"All through."},{"speaker":"Kenneth","time":"00:09:59-2","content":"When I got to St. Aug I had stand out teachers. I had a director. Mr. Andrew Davis at St. Aug and I had Coach Otis they were scholars and they understood after knowing my situation that I came from a poverty stricken family. Really no support."},{"speaker":"Kenneth","time":"00:09:59-2","content":"So Mr. Davis led me to getting pretty much after school job at St. Augustine doing bingos and stuff like this or cleaning up the priest house. To give me a little extra money to support myself, so in essence that would be the person that, Mr. Andrew Davis, he was our English teacher. He spoke four or five different languages. He taught there for years before my arrival."},{"speaker":"Marcus","time":"00:10:51-9","content":"That's a very well-known school. So any trouble with the law? I mean you said you got busted with a joint."},{"speaker":"Kenneth","time":"00:10:59-0","content":"Yeah. They didn't bring any police in. They just suspended me from school and I just transferred to Nicholls."},{"speaker":"Marcus","time":"00:11:05-7","content":"Did you have any other brushes with the law?"},{"speaker":"Kenneth","time":"00:11:08-7","content":"This my first offense. I got a first degree murder charge. I had never had a traffic ticket before this."},{"speaker":"Marcus","time":"00:11:15-2","content":"Well we're going to get there in a second. What about, was there fighting at home?"},{"speaker":"Kenneth","time":"00:11:20-2","content":"No we really no. I mean my father and I had little spats as I was growing up coming in late but no real, no physical altercation. He threatened me with making me stay in and this and that."},{"speaker":"Marcus","time":"00:11:38-7","content":"What about outside the home?"},{"speaker":"Kenneth","time":"00:11:40-4","content":"Fights? No I had a couple of fights but there was little school, domestic type, over girlfriend type stuff so it wasn't anything heated."},{"speaker":"Marcus","time":"00:11:54-2","content":"Tell me about girlfriends."},{"speaker":"Kenneth","time":"00:11:56-8","content":"I had a few of them. When we was all kids you think you're in love you. I end up getting two chicks pregnant before I even get to St. Aug and they held a conference with me because that was really prohibited. I wasn't supposed to have a scholarship going there but being an athlete they made exceptions and knowing my background that I really had no financial support and this and that."},{"speaker":"Kenneth","time":"00:11:56-8","content":"So I was allowed to enter the school but I had two chicks pregnant around the same time and they allowed me to go there and like I said, we thought we was in love but no just and eventually I had another which became to be my codefendant of mine on this charge. She had my youngest daughter. So I have a son and two daughters."},{"speaker":"Marcus","time":"00:12:49-0","content":"Okay. All right. And are they still in your life?"},{"speaker":"Kenneth","time":"00:12:54-4","content":"I talked to my son a few nights ago. We are not close. I call occasionally because I don't want to burden them with my problems. So, he was telling about my grandson who is overweight. He had made commitments to Alabama. He'd done got over 400 pounds and they're trying to work weight off of him."},{"speaker":"Marcus","time":"00:13:14-6","content":"This is your grandson?"},{"speaker":"Kenneth","time":"00:13:17-1","content":"Oh yeah. He's a standout athlete. But he messing up kind of like he and I don't know at the same age as my son. I mess up. We just decided to, he was a great athlete too but he decided to raise a family. So he ventured off into a family and got four kids."},{"speaker":"Marcus","time":"00:13:33-4","content":"They're in New Orleans as well?"},{"speaker":"Kenneth","time":"00:13:35-8","content":"No they're in Texas. Katrina rerouted them. I mean it is sad but that did put him in a better position. So he hasn't stumbled since."},{"speaker":"Marcus","time":"00:13:45-4","content":"What about folks who visit you up here? Who visits you?"},{"speaker":"Kenneth","time":"00:13:53-2","content":"I have a cousin. He visits occasionally. He really don't have time. His job leads him to different states and occasionally when he has time he'll come visit once or twice a year. My brother was coming when he was alive. But that was pretty much the only one. Mr. Davis the athletic director he used to come until he died. He came faithfully twice a month."},{"speaker":"Kenneth","time":"00:13:53-2","content":"Coach Otis Washington about two or three years ago go he and Judge Hunter, the Hunters went to St. Aug as well they came and spoke to me trying to support me, they said 30 years. I had been in my thirty-fourth year at that time. They would try to do something to assist me in getting out of here."},{"speaker":"Marcus","time":"00:14:45-5","content":"Have you come before the pardon board?"},{"speaker":"Kenneth","time":"00:14:45-5","content":"I went twice and each time they refused the first one. You have to wait every five years. So the last one they granted the hearing but they denied me on the pardon board, so I'm about six months shy of it again so I'll be re-submitting a request."},{"speaker":"Marcus","time":"00:15:10-6","content":"Did you have victim opposition in your case?"},{"speaker":"Kenneth","time":"00:15:13-6","content":"Well it didn't get far enough after they granted it. It didn't get that far to show a victim opposing my release. So it was just the district attorney opposed me."},{"speaker":"Marcus","time":"00:15:27-6","content":"So you never had the hearing?"},{"speaker":"Kenneth","time":"00:15:29-3","content":"Right."},{"speaker":"Marcus","time":"00:15:31-1","content":"So tell me a bit about how you ended up going down. It's a first arrest so how did you go from being a star athlete, doing well in school, you graduate from school to?"},{"speaker":"Kenneth","time":"00:15:51-3","content":"Well I think my downfall was when I did get knocked off from St. Aug. See Coach Walsh and Mr. Davis was kind of role models for me keep me in the right direction then when I went to public school everything kind of went downhill. So it caused a bit of conflict in the house, my dad was, he never really supported me financially."},{"speaker":"Kenneth","time":"00:15:51-3","content":"When I was playing football, really had no job. I was doing a little part time thing to get a little money for miscellaneous. It wasn't nothing to do anything with. So in turn that kind of forced me into the street to try to do a little juggling, to really prove a point to him that I could survive on my own. So when I moved out of house with him I just start trying to hustle."},{"speaker":"Marcus","time":"00:16:45-2","content":"Sure."},{"speaker":"Kenneth","time":"00:16:48-7","content":"That really started the bad path or put me in a position where this incident occurred."},{"speaker":"Marcus","time":"00:16:53-8","content":"So when you say that, so you're selling drugs?"},{"speaker":"Kenneth","time":"00:16:57-1","content":"I was. Yes I was selling but it was, I wasn't no local just straggling picking up little bits and pieces. I never got established with it."},{"speaker":"Marcus","time":"00:17:08-4","content":"Sure. Did you feel the need to have a firearm?"},{"speaker":"Kenneth","time":"00:17:11-7","content":"Yeah in the area. That was pretty much a custom in our neighborhood. And it wasn't for any real like robbing or something it just was for like it was just standard procedure. Pretty much everybody had them."},{"speaker":"Marcus","time":"00:17:35-0","content":"I understood that and I also have heard folks say that nobody's dealing drugs without a firearm."},{"speaker":"Kenneth","time":"00:17:38-9","content":"Right."},{"speaker":"Marcus","time":"00:17:44-4","content":"What happened, was it drug related?"},{"speaker":"Kenneth","time":"00:17:46-5","content":"No it wasn't drug related. The codefendant was my girlfriend I told you had the youngest child."},{"speaker":"Marcus","time":"00:17:51-6","content":"Do you still have some kind of a relationship with her?"},{"speaker":"Kenneth","time":"00:17:54-5","content":"No she committed suicide."},{"speaker":"Marcus","time":"00:17:57-6","content":"I'm sorry."},{"speaker":"Kenneth","time":"00:17:58-9","content":"This little incident, I knew it was suicide. She brought my daughter to my mom's house one morning and she and some dude went down a really common highway around our area and ran up to a pole and killed herself and the dude. That's how that ended."},{"speaker":"Marcus","time":"00:18:22-5","content":"So drugs and alcohol at all a part of your life?"},{"speaker":"Kenneth","time":"00:18:28-8","content":"Never. I have smoked a little weed. I've even drank here and there but not."},{"speaker":"Marcus","time":"00:18:34-0","content":"Nothing that was a lifestyle that made your life unmanageable or anything like that."},{"speaker":"Kenneth","time":"00:18:35-3","content":"No."},{"speaker":"Marcus","time":"00:18:38-3","content":"So let me ask you this. I mean in some ways it's not possible to answer this in terms of you knowing how your life would have turned out but let's just say that that you never met that person that day. I'm sure you've thought about this a lot. What if that day hadn't happened? How do you think that your life would have unfolded for you in the next few months and years?"},{"speaker":"Kenneth","time":"00:19:03-3","content":"I probably wouldn't be alive to be perfectly honest because I was too eager to mess with women and with the viruses and AIDS and stuff being out there and I was just freelancing, I probably would have gotten AIDS or be dead or something by now because I really hadn't grown. I still had an adolescent type of mentality. I wasn't too responsible in that area."},{"speaker":"Marcus","time":"00:19:42-7","content":"Sure. But you don't think that you would have succumb to gun violence and been killed that way?"},{"speaker":"Kenneth","time":"00:19:42-7","content":"No."},{"speaker":"Marcus","time":"00:19:47-9","content":"Right. So you think it just would have been from a risky sort of sex sexual activity?"},{"speaker":"Kenneth","time":"00:19:50-5","content":"Right. Not any violence or."},{"speaker":"Marcus","time":"00:19:53-8","content":"Okay yeah. So what I'm going to do is sort of shift gears and start to talk a little bit about you coming here and all of the things you've been doing for the last 30, almost four decades. It's hard to imagine. But before I do is there anything else about your coming up that we didn't get a chance to talk about that's really kind of an important part of who you are today that we didn't cover? We talked about quite a few things but did we miss something?"},{"speaker":"Kenneth","time":"00:19:53-8","content":"Nothing that no. Well I think too that in my senior year of high school Coach Walsh transferred to LSU, and they brought in a coach from somewhere else and he never we never had any real relationship and I think that kind of contributed to my going off although like I say I was trying to juggle a little weed and stuff that I took from my dad to make money to support myself. But with his absence they really gave me no one to really look up to. So that kind of assisted my venturing off."},{"speaker":"Marcus","time":"00:21:15-9","content":"Yeah. It's something you said earlier on it's really quite extraordinary that your coach would come and visit you up here."},{"speaker":"Kenneth","time":"00:21:19-7","content":"Oh yeah."},{"speaker":"Marcus","time":"00:21:22-9","content":"On a regular basis. It's a long drive."},{"speaker":"Kenneth","time":"00:21:27-0","content":"Oh yeah. And he'd done it faithfully until he died. And initially I know we had a good relationship. When he used to call me good to the banquets, the bingo to work and get me that additional money and I really didn't think that he would be the one to step up in that time of need and he came. He's the man. \"I got your back where I can.\""},{"speaker":"Marcus","time":"00:21:58-5","content":"I mean there are people whose own fathers don't come up here."},{"speaker":"Kenneth","time":"00:22:04-2","content":"Yeah."},{"speaker":"Marcus","time":"00:22:01-2","content":"You must have had an incredible impression on him. Wow. Maybe you're also a really good ballplayer."},{"speaker":"Kenneth","time":"00:22:14-4","content":"I was all right."},{"speaker":"Marcus","time":"00:22:17-4","content":"So one of the reasons that we wanted to talk with you Mr. McGee that you're one of many folks who came here very young, but so let's go back to the character McGee who's being driven in the bus down here. Do you remember the bus ride?"},{"speaker":"Kenneth","time":"00:22:35-5","content":"Oh yeah I remember that well. We came on a bus attached to someone else. We was attached by leg, by restraints to another person."},{"speaker":"Marcus","time":"00:22:44-9","content":"Was it paved? Was the road paved?"},{"speaker":"Kenneth","time":"00:22:48-5","content":"No they had the snake road then. It's kind of straight coming into this prison now. They used to have curves for twenty miles. Looking in down in the top the trees in the ravines which we really couldn't see coming in early that morning."},{"speaker":"Marcus","time":"00:23:04-2","content":"Right. So what was going through your mind?"},{"speaker":"Kenneth","time":"00:23:07-3","content":"Well hearing the stories of what goes on in Angola, you have to make preparations to either be ready to fight or be ready to kill somebody. So getting here they used to keep us on the hill for about two weeks to prep us up for the population."},{"speaker":"Kenneth","time":"00:23:07-3","content":"So in my two weeks I talked to a few dudes that worked up there and they would tell you how things go down here and it gave me an opportunity to kind of know what was going on so the older guy called himself supporting me gave me a little pear knife to bring down here with me."},{"speaker":"Kenneth","time":"00:23:07-3","content":"He said, \"Man if someone asks you to bring your bags and stuff then they're trying to mess with you .So you've got to go take care of your business though. Don't be somebody's punk.\" So I came with a kind of a grudge. Well it really wasn't a grudge. I just wouldn't do that so I had a choice to make."},{"speaker":"Marcus","time":"00:24:07-5","content":"Right. And was there a lot of sort of daily violence in terms of just the prison environment when you were here?"},{"speaker":"Kenneth","time":"00:24:13-8","content":"Yes. When I first came in '82 I came in May of '82. It was terrible. A lot of dudes that got off the bus with me they succumb to a lot of stuff that occurred. And luckily I had been what you call 'schooled in the parish' and by some elder that had been up here they were saying, \"Man, with the way you conduct yourself I don't think you would ever have a problem,\" Because I don't play. I'm not into drugs. I don't mess with the homosexuality. So, I'm not really trying to school up with anybody to fall back in. So I'm kind of a loner."},{"speaker":"Marcus","time":"00:24:50-5","content":"Yeah."},{"speaker":"Kenneth","time":"00:24:57-1","content":"I've never really had any problems in those areas."},{"speaker":"Marcus","time":"00:25:01-5","content":"Yeah sure. And was it a time where everybody felt the need to have some kind of a weapon?"},{"speaker":"Kenneth","time":"00:25:05-1","content":"Oh yeah. That was true. When I came here you really had to keep something around you in the area of close, at hand in case something did kick off because the things, the tension was just it was here. It was thick enough that you felt that you just always on the edge of making, forcing you to be observant when you seeing somebody walking around or doing something and knowing something about to go on. So if you had any confrontation with a person you might as well do them or then do it."},{"speaker":"Marcus","time":"00:25:44-0","content":"Right. A very different place."},{"speaker":"Kenneth","time":"00:25:45-2","content":"Right. Yeah."},{"speaker":"Marcus","time":"00:25:46-9","content":"What kind of a person were you when you came in here?"},{"speaker":"Kenneth","time":"00:25:51-0","content":"Well I'm pretty much just stayed the same. I've been the same. I just never really embraced the crowd of people I pretty much allowed a person to play into me with conversation. I never just forced conversation or try to get personal with a person unless they open that door to find out where I'm from."},{"speaker":"Marcus","time":"00:26:21-1","content":"Right. All right. How different are you today if at all? Do you think you're pretty much the same?"},{"speaker":"Kenneth","time":"00:26:24-7","content":"In some ways but a lot more mature in ways and I'm not as an eager to confront issues. Back then a situation didn't seem right you had to confront it and bring it to a head. Now I'm more laid back and I listen and I see where a person at and I've transformed in terms of trying to use my situation to in a positive way."},{"speaker":"Kenneth","time":"00:26:24-7","content":"I feel like I forfeited my life and I see a lot of youngsters that's coming here they've gone straight and I try to pull them to the side and say, \"Man, come on bro. Go to the law library. Smoking mojo and doing this and that. That's not the answer. You're going to wind up being here all these years like I've been here.\""},{"speaker":"Marcus","time":"00:27:17-2","content":"When you look at some of these guys coming in, do you see your young self sometimes in them?"},{"speaker":"Kenneth","time":"00:27:26-1","content":"In some it's rare. These youngsters they're so hard to reach with all these chapels and Biblical avenues that they are trying to approach them. They reject right off the top. So you have to have somebody that's kind of walking in a straight line and religious to approach him because if not you're going to lose them right off the top. If you come to them with Jesus type topics, they ain't trying to hear that."},{"speaker":"Kenneth","time":"00:27:26-1","content":"So if you have some type of street knowledge combined with doing right then you maybe can penetrate."},{"speaker":"Marcus","time":"00:28:03-5","content":"Are you a religious person?"},{"speaker":"Kenneth","time":"00:28:06-7","content":"Oh yes. I've always been but I've done all kinds of stuff on the side that wouldn't done did last year or so I've been more in tune to religion. I go to church faithfully now and try to."},{"speaker":"Marcus","time":"00:28:28-1","content":"So what's your typical day like now? What's your routine so if he hadn't been kind enough to come over here today what would you be doing?"},{"speaker":"Kenneth","time":"00:28:35-1","content":"Okay well I just got in a carpenter school. I've been working in a garment factory making T-shirts where they got this lady from Saint Gabriel is supervising it. So she really don't know the procedures of Angola so she tries to work you to death."},{"speaker":"Kenneth","time":"00:28:35-1","content":"So I let her know from the beginning that I would stay there long enough to teach dudes how to sew, that sew pool, but don't expect me to be there. I've been here thirty-seven years and I'm not working hard like that anymore. So I just do enough to."},{"speaker":"Marcus","time":"00:29:03-3","content":"Just this is a security person?"},{"speaker":"Kenneth","time":"00:29:06-7","content":"Yes she's security. In a day it's normal breakfast. They have the same thing almost every day. That you get so tired of. I barely go to the cafeteria. I just eat little stuff out the canteen and this and that. So after 30 years you can imagine grits and chicken and everything and don't even taste like it especially when it's not prepared properly. Got to be mindful of the things you eat around here, because the cafeteria is so nasty."},{"speaker":"Kenneth","time":"00:29:06-7","content":"In fact I cooked until about six months ago until they dragged me over there to the garment factor. I was cooking in the cafeteria for a while and I used to have confrontations with my co-workers because they were so filthy. I'm not going to do food that. So it caused a problem. But after a while they understood and followed suit to try to make it clean and taste better."},{"speaker":"Marcus","time":"00:30:23-1","content":"Sure. Yeah you might as well. What about, there's so many clubs and organizations here some people just don't want to deal with all of those things and they still go on and do good things but they don't do it through the clubs. What about you? Have you been part of a lot of the organizations here?"},{"speaker":"Kenneth","time":"00:30:26-3","content":"I've been attached to a few but the clubs here mean that you have to kind of cater to security in a sense and that's been one of the things. Back when I come, security and prisoners always had a gap. Here recently it's been emerging and prisoners are doing a lot of security type work."},{"speaker":"Kenneth","time":"00:30:26-3","content":"I never really wanted to put myself in that kind of position. And organizations and clubs and stuff I've been often asked to take positions and stuff. I just never really want to the responsibilities of it. Like I say a certain things as years go, I push them aside if you just dwell on a bad decision that you made yesterday and harbor it, it'll eat you like cancer so I think that's been kind of a part of my survival and longevity here because I'm able to push them aside."},{"speaker":"Marcus","time":"00:31:31-6","content":"Yeah I've noticed that. There are some people who have a very sort of privileged status and can kind of do whatever they want. Security tends to not but they may not always have all of the respect from."},{"speaker":"Kenneth","time":"00:31:51-6","content":"From the prisoners, right. You have to kind of balance it. I mean I have to respect, mutual respect from security. You have prisoners without them, \"Oh no he's a rat.\" That kind of situation. That's how I prefer it."},{"speaker":"Marcus","time":"00:32:06-0","content":"Yeah. I understand very well. What is it honestly that you feel about it now when you look back on the crime and what happened and the victim and the victim's family? Are you, what is the?"},{"speaker":"Kenneth","time":"00:32:06-0","content":"It's a kind of touchy situation. I feel sad for the victim's family. The victim--my family is also victimized because of it. But I feel like I let a lot of people down with one bad decision and I really would like to be able to share that with the victim's family."},{"speaker":"Kenneth","time":"00:32:06-0","content":"If I was ever able to that it was a situation that was senseless and whether I get out of here or not it was a bad decision on my part. I would like to apologize to them if ever given the opportunity to. I've apologized to myself. That's the main thing I was pondering myself for years and years."},{"speaker":"Kenneth","time":"00:32:06-0","content":"I said, \"Man you've got to just let it go. That's a decision that was bad, and you made it and just have to roll with the punches now.\" It has affected my family. They're the ones that tried to support me, and I'd let my cousin know the last time I spoke to them I said, \"Man, Little Joe\" Joe he'd been real supportive. He was kind of like a fan of mine when he was young and in football."},{"speaker":"Kenneth","time":"00:32:06-0","content":"I said, \"Man there comes a time where you got to just cut the rope.\" He said, \"Man, I'm going to be with you.\" And he tries to send me money here and there when he can and I be letting him know, \"Man, I'm cool.\" I don't just want to drag anybody else down for a bad decision I made I appreciate you're being here a lot easier. I'm good."},{"speaker":"Marcus","time":"00:34:08-5","content":"In your own family who do you think struggled the most with you being sent here?"},{"speaker":"Kenneth","time":"00:34:14-3","content":"Pardon me?"},{"speaker":"Marcus","time":"00:34:15-8","content":"In your own family, who were also victims in this situation, who do you think in your family had the toughest time?"},{"speaker":"Kenneth","time":"00:34:23-4","content":"My father. He came periodically when he was alive but it did, it aided him. He really, he broke down every time he came to visit. So I kind of pushed him away to tell him, \"Man, its okay this month. I'll call you when I can.\" Put some distance in the visits because he broke down every time. Even though he didn't really support me in sports and stuff. Just that my coming here knowing that I wasn't really criminal minded, it disturbed him."},{"speaker":"Marcus","time":"00:34:59-7","content":"That couldn't have been easy for you."},{"speaker":"Kenneth","time":"00:35:03-9","content":"Right. Oh yeah that was harder for them."},{"speaker":"Marcus","time":"00:35:07-4","content":"Sometimes I think that visiting days here got to be just mixed emotions because you're happy to sit with them and it's also just kind of sad."},{"speaker":"Kenneth","time":"00:35:17-1","content":"Yeah to see the person leave and it's just a mental drain. When I used to come from visits I used to have to go straight to sleep. It was a mental exhaustion."},{"speaker":"Marcus","time":"00:35:29-2","content":"Yes. So look if the parole board or the pardon board rather gets a chance to see you again and you do get an actual hearing which you've never had you'll have you'll obviously give them your materials and your jacket and all the various things that you've done and disciplinary records and all that stuff."},{"speaker":"Marcus","time":"00:35:29-2","content":"You'll have a very short window of opportunity to talk to them and tell them who you are saying, \"Mr. McGee, what do you want to tell us today?\" What would you tell them?"},{"speaker":"Kenneth","time":"00:36:01-6","content":"I would tell him that I'm convicted of murder. I'm listed as a murderer. I killed a person but I'm not a murderer. I have no criminal intentions of doing anything once released. I was a youngster. I made decisions in my twenties that I wouldn't have made in my thirties."},{"speaker":"Kenneth","time":"00:36:01-6","content":"Decisions in my 30s that I wouldn't have made in my 40s and so forth. I'd probably make decisions that wouldn't make ten years from now. So I matured and I respect and honor every individual. It caused me to think most situations out"},{"speaker":"Marcus","time":"00:36:41-3","content":"That's sort of impulsivity is part of what we're trying to focus on. I mean again I think 18, 19, 20 year olds they're not thinking through the consequences of anything."},{"speaker":"Kenneth","time":"00:37:02-6","content":"No and I talked to a lot of guy that are on the juvenile life situation and I found it strange that society doesn't notice that juveniles don't think like adults. I'm sure if they look back to their juvenile years up until where they're at, I mean they've made decisions that they wouldn't make today."},{"speaker":"Marcus","time":"00:37:20-9","content":"Right. So earlier on you had said something to me and you said that, \"I've kind of come to terms with the fact that I have shot my life.\""},{"speaker":"Kenneth","time":"00:37:39-8","content":"Right."},{"speaker":"Marcus","time":"00:37:41-8","content":"I think also with the passage of time as you think of the amount of time you have left you start to think a little differently. I mean I also start thinking a little bit like that as I get older I start thinking of time left as opposed to time spent."},{"speaker":"Marcus","time":"00:37:41-8","content":"And since you have spent so much time here when you think of the possibility of not ever leaving, how do you cope with that?"},{"speaker":"Kenneth","time":"00:38:04-6","content":"I tried to do good deeds where I can. That's a sense of relief, of tension knowing that I'm on the downhill side of my life, my possibility of being released is real slim. So I tried to seek out people that I feel is worthy of the knowledge that I have, or whatever I have to share to them that they could use in their life. So that pretty much keeps me from just throwing in the towel completely."},{"speaker":"Kenneth","time":"00:38:04-6","content":"So I just go on and I see a person that like I have a lot of hobby shop stuff that I have accumulated. Sewing machines and this and that. I'm just burned out on that. So I'm seeking someone younger or that's interested in this that I could just put in the hoppy shop here. Take it and run with it."},{"speaker":"Marcus","time":"00:39:02-1","content":"I mean I think that partly what you're saying is too that another coping strategy is to lead a meaningful life while you're here."},{"speaker":"Kenneth","time":"00:39:13-6","content":"Oh yeah."},{"speaker":"Marcus","time":"00:39:16-4","content":"I mean this is also a community."},{"speaker":"Kenneth","time":"00:39:17-8","content":"I try to look at my spiritual side of it too and then say, \"Well God put people in places for a purpose. It may be my purpose to aid and assist people that's coming after me."},{"speaker":"Kenneth","time":"00:39:17-8","content":"So that they may be able to do the same thing with people coming after them so I try to be a not a fatherly figure but a brotherly figure I don't go try to, \"Man you go do that,\" you won't do that preaching to them because they if you preach to them sure enough they'll avoid you from then on."},{"speaker":"Kenneth","time":"00:39:17-8","content":"So I think that kind of keep me afloat and keep me motivated to strive and there comes times when you're depressed and down on yourself but in those times something always surfaces to give you a little boost to take another step to encourage you to go further."},{"speaker":"Marcus","time":"00:40:22-0","content":"Is that usually relying on some of the few folks that you can trust and become kind of like family?"},{"speaker":"Kenneth","time":"00:40:25-2","content":"Over here?"},{"speaker":"Marcus","time":"00:40:27-0","content":"Are those the folks you turn to in those moments when things get dark?"},{"speaker":"Kenneth","time":"00:40:29-0","content":"It is family! I mean once you've been here so long the prison, the prisoners are your family so you have to encompass yourself around the same caliber of people so that you're really be able to notice in their downtime where you maybe can come to them and give them some uplifting words to push them on."},{"speaker":"Kenneth","time":"00:40:29-0","content":"So like a couple of weeks ago I had a partner that I love like a little brother got killed back at Camp D. He and I were best, I've been knowing him thirty-five years. Something went wrong in the dorm. Dude hit him in the head and knock stomp him to death right in Camp D. He died a few days later. There's things like that."},{"speaker":"Kenneth","time":"00:40:29-0","content":"I left Camp D some years ago. I have an orderly have a little gown CCR. He tried to escape one of the other parishes and he and I had grown to be so close that when I left he had no one to support him. I wrote him, we were writing and I got a letter bounce back to me saying that person was dead. Only to discover that he had hung himself."},{"speaker":"Kenneth","time":"00:40:29-0","content":"These type of things that, as years go, I've learned to expect the unexpected type. So when I get blindsided by these type of things it shakes me but I have to keep walking or it'll shatter a person."},{"speaker":"Marcus","time":"00:41:57-0","content":"Yeah. The killings and suicides have dramatically decreased from when you were first here but they still happen."},{"speaker":"Kenneth","time":"00:42:10-0","content":"Yeah. Some people just get fed up. They get in the cells and start reminiscing of their past and someone of them just rather end it. So, I try to treat everybody right. In those times I've been in cells a few different times and I know how when they say the walls seem to be closing in on you, it seems like it. Sometimes you'll be in there like you just want it to end."},{"speaker":"Marcus","time":"00:42:40-1","content":"If you do get released so you're six months away from another shot at it. So let's say you go up the next time. It has a different outcome. What do you see yourself doing? What's the next chapter for you?"},{"speaker":"Kenneth","time":"00:43:10-5","content":"Well if released I would like to join some type of organization where I could speak to youths or kids or something try to deter their wrongful doings. I've got a grandson. I've got a daughter that we really don't get along. I spoke to her the other day for the first time and it's probably four or five years and I got a grandson that was pending in court. He likes to steal cars."},{"speaker":"Kenneth","time":"00:43:10-5","content":"I was telling her that had you stayed closer to me, and brought him up here where I could talk to him, it probably would have influenced him to take a different route, and I had preached that to her years ago and bring them. You come yourself. Even though I'm not there to support you in the areas that might, but I do have some knowledge that could help you when you get in certain situations. So by you withdrawing or distancing yourself, these types of things occur."},{"speaker":"Marcus","time":"00:44:04-1","content":"Well last question then. I've learned a lot about you and I appreciate you sitting down and sharing your life story. Is there something I should have asked you that I didn't?"},{"speaker":"Kenneth","time":"00:44:20-9","content":"Well no I think we basically covered it all."},{"speaker":"Marcus","time":"00:44:25-4","content":"We did. All right. Well thank you very much."},{"speaker":"Kenneth","time":"00:44:30-4","content":"Okay and thank you all for coming."}]}