{"name":"","transcript":[{"content":"Kenneth Hill Transcription REDACTIONS FINAL"},{"speaker":"Kenneth","time":"00:00:00-4","content":"All right. My name is Kenneth Hill. I been incarcerated since I was 18 which is now 28 years incarcerated June 27th 1990."},{"speaker":"Marcus","time":"00:00:10-5","content":"What was your charge?"},{"speaker":"Kenneth","time":"00:00:12-1","content":"Second degree murder."},{"speaker":"Marcus","time":"00:00:13-9","content":"Where did you grow up?"},{"speaker":"Kenneth","time":"00:00:15-8","content":"I grew up on the West Bank of New Orleans in Algiers mostly in the Fisher Housing Project"},{"speaker":"Marcus","time":"00:00:20-5","content":"Okay. So I'm going to start by asking you a few questions about you coming up and about those first 18 years and then we'll switch gears and talk about Angola a little bit. Tell me a little bit about your family. Who raised you and who?"},{"speaker":"Kenneth","time":"00:00:38-1","content":"I was raised by a single mother. I had a step-father but mostly my mother raised me, until I got to like 9 years old. A guy came into my life, my step-father, who kind of like gave me a few principals. I have one brother one sister. My brother was is now 47 and I'm 46. My little sister is 35 when I came to jail she was 11. So, it took a toll on them me being incarcerated in prison."},{"speaker":"Marcus","time":"00:01:12-1","content":"Okay, so your mom and then step-father. Did that relationship remain stable? Were there other men that came into your mother's life?"},{"speaker":"Kenneth","time":"00:01:22-4","content":"No. For a long time for about ten years they were together but I like they had a lot of fall outs inside the house, mostly about money, bills. My mother worked for the school board, my step-dad worked for a tire company and mostly of the time, the casino wasn't really was what it was back then."},{"speaker":"Kenneth","time":"00:01:22-4","content":""},{"speaker":"Kenneth","time":"00:01:22-4","content":"She would get money from his check she would just be free and let people using her. My mother worked since she was like 15 years old. She been working all her life and most of the time, older man, talk about 17 years old and most of the fights were behind money in the house."},{"speaker":"Kenneth","time":"00:01:22-4","content":"Normally she would have to pay the bill and she would be like double up. He'd be like why did you do that? Before you knew it he would hit her and she's fighting him off but other than that, when he first came into our life, it was good you two boys 8, 9 years old, raised us. She had my little sister 8 years later for him, it was good. He would get a chance to play ball with him and stuff. Kind of like he tried to be a male figure for two young boys at the time."},{"speaker":"Kenneth","time":"00:01:22-4","content":"Outside the accuracy I'm not mad about John because after him, my mother finally got to the point where she just finally got tired of getting into it with the fighting, he left. But he was the only male figure I had in my life as far as a role model inside the house. I never knew my father, just found out that the person that I thought my father was wasn't his name."},{"speaker":"Kenneth","time":"00:01:22-4","content":"It's something that you should know that, my legal name, I found out when I got married in 2012, well 2011 that my legal names is Hilton Junior Hill."},{"speaker":"Kenneth","time":"00:01:22-4","content":"I didn't find that out because I was trying to get married and needed my birth certificate came out. My ex-wife, just got divorced like a couple weeks ago. She was what I wrote my name, my social security, my date of birth but all that master date, the name that they recognized but the name didn't match. So she was like \"What's your real name?\" I said Kenneth Hill\" \"Well, I went down there.\""},{"speaker":"Kenneth","time":"00:01:22-4","content":"She called my little sister, my little sister like \"My brother's name is Kenneth Hill\" Called my mom said, \"Ask them is it Hilton.\" And they said \"Yes, it's Hilton\" They gave it to her and I'm still here thinking my name is Hilton Martin Junior now come to find out that it's not Hilton Martin Junior, she just named me after the guy she was messing with in the 70s and my name is Hilton Junior Hill."},{"speaker":"Marcus","time":"00:04:11-5","content":"Okay interesting. So you confused me a little bit just then when you said that you got married in 2011, 2012, but you then said your ex-wife, you got divorced a few weeks ago?"},{"speaker":"Kenneth","time":"00:04:21-2","content":"Yeah, I got married 2000, January 27th of 2012. We separated September 2015 and I just got…"},{"speaker":"Marcus","time":"00:04:32-5","content":"Oh I see, that's the one that's the ex-wife."},{"speaker":"Kenneth","time":"00:04:35-1","content":"…yes."},{"speaker":"Marcus","time":"00:04:37-0","content":"Okay, I got it. So, before we move on, tell me a little bit about that. How did you meet your wife?"},{"speaker":"Kenneth","time":"00:04:44-0","content":"I worked at the business shaved glass 22 years. So I had the opportunity to meet people and I started talking to her and we started communicating and by the end I asked her to marry me this was like in 2011, we got married. We stayed married up to- well, we stayed married."},{"speaker":"Kenneth","time":"00:04:44-0","content":"She came up here three and a half, four years straight every two weeks. Then go off of that. At one point, we were married a guy with a life sentence hoping and praying he might get out, it was time for her to move on and that's what she chose to do. I'm faithful for that because she did allow her grand-children her children to come in my life and I was thankful for that."},{"speaker":"Marcus","time":"00:05:29-5","content":"Yeah, no, I can only imagine that that was very difficult."},{"speaker":"Kenneth","time":"00:05:35-3","content":"It was a difficult time. I tell people all the time. And people know that she's a good woman. I have been working in the business share a long time with that. You can't really hold a marriage or hold a relationship in prison. You know, especially a marriage because bills and things going on and even I'm in a position but down the line, it's going to fall unless you get out."},{"speaker":"Marcus","time":"00:06:00-1","content":"I understand. It surprises me though how many people who are here got married after coming here. Somebody they met at the rodeo or a friend of a friend visiting."},{"speaker":"Kenneth","time":"00:06:15-9","content":"It's a strange thing to get at Angola. People say \"Why you get married?\" I say \"Because I was in love.\" I mean, I had been incarcerated since I was 18 years old and you know, I got me somebody and she loved me and we decided to get married and you get caught up."},{"speaker":"Marcus","time":"00:06:34-6","content":"It makes sense to me. What was her name?"},{"speaker":"Kenneth","time":"00:06:37-0","content":"Her name was Robin."},{"speaker":"Marcus","time":"00:06:39-7","content":"So, let's get back, you were saying that there's a fair amount of violence in the house between your mother and father over money. Did any of that violence trickle down to the kids?"},{"speaker":"Kenneth","time":"00:06:51-9","content":"No because most of the time it was just them two fighting. He whooped us you know, my brother might have stole some money out of his pocket, most of the time he whooped my brother like if he did something wrong but, my momma was. She's a very angry person, she was strict and she had her breakdowns. I didn't understand it back then why she would act the way she acted but she comes from Mississippi. The only way she knew how to act was by loving you and whooping you and when you do something, she's going to whoop you."},{"speaker":"Kenneth","time":"00:06:51-9","content":"She ain't going to let it get by. They were times she would hit you with a stick, mop, you know anything she got her hand on. Because she didn't know any other way of showing how to just get you right and then, down the line, she started letting everything pile on and school letting it add up and then she would just explode. You knew it was coming and she'd always catch you in the bathroom, you can't run."},{"speaker":"Marcus","time":"00:07:56-9","content":"I see, so there was a fair amount of violence in the house."},{"speaker":"Kenneth","time":"00:08:00-9","content":"Yes to my mom, between the two of them they was a lot of violence."},{"speaker":"Marcus","time":"00:08:05-3","content":"Between you and your mom."},{"speaker":"Kenneth","time":"00:08:06-5","content":"Yeah, me and my momma too because she don't play. Still don't play."},{"speaker":"Marcus","time":"00:08:13-7","content":"Tell me what your siblings are doing now."},{"speaker":"Kenneth","time":"00:08:16-8","content":"Well, my little sister, she just graduated. She's a nurse. She works out at a BA center. She left New Orleans. Now she's at a place where she works in operations. My oldest brother, he's a farmer, he's been a farmer for like 25 years at Bull Brothers farmers. So, he's been there a long time."},{"speaker":"Marcus","time":"00:08:43-6","content":"Okay, sure but he's in New Orleans also?"},{"speaker":"Kenneth","time":"00:08:45-6","content":"Yeah, he's in New Orleans. Both of them are in New Orleans."},{"speaker":"Marcus","time":"00:08:49-4","content":"Alright. So, who would you say you got along with best in the family before, certainly before these charges? It may have changed over time, but when you were coming up, who were you closest to?"},{"speaker":"Kenneth","time":"00:09:04-3","content":"Me and my brother. We never really stayed that much apart. We did a lot of things, played football, played the band did a lot of things, but over the years, it's just Terry. I had a lot of anger towards and that's one thing I realized being incarcerated, I had a lot of anger. I always wanted to, because I worked in a shade I see a lot of guy's brothers and daddies and mommas coming and I used to wonder why my brother wouldn't come see me to this day."},{"speaker":"Kenneth","time":"00:09:04-3","content":"The last time I saw my brother was the day I got married was January 2012. I mean, he takes care of the family and send to college and stuff but it hurts me that my brother doesn't feel the pain that I'm going through. So I just put him in God's hand. I always quoted [inaudible] [00:09:59]."},{"speaker":"Marcus","time":"00:09:57-2","content":"Things you can't change."},{"speaker":"Kenneth","time":"00:09:58-7","content":"Yes, put in God's hands things I cannot change. So, I just put them in God's hands and hopefully one day he might come around. I call him, he'll send me money, but money's not everything. It's just a personal relationship."},{"speaker":"Marcus","time":"00:10:16-3","content":"Was that something that was there and then you just used the word deteriorated. That he would come and visit and slowly that would trail out?"},{"speaker":"Kenneth","time":"00:10:24-9","content":"He would come and up when I first got at Angola, the first couple years but he never did like leave me. That was that way he would hate leaving me out the gate and he was a stranger because like, my brother doing that. I was kind of like in my own field like other brothers come up and see their brother, who are you? What makes you special? But he can't feel that he been here only…"},{"speaker":"Marcus","time":"00:10:56-2","content":"Is it possible that it was just too difficult for him?"},{"speaker":"Kenneth","time":"00:10:59-2","content":"Yeah, very difficult. It is difficult the fact that, being out all these years, like I said I can talk to him and call him but he wouldn't, for some reason, he wouldn't come around."},{"speaker":"Marcus","time":"00:11:13-5","content":"I guess what I mean, obviously, I don't know the situation, but I think maybe there's a difference between somebody who stops visiting you because they stop really caring and somebody stops visiting because it's just too painful."},{"speaker":"Kenneth","time":"00:11:29-3","content":"He cares, I know he loves me. He always says he loves me. I was just on the phone with my mom the other day, she tell me she said, \"Well, Kenneth, just like you said, just let him go ahead\" I can't make him come see me. I wish one day that he just might. They say you got a visit. And one day it just might pop up and it be him. Those are my prayers."},{"speaker":"Marcus","time":"00:11:29-3","content":"I'm sort of familiar with Algiers but I'm not very familiar with official housing project."},{"speaker":"Kenneth","time":"00:12:02-7","content":"It's right by the bridge, right there. It's on the bridge, it's right there."},{"speaker":"Marcus","time":"00:12:06-5","content":"Okay, so can you paint a picture for me what was right outside of your unit, where you were living? Like you know I'm sitting on the stoop with you and what's going and what am I hearing and smelling in your building and I know it's a long time ago."},{"speaker":"Kenneth","time":"00:12:22-3","content":"Well, we grew up in a house that was close to the bridge was more the quiet side- people could raise their kids on that side, different side might be with a lot of stuff going on. Mostly, you know, boys being boys, shooting marbles, playing ball, getting in fights, constant fighting behind the woods and the stuff like that. You know, I did a lot of fighting. I didn't know why it just liked fighting."},{"speaker":"Kenneth","time":"00:12:22-3","content":"If you come out of Algiers, when you're on the bridge you see the wood area and most of all that you can face is the water area. It's on Delco, Delco faced the wood area. So basically, that's what you had you had the monkey bars and swings and stuff behind them, the project, another part of the project and you could play on the monkey bars with your, as you get older you just start playing football."},{"speaker":"Marcus","time":"00:13:16-7","content":"What about school? Where were you in school?"},{"speaker":"Kenneth","time":"00:13:19-9","content":"I was in 9th grade at Landry."},{"speaker":"Marcus","time":"00:13:25-6","content":"Was that the high school?"},{"speaker":"Kenneth","time":"00:13:27-1","content":"That's the high school that is called Landry Walker now. I went to Fisher School it's in the projects. My mother worked there as a custodian and growing I always wanted to be seen. Being class clown and they hear my name, my mom could hear my name \"Kenneth, come to the office\""},{"speaker":"Kenneth","time":"00:13:27-1","content":"She would meet me there and she would tear my butt up and at that time, she would just have been in the hallway, hanging around, going to clean somewhere and she would see me, \"You want to be the class clown?\" She would just whoop you right in front of the class and back then, that's like, I tell her right now, \"Well you would go to jail for child abuse\" But back then it was just like normal, you know?"},{"speaker":"Marcus","time":"00:14:12-2","content":"Yeah, sure. So was the 9th grade the last grade in school?"},{"speaker":"Kenneth","time":"00:14:17-1","content":"Yeah, I was classified, I just found this out in paperwork, I've been in special Ed since the fourth grade. I got paperwork that said I was a handicap a slow learner. I been in special Ed since fourth grade to 9th grade and it basically just skip you on out. Then I went to 9th grade from 86 to 1990 up to the time I came to jail. I was in school when I came to jail. School had just let out in May. I came to jail June 27th to this day I'm fortunate to have."},{"speaker":"Kenneth","time":"00:14:17-1","content":"It was my football coach/teacher Tyrone Casby he's president at Landry Walker High School now testify in my trial and my band director was Michael McGruder who is now at State University testify at my trial. I had my English teacher testify at my trial. I had my president at the time Charlie Lewis testify at my trial about what type of person I was in school. What type of person I was in the community and I considered myself a good person, just made a bad decision."},{"speaker":"Marcus","time":"00:15:28-6","content":"Okay so we'll get here in a second. So did you ever get kicked out of school?"},{"speaker":"Kenneth","time":"00:15:35-5","content":"I got kicked out of school, I was in the 6th grade. I think that's one of the questions, when was the first time you got arrested. I was either 11, probably 10, 11 years old. My 6th grade teacher, who wound up testifying for me many years later, in my school. She grabbed me out on the yard, to go in and Ms. Growler said she grabbed my pocket on my sweatshirt hood and I just ran and she ripped it and I realize now, shame, I had to be shame, but she grabbed me, the first reaction to me, I hit her. And when I hit her, she slammed me down on the ground and she jumped on me."},{"speaker":"Kenneth","time":"00:15:35-5","content":"But just before that, we had met her husband, he was a police officer and all she could say is \"You going to jail baby, you going to jail baby.\" That was the first time I went to jail for and I went to central lock, I went to juvenile place and I was charged with \"Battery of a teacher.\""},{"speaker":"Kenneth","time":"00:15:35-5","content":"And that was my first time I ever had handcuffs on me, scared to death. 11 years old. And people tried to tell her \"Don't do that\" but she went ahead \"You going to jail baby, you shouldn't have hit me\""},{"speaker":"Marcus","time":"00:16:57-0","content":"Okay, after that, any other brushes with the law?"},{"speaker":"Kenneth","time":"00:17:01-9","content":"As a juvenile, I started going on Bourbon Street, tap dancing, shoe shining and all that stuff there. You had to be on Bourbon Street 8 o'clock back then. You had a curfew. You could tap dance, shoe shine, all day after school. You could go on Bourbon Street after 3 o'clock. I go out there, tap dance, shoe shine, had a few questions with undercover cops."},{"speaker":"Kenneth","time":"00:17:01-9","content":"What type of game, as long as it's legal, other than that, and then, as a juvenile, I wound up getting charged with stuff breaking into houses. I got charged with simple battery for breaking into school, took some, took a teacher, went broke into the classroom and I stole the teacher's purse. They charged me with…"},{"speaker":"Marcus","time":"00:17:47-6","content":"Simple burglary."},{"speaker":"Kenneth","time":"00:17:49-0","content":"Simple burglary. That charge there and possession of stolen property. I was charged with possession of stolen property. Other than that, that's the only charge I had as a juvenile."},{"speaker":"Marcus","time":"00:18:02-6","content":"Tell me a little bit about tap-dancing on Bourbon Street."},{"speaker":"Kenneth","time":"00:18:06-2","content":"Oh that was fun."},{"speaker":"Marcus","time":"00:18:08-9","content":"These bottle caps?"},{"speaker":"Kenneth","time":"00:18:10-4","content":"I had to put taps on. I started out with little cheap taps and that's one of the, I knew, that had to be people finding out one time behind that, because you know, my mom's from Mississippi. She just got that thing, her son out on Bourbon Street tap dancing for white folks she had this thing. That's how she looked at it. But my step-dad looked out it like at least he's not there breaking into somebody's houses all the time and I would tap dance and I could tell you about the, tell you about the shoes and running game and hustling."},{"speaker":"Kenneth","time":"00:18:10-4","content":"It was legit hustling, has long as it's legit the police don't mess with you. Did that for a long time, couple of years and I graduated from that there. I got tired of going there and one time my step-dad bought me some brand new taps and my momma she just had a thing about me going to Bourbon Street. I mean she had an issue and so she took the shoes and she threw them away and I went looking for the shoes and that's the one time that I apologized to my momma a couple years ago."},{"speaker":"Kenneth","time":"00:18:10-4","content":"Because it got real bad out that day because he just bought the shoes for me, he bought the taps. She knew he bought the shoes and they had this big dispute about me going on Bourbon Street and he bought the shoes and I didn't find the shoes and I told him and she threw them away and before you know, he hit her, pow. And he took her head and the project, the way the project walls are like sheet rock and he pushed her head in the wall and she was just fighting him and it turned and she was beat up."},{"speaker":"Kenneth","time":"00:18:10-4","content":"That's one of the ones that I knew I had some involved with was them fighting. I apologized to her and she was like you didn't let me, you didn't understand, you know? But, it was fun, selling popcorn and sipping and you know, doing all the hustling and it was legit hustling selling popcorn and all that stuff. I was a hustler. I could tell you where I got my shoes at all of that on Bourbon Street, got you on your feet, standing on Bourbon Street in Louisiana, I just hustling popcorn and peanuts."},{"speaker":"Marcus","time":"00:20:18-2","content":"So, am I right in assuming that aside from the physical punishment that you had, there was no abuse that you would characterize as abuse in the house towards you or is that…"},{"speaker":"Kenneth","time":"00:20:31-8","content":"Well obviously, it was outside of me doing something, physical abuse you know, she whooped you. But, my step dad, you know, he was cool, he never hit us. He never hit us. One time he got angry he hit my mom, my brother tried to get involved with it and he slung him and my auntie, my brother tried to ran to my auntie and he grabbed a shot gun and that kind of got all got out of control because he about to shot her outside of that, you know, me and her come over here for that reason."},{"speaker":"Kenneth","time":"00:20:31-8","content":"My brother's dad played a part in his life so he would go by his dad on the east who wanted to give him everything he had because that was his oldest child. When me, I never knew anything other than my step dad. My dad was even when him and my mom were a part. He was the only Man I knew so I just followed him."},{"speaker":"Marcus","time":"00:21:22-7","content":"I get that and was there sex abuse in your house?"},{"speaker":"Marcus","time":"00:21:22-7","content":""},{"speaker":"Kenneth","time":"00:21:26-2","content":"No."},{"speaker":"Marcus","time":"00:21:31-2","content":"What about intimate relationships, girlfriends before you came into."},{"speaker":"Kenneth","time":"00:21:35-1","content":"Yeah. I was in high school, you know. First, I tried to think back when I first started having sex. I think I was like 12 years old, I was in 7th grade. Didn't have children, it was just two teenagers dating and up to the time I came to jail in 90. I was physically active but I had a messed up mentality about sex. My attitude was that HIV is out there, I don't wear a condom."},{"speaker":"Kenneth","time":"00:21:35-1","content":"I was like thank God that I didn't get HIV because I was like just doing it with all different girls and I was a player. I played football. I played in the band so I'm well known. I'm supposed to be in the 12th grade, but actually I'm in the 9th grade because I'd been stuck in 9th grade all the years. I have no kids."},{"speaker":"Marcus","time":"00:22:31-6","content":"So, did you find that you had relatively easy access to a firearm?"},{"speaker":"Kenneth","time":"00:22:36-8","content":"Yes, was not in the house, outside the shotgun, we knew that was not to touch because he had it up on a high thing. So that was a no we didn't get the shotgun. Never seen a pistol in our house until I started getting guns."},{"speaker":"Marcus","time":"00:22:56-9","content":"Let me ask you this. Can you briefly summarize the circumstances around the charge that you've been serving all this time for now, almost 30 years ago?"},{"speaker":"Kenneth","time":"00:23:09-9","content":"Well, it was, school let out, I went. I was drugging I was on drugs. I was smoking crack at the time, in high school, drinking. Back then all we did was drink, band and drink, and I was smoking crack which is called a primo. Which is crack and weed and I was doing that and my life had gotten out of control to the point where I was wanting to get from that environment. So I'm with my mom who I thought my dad and brother, who always played a part in life."},{"speaker":"Kenneth","time":"00:23:09-9","content":"So I called my Auntie Elaine and I said I just need to get out of this project away from this here. They still in Harvey and an apartment at that time was real quiet of that neighborhood. So I go by them that morning about a couple of days, I didn't know exactly where she stayed. So we were going by house and a man stopped me on the streets and asked me \"Kenny, where you going back there.\" I said \"I'm going by this chick, by this female.\""},{"speaker":"Kenneth","time":"00:23:09-9","content":"I can't remember the name of the chick, I could tell you how she look right now. Other than she was red. He says this guy walks up to me we passed him up watching, people sit on the back of a truck sometimes, summer time, school's out, typical day and we passed the guys up and when he stopped me, the guy got off the car, and he come down there question me like \"Where you from?, you know what you doing back\" I had this ego, \"I'm from Fisher Project\" Fisher Project and Marrero and Harvey were beefed out we talking and he talking and I didn't see the gun because he had a gun."},{"speaker":"Kenneth","time":"00:23:09-9","content":"I just got so mad that he was questioning me and he had a gun walking off I see the gun walking off and I'm like \"He's showing off\" So the little man in me, I got so angry, I like he's showing off they had this girl and a few girls on the car and I decided I'm going to go back, we went to the car and we turned around, I'm going to show him I said we're going to go pressing him we go back we, one apartment, we go by somebody's house, we back there, got a little 30 gun, we come back up the streets within like 15 minutes."},{"speaker":"Kenneth","time":"00:23:09-9","content":"Come back up the streets. The girls say \"Here come them guys\" We get back I stand, pull up, I see him, but what I know now, I didn't know back then, I didn't understand it. Libby, her name is Libby, when she went inside her door she slammed the door because I had a 30 in my waist. I had a white t-shirt and blue jeans and when she slammed the door, I was scared and I went and got a gun and that's why I got a gun for a fight."},{"speaker":"Kenneth","time":"00:23:09-9","content":"Me and Chris we were going back to fight but I just went and got a gun. I knew they had a gun, come to find out it was a toy gun and when she slammed the door, I just took my gun out and I just started shooting up in the air and running and shooting and I found out the very next day."},{"speaker":"Kenneth","time":"00:23:09-9","content":"I got up that morning nothing happened, I was watching 12 o'clock news and they described me. I left my apartment at Auntie Ell's I went to the project. My mom was still in Holly grove, my auntie told me to call my mama, to come out of Holly grove. I told her what happened. And I turned myself in the very next day like 8 o'clock that next night because I know it was me and I turned myself in. I've been in jail ever since."},{"speaker":"Marcus","time":"00:27:00-9","content":"So who was hit?"},{"speaker":"Kenneth","time":"00:27:02-4","content":"Well, the guy, like I said, there were a bunch of people out there. The guy named Johnny Gilmore. He was 16 years old. He was out there with them but he was on probation parole. He had an ankle bracelet on he come that far, that's why he came up with Pauly with the guy Paul Jackson. He never came up to because he knew he couldn't go out 200 feet so he stopped and that was only why he never came that far and when he, like I said, I he could only come up for he knew what his limit was."},{"speaker":"Kenneth","time":"00:27:02-4","content":"They were going all and he was shot by accident. Everybody was like \"He was shot by accident\" I didn't really know I killed somebody until the very next day. I thought I just got into it and I shot and it's raining and when I realized that I took somebody's life I was like my momma like \"You got to turn yourself in\" I turned myself in. Gave a statement, you know. But you in that situation, God gave mercy because he gives you signs."},{"speaker":"Marcus","time":"00:28:10-0","content":"Okay, so obviously you're a kid and so much time has passed but if you had to identify one causal factor for what led up to this, this may not be possible because life isn't like that but usually many different things going on, but what was the main thing in your life. I mean, for some people, for example, it's drugs."},{"speaker":"Kenneth","time":"00:28:35-8","content":"For me, my life, 88 to 90 there were lots of struggle in my life. Playing football, I'm still going to school, playing band, playing football, running track, but after school I was getting in trouble for selling drugs, in the projects, hustling. I'm at my auntie's house but I realized it's anger. I had anger problems. It was anger. I realized when I went to anger management what it was pride. I let me anger get the best of me. I lost it and I just went and got a gun and I wanted to fight."},{"speaker":"Marcus","time":"00:29:20-3","content":"Do you think it would be fair to say that while you were using drugs and alcohol at that time in your life that that wasn't the reason that this happened."},{"speaker":"Kenneth","time":"00:29:33-0","content":"No. That wasn't the reason."},{"speaker":"Marcus","time":"00:29:36-2","content":"So, let me ask you this, you must have gone through quite a few of \"what if\" this didn't happen, what if I just kept walking or you know. So, how do you think your life would have trotted out if this did not happen, how would you envision things going for you?"},{"speaker":"Kenneth","time":"00:29:58-3","content":"I always say, since I liked music, I might have been playing some type of second line band or something in New Orleans or just working. I consider myself fortunate, like I said, it's not often you get teachers, principal be on record testifying on your behalf. So I was fortunate that when this happened that I was no not get here no. Poor decision, poor choices."},{"speaker":"Marcus","time":"00:30:34-2","content":"What instrument do you play?"},{"speaker":"Kenneth","time":"00:30:35-8","content":"I play the trombone."},{"speaker":"Marcus","time":"00:30:36-7","content":"Do you still play?"},{"speaker":"Kenneth","time":"00:30:38-1","content":"I'm trying to get a trombone right now. They have a trombone that nobody plays regularly. I have a cousin right now who just graduated from Texas Southern he's about to teach at a school and he is getting it like ASAP, this week."},{"speaker":"Marcus","time":"00:30:55-7","content":"So, I want to change gears and talk a little bit about a little bit of time in the parish that you then spent going through the trial and then ending up coming here really. But, if my goal up until this point is to try to sort of capture the picture of your childhood and adolescence. Is there something that I should have asked you that I didn't at this point?"},{"speaker":"Kenneth","time":"00:31:20-1","content":"No, not that I know of. I mean, other than. The things I did in high school. I mean, even like being a peer counselor in school and all these things. I wasn't no bad person. People they'll tell you right now \"Kenny wasn't a bad person. He's gets mad\", Even I do been in fight since I been here because I realize- I ain't and I am allowed to think now. I couldn't think back then because I didn't know how to think."},{"speaker":"Marcus","time":"00:31:52-3","content":"So, okay, let's switch gears to the parish. Tell me about your experience there."},{"speaker":"Kenneth","time":"00:32:01-8","content":"I get to the parish, on a Thursday night. They process me and I go to, the next day Friday, they give me a bond for 25 thousand dollars. Nobody got that type of money. I ain't got 10 thousand dollars, my mom just moved out of the projects to Algiers. They reach out the family members, they tried to put their house up everything they have so I stayed in the parish from June 20 to somewhere to mid-2000 and I went to 1992 to November 1992."},{"speaker":"Kenneth","time":"00:32:01-8","content":"When I first got there, I guessed there's again, I'm in Jefferson Parish. I'm not Orleans Parish by Algiers. Some of the people know the guy. Its turf, you know, you got to fight. I was good at fighting. I could fight my way I lost a few, I won a few. But I had a lot of fights in the parish, then I was, sometimes I would fight when somebody was getting picked on and it had nothing to do with me, but I knew I could fight. So, I guess, like a big brother thing or maybe the way I am, emotional."},{"speaker":"Kenneth","time":"00:32:01-8","content":"Most of the time, I had fights was behind some food or something, stuff like that or even when I was in the parish, they had drugs, weed, stuff like that. A guy might have owed me some weed, didn't want to pay me, I want to fight. Or just typical because Jefferson parish is different than Orleans as far as system is set up. So you would be inside of a room, we had a phone, we had a TV, and everybody want to get on the phone. Everybody want to get on the TV."},{"speaker":"Kenneth","time":"00:32:01-8","content":"Somebody wants to be in charge, I was small, I as a little small fellow but I had a big heart and there was a lot of fighting, just for typical. Most of the time, we was just fighting just to you know, express ourselves. It wasn't- you know, the only time I had a fight behind my charge was a guy who said you ain't got to watch your back, you got to watch your front."},{"speaker":"Kenneth","time":"00:32:01-8","content":"I went off because he let me know, I'm from Algiers. Everybody from the parish is from Harvey, Marrero, Kenner, Jefferson Parish and you only have a few people from Algiers in jail so like, you had to live or die situation, fight. There ain't no killing but fight."},{"speaker":"Marcus","time":"00:34:38-6","content":"Sure, so did it your, a few months down there. How old were you when you were sentenced?"},{"speaker":"Kenneth","time":"00:34:50-3","content":"I was 20."},{"speaker":"Marcus","time":"00:34:52-2","content":"Okay, so you're 20. You still kind of feel like you're a kid and you get given a life, you know, you're thinking you're going to get a manslaughter charge or something, and here comes the conviction and the sentence of life without the possibility of parole."},{"speaker":"Kenneth","time":"00:35:11-6","content":"I still don't understand that. When, I went to trial for 9 days. Day before I went to trial, they said \"You want a cop out for manslaughter?\" I looked at my lawyer and my lawyer's, he didn't say like \"No, life means life in prison, you'll never get out.\" So we went to trial. What I, regret so bad and when that jury come with a life sentence, my mom everybody was like start crying, I start crying and I didn't know that life mean life."},{"speaker":"Kenneth","time":"00:35:11-6","content":"I was thinking like maybe because they were saying manslaughter and aggravated you have to do 10 years for parole and discharge you have to do 17 and my momma was 37 they said you going to do 35. I said momma you old so they like you do it old, you do it 35 they are kind of like it's where you take a plea bargain not that I didn't do or whatever and the jury said guilty. I didn't realize until I got to Orleans Parish because they transfer me from Jefferson Parish to Orleans just to transfer me to Angola. I didn't realize that I would be in prison this long."},{"speaker":"Kenneth","time":"00:35:11-6","content":"I'm thinking maybe 5 years you go to I didn't know about no appeal process. I didn't know life means life. Had I known what I know now, I would have took the manslaughter. You don't know, lack of knowledge is going to kill you and like that let's say, \"We the jury find the defendant guilty of second degree murder\" I'm crying because I'm guilty. I already know I'm guilty because I turned myself in, but guilty of second degree murder, I don't know what second degree means that you ain't never get out."},{"speaker":"Marcus","time":"00:37:16-3","content":"You then get on that bus to come to Angola. What's going through your mind then?"},{"speaker":"Kenneth","time":"00:37:22-9","content":"I go to Hunts first, process you in, go to Hunts, stood there about- I want to say- I'm 21 because my birthday is December 17th. I got found guilty November the 5th. Got sent like November the 9th. So I go to Hunts like right before Christmas time and I was like man, \"Hunts feeds you good.\" Christmas meal was good. It was Christmas time. I'm scared to death because I'm going to Angola. One thing I didn't tell you, I come on tour before I come to Angola so I kind of like knew Angola. I come on tour there in high school, before I come to jail."},{"speaker":"Marcus","time":"00:38:10-5","content":"But did it seem like a distant thing that happened to somebody else?"},{"speaker":"Kenneth","time":"00:38:14-0","content":"Yeah, because when I came on the tour I was, my senior year, my senior year, I came to jail 1990, like I said, we were, I came to Angola on a tour March of 90, and 3 months later, I'm on trial for murder. 2.5 years later I'm at Angola and you see, the road and you don't know where you're going at. And we get down this long road and you don't know where you're going at and you know you're going to Angola and I'm scared because I don't know what it going to happen to me."},{"speaker":"Kenneth","time":"00:38:14-0","content":"I don't know if I'm going to get raped or going to kill somebody because it's Angola and you kind of like, no one at Angola but is like the streets. You don't talk about Angola or prison, you know, that was like- nothing. You know, not a conversation that you're going to be in jail for the rest of your life. That was, so I get to Angola, they process me in. So I go to this, at the time it was called C Block, which is the homosexual block with a bunch of weak people, and most the homosexuals."},{"speaker":"Kenneth","time":"00:38:14-0","content":"We were young, they put you in C Block. They don't just put you in population because you don't know the ins and outs of Angola and the first encounter- I get there, I come that in the night, go to C block, inmate named Mars he had the smile, I never forget this because $$. He said, \"Cherry Bud where you from?\" And I got mad because I'm at Angola. I got to have a complex. I said \"I'm from New Orleans.\""},{"speaker":"Kenneth","time":"00:38:14-0","content":"He said \"Where you from in New Orleans?\" I said \"At the Fisher Project.\" He said, \"Well, my name is Mars, I'm at the 9\" I'm saying in my mind because he got the old saying you by the 9, you about to die, say you about to die. That's what I'm saying to myself. And he was, this was, come to find Mars was a teddy bear."},{"speaker":"Kenneth","time":"00:38:14-0","content":"But there's lots of, horny homosexuals. I don't even know what block I'm in. But, I was in a cell with a guy named Mike, right now, Mike is 66 years old, come up death row with him all the time. He just schooled me. He gave me a crash course on Angola."},{"speaker":"Marcus","time":"00:40:40-2","content":"Okay, what was that? Can you re-create that?"},{"speaker":"Kenneth","time":"00:40:42-9","content":"Well me and the guy, came, we both came in one in the 9th ward. We go into the, I'm the small one, I'm like 145 pounds soaking wet. So I go in the cell with, the one I'm in the cell with, I don't know where I'm going at. I just got this competition down, not a competition, but this conversation downstairs talking about him from the 9th ward and stuff like that and I'm saying to myself man, it's like a lot going on in your mind."},{"speaker":"Kenneth","time":"00:40:42-9","content":"You really don't know what you about to face and I go in the cell, Mike picked me, he picked me out quick. He realized. He knew I just came to Angola. But he come off death row and he said \"Brother, this is the weak block\""},{"speaker":"Kenneth","time":"00:40:42-9","content":"He said \"You're going to see some things that you never saw before which I did\" He was telling me because the moment this night time arrived, you have a bunch of homosexual people at Angola walking around in draws like women and all that and this, I'm in C Block, at this time, it's all they had over there."},{"speaker":"Marcus","time":"00:42:02-8","content":"In drag"},{"speaker":"Kenneth","time":"00:42:05-4","content":"Yeah, they were like, you know, they don't do that no more at Angola because you got women, but back then, 93, 90 you wore draws or bikinis. So now, he like gave me a crash, \"Don't mess with this, don't mess with the gangs, never get involved with this and that and I listened. But he also told me, \"Look, I got my punk coming my people coming.\" He used to say my people coming. You don't leave the cell for no just leave, he said \"I'm a get you two box of caramels, I know your boy come around the corner\""},{"speaker":"Kenneth","time":"00:42:05-4","content":"I'll pay you to leave the cell, so he gave me two boxes of caramels to leave the cell. I'm like \"Cool!\" So I went around the corner with the drags that had been in New Orleans Parish and hung around there but it was deep. It was deep. I mean, \"Hey, what's your name?\" I mean it was like real, it was a hell of a situation."},{"speaker":"Kenneth","time":"00:42:05-4","content":"It's freezing in December. January 11th, it's freezing this year. This is one of the freezing years. They give you a ski-jacket, a sweatshirt, they'll give you a hat on your head. And this homosexual, to this day, we are good friends he offered me a pair of gloves and might've given me a hit. But he had no gloves you see but I'm going to get you some gloves made or send some to you."},{"speaker":"Kenneth","time":"00:42:05-4","content":"I'm around the corner a couple days later, so when this homosexual come up to me and like your telling me \"Do you want some gloves?\" I'm like \"No\" But it's freezing and we're out there picking okay and steak gloves, steak gloves don't have no, they're like regular gloves and I was like \"Now you're trying to trap us\" He said \"No, look, I ain't trying to get with you or nothing brother but I just trying to you want it's cold out\" It was freezing. So I took them. I said \"Let me just\" Like, if he tries something, I'm going to hit him on the head with this ho or something, but in that case, he just gave me the gloves, no agenda."},{"speaker":"Marcus","time":"00:44:24-8","content":"Wow, so how long did you spend in the C block before they admitted you into the general population?"},{"speaker":"Kenneth","time":"00:44:30-9","content":"80 days because they have a board January, board April, we board January, April, July, October, we just come and I just, we come out."},{"speaker":"Marcus","time":"00:44:50-1","content":"So you come out. What's your typical day like then, your first few days in general population?"},{"speaker":"Kenneth","time":"00:44:56-2","content":"Oh man, it was a while. One came here, when he was here, I get down to walk, first day of my rounds, got older guys, they tell me here go, bring a warden right beside, here goes a knife, buried right here. Here goes a knife buried right here. If you going to be a hoe, get your own, but if you going to be a man, be a man. Anybody mess with you got to do what you got to do in here."},{"speaker":"Kenneth","time":"00:44:56-2","content":"So I had this complex like, I made it through C block, but when you have about it's all about mental. Want to be your friend, don't annoy you, and you got to play that like New Orleans thing and you got to flex from New Orleans because snakes are snakes I come down and go and I went Oak 3 and there was this thing about desegregating the prisons, the whites in the dorm and for some reason the security there were too many whites in the dorm and the whites were escaping, pull officer, it's his thing."},{"speaker":"Kenneth","time":"00:44:56-2","content":"When you have a dorm with 60 people in there at the time, like 80 something people and you got 30 white boys in the dormitory, it's like shit or something, they going to pull off or something so this security would get scared when all the white kids get together. Ain't scared about the black kids because the black kids ain't going to run."},{"speaker":"Kenneth","time":"00:44:56-2","content":"Alligator, snakes so they took us out, because I was one of the groups last coming into the dorm, this dorm, I didn't get a chance to meet too many people."},{"speaker":"Kenneth","time":"00:44:56-2","content":"I was in there for like about 2 weeks. They transferred me from Oak 3 to Oak 1. And I go back, go to Oak 1, it's mixed. They took the blacks out that dorm and put them, they kind of like split it up, so now I go oh man, here's a trip. We going back to Rap City. Rap City come on a 4 o'clock. I was young, just 21 years old. I wanted to watch Rap City."},{"speaker":"Kenneth","time":"00:44:56-2","content":"So we had a conflict, Young and Restless and this is a new generation, talking about the late 80s, 29, 30 years at Angola. I'm going to watch Rap City. These 80 people, they were watching The Restless and they are not about to let us come to Angola and change their environment. So it was a lot of fussing about the TV, conflict, we lip off and this and that boy come up here and change the penitentiary, so it was a lot of conflict. We never got in a fight, almost got in one."},{"speaker":"Kenneth","time":"00:44:56-2","content":"When came in, he realized because he had a couple DCIs and he took it. Because these guys were like look at that change going from the 80s going to the 90s and so his thing was what came? His policy was if a man causes a commotion, he took Rap City. He kept our whole generation, you talking about 18, 19 year old, we just got to Angola. We want our Rap City that's our NWA and all that people like that."},{"speaker":"Kenneth","time":"00:44:56-2","content":"Even other cats, they were like fighting behind the TV. They are fighting because in this area you coming at 4. So there's a big old conflict. He took it."},{"speaker":"Marcus","time":"00:48:46-7","content":"What about the impact on your family?"},{"speaker":"Kenneth","time":"00:48:51-2","content":"Huge. My mother was 35, 36 at the time. My little sister was 11. My brother was, I can't tell, I'll be 18. He was already maybe 19. My brother was 18 because we are 11 months apart. Me and my birthday Decembers 17, so he was 19 or 18. Really starting to feel the impact of my family now. Recently, like in November last year I missed a really, I been feeling it."},{"speaker":"Kenneth","time":"00:48:51-2","content":"My mother, she's been sick a lot. A lot of things, she inherit. I'm started inherit my health at Angola because of Colon Cancer. I've been checked for Colon Cancer, I been by GI, fortunate. But I have some type of virus or something in my stomach that's come from her that she's taking pills and stuff dealing with that. I got to go back up to New Orleans for another Colon on that. Mother, she's getting up in age like she'll be… hopefully she don't but it's reality that you got to die."},{"speaker":"Kenneth","time":"00:48:51-2","content":"She's getting, she's 64 now, 64 bad heath, in there. My brother, I taught my brother more because ain't nobody on my support, play ball and played football and then played at Landry and he was going to Southern and when this charge happened, it was like first of all, where you get a gun from? You know, like even my teachers, everybody, students, like no."},{"speaker":"Kenneth","time":"00:48:51-2","content":"What happened? I mean, I did stuff. I made amends with my momma, my brother, I made amends with too I told them I'm sorry for getting, you know, forgive me, have mercy. What she did, I thought a lot about it for 30 years. I just didn't see the mercy back then. My little sister, she's 36 now. Yeah, she is, have a daughter, and then it go back to like, you see, acting out, my sister's daughter was acting out, fighting. And it was like act of violence going on again but she, run her momma out and now her daughter acting out. She's kind of slowed down and then my little niece is 18."},{"speaker":"Kenneth","time":"00:48:51-2","content":"So I got to look at the impact. My sister was 11, now she's a grown woman. Her oldest child's 18. Her brother come to jail he was 18 years old. And she was acting very strange, you know, and she was like going through it because even though my daughter was 18, my brother's been in jail since he's 18. That day traumatic. I didn't know, but now I realize later on that obviously."},{"speaker":"Kenneth","time":"00:48:51-2","content":"You don't realize, when Kianna is 18 and you go to jail at 18 a lot unwinds it. You know, her brother's in jail, all those years. My brother, schooling, he's a good dude, he's working, has a family stays in Slidell."},{"speaker":"Marcus","time":"00:52:32-6","content":"I think, emotionally, who in the family has taken it the worst? Having to watch you come here."},{"speaker":"Kenneth","time":"00:52:42-2","content":"I would say all of them. I think my momma, she's kind of like- she has faith that something good is going to come out of the situation, I might get out, you know, just holding on because she knows she's got a lot of help. But mostly I think the impact is on my brother. Mostly, because like I said, we play in the band, we play football."},{"speaker":"Kenneth","time":"00:52:42-2","content":"And for him to get married twice, the second time he got remarried for like 20 years, he go to Saints games, he's middle class and his brother's in Angola and it's like, where your brother? People don't know your brother. I don't think he tell people he have a brother. You know, and if he do, it's like \"My brother at Angola, he been gone 20 years, 25 years.\""},{"speaker":"Marcus","time":"00:53:39-3","content":"Yeah, sure. So, if a parole board, or actually it would be a pardon board, so you said a couple months ago, you been getting your paperwork together? What are the things you're going to make sure they know?"},{"speaker":"Kenneth","time":"00:54:01-3","content":"That from I would say I come down to work in 93 and an old guy Leo. He's still around, he was a DJ, and he had a radio station. He still been up to DJ. He told me a long time ago, any long answer to this here $$ (Muslim is my pride. Islam is my faith since 93) I pray Islam for 25 years. We were on the side of a building years ago, this was an old building and said \"don't let time do you do time.\" He told me, he said \"But they're going to talk about you don't.\" So he said \"You mine as well get good and get involved.\" That was the advice."},{"speaker":"Kenneth","time":"00:54:01-3","content":"You might know Ben Smith. Ben Smith we was in dorm together in Oak 1 and I was getting a lot of write ups. My first, yeah, most of my write ups are from my second ward here at Angola, $$ he wrote me like 9 times because I didn't want to work. I ain't no people feeling and kind and all that stuff, I'm from the projects, you don't do that. And he always told me. Ben used to always tell me Scripture in Arabic, \"Ali you need T-E\" \"What do you mean I need T-E? What the hell is T-E?\""},{"speaker":"Kenneth","time":"00:54:01-3","content":"I didn't pay no mind. One day I said \"T-E?\" He said \"Trans Nationalities\" When I decided substances abuse, a class taught, substance abuse taught T-E and they put you in the chair and put you in the thing and a light bulb just clicked because now I knew the stage, the parent stage, the child stage, LS stage. Now I learned how to deal with security and. Still getting in tune, alright, I see what stage you're in. And it was like a light and a few write ups I got up lately, a couple of years ago."},{"speaker":"Kenneth","time":"00:54:01-3","content":"I've been involved in programs since I been at Angola like, young leaders. A lot of guys looked up to me as a young leader who always stayed the course, you know, walked it, action, practice, I was fortunate. I became a president at a club at Angola which is like the highest thing at Angola. I was the highest trustee, which I am now, a trustee."},{"speaker":"Kenneth","time":"00:54:01-3","content":"AA, Alcoholics Anonymous, I was the president of that club and when a lot of guys giving back. So when I became a club president, I gave back to the population, gave ice cream to the guys, feed the people because I know a lot of people that don't get visits. I'm fortunate to get visits. So, one of the things I did, I got into a club, and they had like self-help programs. I study Islam, I became a Muslim, still I'm been in Islam for 25 years."},{"speaker":"Kenneth","time":"00:54:01-3","content":"I was part of AA, I am still a part AA, I took substance abuse, JCs, CPR, everything. The only thing I didn't accomplish and that's just a disability, I never gave up, I'm in school right now. I'm always in school, right now, GED School. I'm still struggling because it's a disability I have because I'm a slow learner. But I'm still in school. I'm on a like a 4th, 5th grade education but more people here me talking, they're like because I can read and write but I cannot believe. They are like \"Nah, but that's where my struggle's at in school\""},{"speaker":"Marcus","time":"00:58:12-7","content":"So you've done just about everything you can do here."},{"speaker":"Kenneth","time":"00:58:15-7","content":"Well, before it's like my record, I think its going to speak for itself as far as at Angola. I had a bad write up that I put myself in. As long as I've been here, physically still. I think I'm okay, I think God will protect me. I never had no bad experience at Angola. You don't really, I'm fortunate because I was largely bending. They grabbed me when I was young and I say once I learned that T-E it just clicked and I've been on a good path, I mean a good path."},{"speaker":"Kenneth","time":"00:58:15-7","content":"One of the most rewarding thing is being Angola, doing tours, speaking to the kids. You know, talking to the kids and telling my experience at Angola, what a typical day at Angola is, how it is, people one of the questions I have a lot \"How do you do it? How do you live with a life sentence?\""},{"speaker":"Kenneth","time":"00:58:15-7","content":"At that time I was 25, 26 years old and I don't how to do a life sentence. I would never accept Angola as my reality and, just always trying to save someone else child. Even if, people come and give me like because you know, like \"Kenny, come talk to my grandchild, come talk to my son, talk to my niece, give them a testimony about how you came here and what charge and how when you fail at things for just a few seconds, you get caught up\""},{"speaker":"Kenneth","time":"00:58:15-7","content":"That's basically, what I do and one of- out of all my tours, I just recently, I had Warden, because I did it for 20 something years, but I knew Landry was coming up here, Landry Walker high school in Algiers. It's not Walker it's combined now. The principal now which is the big chief of Indians on West Bank, he brought me on the tour. So I do this tour, he let me do the tour, trustee, I'm doing my thing but I'm talking to my old like classmates' children and it was like that."},{"speaker":"Kenneth","time":"00:58:15-7","content":"I'm pouring my heart to them why not to come and why you should think and this and that and then not knowing 13 busses. It was only my coach and the principal. The one thing you didn't do is every day, we plan for 13 busses of students from the west-the east bank because Landry Walker is a big school now and I was like focusing on these kids for like y'all are Algiers, y'all."},{"speaker":"Kenneth","time":"00:58:15-7","content":"In my attention is pouring I didn't know about the bussing situation, I'm just like, whatever y'all are doing, I did it, it doesn't, ask your momma, ask your daddy, ask your grandma, they'll tell you, the type of person I am, this and that and that's one-] and they ended up doing a story on me too about that. That was like the crème of the crop, I got a chance to speak to the school that brought me up here. I told a lot of the kids that went to school that school and stuff, but to actually give back to my community."},{"speaker":"Kenneth","time":"00:58:15-7","content":"I was told by my football coach, which I call Coach D they call Mr. Cash that there are like 3 kids that I asked that question \"who's 18\" because I wanted them to put a face, let them see that I'm you. I'm 18 years old. I played football. I was on the school and Casper and all my teachers and stuff testified for me and he said I had impact, he said we did a thing that had impact on them kids and that's what my thing is, even with inmates at Angola."},{"speaker":"Kenneth","time":"00:58:15-7","content":"I'm always finding, with this mojo stuff going on, man look don't give up. Stay focused. Hope in Allah. You see it now. You hear it. People that say that they will never get out. You see people actually getting out of Angola that did something 27, 28 years. So you just got to keep hope."},{"speaker":"Marcus","time":"01:03:10-1","content":"That's actually a great place to stop. With hope."}]}