{"name":"","transcript":[{"content":"Kirt Hall Transcription REDACTIONS FINAL"},{"speaker":"Kirt","time":"00:00:00-0","content":"My name is Kirt Hall. I am presently serving a life sentence. I was born December the 23rd 1973. And at the time that I was arrested and charged with the current offence that I am serving prison time for I was eighteen years old. I had just made eighteen fifty five days before the tragic event occurred."},{"speaker":"Marcus","time":"00:00:24-7","content":"You've served how much time?"},{"speaker":"Kirt","time":"00:00:26-7","content":"I've served twenty-five and a half years in prison."},{"speaker":"Marcus","time":"00:00:30-4","content":"Did you grow up in Baton Rouge?"},{"speaker":"Kirt","time":"00:00:39-8","content":"Partially in Baton Rouge and partially in the country. In the Iberville area, Iberville parish"},{"speaker":"Marcus","time":"00:00:51-0","content":"So I wanted to start asking you a few questions before you turned eighteen, about the time in your life before you turned eighteen. And then I want to follow up with some questions about your life since you've been incarcerated, obviously. So, can you tell me a little bit about the folks who raised you? What your family life was like?"},{"speaker":"Kirt","time":"00:01:13-1","content":"Fortunate for me my mother and my father were present in my life. They played active roles throughout, even up to this point. My grandmother, I had the courtesy and honor of meeting me my great-grandmother and living with her for a while. I learned life lessons from all of them. I mean, they were just a group of hard working people who tried to provide a substantial and respectable level of living for their family."},{"speaker":"Marcus","time":"00:01:36-7","content":"Did you have siblings?"},{"speaker":"Kirt","time":"00:01:39-0","content":"Yes, I have three sisters and a brother."},{"speaker":"Marcus","time":"00:01:41-3","content":"Where are you in the age order?"},{"speaker":"Kirt","time":"00:01:43-6","content":"I'm the eldest."},{"speaker":"Marcus","time":"00:01:47-7","content":"Does your family visit you?"},{"speaker":"Kirt","time":"00:01:50-2","content":"Yes. They visit as often as possible. I mean, initially when I first came here according to security, I visited more than any other prisoner that was here. Over the years, I mean responsibilities grow. People tend to, they still love and care for you but they don't get a chance to visit as much. So they still come to visit on a regular basis but I also give them room to do the things that they need to do as well."},{"speaker":"Marcus","time":"00:02:18-5","content":"Do you think it would be fair to characterize your upbringing as caring and nurturing and loving?"},{"speaker":"Kirt","time":"00:02:28-8","content":"Yes, absolutely. I mean, I come from a close knit family. So they always try to not only be there for one another but to also be there for me and any other children in their family. And we would routinely have family get togethers, especially on the holidays. And just try to, you know, bring a place of normalcy and respectability to one another."},{"speaker":"Marcus","time":"00:02:52-5","content":"So your parent's relationship was good?"},{"speaker":"Kirt","time":"00:02:54-1","content":"Yeah. Despite the fact that they haven't been together since I was like four years old, five years old. There's still a mutual respect for one another."},{"speaker":"Marcus","time":"00:03:02-8","content":"Were there men in your mother's life that came into your life?"},{"speaker":"Kirt","time":"00:03:07-3","content":"Just before within the like three to four years prior to my incarceration my mother met someone. And over the course of the following three years they married and that's where my youngest sibling comes from, my little brother. They're still together today. And my father, he's had a relationship, a long term relationship so. Each one of them."},{"speaker":"Marcus","time":"00:03:37-1","content":"So you have a stepfather. Your relationship with him, how is that?"},{"speaker":"Kirt","time":"00:03:40-9","content":"It's fairly well. We don't get to see each other a lot because of his extensive work schedule. But we're, you know, we're good."},{"speaker":"Marcus","time":"00:03:51-7","content":"I just want to get a sort of better sense of. I want to have the visual of where you lived, what it would look like. So let's say I was standing at the front door of your house looking out on a Saturday morning."},{"speaker":"Kirt","time":"00:04:13-4","content":"What age?"},{"speaker":"Marcus","time":"00:04:16-4","content":"Eighteen."},{"speaker":"Kirt","time":"00:04:18-6","content":"At eighteen, when you would walk out, you would see manicured lawns, possibly children riding up and down the street on bicycles. Perhaps someone washing cars. On the main street, one street over from where I lived you would hear the sounds of cars and vehicles, birds chirping, humming birds here and there."},{"speaker":"Marcus","time":"00:04:48-5","content":"What was on your bedroom walls?"},{"speaker":"Kirt","time":"00:04:51-0","content":"On my bedroom walls I had some pictures of a few old school rap artists and I had a picture of, I don't even know who the painting was, but it was a picture of a ship that was like, sailing out into rough seas. And sometimes I would just listen to music and look at it and be like, you know what, I've never taken the time to really go out on a ship so I was like, one day I'm going to have to try that."},{"speaker":"Marcus","time":"00:05:25-6","content":"If you had to identify an adult in your life growing up who you were closest with..."},{"speaker":"Kirt","time":"00:05:35-9","content":"That would be my grandmother."},{"speaker":"Marcus","time":"00:05:37-8","content":"Your grandmother. And when was the last time you saw her?"},{"speaker":"Kirt","time":"00:05:42-2","content":"The last time I saw my grandmother was in the middle, I think, of 2002. She passed not long thereafter. And we always had a close bond, and relationship with one another. She was, I mean, there were things that she would permit me, like before I got my first car, she would let me use her car when sometimes she wouldn't even let her own children use it because of the level of trust she had for me."},{"speaker":"Marcus","time":"00:06:16-7","content":"Did you have a particular friend, would you say you had a best friend growing up?"},{"speaker":"Kirt","time":"00:06:23-7","content":"Best friend, yes. My best friend, a guy by the name of Maurice. We were born like weeks apart and our mothers were close. So we all, we grew up we was just several houses apart. And we always knew each other, always hung out together what have you, so."},{"speaker":"Marcus","time":"00:06:43-6","content":"Do you still stay in contact with him at all after all these years?"},{"speaker":"Kirt","time":"00:06:48-0","content":"Periodically I'll call and sometimes he may show up to see me, spend a few hours. And he wanted me to make certain that I met his children and I knew his wife prior to my incarceration. And his mother, she calls me her second son."},{"speaker":"Marcus","time":"00:07:06-6","content":"Even after all this time, that's pretty amazing. Did you have kids?"},{"speaker":"Kirt","time":"00:07:13-7","content":"Unfortunately, I hadn't had children prior to my incarceration. I was looking forward to possibly a wedding and children, you know, a picket fence kind of thing but tragedy struck before then."},{"speaker":"Marcus","time":"00:07:28-4","content":"You had mentioned I think that this was you, was this your first arrest? First time you got arrested?"},{"speaker":"Kirt","time":"00:07:37-7","content":"Yes. This was the first time that I've ever been arrested. No prior tickets, no anything, just this."},{"speaker":"Marcus","time":"00:07:37-7","content":"What was the highest grade then that you accomplished in high school? You were cut off before you graduated then, right?"},{"speaker":"Kirt","time":"00:08:00-0","content":"Yes, I was in the eleventh grade."},{"speaker":"Marcus","time":"00:08:03-0","content":"Eleventh grade."},{"speaker":"Kirt","time":"00:08:04-3","content":"Yeah, and working towards trying to get my credits straight so that I can complete and walk with the graduating class."},{"speaker":"Marcus","time":"00:08:10-3","content":"Right. So, I'm sure since coming to prison that you've made use of all kinds of educational opportunities."},{"speaker":"Kirt","time":"00:08:19-2","content":"Every meaningful opportunity that the department of corrections has given me in order to evolve and become a better person. To grow in education, and even outside of that, anything that I can do to make the best of the time that I'm spending here. Because I didn't want this tragic event to be the defining moment of my life. I didn't want this to be that ending chapter."},{"speaker":"Kirt","time":"00:08:19-2","content":"And after growing and actually coming to a point in life where you reflect back and look upon the incident that brought you to a situation like this, I wanted to bring meaning to that. I wanted to bring some respect. I didn't want people to say, that incident, I remember those two individuals by that incident."},{"speaker":"Kirt","time":"00:08:19-2","content":"I wanted to be able to say something like, look, in honor of his memory, the deceased, both of our lives have been ruined, but I'm still here, and I can actually do something to try to deter the same type of event from repeating itself. And I think that I owe that to his memory."},{"speaker":"Marcus","time":"00:09:33-1","content":"Do you think that you had, do you see now, did you have a choice. I mean I think the way you described it earlier, that you were fearing for your life."},{"speaker":"Kirt","time":"00:09:50-7","content":"Yes, I truly feared for my life and the life of my family. On several occasions, I mean it's actually documented, that I attempted to make peace. Unfortunate for both him and myself there were other people who were giving him things to think about, giving me things to think about."},{"speaker":"Kirt","time":"00:09:50-7","content":"I think when we as people have a tendency to invest trust in others and the things that they say. That doesn't necessarily mean that their perception of what's going on is the actuality of what is going on."},{"speaker":"Marcus","time":"00:10:29-7","content":"You were eighteen. I want to ask you slightly complicated question then. So, with those particular circumstances, and with the passage of more than twenty years, is it remorse that you feel at this point? Or is it more complicated emotions."},{"speaker":"Kirt","time":"00:11:01-5","content":"It's a combination of, once a person grows, as the brain develops, as you grow and understand life, and you learn to appreciate how fragile life is, when you arrive at that state in your being. When a life is lost and you reflect on the gravity of you having remotely anything to do with it, that's a burden that you carry. And if you're a person that recognized humaneness, there is a part of you that's supposed to always have a desire and a wish to make amends."},{"speaker":"Kirt","time":"00:11:01-5","content":"If people are still sore and hurting from what happens, you can only want to reach out to them and pray that some way for them, the faster you can help them heal. But one thing you have to move forward with is, if there's anything you can do in the way of keeping something like this from happening again, you should hone that as a responsibility."},{"speaker":"Marcus","time":"00:12:14-9","content":"Is a life sentence without parole humane?"},{"speaker":"Kirt","time":"00:12:23-7","content":"In my honest opinion, I have to say that it took me a while to really grasp what a life sentence meant. But as the years went by, I met more and more people here, and right now today there's scores of people traversing this state who believe that a life sentence is twenty years. I mean people still tell us today, when we're visiting."},{"speaker":"Kirt","time":"00:12:23-7","content":"Well you don't, twenty years is supposed to be when you go for parole. And it's like, there's no such thing, and they're like, come on stop kidding. I would have to actually take people to the counter and introduce them to other inmates who have done, 32, 36, 41, 50 years."},{"speaker":"Kirt","time":"00:12:23-7","content":"And then they start to slowly grasp, wait, you're serious. Life without parole is death sentence, it's just repackaged. So when you really reflect upon that, that this is supposed to be your end, Ii's just basically a scenario where you're dying day by day, instead of all at once. Instead of choosing a date to impose or execute the sentence, it's just little small increments slipping away."},{"speaker":"Marcus","time":"00:13:52-8","content":"Yeah and I suppose in the face of that, you try to make the best of it, which involves I guess the little things that you're doing."},{"speaker":"Kirt","time":"00:14:03-7","content":"Well, even if the things that I've devoted myself to while here. I mean, trying to be someone that guys here can lean on, trying to be a source of guidance. Knowledge, information, wisdom, is partially for us, but you give it meaning when you pass it on to others."},{"speaker":"Kirt","time":"00:14:03-7","content":"In so doing, I've found that on each occasion that I do try to share myself with somebody else I never know. I mean considering the fact that I'm charged with taking a life, there may very well be a life that I'm saving. So I just try to do that as much as possible."},{"speaker":"Marcus","time":"00:14:51-1","content":"So how much punishment is enough punishment?"},{"speaker":"Kirt","time":"00:14:59-8","content":"In my assessment and, I mean, I ask myself that same questions. And I even turned to studying various belief systems in order to see how that age old question had been asked."},{"speaker":"Kirt","time":"00:14:59-8","content":"And there's some instances where if you can make peace with the members of the family of whomever you may have caused to be a victim that whatever terms you all agree to, that can be a resolve, but under the existing circumstances, I think that punishment is warranted in many instances."},{"speaker":"Kirt","time":"00:14:59-8","content":"But at some point there has to be a case where you have sent a person to prison as punishment, and what society does not necessarily understand that, okay yes this person is in prison, it's costing I think $24,000 a year to keep this person in prison. If you chose to reinvent or aid that person in redefining themselves to become a better human being, then that would be a more worthy investment than perpetual punishment. Because then the perpetual punishment, no one actually gets anything out of it. I mean it's infinite."},{"speaker":"Kirt","time":"00:14:59-8","content":"And when a person is redeemed, when a person is redefining themselves. When a person shows that he's not the person who you perceive him to be. You thought that this person was, the only person that he or she could amount to was the person who committed this crime. Then you look down the line years later and you see that this person can actually be an asset to our community versus a burden."},{"speaker":"Kirt","time":"00:14:59-8","content":"Because when you take into account the tragic events that are constantly going on in the communities today, you don't see anyone who is seemingly coming up with true answers. And we've looked at the data and everything else, you can't incarcerate yourself out of this. There has to be a gap that's bridged between those who are here who have been through the experience as well as those who need to know what it is we've learned."},{"speaker":"Kirt","time":"00:14:59-8","content":"We don't need anyone else to become a victim, before this person learned that we can stop this person from becoming a victim. Then we can help our communities. And that's what many of us are just simply trying to do, despite the fact that we have life sentences."},{"speaker":"Marcus","time":"00:17:57-7","content":"Somebody that I was talking to earlier on today talked about the concept of becoming prisonized, institutionalized, which you stopped hoping for some kind of relief and you just accept it."},{"speaker":"Kirt","time":"00:18:25-5","content":"I've witnessed that, a lot, and until recently, I mean, many people have just accepted this was essentially a retirement home. There was no available mechanism for release, there was no possibility of release. I mean at bare maximum the rate of people going home may have been, five or six people per year. And when you look at fourteen hundred people sentenced to life in prison, and I think it's a hundred or so every six months get new life sentences."},{"speaker":"Kirt","time":"00:18:25-5","content":"At some point this prison is going to be overcrowded and you're keeping a lot of people in prison who really want to make an honorable contribution to their communities and any community where you allow them to. I mean myself and sever others we've sat down and drawn up plans that could possibly help the communities, but even in so doing, who do you present them to?"},{"speaker":"Kirt","time":"00:18:25-5","content":"Programs and things of this nature, I mean, we don't have a problem working with anyone. District attorney, judge, whomever, it's concerned with the betterment of their community and making the community safe. So that we would all have, in our future generations, somewhere safe to live."},{"speaker":"Marcus","time":"00:19:59-3","content":"You're aware I'm sure of the recent changes whereby people who were sentenced to life without possibility of parole are, some of them are getting relief. The juveniles, the folks who committed their offence between '73 and '79 in the second degree. Does that give you so hope, that maybe there will be some shift, maybe push the needle a little further on? To folks like yourself, actually."},{"speaker":"Kirt","time":"00:20:47-7","content":"Yes, well. Considering the efforts of our current governor, the department, as well as the pardon and parole board. With their new approach, it seems as if, the concept of helping a person evolve into the best person that they could possibly be is actually taking root."},{"speaker":"Kirt","time":"00:20:47-7","content":"Many people find that they were once considered throwaway, irredeemable. And that's not the cause because when you take and you put a person in prison for twenty, twenty-five, thirty, thirty-five years, forty years. The person that they become while in your custody and under your programming, that's reflective of your efforts and what it is you've been able, have you been able to reach that person."},{"speaker":"Kirt","time":"00:20:47-7","content":"And I'm honestly of the opinion that with the current programs that are available, that it doesn't take beyond twenty years for the Louisiana department of corrections to turn out a better and new human being."},{"speaker":"Kirt","time":"00:20:47-7","content":"Because in many of the instances when you look at the paperwork, you'll find that the individual, the mindset that the individual had when they were sent to prison, that mindset, that personality, that individual has long passed away. A new person was born and they grew into the adults that are currently before you."},{"speaker":"Marcus","time":"00:22:27-1","content":"Yeah, I agree. Now, let's go back for a second to that person, who was arrested, incarcerated, tried and incarcerated, how much time passed before you came to Angola from the offense?"},{"speaker":"Kirt","time":"00:22:51-8","content":"I was arrested in February, my trial started in June, I was sentenced in August, and I was in the department of corrections for November, so around ten months."},{"speaker":"Marcus","time":"00:23:06-4","content":"Wow you're still 18. You hadn't even hit your nineteenth birthday."},{"speaker":"Kirt","time":"00:23:15-8","content":"Yes."},{"speaker":"Marcus","time":"00:23:19-9","content":"You come here to Angola, this was in the early nineties?"},{"speaker":"Kirt","time":"00:23:22-8","content":"Yes, '92."},{"speaker":"Marcus","time":"00:23:25-8","content":"'92. I want to ask you a couple of things, first of all, describe that person, that came here in November."},{"speaker":"Kirt","time":"00:23:35-2","content":"That person that came here in November. He was dealing with the cultural shock of, how did the tragedy occur? What happened, what went wrong? How did it ever come to this? Because this wasn't something that was desired, this wasn't what I had planned for my life. I didn't plan for this tragedy to happen, it wanted to happen."},{"speaker":"Kirt","time":"00:23:35-2","content":"And when I came here it was a cultural shock, because at that time this was still, essentially, a very violent prison. The thing that I did understand was that, I really needed to learn my environment and in so doing, I had to pay attention to everything. You had to be extremely cautious of the people that you dealt with."},{"speaker":"Kirt","time":"00:23:35-2","content":"Both in the administration and as well as, you know, prisoner to prisoner."},{"speaker":"Kirt","time":"00:23:35-2","content":"I essentially kept to myself and devoted myself to positive pursuits in learning so that I wouldn't get absorbed into the prison itself. Because again, I don't want this to be the defining event of my life. I wish I could change that tragic event, I wish that the slate on that. I wish that the person could be brought back and we be given that opportunity to sit and talk again, I really wish that it could. But I understand the permanence of death. And that's why I feel so strongly about having that opportunity to make amends."},{"speaker":"Marcus","time":"00:25:26-1","content":"I imagine you were very scared as well."},{"speaker":"Kirt","time":"00:25:31-8","content":"Yes, quite naturally."},{"speaker":"Marcus","time":"00:25:34-0","content":"Being so young. And as you said it was a very violent place. And you probably, I would imagine that you were going into a sort of survival mode."},{"speaker":"Kirt","time":"00:25:42-1","content":"Yes, because there was never a moment, when you first arrived at this place, when a person wasn't looking for a weakness. So you had to be on perpetual guard of yourself."},{"speaker":"Marcus","time":"00:25:58-7","content":"Can you describe what your typical day is like now? Like what is your routine from the time you wake up to the time you go to bed."},{"speaker":"Kirt","time":"00:26:07-3","content":"Generally in the mornings when I wake, the first thoughts that go through my mind is, okay, god has afforded me another day to make a difference, what am I going to do today differently than I didn't do yesterday. So I ponder that thought for a while and I look at things that I may have left off from yesterday. And my day, every day, is filled with responsibilities. And I have responsibilities here."},{"speaker":"Kirt","time":"00:26:07-3","content":"I have responsibilities to the communities that I have left behind. I have responsibilities that have been victims by this situation and circumstance, and I try to meet those responsibilities head on by being someone that's not afraid to make a difference. Because a part of being an adult when you actually arrive at that state of adulthood, you come into an awareness like, look, everything is not about me."},{"speaker":"Kirt","time":"00:26:07-3","content":"There are things that I need to accomplish but there are also other things that I have to help other people accomplish who otherwise wouldn't be able to accomplish on their own. So when I get dressed and moving through the dorm, guys will stop and ask me for advice. Man look, I'm going through something, do you have a minute. And I'll stop and I'll sit and talk with them. And whatever is troubling them, I'll try to help them work through it."},{"speaker":"Kirt","time":"00:26:07-3","content":"And I come up here, I work in the law library, I'm a counsel substitute. Certified paralegal. In conjunction with LSU, North Shore Community College, I was able to become a certified paralegal. That too was offered as a rehabilitative opportunity by the Louisiana department of corrections, so I took advantage of that. My day to day job is to help guys with whatever it is they don't understand who can't afford attorneys. Help them continue their litigation and the preservation of their rights."},{"speaker":"Marcus","time":"00:28:29-2","content":"Is that your primary activity now? Are there other organizations that you're part of?"},{"speaker":"Kirt","time":"00:28:35-3","content":"That's my primary job/responsibility and occasionally I'll do guest speaking and I also take time out on the yard. We have what's called a reentry program and some of those guys, I'll go and sit and talk with them to try to give them some perspective because I understand that before I'm released out of prison, they're likely to be released out of prison."},{"speaker":"Kirt","time":"00:28:35-3","content":"Well they're going home to where you, and others live. And if I can help get one of those individuals, just one, to change his perspective in life, and to go in a positive direction, not only have I saved him, I've saved a community from the turmoil that he may create in that community. So I invest a lot of time in doing that."},{"speaker":"Marcus","time":"00:29:28-8","content":"So you spend quite a bit of time just informally mentoring people in addition to what you do in the law library."},{"speaker":"Kirt","time":"00:29:35-2","content":"Yes, essentially."},{"speaker":"Marcus","time":"00:29:42-4","content":"Do you, I mean do you see yourself, I mean I see myself as profoundly different from when I was eighteen. I think every person, as they age into their forties would look back and think, yeah I'm a totally different person. Do you see yourself as having gone through some sort of rehabilitation?"},{"speaker":"Kirt","time":"00:30:04-3","content":"I'll say this. The term rehabilitation, I'm not certain that that defines what we go through. Because one of the things that the term rehabilitation establishes into the psyche of the person is that, at some point in life, this person was completely habilitated. That presumption is not safe to say in every case scenario. Especially considering what we've learned about brain development."},{"speaker":"Kirt","time":"00:30:04-3","content":"But you have some people who were raised in environments that are so challenging until when they do fall short of what they're expected to live up to, then they're not only blamed, but punished for not being able to withstand that environment."},{"speaker":"Kirt","time":"00:30:04-3","content":"When you're born into an environment and you look, you learn through observation and interactions. And looking and learning through observation and interactions people develop their response to stimuli. Well if these individuals haven't been properly fed the right information. If they haven't been actually nurtured and shown how to do things correctly, I can't completely in trust to them the standard of normalcy that I know."},{"speaker":"Kirt","time":"00:30:04-3","content":"Because when I was about twelve years old, twelve thirteen years old, I lived in a neighborhood that was essentially quiet. All middle class, well to do, well-manicured lawns. We had an individual, him and his wife, they were retired. They had a real big garden, they sold us fresh produce, everybody in the neighborhood. But two blocks over behind us, every night, all you heard was shots. And for them, that was normal, I mean it was like they never ran out of bullets."},{"speaker":"Kirt","time":"00:30:04-3","content":"So I'm thinking as an adult reflecting back on that, shots every night and they never called the police. You hear one shot over here, I mean, they want helicopters in there. So, what those individuals were accustomed to is not the same thing that many of us were accustomed to. So when you talk about rehabilitation to someone that was raised in that environment, you can't say that that was a normal environment for them to live in, that they were habilitated."},{"speaker":"Kirt","time":"00:30:04-3","content":"So you're looking at, it's a fact intense search and then you have to actually go into the history of the person. You have to go into the family environment that that person came in to determine what level of responsibility you can extend to that person."},{"speaker":"Marcus","time":"00:33:17-6","content":"I understand that but I mean, and I understand the term. There is a problem with the term. But what about your own life?"},{"speaker":"Kirt","time":"00:33:21-8","content":"With my own life, I take into account this. I say that with the opportunities given through establishing and surrendering my life over to God I've been able to find that I can be a different and better human being. And in so doing, I have gifts that I would like to share with humanity."},{"speaker":"Kirt","time":"00:33:21-8","content":"I mean what I was told as far as me being irredeemable, I strive every day to prove that not to be true. I want to be that better person whether I'm here or not. I mean over the twenty five years that I've spent incarcerated, I think I have maybe five disciplinary reports and all of them are for little minor incidental matters, no violence, no anything, so."},{"speaker":"Marcus","time":"00:34:28-8","content":"What do you think, now twenty-five years later, what's the worst part about your experience here?"},{"speaker":"Kirt","time":"00:34:39-8","content":"The worst part about the experience here is. In all the things that I've read and research. Learning of, the fact that since this place was founded, it's been a place of perpetual suffering, uninterrupted. And the way that I see it, people are overlooking the potential of this place, whereas this could be, perhaps, the biggest college campus available in America. Because who knows best, who has walked the walk besides the people who are here."},{"speaker":"Kirt","time":"00:34:39-8","content":"I mean, it's almost like the equivalent of hotel California. I mean people have been sent here, and this is supposed to be it. But when you look at the quality of people that emerge from here, I mean we have people who leave here and instantly they start making a difference. I mean, you can't necessarily just throw that away. And whether, again, whether I'm here or not, if I'm here, I'm going to continue to make a difference. If I'm ever let free, I'm going to make a difference."},{"speaker":"Marcus","time":"00:36:08-1","content":"What could prison administrators do to improve the everyday life for lifers?"},{"speaker":"Kirt","time":"00:36:29-8","content":"I think if you guys are interested in the improvement of the quality of life here. I mean for years I've heard guys say, 'man look, I hope, I hope, I hope, I pray,' well people pray and hope their prayers are being answered. People hope against, or for whatever their needs on."},{"speaker":"Kirt","time":"00:36:29-8","content":"Well given due consideration to that, if the administration, as it currently seems, continues to embrace recognizing that many of the men here have evolved, they have matured, and that they are deserving of an opportunity. I think if they stay the course, I think things are going to actually work themselves out."},{"speaker":"Marcus","time":"00:37:37-9","content":"For wardens, for example, to be supportive or reform."},{"speaker":"Kirt","time":"00:37:46-7","content":"Yes, the more the correctional staff who supports aiding us in evolving and to constantly become better people, while we're here so that upon reintroduction into society. That's what the reentry initiative is about, preparing us for life beyond prison."},{"speaker":"Kirt","time":"00:37:46-7","content":"And when you give these guys, as opposed to just giving them hope, you give them an opportunity. It's not like people are just, or would be just released and that's it. I mean if a person is released on parole, he's living in the perpetual state of proving himself worthy to stay on parole until his term is completed."},{"speaker":"Kirt","time":"00:37:46-7","content":"So it's not like a get out of jail free card. It's more so of a, we're releasing you from prison and giving you an opportunity to make a difference, and be less of a burden to the state. And many guys welcome that opportunity, but I'll you what."},{"speaker":"Kirt","time":"00:37:46-7","content":"I mean, we went through a very dark period a few years ago guys felt so hopeless that, I mean I think several guys took their lives in a matter of like two months. It was only through efforts like those of Governor Edwards, some of the people at headquarters, and some of the people here that, that evolution that was needed in order to bring about belief that there was something greater, or something to come."},{"speaker":"Kirt","time":"00:37:46-7","content":"They're making the changes in order to actually give these guys an opportunity to say, hey look, based upon your achievements, your conduct, your character, we're going to afford you an opportunity, because you've shown yourself worthy of such."},{"speaker":"Marcus","time":"00:39:53-5","content":"Let me ask you a difficult question. Do you believe that there are certain folks, depending on the crime they commit, who just should not be released?"},{"speaker":"Kirt","time":"00:40:11-3","content":"When you say."},{"speaker":"Marcus","time":"00:40:15-1","content":"Is a life sentence without parole appropriate for any human being? Regardless of how bad the act was or regardless of what a threat they may present?"},{"speaker":"Kirt","time":"00:40:32-0","content":"I'll say this. I'm not going to say that, today, that every single person is ready for release. And let me qualify that please. That's why we have the parole board, the pardon board. Because if you just release people without assessment, you're not making a determination as to whether that person has evolved because one of the things about the department is, your department of corrections and public safety."},{"speaker":"Kirt","time":"00:40:32-0","content":"So the people that are being released, you know, should go through a responsible stage whereas you have to prove that I can trust you. That I'm not endangering the community, what have you. But as it stands I think that there should be a level of you proving yourself worthy, not just a get out of jail free card."},{"speaker":"Marcus","time":"00:41:39-6","content":"So would you then agree that if you've not proven yourself that you should stay here?"},{"speaker":"Kirt","time":"00:41:51-8","content":"Until you've made that evolution. And then it will be up to whomever you go in front of to decide whether or not ultimately."},{"speaker":"Marcus","time":"00:42:00-5","content":"Here's a slightly harder question because I'm interested in how you think about this. Regardless of a person's ability to change, are there some crimes that are worthy of life without parole, irrespective of a person's ability to change. In other words, is there a crime for which there, that sentence would be an appropriate amount of retribution?"},{"speaker":"Kirt","time":"00:42:37-6","content":"The immediate thing that comes to mind when that happens is when you deal with a person whose actions show that they're incapable of ever becoming anything other than what that crime manifested, then perhaps. But even with that, I'm not necessarily in a qualified position to make that final determination because I've actually read life stories that were written by detached people. Where a person who was a horrible human being at one stage in their life was ultimately the most god fearing at another stage in their life."},{"speaker":"Kirt","time":"00:42:37-6","content":"So as a human being, I think I lack qualifications to make a standing decision on that. I don't know what the creator has in mind for each individual, but I will say that god is the best of planners. With that in mind I have to say that, when I deal with judging whether or not a person is ready to go home the first thing that comes to mind is, will you feel safe if you live next door to my mother, father, children what have you."},{"speaker":"Kirt","time":"00:42:37-6","content":"And that's the best determination that I can judge by, from me having known you. Versus me just saying, just let anybody out of prison."},{"speaker":"Marcus","time":"00:44:13-4","content":"Fair enough. Last question. Is there something, is there a question that you wished I had asked you that I didn't? Or something that you want people to know about the reality of life without parole in Louisiana that we haven't talked about."},{"speaker":"Kirt","time":"00:44:32-5","content":"Yeah, there's one aspect of this all that I know that, not per say you, and not that it was delivered, but I know that very few people are even aware of how many of us, in prison, are remorseful. Who would like to make amends, who would love to be afforded an opportunity at reconciliation?"},{"speaker":"Kirt","time":"00:44:32-5","content":"Many of us, as I spoke of earlier, there is a victim's awareness program here. We go through that voluntarily so that we can identify with the pain, the harm done and everything from a victim's perspective. So that we can identify with that. I'll say this, it gives depth and scope to what happened, and for most guys to go through it, it's an awakening process and it helps you arrive at that point in your life where you're like, I don't ever want to put anyone through that, and I'm sorry that I ever did."},{"speaker":"Kirt","time":"00:44:32-5","content":"So many of us, it's just one of those things, that, it goes unnoticed. But we still try to carry it with us in the way that we walk through this prison. I mean because when you look at Angola from what it was once known as to what it is today. We have guests and visitors, I mean, some even elderly. They come and sit with us in the dorm, and talk and what not, and nobody's going to harm or molest them, and not going to let anyone else do it, why? Because we're not the same men that came to prison all those years ago."},{"speaker":"Marcus","time":"00:46:27-0","content":"I feel very safe here, always have. All right thanks."},{"speaker":"Kirt","time":"00:46:27-0","content":"No problem."}]}