{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Kuantau Reeder Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Resp:Kuantau",
      "time": "00:00:00",
      "upperBoundTime": "00:00:54",
      "content": "Another thing like we were speaking about earlier, jJust doing a life sentence without a mechanism for relief. How you keep going about your're day every day. It would be easy for somebody to say, \"Well I'm tired of this I'm just going to go to my cell and not come out.\" \"I'm not going to work, I'm not going to try to get any education, I'mand I'm not going to do whatever.\" Then you just go forward, and think about something that means something to you, and try to let that motivate you, take you through your're day."
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:00:54",
      "upperBoundTime": "00:01:04",
      "content": "Would you mind starting off by stating your name, the crime that you were convicted off, how old you were, and how much time you've served.Kuantau Reeder"
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:00:54",
      "upperBoundTime": "00:01:04",
      "content": "Transcribed by Dari Zeltser"
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:00:54",
      "upperBoundTime": "00:01:04",
      "content": "02/03/18"
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:00:54",
      "upperBoundTime": "00:01:04",
      "content": "[MISSING TYPED OUT BEGINNING OF INTERVIEW]"
    },
    {
      "speaker": "Intvr:Marcus",
      "time": "00:00:54",
      "upperBoundTime": "00:01:04",
      "content": "K: How old you were and how much time you've served."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:01:04",
      "upperBoundTime": "00:01:14",
      "content": "My name is Kuantau Reeder. I was 20 years old, 19 years Allold about to be 20 years old I was convicted of second -degree murder. And I'm serving a life sentence."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:01:14",
      "upperBoundTime": "00:01:18",
      "content": "How long Havehave you served?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:01:18",
      "upperBoundTime": "00:01:21",
      "content": "24 years."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:01:21",
      "upperBoundTime": "00:01:50",
      "content": "um Kuan I'm gonnagoing to start by asking you a few questions about your childhood and the time before you were convicted of this crime and then mainly questions about what you've been up to for the last 24 years since you've been here turning your life around but can you start by telling me a little bit about the folks who raised you, your family?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:01:50",
      "upperBoundTime": "00:02:34",
      "content": "Well I was raised by mostly women. We didn't have a lot of men in the family. Mmy auntie's, my cousins but like I said most of them were women. I had a pretty good childhood they did what they could youcould know to try to make things go like they should. I was into a lot of sports. I really loved sports. So it was fairly, you know they tried to do the best they could."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:02:34",
      "upperBoundTime": "00:02:34",
      "content": "Was your mom around?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:02:34",
      "upperBoundTime": "00:02:44",
      "content": "Yes she was uh she worked a lot, for the most part as having a parent she was there, she was around"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:02:44",
      "upperBoundTime": "00:02:48",
      "content": "Were there man in your mother's life that came into your life?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:02:48",
      "upperBoundTime": "00:02:57",
      "content": "Yeah yeah a few. They didn't stay long but a few not a lot."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:02:57",
      "upperBoundTime": "00:03:00",
      "content": "Did you get along with them?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:03:00",
      "upperBoundTime": "00:03:10",
      "content": "Some I did, some I didn't. Some I didn't really have a vibe for you know got along with."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:03:10",
      "upperBoundTime": "00:03:17",
      "content": "Is there a particular woman that you really think of when you think of the adult who loved you and cared for you the most?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:03:17",
      "upperBoundTime": "00:03:17",
      "content": "um Well mom first. And one of my teachers second. She died years ago 1998 as a matter of fact I used to keep up with her when I was free, and when I got incarcerated. Her name was Ms. Geraldine Brown. Sshe was my teacher at my elementary school. She was a real good person. But she died, she passed away. I wish I could have been there, you know, but she passed away that's one of the people I really really think about all the time."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:03:17",
      "upperBoundTime": "00:04:08",
      "content": "Would it be fair to say that when you look back on your childhood that you were cared for and loved and nurtured?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:04:08",
      "upperBoundTime": "00:04:11",
      "content": "Yes it would be."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:04:11",
      "upperBoundTime": "00:04:21",
      "content": "Was there a lot of fighting in your house?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:04:21",
      "upperBoundTime": "00:04:26",
      "content": "Amongst the kids yeah but the adults no. They didn't if they had any quarrels or anything like that they would take it in another room they wouldn't do it around us. you know"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:04:26",
      "upperBoundTime": "00:04:28",
      "content": "Right, um where did you grow up?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:04:28",
      "upperBoundTime": "00:04:29",
      "content": "New Orleans."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:04:29",
      "upperBoundTime": "00:04:31",
      "content": "Where in New Orleans?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:04:31",
      "upperBoundTime": "00:04:35",
      "content": "In a place called the 7th Ward in the Fisher housing projects."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:04:35",
      "upperBoundTime": "00:05:02",
      "content": "So if you could take me back to early 90s. Maybe when you were 17 or so, and say I was sitting next to you on the stoop of your house in front of the front door looking out into the neighborhood on a Sunday what would I see?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:02",
      "upperBoundTime": "00:05:40",
      "content": "A lot of guys with nice cars. Aa lot of people in nice cars. Aa lot of young girls you know we lived in the projects at that time so, just a lot of us just hanging out. Watching Washing our cars taking care of our cars getting ready to go somewhere You know hang out water parkWater Park or something you know or Lakefront things like that just to go hang out."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:05:40",
      "upperBoundTime": "00:05:44",
      "content": "So you were mentioning Elementary School teacher earlier on, do you have a specific memory of her when you were in elementary school?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:44",
      "upperBoundTime": "00:07:15",
      "content": "Yeah this is what made me follow her and you know really keep up with her. They had a young lady in our class I'll never forget this her name is Rosalyn and she didn't have much of anything, her family wasn't well off but Miss Brown she used to always take Rosalyn out to the hall and one day I remember Miss Brown ask her, \"Hhave you eaten?\" And Roslyn would tell her yeah, but she would be lying because they didn't have anything."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:44",
      "upperBoundTime": "00:07:15",
      "content": "And You could see the way she dressed her shoes weren't, how her clothes weren't like ours.."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:44",
      "upperBoundTime": "00:07:15",
      "content": "5:22"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:44",
      "upperBoundTime": "00:07:15",
      "content": "Like ours. And Ms. Brown left the school one day when she came back Roslyn had on new pants new shirt new shoes. you know youYou can could see oh and she had a bag. Sshe had a bag a brown bag and she kept the bag close but it had a lot of food in it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:05:44",
      "upperBoundTime": "00:07:15",
      "content": "You know Ms. Brown was that teacher that she would ask you, are you okay do you have the things you need stuff like that. And she would really take care of you so that's what really kind of resonated with me as far as that teacher, and she was more of a mother figure to all of us in the school, but you know as a you know we got a mother at home but in the school that was our mother at the school. So that's what really resonates with me and in Miss Brown."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:07:15",
      "upperBoundTime": "00:07:21",
      "content": "Yeah what a great thing to have."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:07:15",
      "upperBoundTime": "00:07:21",
      "content": "KR:Resp: Yeah."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:07:15",
      "upperBoundTime": "00:07:21",
      "content": "K:Intvr: Dido you have a best friend growing up?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:07:21",
      "upperBoundTime": "00:07:28",
      "content": "David McLaughlin."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:07:28",
      "upperBoundTime": "00:07:30",
      "content": "What's he up to?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:07:30",
      "upperBoundTime": "00:07:58",
      "content": "uh Dave was in prison for 12 and a half years. He got out about 10 years ago and now he owns a restaurant in Gonzales. He owns his own home. Hhe has a restaurant in Gonzales and he's opening another one soon. And he's trying to help me get out of prison right now today."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:07:58",
      "upperBoundTime": "00:08:01",
      "content": "Okay. Who comes and visits you up here?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:01",
      "upperBoundTime": "00:08:39",
      "content": "A young lady named Vanessa. She was my girlfriend on the streets. And she's been here for this almost this entire ride. I praise her for being the person she is and being the woman that she is and being the woman that she has become. You know I'm thankful to her and I don't know maybe if she wouldn't totoo came into my life I wouldn't have made the turn around that I'm sitting here representing right now."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:01",
      "upperBoundTime": "00:08:39",
      "content": "K:Intvr: Sure."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:01",
      "upperBoundTime": "00:08:39",
      "content": "KR:Resp: She's a beautiful person."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:08:39",
      "upperBoundTime": "00:08:42",
      "content": "And she stuck by you all this time."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:42",
      "upperBoundTime": "00:09:43",
      "content": "Well we had,- it was when I was convicted, I asked her to leave because I didn't know what to expect and what would be."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:42",
      "upperBoundTime": "00:09:43",
      "content": "KR:Intvr: Yeah."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:42",
      "upperBoundTime": "00:09:43",
      "content": "Resp: Yeah, I told her to leave because I really didn't know what to expect. You know I got a life sentence and she was young I was young. you know, I know she had a lot more living to do and things that she wanted to do that she wanted to do with me and because I wasn't going to be there I know that eventually that would change."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:08:42",
      "upperBoundTime": "00:09:43",
      "content": "So I just asked her to you knowquit it, and live your life and let me try to see what's going to happen with this. But eventually a few years later, about maybe 8 years later, I got a letter from her and she said man I just I need to see this through. Me and you in this situation and she's been there ever since."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:09:43",
      "upperBoundTime": "00:09:45",
      "content": "Do you have children?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:09:45",
      "upperBoundTime": "00:09:45",
      "content": "Yes."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:09:45",
      "upperBoundTime": "00:09:49",
      "content": "Tell me about them."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:09:49",
      "upperBoundTime": "00:10:13",
      "content": "um I have a daughter her name is Kuanisha she plays basketball for LSU. She's a basketball she's crazy about basketball. AAU basketball junior high school basketball high school basketball she played at LSU. She's a beautiful young lady."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:10:13",
      "upperBoundTime": "00:10:15",
      "content": "Is her mother the one you were referring to earlier?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:10:15",
      "upperBoundTime": "00:11:03",
      "content": "no. No no no my daughter Lolita that's my daughter by this young lady that we just spoke of. My daughter Lolita does she's just graduated college. Shshe had a son, she's married. Her husband is a motivational speaker. They moved to Arizona, Casa Grande Arizona and they just moved back to Louisiana, because she's a representative for Herbal Life."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:10:15",
      "upperBoundTime": "00:11:03",
      "content": "10:19"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:10:15",
      "upperBoundTime": "00:11:03",
      "content": "And she has a gym opening, you know they're doing alright."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:10:15",
      "upperBoundTime": "00:11:03",
      "content": "And then there's my sons, - one of them he just left here. He just left Angola, he was in prison but currently he's out and he's doing better for himself."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:11:03",
      "upperBoundTime": "00:11:05",
      "content": "What was he in here for?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:11:05",
      "upperBoundTime": "00:11:12",
      "content": "But he's out he's currently doing all right he's a rapper. Hhe's on tour doing shows right now things of that nature. So he's alright."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:11:12",
      "upperBoundTime": "00:11:15",
      "content": "Do you have another son?"
    },
    {
      "speaker": "K:Resp:Kuantau",
      "time": "00:11:15",
      "upperBoundTime": "00:11:31",
      "content": "Yes Rashad he's in college. That's he's in college He's in college in Texas. He's going to school to be a teacher. So he's alright he's doing well. Other than that everything"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:11:31",
      "upperBoundTime": "00:11:33",
      "content": "What do your kids think of you?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:11:33",
      "upperBoundTime": "00:13:20",
      "content": "Sometimes, I hear the bitterness in their voices when I talk to them. You know I try to give them advice, and lLet them know that this is not something that they want to try this is not something that they want to do. This is not something that they want to be a part of. Do the right thing, so you'll never become a part of this. I just try to give them some of the advice that I never got."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:11:33",
      "upperBoundTime": "00:13:20",
      "content": "You know Because you can take something the wrong way when people explain it to you or you just take it and run with it not totally understanding what's being said. So I try to convey to them in the most proper manner, so they can really understand what it is that I'm trying to get across to them. BecauseCuz I made a mistake of misconstruing, and misunderstanding something that was being conveyed to me."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:11:33",
      "upperBoundTime": "00:13:20",
      "content": "And I really really believe it caused me to turn to the wrong method of- the wrong coping mechanism that's what I wanted to say, the wrong coping mechanism. So I do my best when I talk to them I try to, I scrutinize everything I tell them, because I want to make sure I'm telling him the right thing, and not give them the wrong directions."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:13:20",
      "upperBoundTime": "00:13:26",
      "content": "It's great that a couple of them are in college."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:13:20",
      "upperBoundTime": "00:13:26",
      "content": "KR:Resp: Yeah."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:13:20",
      "upperBoundTime": "00:13:26",
      "content": "K:Intvr: What was the highest year of school that you completed?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:13:26",
      "upperBoundTime": "00:14:25",
      "content": "8th Eighth Grade. I came here and I got my GED and then I went off into other educational and other educational programs you know like transactional analysis, sober group, and anger management,. things of that nature you know what I'm saying just things to help me enhance myself as a person as a being. I want to do public speaking. I want to do music."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:13:26",
      "upperBoundTime": "00:14:25",
      "content": "I want to do so many different things. Non-profit organizations to feed homeless people and help people are things so there's just a lot of stuff that I really do,- I hone this, I work on my my craft to be able to put things in effect. You know I really want to get things going in different directions."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:14:25",
      "upperBoundTime": "00:14:35",
      "content": "What do you think led you down the road you ended up on?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "One of the aunts that I was telling you about earlier I'd started I got away from the teaching that she was teaching and she started using words like sissy and you act like a little girl and things like that you know because of the way I wasn't listening to her and she used to tell me you going to go to prison and you going to be a sissy. Things like that, and I'd tell people this when I give my testimony in church and everywhere else .I tell people and I say I sit down and I think why would she say something like that? Why would she tell me something like that?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "15:08"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "And I know I don't act like that, so why would she tell me something like that? But she was telling me that to try to scare me, but she try to make me believe that when men go to prison they become sissies and things of that nature. Aand like I said I started not living the teachings that I was being taught. I got outside what she was teaching me as far as being an upstanding person being a righteous person and when she would tell me that you're going to go to prison you're going to be a sissy you don't want to be like this and like that. and"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "So what I mean when I say it took it the wrong way you got to be careful about how you convey the people the things that you said that you got to put it in the proper perspective becausecuz you'll take it and run with it and not fully understand what it is you're being told."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "And because of that I went out in the streets every time somebody looked at me the wrong way or told me the wrong thing or you know how kids do they all you act like a little girl or you act like a sissy and you hear your auntie say that, and it be like, you didn't just tell me that. nowNow I'm going to prove to you that I'm not being a sissy and there you got in a fight, ."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "oOr you know things like that."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "and onc eOnce you start down that road and involves and turns into something else. And then before you know it you're living like a bully. And that's not really your demeanor but physically you have the attributes to be able to bea bully but, but that's not your demeanor, but because you hear these things, you know you're going to be a sissy if you go to prison. You're going to get in trouble you can go to jail you going to be a sissy and that's what I mean when I say I took it the wrong way."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "And I said you know my first time going to prison if you know you hear the stories about prison, you get there and they're going to beat you up, this and that. soSo you got to find the biggest person that you could think of, and you just get to beating on them and I was successful in doing that as opposed to not doing it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "I thought that was the right thing to do. And because I took with what my auntie said the wrong way, I'm in prison now the same person that she told me if I go to I would be a sissy, and I can't let that happen I got to prove her wrong, so that's where me taking that wrong route started."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:14:35",
      "upperBoundTime": "00:18:31",
      "content": "From that point it just escalated and escalated and escalated, and I. I saw felt the physical ability that I had that I didn't know I had. I knew I had it but I didn't know how how major it was within me you know like I had a built-up anger in me for some unknown reason but that anger came from her telling me what she told me and I let it manifest and it grew and it grew and it grew and it grew and as it grew, I grew physically I grew. I got bigger I was stronger, I was faster and I used that to my advantage as far as not using it for the right things. And from there it was a bowling ball effect."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:18:31",
      "upperBoundTime": "00:18:35",
      "content": "Do you You remember the first time you got arrested?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:18:35",
      "upperBoundTime": "00:19:35",
      "content": "I was 11 years old. I got arrested while I was with some friends we were in the store. They were stealing I didn't I paid for what I wanted and they took all of us to the bureau. Tthey're stealing candy and stuff that I could have paid for I'd the money in my pocket and I could have paid for it but because I was with them I went to the bureau. And and the same auntie I was telling you about she came, and signed all of us out. You know and uh"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:18:35",
      "upperBoundTime": "00:19:35",
      "content": "It wasn't a good experience because she whipped all of us in front of the police you know back then you can actually be whipped and not go to jail your parents can whip you and not go to prison. We got whipped in front of the police and we got you know that whipped when we and we got home for stealing and that was the very first time, you know stealing."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:19:35",
      "upperBoundTime": "00:19:45",
      "content": "Were you arrested many more tTimes between now I mean between that point as an eleven-year-old and then as a 20 year old?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:19:45",
      "upperBoundTime": "00:19:58",
      "content": "Yeah I was arrested quite a few times for multiple things, like I said that demeanor took on a bowling ball effect."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:19:58",
      "upperBoundTime": "00:20:01",
      "content": "Let me ask you this, were drugs and alcohol a big part of your life as a teenager?"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:19:58",
      "upperBoundTime": "00:20:01",
      "content": "20:08"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:20:01",
      "upperBoundTime": "00:20:18",
      "content": "Now that's, that's people would think I was a person that use drugs and druink alcohol. I've never use drugs or drink any kind of alcohol. No kind of drugs, no kind of alcohol. Never."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:20:18",
      "upperBoundTime": "00:20:21",
      "content": "Why do you think that is?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:20:21",
      "upperBoundTime": "00:20:51",
      "content": "My mom used to tell us There are three things I don't want you'all to do. I don't want you'all to have these tattoos and don't mess your teeth up with them gold teeth. And I didn't listen to her, I'm 2 of them but the drugs I just saw what it did to people. I just saw what it did to people I just never, I never wanted to use drugs."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:20:51",
      "upperBoundTime": "00:21:23",
      "content": "That's interesting. So one of the reasons that we wanted to speak with you is that you're widely regarded as a trusted member of this community here."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:20:51",
      "upperBoundTime": "00:21:23",
      "content": "KR:Resp: Yeah."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:20:51",
      "upperBoundTime": "00:21:23",
      "content": "K:Intvr: As somebody who has rehabilitated themselves. and I want to talk with you about that process but right now can you just take a minute and describe the 20 year old Kuan that was brought to Angola."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:21:23",
      "upperBoundTime": "00:22:25",
      "content": "The 20 year old Kuan was angry that he had a life sentence, didn't know if he was going to ever get out and still don't know if he's ever going to get out. The twenty year old Kuan had that same chip on his shoulder that is his Auntie put their you know in there. whenWhen in all true actuality she was just trying to scare him into not doing something that she didn't want him to do, .b Be on out on the streets."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:21:23",
      "upperBoundTime": "00:22:25",
      "content": "Getting in trouble and things of that nature."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:21:23",
      "upperBoundTime": "00:22:25",
      "content": "a ndAnd now I understand why she was doing and saying the things that she was saying just to scare me. But like I said if you were a kid and you don't understand you can take things the wrong way, and run with it. And you can make the wrong decisions, and now as a grown man and a man with a better understanding whose mind has evolved, I understand what she was trying to do."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:22:25",
      "upperBoundTime": "00:22:28",
      "content": "But you didn't then."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:22:28",
      "upperBoundTime": "00:23:58",
      "content": "I didn't then I didn't then. And as a 20 year old well see I'm saying I'm taking it from that young kid up until the age of me being arrested. Like I said I had to sit down, and reflect and think about it, this is all she was trying to do, not have me in the situation that I'm in now. The 20 year old Kuan years ago was boisterous. Hhe was bigoted. heHe was angry but he was humble. You know He always, this is the saying that I used.: I lived in the lion's den and I ate with the wolves."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:22:28",
      "upperBoundTime": "00:23:58",
      "content": "You have to be a lion to live in the lion's den and to eat with a pack of wolves you have to be a real solid you know people have to understand that, this is not something you want to mess with. It's hard to eat with a pack of wolves, but if you eat, you stand in the alpha category you know what I'm saying? So when I say that, again my physical presence people knowing me throughout the things that I did, as far as making a name for myself on the wrong side of the fence you know?"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:23:58",
      "upperBoundTime": "00:24:00",
      "content": "Did you get in a lot of fights when you first got here?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:24:00",
      "upperBoundTime": "00:25:48",
      "content": "Well I got here I was about 240 lb. and I was real muscular. I was real ripped you know and I had a few fights. Wwhile my very first fight I think that set the precedent on the stage for what what would happen to the next man. likeLike I told you when I was young kid. I was a very physical person and I was a big person that was good with his hands and was willing to go into any realm of war that another man may have wanted to go into."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:24:00",
      "upperBoundTime": "00:25:48",
      "content": "What I had my first fight was I have to use this man, this person to let everybody else know that they don't want to do this."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:24:00",
      "upperBoundTime": "00:25:48",
      "content": "It's a bad idea. And I use that man. Like I said barbarism was a thing in this prison. And you had to act like that sometimes, but through the years you know people know you and they they know you and they understand, you know you don't want to wake up a sleeping giant. You know That's all over the world."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:24:00",
      "upperBoundTime": "00:25:48",
      "content": "Sso just like I'm sitting and talking to you I don't know what wild side you have to becausecuz you haven't displayed it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:24:00",
      "upperBoundTime": "00:25:48",
      "content": "But you be humble, you be humble until you know you have to show that side of you and that's just what prison is, that's what it was about then. The people that are here, they've made a turn aroundturnaround in this person."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:25:48",
      "upperBoundTime": "00:26:04",
      "content": "Yeah I want to talk about that. So how specifically are you a different man today? Now we're all different after 24 years, but specifically how are you different?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:26:04",
      "upperBoundTime": "00:27:11",
      "content": "I'm different in the manner, I had things to work on when I first came to Angola, there was like everything was a challenge. If somebody said something it was a challenge you could have been speaking to a group of people but to prove to them that you shouldn't say that when I'm standing in this group um why did you say that you know? Why did you touch that?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:26:04",
      "upperBoundTime": "00:27:11",
      "content": "It was about proving who you were and now I'm the type of person when I hear things or see things, it's easy for me to walk away from - that's a problem I had a long long time ago. Like I said my physical attributes made it easy for me to buy into things that people said that I felt like they shouldn't say or buying into things that people did that I felt like they shouldn't have did and it wasn't my place to correct them for what they were saying, or what they were doing but it was a challenge to me."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:27:11",
      "upperBoundTime": "00:27:18",
      "content": "So when did that change?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:27:18",
      "upperBoundTime": "00:29:21",
      "content": "uh Well like I said I always saw myself as a humble person but I just didn't I really can't explain it, but certain things people did it just kind of rubbed me the wrong way. Like I said and that changed a few years maybe like 8 or 9 years into me being here. Because there's so many things to get into here. Llike I said I played basketball I played football I boxed. I was a super heavyweight champion up here for like 3 or 4 years."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:27:18",
      "upperBoundTime": "00:29:21",
      "content": "I never had an altercation with security. Never. not you know a physical altercation maybe a verbal you know with a disagreement, not even shouting match or cursing match or anything like that but a disagreement."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:27:18",
      "upperBoundTime": "00:29:21",
      "content": "And I also felt like this, if I could humble myself towards security and be humble for them, knowing they were the people that had me, you know that had to oversee my incarceration, well then I need to try this with the guys that I'm sleeping next to. And the guys that I'm in this room with every day all day."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:27:18",
      "upperBoundTime": "00:29:21",
      "content": "You know and Doing that I had to work on that, to become a better person for myself, to stop getting into arguments, to stop getting into fights and just see it for what it is I need to change itsit's about myself because this was what led me to thise situation."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:27:18",
      "upperBoundTime": "00:29:21",
      "content": "Always thinking people were challenging me. And again the challenge came from that little thing that my aunt said, it was a challenge. And right now I know what a healthy challenge is, as you know I know what a healthy challenge is when there are unhealthy challenges."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:29:21",
      "upperBoundTime": "00:29:49",
      "content": "So one of the things I'm interested in is what leads people to turn their lives around right. Sso sometimes it's a gradual thing just aging as well. - anotherAnother time it can be something very specific that you can point your finger to and say yes, it was this my interaction with this man or this mentor or this experience or a light bulb goes off."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "Well I got that I can tell you about an experience"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "30:39"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "tThat really humbled me as far as wanting to turn myself around. And it gave me a little window of hope. um I was a Rrec orderly at Camp D and something happened in the Camp, which is Camp D and I was put into administrative segregation for 96 days, and didn't know why nobody ever came to tell me why, but I managed to survive the 96 days unscathed no problems, but I was sentenced to Camp J."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "I had filled out to be a trustee long before that I filled out to be a trustee long before that but they would never sign my trustee status will trustees all they do is work around work outside their, cut grass, they work outside the prison, not the prison but the Camp that they in and some of them do work outside the prison. So I decided that I want to try this trustee y thing and I haven't been in trouble in a while I'm going to fill out this paper see if I get a trusteey status and they kept denying me they kept denying me."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "They denied me 9 times."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "Sso I said I'm going to try one more time. So when I tried the last time I wound up being incarcerated not incarcerated I mean put in administrative segregation. Sso after the 94th day they sentenced me to Camp J so that's where all the knuckleheads and they go to Camp J and they stay back there for a while. Wwell I never made it to Camp J. I got a letter back 2 days later Mr. Reeder we're going to send you back to where you were and we going to make you a trusteey."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "Now this is impossible, I'm in administrative segregation for something I don't know nothing about, but I get a trustee status in the mail and I'm getting sent to Camp F which is the trustee camp where all the trusties, – no other people."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "So I get the trusteey status and I go to Camp F and they sent me to work at beautification which is planting flowers doing landscape and lawn care things like that. Sso I'm like well I got the opportunity to do what I want to do through a bad situation came something good. And that's where I was at with that. Sso that's what kind of gave me that little window of hope when you think you're down and out just be patient. And some good things to come out of a bad situation. So that right there was like the turning point for me because I just thought that was it. You know Going to I'm in administrative segregation for something I don't know what I'm in here for. And now I'm going to Camp J."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "And All of a sudden that goes from Camp J to being a trusty and working outside the camp like I wanted to. So that kind of gave me that window of hope and you know after that happened when I got the beautification, all these security people came, people that you don't think looking at you, people that you don't think really care anything about your situation. I didn't know that major had to do the report when I was in administrative segregation. Hhe did the report and the report told the people that I had nothing to do with what I was in administrative segregation for."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "But I didn't think this man liked me because I saw his interaction with the prisoners and I'm not saying he did like me but at that point for him to write what he wrote in that report that kind of gave me a little glimmer of you know things are changing around here. And this Captain he don't even know me, but he knew me from being a good sports player, good football player he was one of the captains that honed all the football teams he put them together.,"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "Aand he helped me with getting a job in the trusteey status, so I could play football for him. see So you know these things happen."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "All these people put their hand in a pot and work together"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "35:26"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "tTo get me set up out there. Sso from beautification I went from beautification to working in the administration building. A job I never thought I'd have because I was too messed up when I got here."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:29:49",
      "upperBoundTime": "00:35:00",
      "content": "The work in the administrative building is one of the most prestigious jobs you can have. Then from the administration building. I went to the training academy. I like doing personal training and they actually gave me a job in the training academy, doing personal training for the officers. Sso like I said bad situation turned good in a matter of a short period of time"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:35:00",
      "upperBoundTime": "00:35:24",
      "content": "So let me ask you about this issue of hope right this you just mentioned. Sso it's hard for me from the outside looking in to imagine coping with the reality of life without parole. You've been here since you were 20."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:24",
      "upperBoundTime": "00:35:28",
      "content": "Yeah."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:35:28",
      "upperBoundTime": "00:35:45",
      "content": "You're now 44."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:35:28",
      "upperBoundTime": "00:35:45",
      "content": "KR:Resp: Yeah."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:35:28",
      "upperBoundTime": "00:35:45",
      "content": "K:Intvr: When you think about the possibility but never leaving here how do you cope with that?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": "A lot of nights you really lay down and pray, and then that's when you go into believing in God. Asking God to get you out of the situation. You reach to your family, you try to not think about it. You try to find people that are trying to find ways out, you get with them and collectively you all get together and figure out what can we do to get out, what law can we try to get passed? What can we do to help the legislators see that we need a mechanism for a relief? It's not a lot of ways to cope with that."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": "Because I see a lot of men lay under the covers, and they not sleeping, they crying you can hear them sometimes. Yyou can hear men wake up a sleep from having nightmares of knowing they're going to die here. I had those nightmares, but I do my very best, I trick myself into believing that I'm going to get out, and that's what I wake up for."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": "See I harness things- good things my kids, my fiancé, my mother, just all kind of things you got to put that in front of you and look at it and focus on it because it'll mess you up."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": "K:Intvr: Yeah."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:35:45",
      "upperBoundTime": "00:38:32",
      "content": "KR:Resp: You never know you don't know if you gonnagoing to wake up. Yyou don't know if you're ever going to get out. You hold onto old memories you see the guy next to you he just died 2 days. Somebody that you were close to, he's dying from cancer, or you see people die everydayevery day and you wonder you know if you're gone ever become that person, if you don't ever get out. You don't know."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:38:32",
      "upperBoundTime": "00:38:44",
      "content": "I'm sorry that's, a- I asked you a very difficult question I know. But you know what,? That is um tThat's really what's going on here. We need to have a conversation about that."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:38:44",
      "upperBoundTime": "00:38:53",
      "content": "Well we need to have a conversation about it everydayevery day, not just today not just when this film's being shown but every day."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:38:53",
      "upperBoundTime": "00:38:54",
      "content": "Yes."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:38:54",
      "upperBoundTime": "00:39:22",
      "content": "Because every man that comes here people can change change. you know theyThey got a lot of people walking the streets that made mistakes they just got away but we the ones that they said you know that did these crimes, we're the ones that's convicted."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:39:22",
      "upperBoundTime": "00:40:11",
      "content": "Kuan, let me ask you if you if you"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:39:22",
      "upperBoundTime": "00:40:11",
      "content": "40:32"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:39:22",
      "upperBoundTime": "00:40:11",
      "content": "If you were to have a chance to go for a pardon board or parole board we are talking about this little earlier in the day you know they will have in front of them your arrest record your convictions. They might have a conduct report from here and that's what they're going to be focusing on and you're going to have a short period of time to educate them about the person you are now. They're going to have everything about the person you were. What do you want them to know?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:40:11",
      "upperBoundTime": "00:41:38",
      "content": "I want them to know that a man can change. I want them to know that, um you have to grow up somewhere be it in prison, or as a free man, but eventually you will grow up. It's hard. it's hard. Um The paper they would have in front of them, it doesn't tell who the person is, my record the paper that they would be holding it doesn't reflect, it doesn't tell them the person that I have become, picked her it doesn't tell them the person that I am."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:40:11",
      "upperBoundTime": "00:41:38",
      "content": "It's a lot of good things I want to do when I go back out into the world, and I believe that I'm going to go back out into the world. Like like I said sometimes you got to trick yourself into believing that you wannawant to go back out into the world and that you're gonnagoing to go back out into the world."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:41:38",
      "upperBoundTime": "00:41:50",
      "content": "LetsLet's talk about that. When you envision your life outside of here what do you, what is that look like what do you see yourself doing? What are your goals?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "um ok. My goal is to have a nonprofit organization for troubled youth. Because I wasn't a troubled youth but I was a troubled youth because I chose, I had a good family even though it was all women I had a good family they treated me well. Tthey treated me well, - I'm talking about if I wanted to be a sports player or a musician or whatever I wanted to be, those women would get together and get that money to make sure I had the best equipment or whatever it is. Tthat I wanted to be they made sure I had whatever I need to be that person."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "Um I want to start some organization to help at-risk youth. And some not at risk youth and I just I just want the youth to be able to,- we need to get a mechanism to actually help them understand situations. I watch TV all the time I see the bullying thing that they got going on. I like the steps they're taking too redo that, but my life if I was to leave prison right now, my life in 5 years from now I would be a business owner. I have some skills and crafts that I know how to do. I'm a builder. I know landscaping & and I know lawn care I know all types of things you know housekeeping from doing it here in this prison. I know so many different things. I have so many skills."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "But my life in 5 to 10 years I want to be almost finished paying for the things that I'm working for really. I want to be working. I want to go to work everydayevery day. Iif I can get up at 4:30 every morning here and go to a job and work here for $0.04 an hour I would be proud to wake up at 5:30, and go to be at work at 8:00 or 9:00 and get paid or 12 or 13 or $14 an hour and make do make do with that until I'm able to do better."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "You know This place, see you got to want to do better and you got to want to fix what was broken within yourself. And like I said I can get out of here right now and never and never never never"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "45:34"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "backslidenever backslide. I don't have a problem with drugs. Never had one. Mmy communication skills are so much better. Mmy understanding is broader. Mmy mind has evolved. I'm proud of the person I am and to go forward in life, you have to be proud of the person you are, because if you're not, you're going to fall back into your old ways, or you're not going to make the right decisions."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:41:50",
      "upperBoundTime": "00:45:20",
      "content": "I'm a better decision-maker. I'm more willing to help people than I was when I came, before I came. I'm just I'm just an open soul and but I want to do the right thing."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:45:20",
      "upperBoundTime": "00:45:23",
      "content": "Yes and so much of those changes that people go through are invisible."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:45:23",
      "upperBoundTime": "00:45:59",
      "content": "Invisible. You know you can read on a piece of paper but it has no effect on these people because they didn't you know they're not being brought up to speed on, well he just graduated college not that they really care but he just graduated college. Hhe just went through 2 years of Bible school. Hhe just built 40 airplanes and gave it to some kids at St. Jude Hospital, you know stuff like that, they don't get to see that."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:45:59",
      "upperBoundTime": "00:46:38",
      "content": "Yeah so the Supreme Court uh has offered up the guidelines for juvenile offenders that they become parole eligible after 25 years. And to me that is acknowledging on some level that we should look at somebody after 25 years, and assess them, to see if they are a good candidate, and that's what is so perplexing about life without parole. The idea that we would never ask, that we would never want to reassess a person. So maybe 25 years?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:46:38",
      "upperBoundTime": "00:47:24",
      "content": "Well see, that's the thing is uh let's just let me just throw this out there. When I came here in 1995, they closed the college down, and it was understood that any, the technical college if you wanted to get in that school you had to have 5 years or less to be going home. Sso that mechanism was 5 years or less, you go to school, you get a trade and you go back home with the trade. But if you have 65% of the prison, that's lifers, that's a small portion of the people getting the trades to go back home. You see what I'm saying?"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:47:24",
      "upperBoundTime": "00:47:32",
      "content": "Absolutely. I mean all this rehabilitation in the context of life without parole."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "And its never being seen."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "K:Intvr: Yeah."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "KR:Resp: Like I said beautifications skills I love"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "55:04"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "pPlanting flowers I can tell you what soil, what flowers, what's needed annuals perennials What'swhat's needed to be put in this season that season and then the other season. When to take it up, when to put it back down."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:47:32",
      "upperBoundTime": "00:48:15",
      "content": "But I can go do community service at an old folksfolk's home. I can go do community service in front of a Convention Center. I mean just to show the skills that I've learned but what's the sense of me having the skills are or having any hope at all it's like you said if I feel like I'm never getting out."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:48:15",
      "upperBoundTime": "00:48:45",
      "content": "Is that that, I mean it may seem odd for me to ask a question about what's bad about prison or what's good about prison, what's the worst part for you today? You know you talked about an enormous amount of violence when you first came here, what's the worst part of Angola for you today?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:48:45",
      "upperBoundTime": "00:48:53",
      "content": "The worst part of Angola for me today. Getting up and still being at Angola."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:48:53",
      "upperBoundTime": "00:48:54",
      "content": "mhm We talked about it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:48:54",
      "upperBoundTime": "00:50:09",
      "content": "Waking up and still being in Angola. That's the worst part. Knowing that I have I'm a changed man knowing that I have the skills to go be a better person in society knowing that I want to do better and society and knowing that I can do better in society and not having the opportunity to do that.that? Because I have a life sentence without parole."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:48:54",
      "upperBoundTime": "00:50:09",
      "content": "And I think every man that's going to sit in front of you here today they're going to tell you the same thing."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:48:54",
      "upperBoundTime": "00:50:09",
      "content": "Not having the opportunity to go back and share what it is that I've learned and show who I've become to the society that I have to the society that I was helping to destroy give me the opportunity to go back out there, and help rebuild it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:48:54",
      "upperBoundTime": "00:50:09",
      "content": "Now I have much more respect for the society that I was harming. you know nowNow I have much more respect for the society that I was hurting. I want to see it come up and not go down. Now that's the person I've become, that's the person I am now. So"
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:50:09",
      "upperBoundTime": "00:50:25",
      "content": "What's the best part about Angola? What's the good news about Angola? Is there any?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "The only good news in Angola is that people are leaving here now with your help. With the help that you're providing us with right now this camera the documentaries the things that you stand up for when you go see the legislators, and the senators about reform, trying to put a voice and a face to what's going on. The changes that have happened here it with the people that are here."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "Um Tthe good news is seeing a case that has been overturned when somebody has been wrongfully convicted. Now does everybody deserve to get out of prison?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "I'm not at liberty to say that but because the Bible says don't judge people and I'm not going to do that. But and weWe know everybody's not going to get out. We know that too. But the fact that we get a chance to be a voice. Tthe fact that you come here and you see us you talk to us and you convey with us and like you said. a"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "ndAnd like I told you earlier, Calvin was my bed partner. Calvin Duncan was my bed partner and I used to tell Calvin every morning if you see Calvin right now then you ask him what I used to tell him every morning. Calvin this going to be our year. Calvin walked out of here. And hopefully I'll be walking out of here too."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "But he's one of the ones that made it. And it's still trying to make a difference."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:50:25",
      "upperBoundTime": "00:52:49",
      "content": "And if we all can get on that track and get behind Calvin and line up and stand up, firm, plant our feet firm on the ground and do the right thing we can let these legislators and these senators and all these people that are looking at us, I mean everybody not going to, everybody is not gonnagoing to line up, but for the ones that will line up and stand firm and do the right thing, if we can get more of those people out, and out there to tell the story and bringing more advocates, and be an advocate, uh we can do wonderful things with this system."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:52:49",
      "upperBoundTime": "00:52:58",
      "content": "Yeah. Kuan of all the things that you have accomplished, what do you feel the most proud of?"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:52:58",
      "upperBoundTime": "00:55:51",
      "content": "That I have accomplished,... it's not one thing, it's a multitude of things. My accomplishment I had to work on myself. I'm talking about in prison I had to work on myself. And this my understanding, my willingness to help people now it's just so much it's me."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:52:58",
      "upperBoundTime": "00:55:51",
      "content": "The work that I've done on myself. Becoming a better person because I had to work on that because it's the prison is it's so so hard and some people deal with it by not dealing with people. But me myself I knew so many people and I was involved with so many people on the streets, and so many of them are here."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:52:58",
      "upperBoundTime": "00:55:51",
      "content": "So I had to push a friend away here, push one away here, and take a few here and make a path for myself, and work on me. It took a lot of people to help me get to the point that I'm at. Calvin was one of them. Troy thatTroy that you're going to speak to you later on. He's one of them. I had to like they say get rid of the bad weeds, and harvest my garden. You know what I'm saying"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:52:58",
      "upperBoundTime": "00:55:51",
      "content": ""
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:52:58",
      "upperBoundTime": "00:55:51",
      "content": "You know What I'm saying and I had to surround myself with people that were doing positive things as opposed to negative things and and I'm proud of who I am now because I know that whenever I leave here, because I just don't believe I'm going to be here for the rest of my life. Whenever I leave here I'm going into the society to do the right thing. My intentions are to do the right thing. And that's one of my biggest accomplishments. My goals are go forward and do the right thing. That's one of my biggest accomplishments. That's where I'm at."
    },
    {
      "speaker": "K:Intvr:Marcus",
      "time": "00:55:51",
      "upperBoundTime": "00:56:06",
      "content": "Okay sure. So, um You'veyou've given me so much great material by just sharing parts of your life with me I'm very grateful for that."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:56:06",
      "content": "I appreciate it."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:56:06",
      "content": "KR:Intvr: Thank you I appreciate this."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:56:06",
      "content": "K: Thank you"
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:56:06",
      "content": "KR:Resp: This was a wonderful thing."
    },
    {
      "speaker": "KR:Resp:Kuantau",
      "time": "00:56:06",
      "content": "K:Intvr: Thank you I feel privileged to be able to talk to you guys actually."
    }
  ]
}
