{"name":"","transcript":[{"content":"Lawrence Kelly Transcription REDACTIONS FINAL"},{"content":"Lawrence Kelly"},{"content":"Transcribed by Dari Zeltser"},{"content":"09/14/2018"},{"speaker":"LK:Lawrence","time":"00:00:00-0","content":"How you doing? My name is georgeGeorge Cooks. I'm also known as Lawrence Kelly. Lawrence kellyKelly is an alias of mine. I've been convicted of first degree murder. I was 18 years old. I was 18 years old, just making 18 during the time the crime was committed. I've been here for 25 years, since I've been here for the most part, I've been a legal aid that's been my $$ responsibility helping other people."},{"speaker":"K:Marcus","time":"00:00:26-8","content":"Tell me about the alias."},{"speaker":"LK:Lawrence","time":"00:00:29-7","content":"Well at the time, I used another name and so it stuck with me, lawrenceLawrence kellyKelly, but my real name is georgeGeorge Cooks."},{"speaker":"K:Marcus","time":"00:00:38-3","content":"Well what do you go byby?"},{"speaker":"LK:Lawrence","time":"00:00:41-4","content":"um Well here lawrenceLawrence kellyKelly."},{"speaker":"K:Marcus","time":"00:00:43-5","content":"How would you like me to refer to you, lawrenceLawrence?"},{"speaker":"LK:Lawrence","time":"00:00:47-2","content":"George."},{"speaker":"K:Marcus","time":"00:00:48-9","content":"George, so you use georgeGeorge. alrightAlright um georgeGeorge can you start by telling us a little bit about um your life coming up? tellTell me about the people who raised you, who you were close to."},{"speaker":"LK:Lawrence","time":"00:00:59-0","content":"My sisters mainly raised me, my two older sisters. I was about 13 years old when mom went to prison and I never really had a father figure around. It's just my two sisters. twoTwo good women, so um that's who mainly raised me when I was a kid."},{"speaker":"K:Marcus","time":"00:01:14-7","content":"Okay and what are they doing?"},{"speaker":"LK:Lawrence","time":"00:01:18-6","content":"What what are they doing? Well one um owns a beauty salon and one works at Coplin's as a $$ as a um chef."},{"speaker":"K:Marcus","time":"00:01:26-4","content":"Okay and this is all in New orleansOrleans."},{"speaker":"LK:Lawrence","time":"00:01:29-4","content":"Yes., yes"},{"speaker":"K:Marcus","time":"00:01:32-0","content":"and That's where you grew up too New orleansOrleans."},{"speaker":"LK:Lawrence","time":"00:01:33-9","content":"Yes in New Orleans."},{"speaker":"K:Marcus","time":"00:01:34-1","content":"So that, so $$ you lose your mum at 13. Were there any other adults that took an interest in your life and made sure you were doing alright other than your sisters?"},{"speaker":"LK:Lawrence","time":"00:01:46-3","content":"(shakes head) No."},{"speaker":"K:Marcus","time":"00:01:48-9","content":"Okay alright so uh I imagine that that was a very difficult time for you."},{"speaker":"LK:Lawrence","time":"00:01:55-4","content":"Yes."},{"speaker":"K:Marcus","time":"00:01:58-9","content":"um Do you uh When you look back on that, do you feel that in spite of those things that there were folks who were looking out for you, who cared for you, and who loved you or do you feel like you were kindakind of just on your own?"},{"speaker":"LK:Lawrence","time":"00:02:10-7","content":"There were people. It was just that at that time being that young, not really knowing how to express myself, it was hard trying to explain to them, you know, what I was actually going through and I kindakind of kept it in, so I kindakind of shied away from them."},{"speaker":"LK:Lawrence","time":"00:02:10-7","content":"So when people tried to reach out to me because I couldn't really explain it I shied away from them, because I had several people always try to reach out to me, but itsit's just that I didn't think they understood what I was going through."},{"speaker":"K:Marcus","time":"00:02:42-8","content":"Yeah. whatWhat were you going through you know obviously outside of the specific?"},{"speaker":"LK:Lawrence","time":"00:02:46-3","content":"you know Having to, losing your mom to something like that, it's kindakind of you know, at that age it feels kindakind of shameful to try to talk to people about and you just shy away from people."},{"speaker":"K:Marcus","time":"00:02:59-0","content":"Yeah, no I understand that."},{"speaker":"LK:Lawrence","time":"00:03:00-6","content":"So that's what it was. it'sIt's hard to talk to people and they just try to deal with it."},{"speaker":"K:Marcus","time":"00:03:06-7","content":"howHow about school? howHow was school for you?"},{"speaker":"LK:Lawrence","time":"00:03:09-4","content":"Well, I was very studious, but it was hard to focus in school. itIt was always hard to focus, so I didn't do the things I was supposed to, you know. I didn't because trouble in school, but I just couldn't focus."},{"speaker":"K:Marcus","time":"00:03:25-4","content":"mhm and, you know, I imagine it would be hard for your sisters to kind of make sure you did your homework. theyThey had enough to worry about."},{"speaker":"LK:Lawrence","time":"00:03:33-4","content":"Right., right"},{"speaker":"K:Marcus","time":"00:03:36-3","content":"So did but did you do well in school?"},{"speaker":"LK:Lawrence","time":"00:03:38-8","content":"For a while, but then I just just couldn't focus."},{"speaker":"K:Marcus","time":"00:03:42-3","content":"Yeah. Where were you in school?"},{"speaker":"LK:Lawrence","time":"00:03:44-0","content":"um You mean what school?"},{"speaker":"K:Marcus","time":"00:03:45-9","content":"Okay. mhm"},{"speaker":"LK:Lawrence","time":"00:03:47-2","content":"um Carter G Woodson was the school I was in."},{"speaker":"K:Marcus","time":"00:03:49-1","content":"What was the highest grade you finishedfinished?"},{"speaker":"LK:Lawrence","time":"00:03:51-5","content":"7th."},{"speaker":"K:Marcus","time":"00:03:53-9","content":"So after 7th grade, how are you supporting yourself?"},{"speaker":"LK:Lawrence","time":"00:03:56-4","content":"Well, um, I started dealing drugs actually. So I started selling drugs, and you know, it's kindakind of hard at that young age, and that doing that type of stuff, and I wasn't in spite of my mom going to prison I still wasn't raised like that. LK: So, it was kindakind of real dangerous for me, you know being that young out in the street, you know. peoplePeople always try to take advantage of you and stuff so it's kindakind of hard."},{"speaker":"K:Marcus","time":"00:04:22-7","content":"Yeah, I mean so you're at 12, 13 years old."},{"speaker":"LK:Lawrence","time":"00:04:26-6","content":"Yeah, yeah I was 13."},{"speaker":"K:Marcus","time":"00:04:28-9","content":"Yeah, that's really young. K: um Did you have access to a firearm?"},{"speaker":"LK:Lawrence","time":"00:04:32-1","content":"um, Eventually, yes."},{"speaker":"K:Marcus","time":"00:04:37-2","content":"It seems like that's a prerequisite to being able to. $$"},{"speaker":"LK:Lawrence","time":"00:04:38-8","content":"Right right the um .. to really um to survive, to in New orleansOrleans, you know, when that start doing that type of stuff then well people always trying to you know. youYou have people doing drugs and people that wannawant to do drugs and stuff like that's so it's just something that you just have."},{"speaker":"K:Marcus","time":"00:05:03-5","content":"Yeah, tell me about that. whatWhat was your daily life like?"},{"speaker":"LK:Lawrence","time":"00:05:05-6","content":"Also, in spite me doing that, it was still shameful for me. I didn't really um like doing it. Honestly, I didn't $$, but I never really liked doing it, but I had to so um, but the craziest thing I always remember man, we had these next door neighbors and they used to always want me to go places with them. But when I started dealing drugs I used to hide from them"},{"speaker":"LK:Lawrence","time":"00:05:05-6","content":"5:33"},{"speaker":"LK:Lawrence","time":"00:05:05-6","content":"Um because I didn't feel right, and they still down the street from where the corner I used to be on."},{"speaker":"LK:Lawrence","time":"00:05:05-6","content":"And I used to always watch for that car, so I go hide in the store when they passed by because I never wanted them to see me hanging in this area $$, but I never really enjoyed it you know., So the other guys used to come $$. i'dI'd just tell them you got a momma to go home to, go home."},{"speaker":"LK:Lawrence","time":"00:05:05-6","content":"And they just wanted to stay around me but $$the crazy thing is that it's always like somebody around you get hurt, so its it=sit's never you, it's them, so you try to warn them. you know, So itsit's its just dealing with that every single day."},{"speaker":"K:Marcus","time":"00:06:11-9","content":"Yeah, it's interesting to me that you're worried about what your neighbors think of you when you're dealing with really high stakes."},{"speaker":"LK:Lawrence","time":"00:06:20-1","content":"you know um They used to, they always wanted me to come around. I liked it. I used to like bicycles, so I was good with them and so I used to basically fix everybody's bikes in the neighborhood before you know um $$ my mom, and so they kids, one foof the kids I used to always work on his bike and they'd pay me, and so they knew me well. And after that happened I just had to make some money, so but I could never look them in the eyes doing what I was doing."},{"speaker":"K:Marcus","time":"00:06:53-0","content":"Sure I understand that. um.. Where exactly werewhere you what neighborhood were you in?"},{"speaker":"LK:Lawrence","time":"00:06:58-2","content":"Uptown. theyThey call it uptown area, like 2nd and Danneel is the area. I used to deal drugs on its like, um actually, about 2 blocks off of St charlesCharles avenue."},{"speaker":"K:Marcus","time":"00:07:07-7","content":"uhh Yeah sure um so I think I know the area pretty well. ifIf I was sitting on the stoop of your house, what would I, what would be typically going on in your neighborhood?"},{"speaker":"LK:Lawrence","time":"00:07:23-7","content":"Well um just people $$ $$ some people trying to buy drugs, um just you know, I mean anything could happen but most of the time just people going coming and going going to the store."},{"speaker":"K:Marcus","time":"00:07:43-7","content":"A lot of drug trafficking coming through there?"},{"speaker":"LK:Lawrence","time":"00:07:45-5","content":"Yes., yes, yes"},{"speaker":"K:Marcus","time":"00:07:49-4","content":"um So it's just you and your two sisters?"},{"speaker":"LK:Lawrence","time":"00:07:51-0","content":"I had my little brother."},{"speaker":"K:Marcus","time":"00:07:55-8","content":"A little brother.. Now whatswhat's the age difference? howHow old were your sisters when they were taking care of you?"},{"speaker":"LK:Lawrence","time":"00:07:59-2","content":"Well, at that point um when I went to prison, 19 and 20."},{"speaker":"K:Marcus","time":"00:08:07-0","content":"and They were able to hold onto the house?"},{"speaker":"LK:Lawrence","time":"00:08:06-3","content":"No.. actually um we lost our home and then so we moved around a little bit, and then we were able to make enough money to get us another home, and then wound up moving between Baronne between washingtonWashington and sixth on Baronne street, so we moved there. So I mean without being to able to stay at home for a while, wwe lost basically everything and so we had to start all over again and so that's what we did."},{"speaker":"K:Marcus","time":"00:08:39-5","content":"Sure, and you just continued to put yourself you know on the streets?"},{"speaker":"LK:Lawrence","time":"00:08:42-8","content":"Right, so even when I first, my sister didn't know what I was doing, they had no idea I was actually selling drugs and, uh, one day I came home, and I had some money and I gave my sister some money, my oldest Troy, she basically beat the life out of me, and put me out the house, so um I had to try.."},{"speaker":"LK:Lawrence","time":"00:08:42-8","content":"I started sleeping in the yard for a while because I couldn't come home, because she couldn't accept that. So I used to sleep in the yard when she wasn't there, and she wouldn't know, and being young, my little brother keep the back light on while I'm sleeping, so I get up real early, uh give me something to eat while she gone because she wouldn't accept me doing that. So I just had to just try to find a way to do it, so eventually um I mean she never accepted it but she stopped uh basically beating meyou know."},{"speaker":"K:Marcus","time":"00:09:41-3","content":"Yeah I mean and how was she supporting herself?"},{"speaker":"K:Marcus","time":"00:09:41-3","content":"10:01"},{"speaker":"LK:Lawrence","time":"00:09:44-9","content":"Well, working you know, um the jobs that they had then basically both of my sisters um just trying to manage, so at that point I wasn't in school anymore. $$ so"},{"speaker":"K:Marcus","time":"00:09:59-6","content":"WhatsWhat's your relationship like with them now?"},{"speaker":"LK:Lawrence","time":"00:10:02-4","content":"fine. Fine its um you know it's something else, because my sister at this point, she she lost a son. um His girlfriend killed him, and so um she's dealing with that, and we talk a lot. you know,So she was just asking me about, she dontdon't want nothing really bad to happen you know, the woman that killed her son, so she was just asking me, you know asking what would be the right sentence for a plea agreement so she be in this position."},{"speaker":"LK:Lawrence","time":"00:10:02-4","content":"That's my sister of course. I love her. sheShe raised me like her own child and stuff., you know, So you know I had to explain to her everything and just come up with a number and so we agreed to a number so that's what she dealing with."},{"speaker":"K:Marcus","time":"00:10:51-7","content":"Was there was that in self-defense? whatWhat was there what was the?"},{"speaker":"LK:Lawrence","time":"00:10:57-8","content":"No um the girl was somebody that was just madly in love with him. um My nephew was a guy real church kid, never not in any trouble. it just It happened."},{"speaker":"K:Marcus","time":"00:11:10-5","content":"And she's been charged with second degree murder?"},{"speaker":"LK:Lawrence","time":"00:11:14-4","content":"Yes, and you know be in this position its $$. itsit's weird."},{"speaker":"K:Marcus","time":"00:11:20-1","content":"Yeah, what do you think? um What do you think is a just punishment for that?"},{"speaker":"LK:Lawrence","time":"00:11:28-1","content":"Well, I say 25 years would be something that's you know, I couldn't not telling my sister to, she was trying to deal with it. So I said well I agree with her I feel like 25 years would be a reasonable number for her, you know um, that she could accept, my sister could accept, you know. sheShe don't want her to spend the rest of her life in prison."},{"speaker":"K:Marcus","time":"00:11:52-6","content":"Right, so she would have to plead manslaughter?"},{"speaker":"LK:Lawrence","time":"00:11:54-4","content":"Yes., yes"},{"speaker":"K:Marcus","time":"00:11:56-0","content":"um Wow so who visits you up here?"},{"speaker":"LK:Lawrence","time":"00:12:00-2","content":"My sisters. myMy mom, also my mom, my sisters and my girlfriend."},{"speaker":"K:Marcus","time":"00:12:05-3","content":"Okay, um what about your little brother, what's he doing?"},{"speaker":"LK:Lawrence","time":"00:12:08-2","content":"Well my little brother was killed. LK: My little brother was killed about 10 years ago. so um"},{"speaker":"K:Marcus","time":"00:12:19-9","content":"What were the circumstances of that?"},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"He was leaving a nightclub it was all related to drugs, still he was leaving a nightclub going to his house, I mean his vehicle and they shot and killed him. So um and that was a real learning experience for me it's part of the one hundred hours to say my worst best experience."},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"And itsit's probably kindakind of strange how it could be a worst best experience but you know when you come up in the environment I come up in and it's kindakind of crazy I watched TV and I watched this stuff that happens like kids come in schools and just shoot people like this and how they do this. And is wondering how could they actually do something like that. And it's like well I mean my reasoning is they watch these video games and become so numb to this stuff that they could actually do this."},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"Um and you just You always for me I'm always thinking just always trying to rationalize stuff trying to understand. and for"},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":""},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"LK: My little brother is like my own child. I don't have kids but my little brother was like my baby and I was always protective of him and I didn't want him to get involved in drugs. When I came to prison, I couldn't protect him. And when that happened, it was something that really made me understand what people go through when you're selling people drugs."},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"When you're doing wrong to people. That's how they feel. It was something that really kind of made me, it is about trying to help people, not thinking about yourself and"},{"speaker":"LK:Lawrence","time":"00:12:23-1","content":"You know um notnot just caring about you aintain't hurting people because now going losing my little brother, that was my child and it kindakind of, it was just something that really took me while to deal with, kindakind of it really woke me up."},{"speaker":"K:Marcus","time":"00:14:18-5","content":"Yeah do you think he was trying to be like his big brother."},{"speaker":"LK:Lawrence","time":"00:14:21-4","content":"When I told my mom and I said I did this to him, my little brother idolized me. So itsit's like I'm the one who pulled the trigger on him because I taught him his stuff. you know so"},{"speaker":"K:Marcus","time":"00:14:37-7","content":"That's pretty harsh on yourself."},{"speaker":"LK:Lawrence","time":"00:14:41-2","content":"Well you know it when I look at itsit's like this when you live a life where you just learn not to care about people not that you don't care but all you think about is yourself, you have oto be hard on yourself so you don't go back to that. You have to understand and so its I mean it's you have to."},{"speaker":"LK:Lawrence","time":"00:14:41-2","content":"K: $$"},{"speaker":"LK:Lawrence","time":"00:14:41-2","content":"LK: huh"},{"speaker":"K:Marcus","time":"00:15:06-1","content":"What's his namename?"},{"speaker":"LK:Lawrence","time":"00:15:07-4","content":"Gregory. Gregory Cooks. So it's just you know I tell my mom, not my mom, I tell my sisters that it's something that I have to understand it something that I have to deal with so um"},{"speaker":"LK:Lawrence","time":"00:15:07-4","content":"15:10"},{"speaker":"LK:Lawrence","time":"00:15:07-4","content":"now it's like and as I described it itsit's my worst thing, best experience in life, because itsit's a growth process and thatsthat's thats what happened."},{"speaker":"K:Marcus","time":"00:15:33-3","content":"That's a hell of a price to learn something."},{"speaker":"LK:Lawrence","time":"00:15:36-9","content":"yes.. Yes."},{"speaker":"K:Marcus","time":"00:15:43-2","content":"So I gottagot to ask you this because itsit's uh one of the things that popped out to me and its uh its occupying my mind actually for the last few days. K: um So your 18th birthday was on the 26th of marchMarch."},{"speaker":"LK:Lawrence","time":"00:16:01-9","content":"Yes."},{"speaker":"K:Marcus","time":"00:16:03-8","content":"Of 1992."},{"speaker":"LK:Lawrence","time":"00:16:05-6","content":"Yes."},{"speaker":"K:Marcus","time":"00:16:08-2","content":"and um The crime that you've been convicted of occurred 3 days later 29th of marchMarch 1992. And as a result all of the legislation that you're keenly aware of inmate counsel."},{"speaker":"LK:Lawrence","time":"00:16:25-5","content":"Yes."},{"speaker":"K:Marcus","time":"00:16:26-5","content":"That has come to $$ on juveniles and given a ray of hope for some kind of eligibility for parole is now beyond your reach. Because of those 3 days and to me itsit's been occupying my mind because it just seems uh., just like a cruel coincidence. And I'm sure that more than anybody you've been made aware of that, how do you make sense of that?"},{"speaker":"LK:Lawrence","time":"00:16:58-2","content":"It's not that you make sense of it, it's just it is. it's just, it is. Um and, you know, I mean learning the law you understand that, you know and $$ I look I think about me in the sense that I left school in the 7th grade, and the crazy thing when I was young, I used to think I wanted to be a doctor or maybe a lawyer. So I come to prison and then my aspiration for $$ a legal aide didn't have anything I wanted to be a lawyer, but $$ to be free."},{"speaker":"LK:Lawrence","time":"00:16:58-2","content":"But in the process of learning the law, it really, um to really learn it you grow because to truly understand the philosophies, to truly apply it when you litigating, it requires a level of growth. Other than that you're rights, $$ it's not gonnagoing to come out right. You're trying to explain to a court or to another legal professional um uh a point of law it's not gonnagoing to come out right. Because you don't understand it."},{"speaker":"LK:Lawrence","time":"00:16:58-2","content":"And with that knowledge it helps your reasoning process with everything else you know itsit's like $$ $$ $$ what you go to school to educate yourself it's to learn to reason and so my drive to leave prison and learning the law is another part of what really helped me grow it helps me really think things through um it forces me. And that prtpart it's easy for me to understand the difference well with the $$ 3A and everything else because I mean."},{"speaker":"K:Marcus","time":"00:18:45-9","content":"It's a matter of love."},{"speaker":"LK:Lawrence","time":"00:18:47-4","content":"Yes yes it is now $$, of course I would have liked to benefit from it, but I understand."},{"speaker":"K:Marcus","time":"00:18:57-3","content":"Do you think it makes some sense to have that as a cut off?"},{"speaker":"LK:Lawrence","time":"00:19:02-1","content":"No, I don't think it maybe, I'm rationally would be $$ think about a juvenile maybe 21 years then it maybe should that should start um and reading some of of the legal opinions in that, they should they think that that should have been um the time I mean the age bracket, however um legally that wasn't the decision. and so"},{"speaker":"K:Marcus","time":"00:19:30-1","content":"Do you think that's any chance that it might expand to that as people start to look a little more closely at the brain science?"},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"In louisianaLouisiana I think it'll be slow. When I think $$ overall in louisianaLouisiana, it's just that um louisianaLouisiana is a bit slower especially in justice reform, and um $$ $$ $$ and in a sense, I think that it's most likely well, when you look at all the crime that actually is occurring it doesn't justify it. However but in a rational sense to them that's the only way that they think about it. $$ um"},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"However I mean when you still look at it, well you say well you have the death penalty it doesn't deter crime um and you have mandatory life sentences it doesn't deter crime."},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"20:09"},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"And I mean it's like well even mandatory I mean. So we're mandatory it doesn't help and I'm like well for people who thought you think that would well you have people in prison um of course you need prison but you have people in prison that could help. Um"},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"I do understand and my biggest problem was that I didn't have people that would that like should have recognized when I was a kid you know that you have a mother that have children, you know that even cared about that, you have a mother with children. So you the mothers in prison what happens to her children. you know You have the government and I should have asked those questions and they should have looked at $$ you know, even whatever she's in prison for that's. you know"},{"speaker":"LK:Lawrence","time":"00:19:38-6","content":"So it's just like you would expect um for people you know to actually I mean just like same thing that's going in the schools you know I mean you have a child it doesn't justify what he doing but you to prevent it from happening you should be looking at maybe what's going on in our schools and some of these kids are saying itsit's because theyrethey're being bullied you know and it could be prevented. um and so"},{"speaker":"K:Marcus","time":"00:21:49-1","content":"Do you mind if I ask what your mother was incarcerated for?"},{"speaker":"LK:Lawrence","time":"00:21:51-5","content":"Drugs. LK: Yeah she was on drugs."},{"speaker":"K:Marcus","time":"00:21:52-4","content":"and Was she using drugs or was she dealing drugs?"},{"speaker":"LK:Lawrence","time":"00:21:59-5","content":"Dealing drugs."},{"speaker":"K:Marcus","time":"00:22:02-8","content":"So in some ways you were sort of following in her footsteps too."},{"speaker":"LK:Lawrence","time":"00:22:06-5","content":"Not really because I wasn't I knew about it but I never was exposed to that she made sure of that. I never was exposed to it, thatsthat's again um it was easy to make a $$ possession of drugs and I assume she went to prison but because of the environment but um she never exposed us to that. $$"},{"speaker":"K:Marcus","time":"00:22:31-7","content":"Okay so um prior to this particular charge did were you ever arrested for anything?"},{"speaker":"LK:Lawrence","time":"00:22:40-3","content":"Yes um I was arrested for guns, illegal carrying of a weapon, um guns, um I've been arrested for robbery, um a drug dealer um and thefts $$ when I was smaller."},{"speaker":"K:Marcus","time":"00:22:52-3","content":"So and then the robbery of the drug dealer was that over a dispute over something or was that. just a"},{"speaker":"LK:Lawrence","time":"00:22:59-5","content":"$$ Yeah alias, basically he was muscling on us and so uh we came back, and just so happened instead they called the police."},{"speaker":"K:Marcus","time":"00:23:16-9","content":"Okay um uh yeah sure, that makes sense and there's a lot of um I guess sort of you know tit for tat kind of back and forth rivalry with some of these groups, and I think a lot of the violence comes from that, whether it looks like a robbery or assault or a homicide it's usually some kind of a dispute over something economic."},{"speaker":"LK:Lawrence","time":"00:23:43-8","content":"I mean sometimes itsit's that itsit's not like when you look at californiaCalifornia with this stuff gangs and stuff like that which is still not justifiable but in new orleansOrleans it's just the craziest thing, like it would be hard to understand that um people would actually want to hurt themselves or hurt other people simply because of the fact you're not from that area. um"},{"speaker":"K:Marcus","time":"00:24:05-9","content":"Yeah its neighborhoods its geography."},{"speaker":"LK:Lawrence","time":"00:24:14-5","content":"ItsIt's if you're not from the area you could look at a person wrong and um that could just its just like total just craziness."},{"speaker":"K:Marcus","time":"00:24:25-4","content":"Yeah yeah I know I understand um were drugs and alcohol part of your life with respect to using."},{"speaker":"LK:Lawrence","time":"00:24:32-4","content":"I've never used no drugs before and I've definitely been drunk before uh my mom smoke and I never I never smoked and anything. I never used any type of substance before."},{"speaker":"K:Marcus","time":"00:24:45-7","content":"This is just purely a way to earn money."},{"speaker":"LK:Lawrence","time":"00:24:50-6","content":"Yes yes."},{"speaker":"K:Marcus","time":"00:24:52-4","content":"Sure, so um I'm about to shift gears to coming here to angolaAngola and and to talk about some of those experiences that have changed you shaped who you are um is there anything else about your life before angolaAngola that we should talk boutabout that sort of captures something about your experiences that I didn't that we didn't talk about."},{"speaker":"LK:Lawrence","time":"00:25:19-3","content":"um, I was shot. itIt was my best friend that shot me."},{"speaker":"K:Marcus","time":"00:25:17-9","content":"Ok."},{"speaker":"LK:Lawrence","time":"00:25:19-5","content":"um and That was another I had these what I call worst best experiences and it was something that um itsit's out of just pure jealousy um people was telling me that this was how being $$ I just didn't want to accept that"},{"speaker":"LK:Lawrence","time":"00:25:19-5","content":"."},{"speaker":"LK:Lawrence","time":"00:25:19-5","content":"30:26"},{"speaker":"LK:Lawrence","time":"00:25:19-5","content":"Um and So it was something that it's something that I always think about because he attempted to blow my brains out and he ended up shot me in my neck."},{"speaker":"K:Marcus","time":"00:25:46-9","content":"Wow.o"},{"speaker":"LK:Lawrence","time":"00:25:50-9","content":"But it was something that I'll always re live because for multiple $$ home I lost a lot of blood and I'm lucky to be alive and I understand that."},{"speaker":"K:Marcus","time":"00:26:01-4","content":"Wow.o"},{"speaker":"LK:Lawrence","time":"00:26:01-4","content":"and It helps me when I think about that to really kindakind of like just look at things you know I mean that was almost a couple of months before I come to prison."},{"speaker":"K:Marcus","time":"00:26:15-6","content":"wow.. So tell me about him whatswhat's what's happened to himhim?"},{"speaker":"LK:Lawrence","time":"00:26:22-3","content":"He was killed... He was killed um septemberSeptember that I come to prison maybe 2 years later something like that yeah.. That's the like thats the environment you know thatsthat's what in that lifestyle. itsIt's just, itsit's no, really, it's not. it'sIt's just ignorance.."},{"speaker":"K:Marcus","time":"00:26:42-1","content":"mhm Now did he ever get charged for that attempted."},{"speaker":"LK:Lawrence","time":"00:26:45-0","content":"No I never I didn't um say any. um"},{"speaker":"K:Marcus","time":"00:26:49-9","content":"Yeah um so uh you've obviously gone through all kinds of changes and but I wannawant to maybe if you could take me back to first few experiences here at angolaAngola I would imagine you were at opposite for a little while while this whole thing was going through and you're hearing back or can you take me back to the georgeGeorge the 18 year old 19 year old kid whoswho's really who's really a kid."},{"speaker":"LK:Lawrence","time":"00:27:18-0","content":"Yeah."},{"speaker":"K:Marcus","time":"00:27:20-5","content":"uh Coming through the gates of angolaAngola what was that georgeGeorge like what was some of your first memories of the place."},{"speaker":"LK:Lawrence","time":"00:27:29-7","content":"I remember this is what I said to myself um I remember being processed and I remember coming down that road and I said um I actually said this I said that when it's time for you to leave this place you gonnagoing to think your way out of it and what I meant by all that was you gonnagoing to get here and you gonnagoing to learn and you study as much as you can and you grow and when it's time for you to leave this place you gonnagoing to think your way out of it."},{"speaker":"K:Marcus","time":"00:28:00-6","content":"and That's what you were thinking when you first come in here?"},{"speaker":"LK:Lawrence","time":"00:28:03-0","content":"Yes."},{"speaker":"K:Marcus","time":"00:28:06-6","content":"Wow."},{"speaker":"LK:Lawrence","time":"00:28:08-7","content":"Well."},{"speaker":"K:Marcus","time":"00:28:11-6","content":"Usually it takes people a little bit of time to get to that place."},{"speaker":"LK:Lawrence","time":"00:28:15-1","content":"No that was my mindset um to learn so that's all I did when I came here I just studied books I really didn't socialize with people sometimes I be up 2 or 3 o'clock in the morning have to go to the field the next day um I'm tired but I just read law books and cases and stuff like that and that was my whole dive was to learn."},{"speaker":"LK:Lawrence","time":"00:28:15-1","content":"So thatsthat's thats what itsit's been and in the process of learning you help teach people because in order to know what you really know you have to be able to explain it and you have to be able to apply it."},{"speaker":"K:Marcus","time":"00:28:48-9","content":"Yeah I couldn't agree more."},{"speaker":"LK:Lawrence","time":"00:28:52-3","content":"Yeah so thatsthat's what thatsthat's what the one of the I'll always remember what I said to myself driving on that bus um so that's always been what how I lived here."},{"speaker":"K:Marcus","time":"00:29:05-5","content":"Okay. mhm"},{"speaker":"LK:Lawrence","time":"00:29:11-6","content":"you know It was to educate myself in the process I help people you know um I've helped people go home I've even helped my mom get out of prison so um it's been beneficial."},{"speaker":"K:Marcus","time":"00:29:15-5","content":"Sure."},{"speaker":"LK:Lawrence","time":"00:29:20-1","content":"As an individual so yes."},{"speaker":"K:Marcus","time":"00:29:25-7","content":"Sure so um can you tell me a little bit about where you are with your own case you said that some things are coming together."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"Well I was fortunate enough to I wontwon't I to figure out a way to get to new orleansOrleans police department to release my documents the New orleansOrleans police department has a thing they cocky and they have a habit of just not responding to public record requests."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"So I had to conceive a way of how to get these people to release these documents without saying they were destroyed because that's what they had a pattern of doing all the records weren't destroyed they were saying that records were destroyed"},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"35:08"},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"So knowing that they would not respond to a public record request um people write them and they just say it don't matter but the law requires that they respond to a public record request within 3 days."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"So when I knew that they would not respond to it I actually prepared a letter in my girlfriend name and I had it sent to the new orleansOrleans police department and I said don't worry about it they not gonnagoing to respond. They didn't respond. I allowed 3 months to pass I prepared another letter had her send the letter allowed 3 more months to pass they did it again allowed 3 more months to pass understanding that they would not respond to those requests."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"When they failed to respond to requests well when you fail to respond to a request as a public official in fact that's a crime it's a misdemeanor. But itsit's a crime but the biggest part is that you have to pay 25 up to 100 dollars a day to the person that you fail to respond well that became the problem for them."},{"speaker":"LK:Lawrence","time":"00:29:30-5","content":"So now you either give me the documents that I need or you pay all this money for failing to respond and that's how it turned out and the documents show um that the person that testified against us it actually shows that the police officers they coached this guy and now I know for a fact that that story had changed and so I was able to uncover that information."},{"speaker":"K:Marcus","time":"00:31:20-3","content":"Alright. and"},{"speaker":"LK:Lawrence","time":"00:31:20-7","content":"and We also got a new witness um that they withheld for months and her testimony was that it was two other people that had committed the crime so all this stuff is coming out."},{"speaker":"K:Marcus","time":"00:31:33-0","content":"Ok so that's a $$ violation is that what you filed."},{"speaker":"LK:Lawrence","time":"00:31:37-6","content":"Yes."},{"speaker":"K:Marcus","time":"00:31:43-0","content":"So when you say us so were there other people who were uh codefendants with you."},{"speaker":"Lk:Lawrence","time":"00:31:49-3","content":"I have a co defendantcodefendant yes one person."},{"speaker":"K:Marcus","time":"00:31:53-2","content":"um So can you tell me a little bit um about how that experience through through educating yourself about your own case and motivation being I gottagot to get myself out of here kind of started $$ like that um do you see yourself as being a really different man."},{"speaker":"LK:Lawrence","time":"00:31:57-3","content":"Oh yes."},{"speaker":"K:Marcus","time":"00:32:01-1","content":"Yeah and can you tell me how how so."},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"… I've learned a lot and one of the things is that I've I learned I tell people that I believe in respecting people first and that's how I respect myself. And that's the way I live um and itsit's just certain things like one thing I remember reading I went through this experience I started reading a lot of religious material because I kept saying I needed help.. And I wanted to um like be in touch with something spiritual"},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":""},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"40:16"},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"bBecause I felt numb."},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"So I I read religion material for about a literally a year and a half and I remember when it was all over with just like itsit's think it was it was just I still felt like I didn't find anything. I didn't understand but after that I remember was just a few days later I went to the $$ library I had never been to the library you know and I had been here a couple years but I had never been to the prison library I had people send me books and everything."},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"But I went to the library and I went into the library and I went down the aisle I wasn't familiar with the library and I found a book and the craziest thing about this is that um the book and this the title of it is uh art of war and people always get confused when you when they hear that they think just destruction and everything else just violence and I took the book off the shelf. and"},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"So I checked it out and I started reading the book but the first thing I see in the book was that the skillful warrior was not the one that fought a hundred battle but the one that fought none at all and that was something that really broke me down because I wanted to know what made this guy. So skillful that he didn't fight at all and this book by sun tzu sun tzu was general ever that ever lived. and"},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"So I started to study this and the art of war everything like one thing is like when you read a bible when you read certain books it depends on where you are in your life that how you understand that and like I tell people like you $$ that actually art of war means the art of peace um if you thinking on small scale you would think about um I hurt somebody you'd think about conquering a man you think about symbols such things as violence and stuff like that if you thinking on a small level."},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"But um actually when you on a high level you always thinking about making things itsit's you two is better than one. So you build a man you don't destroy him you want people to work together you should never destroy people because when you work together then you build and its part of the philosophy of same thing only the skillful warrior not the one who won 100 battles but the one who fought none at all when you more skillful you learn to make people work together you learn to build people not destroy them. and"},{"speaker":"LK:Lawrence","time":"00:32:08-0","content":"So part of all these things this maturity that I read it just helped me grow as a person um and when you come from an environment that I come from thatsthat's what you learn $$ but you also part of a world that it dontdon't pay it dontdon't help you know it doesn't.. And so um"},{"speaker":"K:Marcus","time":"00:35:34-0","content":"So uh so Not so much a religious you kindakind of went down that path and its more it sounds to me more of a sort of philosophical and spiritual sort of awakening of sorts and that's continued to inform your life to this day."},{"speaker":"LK:Lawrence","time":"00:35:51-2","content":"Yeah so um I'm a big um I guess well I love asianAsian philosophy um yeah. So now I study it and so I kind of incorporate it with my religious beliefs and uh you know I work out constantly but part of that is my self punishmentself-punishment um always to kind of keep me focused I normally run 5 miles 3 or 4 times a week. um But it's always something just to make me stay focused um and itsit's just my thinking process is just it helps me think um and yes."},{"speaker":"K:Marcus","time":"00:36:31-8","content":"Sure"},{"speaker":"K:Marcus","time":"00:36:31-8","content":"K: what'swhat's the worst thing that you deal with here at angolaAngola?"},{"speaker":"LK:Lawrence","time":"00:36:34-7","content":"Yeah. huh"},{"speaker":"K:Marcus","time":"00:36:36-6","content":"What is the worst thing that you still deal with here?"},{"speaker":"LK:Lawrence","time":"00:36:38-6","content":"The worst thing that I deal with?"},{"speaker":"K:Marcus","time":"00:36:42-4","content":"The worst thing you deal with."},{"speaker":"LK:Lawrence","time":"00:36:47-8","content":"oh The worst thing I have to deal with .. Um just being here just being here um sometimes I have to actually like mentor guys you know and in the sense that well sometimes when they dealing with things and like I tell them I say well it's always about learning and I especially as a legal aideaid will discuss with them time $$ disciplinary court we have to explain to people."},{"speaker":"LK:Lawrence","time":"00:36:47-8","content":"Sometimes well um itsit's like you playing two hands you advise the rest of the counsel and sometimes they don't understand that you giving them the best advice and they get frustrated. So and so um itsit's that process of always maintaining control. and so um... When you dealing with some people who just frustrated and aggravated you know you have to learn."},{"speaker":"LK:Lawrence","time":"00:36:47-8","content":"So that's how those times can be extremely frustrating and I have to tell other guys that you you still need those experiences because you go home and there are people sometimes who just be driving on the road but you have to learn how to always think things through. So I mean a worst moment but it just being here sometimes you know of course I dontdon't it you don't like being here at all."},{"speaker":"K:Marcus","time":"00:38:13-1","content":"Yeah have you seen this place go through um some major changes in terms of the daily life the quality of life since you've been here."},{"speaker":"LK:Lawrence","time":"00:38:21-2","content":"Both good and bad yes."},{"speaker":"K:Marcus","time":"00:38:23-2","content":"Tell me a little bit about that."},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":"One way um it's not as much like much violence as it once they used to have and so it's the way this place is set up its that itsit's a good in a good sense that if you want to learn something it's your responsibility you can go get it they don't force it on you and that's good for a person because they can make a choice on they own."},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":"And it's better that they make a choice that they wannawant to learn something instead of somebody forcing on them well he only learned because somebody forced it on him so in this place it's kindakind of you set up your own responsibility to rehabilitate yourself and if you rehabilitate yourself we will help you. and"},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":"So that's how this place set up and so um that's a good thing because it allows a person to take his own responsibility"},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":""},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":"50:55"},{"speaker":"LK:Lawrence","time":"00:38:25-3","content":"aAnd decide ok this is what I want to do for the most part that's how it is.s"},{"speaker":"K:Marcus","time":"00:39:21-7","content":"Yeah and there's all these opportunities that are available to lifers now that weren't before."},{"speaker":"LK:Lawrence","time":"00:39:25-5","content":"Yes and that's another thing um at one time that if as a lifer you couldn't apply to school certain activities that rehabilitative activities that you couldn't be involved in and now thatsthat's open to everybody."},{"speaker":"K:Marcus","time":"00:39:38-9","content":"So whatswhat's the whats the badbad?"},{"speaker":"LK:Lawrence","time":"00:39:42-0","content":"Well it just depends like like um like I told a person that came from a texasTexas correctional facility that came here um this was um an employee um they worked at some type of $$ trade so we was talking and she was like well you all have it made here I said well it depends. It depends on the way you see things because if you take a young guy out a texasTexas correctional facility that's been locked down for most of 23 hours a day."},{"speaker":"LK:Lawrence","time":"00:39:42-0","content":"Well generally a hardship most likely gonnagoing to kindakind of like wake him up I'm assuming here sometimes you take a young guy and you just put him in just run amok you know. So he just might not learn like he's supposed to you know um but if he the opportunity is there if he take his own opportunity to learn. you know So instead of learning 10, 14 years down the line you know and so yes."},{"speaker":"K:Marcus","time":"00:40:47-7","content":"Okay, ok um so this is the second harder question that I actually don't like asking you guys because it's uh you know itsit's a difficult thing and that is um and your and you're limited to your situation you know 3 days after your 18th birthday and therefore not eligible for any kind of relief that seems to be coming down $$ how do you there have to be times as you're helping these guys with their cases and seeing doors being shut there have to be times where you have to very realistically consider the fact that you may never get out of here."},{"speaker":"LK:Lawrence","time":"00:41:27-4","content":"Yes."},{"speaker":"K:Marcus","time":"00:41:29-8","content":"and I'm I'm interested in that to me sort of an absurd kind of thing to try to wrap your head around how do you cope with that how do you make sense of that."},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"……. Mm I don't make sense of it. I don't want to say I make sense of it that's like.. It is. it's the way it is um coping with it.. Is that welll… for me I put it to you like this.. I was in a meeting the other day and a guy said that what he said was that if he could go to the future and he seen that he was dying in prison.. Then he would kill hiselfhimself and so I told him I said I would that dontdon't thatsthat's not the right way to think. Because if you go to the future and see yourself dying and then what you can see things that you need to do to change that actually happening because you seensee that for a reason. and"},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"So um my thinking is that face life without parole but I still for me it's just my belief if you put in the work something's gonnagoing to come out of it um and thatsthat's life without parole there are people here great people you know great people um we have people thatsthat's innocent and we have people that's just great people despite what they done as far as some stuff it's gruesome but hey are great people and you have bad people um and for the most part those bad people they show you that they bad because all the things they do and its within their record."},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"But you have great people here um and I'm not saying that because I'm for a prisoner I understand that because they are I mean you have a lot of guys are left here that's doing a lot of great things."},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"um"},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"55:34"},{"speaker":"LK:Lawrence","time":"00:41:48-3","content":"That wouldn't have left had they not have had life with parole for I mean I'm sorry would not have had the opportunity to legal ramifications that wouldntawouldn't left this place you know and um some of the guys that $$ some certain laws that changed I mean they doing great you know so um for me the way I think is that me.. There's a possibility.."},{"speaker":"K:Marcus","time":"00:44:22-4","content":"So .. you cope with it by hanging out from hope that something will change."},{"speaker":"LK:Lawrence","time":"00:44:24-8","content":"Yes and doing everything that I possibly can um yes."},{"speaker":"K:Marcus","time":"00:44:27-9","content":"Yeah.. Do you do you I mean some of the guys I've talked to will say you know um that's how I'm gonnagoing to live my life and if I end up dying here I'm gonnagoing to have as meaningful life as I can ehrehere."},{"speaker":"LK:Lawrence","time":"00:44:42-4","content":"Hope is not a method for me um I work I study I do everything that I possibly can and if that's tiltill my dying day then.. Thats .. That's the way it's gonnagoing to be."},{"speaker":"K:Marcus","time":"00:45:01-1","content":"Okay, no I like that hope is not a method for you."},{"speaker":"LK:Lawrence","time":"00:45:03-4","content":"No it's not noknow um you put in the effort you put in the effort."},{"speaker":"K:Marcus","time":"00:45:14-6","content":"Ok very good um… you do a lot of things here to improve your life and um maybe it's not an easy question either but what are youyou are most proud of."},{"speaker":"LK:Lawrence","time":"00:45:26-5","content":"Of who I am. Um I don't try to please people itsit's just natural $$ I tell people before you come to like me you will hate me because I don't try to please people. I don't try to hurt people but I'm just me. And I accept people for who they are um I respect myself I respected me but I'm proud of me um at one time at one time I wasn't I just wasn't real comfortable with myself um and I always worried about what people thought and at this point I'm comfortable with who I am and so um I'm proud of me."},{"speaker":"K:Marcus","time":"00:46:17-4","content":"Yeah so um you know you're you've got your eyes very much sort of focused on the future and and getting out uh through your own work. um"},{"speaker":"LK:Lawrence","time":"00:46:17-4","content":"Of course with I have the help of other people"},{"speaker":"K:Marcus","time":"00:46:30-5","content":"Of course. Um and I imagine that you spend quite a bit of time imagining what that would look like what your life would be like what would you be doing how do you what do you how do you see that."},{"speaker":"LK:Lawrence","time":"00:46:52-4","content":"What I want to do this is what I always think about because I speaking to a lot of people um kids and stuff like that um helping working towards like different like programs to kindakind of like help prevent children from going through you know coming through this at the early stages and getting involved with a lot of community programs um thatsthat's what I really thatsthat's a lot of stuff that I wannawant to do. and"},{"speaker":"LK:Lawrence","time":"00:46:52-4","content":"Just speak to people do a lot of speaking um iI- legal $$ event thinking it'd be civil law not cvecave made myself real good at it there would be civil law but I would like to do a lot of community work i'dI'd like to do a lot of speaking i'dI'd like to do a lot of that and i'dI'd like to involve myself with a lot of kids. A lot of programs that help children um different things like that that that what I'm always thinking about you know what I'maI'm do and everything and how I see myself."},{"speaker":"LK:Lawrence","time":"00:46:52-4","content":"I see myself as basically community activist but involved a lot of things to kindakind of like help people and um actually it's kindakind of crazy to me we had a crime thing about stopping crime and stuff like that stopping things from happening stopping kids from coming to a place like this so that's the way I see myself in the future."},{"speaker":"LK:Lawrence","time":"00:46:52-4","content":"1:00:06"},{"speaker":"K:Marcus","time":"00:48:16-8","content":"Did you think of a particular place are you gonnagoing to go back to New orleansOrleans?"},{"speaker":"LK:Lawrence","time":"00:48:21-8","content":"Well.. I don't want to live in New orleansOrleans you know I don't want to but I think that that's the place that I would like to start I wouldn't like to live in New orleansOrleans but I think thatsthat's a place that because I know it um it's kindakind of hard thing to go somewhere else and try to tell people itsit's like um there be there. You know and One thing that I see is that cause me again get to know me you would hate me before you would come to know me and I will tell you if you deal with me you will love me um but again I am real strong minded um and I don't bend."},{"speaker":"LK:Lawrence","time":"00:48:21-8","content":"But if I can help you I will but you know some people meet you and they try to tell you what to do and everything else so I'm this type of person that I'm my way um but I always one of the things is that in part of doing what I want to do is it that I always say well I would like to go and speak to people and I'm like well if you gone preach justice you should know us if you gone police us you should know us."},{"speaker":"LK:Lawrence","time":"00:48:21-8","content":"If you gone govern us you should know us and part of my programs would be to get these people out and get them into the streets start a thing where police actually communicate with children the judges everybody get them involved with programs where they could understand whatswhat's going on in communities where they could actually help you know it's something different if you outside and you telling someone we'll give you a hundred years or you just come in a community and do something but you don't understand. you know"},{"speaker":"LK:Lawrence","time":"00:48:21-8","content":"So I'm like okay, well get with these preachers and everything else get out there and talk to these people get into these communities. you know So that's the only thing that I'm like in that $$ I know its controversial maybe $$ a lot but thatsthat's my thats what I want to do."},{"speaker":"K:Marcus","time":"00:50:15-6","content":"Sure. Is there room for this girlfriend in this equation?"},{"speaker":"LK:Lawrence","time":"00:50:17-9","content":"huh Of course."},{"speaker":"K:Marcus","time":"00:50:20-0","content":"Tell me a little more about her."},{"speaker":"LK:Lawrence","time":"00:50:22-2","content":"Well she's very sweet very sweet person I mean I been in prison all a long time and she's been there for me um her name is $$ $$ Zeddy Carter and so she's a really."},{"speaker":"K:Marcus","time":"00:50:33-8","content":"and How long have you known her?"},{"speaker":"LK:Lawrence","time":"00:50:35-8","content":"Before I come here."},{"speaker":"K:Marcus","time":"00:50:38-4","content":"Sure."},{"speaker":"LK:Lawrence","time":"00:50:42-7","content":"Yes."},{"speaker":"K:Marcus","time":"00:50:44-7","content":"That's pretty amazing."},{"speaker":"LK:Lawrence","time":"00:50:47-3","content":"Yes before I come here so no kids."},{"speaker":"K:Marcus","time":"00:50:47-3","content":"Sure .. yeah ok so that's pretty good it's a good place to wind down I just want to ask you one more question and thatsthat's was there something I should have asked you about your prison experience about your time here something that you think might be important for people to know about the experience of serving life without parole. Anything I didn't ask you about?"},{"speaker":"LK:Lawrence","time":"00:51:08-6","content":"ItsIt's hard. ItsIt's extremely hard. Um … its itsit's just that um how I ascribe this is like being buried alive um and that's how it I describe my prison experience it's almost like being buried alive and sometimes itsit's its not knowing.. So um it's just real hard you deal with it but thatsthat's what itsit's like itsit's like actually being buried alive so you just you deal with it and just try to keep keep .."},{"speaker":"LK:Lawrence","time":"00:51:08-6","content":"you know You in that tight tight confines despite how large this place is.. ItsIt's small you know for me sometimes I say I feel I've outgrown my confines I've learned everything that I possibly could here.. So now it's to the point where I should be free. You know I've learned everything. Um So um it's real hard."},{"speaker":"K:Marcus","time":"00:52:35-5","content":"Yeah and I think that that is something that it's almost beyond reach of of your average person who's not incarcerated to to just grapple with what that actually means."},{"speaker":"LK:Lawrence","time":"00:52:56-0","content":"Exactly um I mean.. Sometimes I tell people I try to explain that to people you know just thinking about this mean mean yeah just when I tell you that it's just like that it's like actually being buried alive. So and despite all the people around you sometimes it can be extremely lonely um it can be and for me itsit's just I don't' run I never used drugs before I don't believe in running away from my problems."},{"speaker":"LK:Lawrence","time":"00:52:56-0","content":"I don't believe hiding from them I believe in dealing with them and sometimes that puts me in a very lonely place because some people they joke around but I don't everybody has the way they cope with things but for me I really been dealing with it. you know so"},{"speaker":"K:Marcus","time":"00:53:48-4","content":"Yeah which is um a little less lighthearted no distraction."},{"speaker":"LK:Lawrence","time":"00:53:51-5","content":"Yes."},{"speaker":"K:Marcus","time":"00:53:53-4","content":"Okay well I'm so grateful to you for sharing all of this with me taking your day."},{"speaker":"LK:Lawrence","time":"00:54:00-8","content":"imI'm grateful for it too and I certainly wish it helps that this information helps people I wish it helps."},{"speaker":"K:Marcus","time":"00:54:10-8","content":"Yeah I hope so thank you for doing your part."},{"speaker":"LK:Lawrence","time":"00:54:12-7","content":"oh Thank you all right."}]}