{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Lawrence Peters MK REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:02",
      "content": "Okay? Go ahead."
    },
    {
      "speaker": "Lawrence",
      "time": "00:00:02",
      "upperBoundTime": "00:00:23",
      "content": "Lawrence Peters, I was convicted of 2nd degree murder, 2 counts. I was sentenced to life in prison. I had just turned 19 and that's what I'm charged for, I'm serving a life sentence."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:23",
      "upperBoundTime": "00:00:27",
      "content": "How much time have you served?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:00:27",
      "upperBoundTime": "00:00:30",
      "content": "I've been down 23 years now."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:30",
      "upperBoundTime": "00:00:44",
      "content": "So as I said I'm just trying to learn about your life. And so maybe we'll start with your childhood and look at maybe, tell me about the folks who raised you."
    },
    {
      "speaker": "Lawrence",
      "time": "00:00:44",
      "upperBoundTime": "00:01:01",
      "content": "I was raised by a single mother. I'm her only son. I got a sister. I'm my daddy's only child, my sister got another dad. My sister got her dad and I got my dad. But I pretty much came up in a house with my mother and sister."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:01",
      "upperBoundTime": "00:01:04",
      "content": "And where did you grow up?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:01:04",
      "upperBoundTime": "00:01:07",
      "content": "In New Orleans in the Desire Project."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:07",
      "upperBoundTime": "00:01:06",
      "content": "Okay."
    },
    {
      "speaker": "Lawrence",
      "time": "00:01:06",
      "upperBoundTime": "00:01:16",
      "content": "And kind of like became the man of the house at a young age. And no father around."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:16",
      "upperBoundTime": "00:01:24",
      "content": "Okay, were there men who came into your mother's life who then became part of your life?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:01:24",
      "upperBoundTime": "00:01:54",
      "content": "They had one guy, me and my sister started calling him stepdad. He was the one that kind of like, he drag my mother here, then her brought her back down here. And what I mean by that, he put her in a house with two kids, they was doing good. Then, turned out that drugs he got into drugs and it took off from there."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:54",
      "upperBoundTime": "00:01:57",
      "content": "Okay, so did your mother have a problem with drugs and alcohol?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:01:57",
      "upperBoundTime": "00:02:37",
      "content": "Yeah my mom was a drug addict and me and my sister didn't appreciate it, we tried. Mom leaving kept doing what she wanted to do. And as the only guy that came into my mama life, we kind of took a liking to him at first because he treated us like we was his kids. Put my mother in a house, and he was an army guy, and when he come back he turned his life into drugs and just went crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:37",
      "upperBoundTime": "00:02:54",
      "content": "Yeah. So aside from the drugs, is it safe to say that you grew up in a household knowing that you were loved and cared for or did you feel like the man of the house I got to take care of everything and make it on your own?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:02:54",
      "upperBoundTime": "00:03:44",
      "content": "My mother loved her kids, she loved me and my sister. She did what she could do for us, and we did get that motherly love from her. And I guess that's what kind of like pulled us real close in with our mama, wanting her to do better. And getting away from that life and it didn't happen."
    },
    {
      "speaker": "Lawrence",
      "time": "00:02:54",
      "upperBoundTime": "00:03:44",
      "content": "So, me and my sister kind of moved on at an early age. We left my mama, I went to one of my dad's sisters, that's who kind of like raised me after I left my mother. I left my mother at the age of like 9."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:44",
      "upperBoundTime": "00:03:48",
      "content": "And where were you living with your aunt?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:03:48",
      "upperBoundTime": "00:03:50",
      "content": "In a Desire Project."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:50",
      "upperBoundTime": "00:03:54",
      "content": "Oh same. Is your mother still alive?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:03:54",
      "upperBoundTime": "00:04:01",
      "content": "No, my mother passed in 2009 and my father passed in 2010."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:01",
      "upperBoundTime": "00:04:06",
      "content": "Okay. Before that, did they visit you here at all?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:04:06",
      "upperBoundTime": "00:04:36",
      "content": "My mother, she visited me a lot before Katrina. After the Katrina incident, it was kind of like off. And during that time, during Katrina she caught an aneurysm and she wasn't able to move around like talking about it, my sister took her in and my sister was like her caretaker. She was a vegetable all over again."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:36",
      "upperBoundTime": "00:04:43",
      "content": "Sorry. Does anybody else visit you up here?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:04:43",
      "upperBoundTime": "00:04:47",
      "content": "Right now, my daughters."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:47",
      "upperBoundTime": "00:04:50",
      "content": "Oh, tell me about your children."
    },
    {
      "speaker": "Lawrence",
      "time": "00:04:50",
      "upperBoundTime": "00:05:15",
      "content": "Yeah I got 3 beautiful kids. I got a son and I got 2 girls. My son, he's 25, both of my girls 24. Baby girl, she's got a different mama, my oldest daughter and my son they got the same mother. Which is my 4th grade girlfriend."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:15",
      "upperBoundTime": "00:05:18",
      "content": "Oh wow, what's her name?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:05:18",
      "upperBoundTime": "00:05:23",
      "content": "Her name called Kawanda Edwards."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:23",
      "upperBoundTime": "00:05:25",
      "content": "What are your kid's names?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:05:25",
      "upperBoundTime": "00:05:28",
      "content": "Well, Lawrence, Lowanda, and Lawrencia."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:28",
      "upperBoundTime": "00:05:30",
      "content": "Okay."
    },
    {
      "speaker": "Lawrence",
      "time": "00:05:30",
      "upperBoundTime": "00:05:55",
      "content": "And, my baby girl, she's like the mother, the father, the big sister. She is like everybody. She tell me what to do. And yeah they visit me and my sister, my sister been my rock since like I've been born."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:55",
      "upperBoundTime": "00:05:57",
      "content": "Yeah, is she older than you?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:05:57",
      "upperBoundTime": "00:06:19",
      "content": "She's I'm 43, she's 44, she's 1 year older than me. But it just been me and her all my life. She's really like my mother and my father. And she's, my sister is, she's my everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:19",
      "upperBoundTime": "00:06:31",
      "content": "I think that, I'm just guessing that the two of your having to deal with your mothers problems from a very young age kind of bonded you to look out for each other."
    },
    {
      "speaker": "Lawrence",
      "time": "00:06:31",
      "upperBoundTime": "00:06:44",
      "content": "It did, it brought me and my sister close. Like I don't think there's a better relationship than me and my sister. That's my love."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:44",
      "upperBoundTime": "00:06:54",
      "content": "Yeah, that's great, that's nice. Are you still in touch with your 4th grade girlfriend?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:06:54",
      "upperBoundTime": "00:07:57",
      "content": "Yeah I'm still in touch with her. We talk, not regular but we do conversate. I kind of like got to give her room, her space, her time. And recently she just lost her mother. And I kind of like talked to her and give her what I went through with my mother. And kind of it helped her, she said. She thanked me for the conversation and she really appreciated it and needed the time that I did talk to her."
    },
    {
      "speaker": "Lawrence",
      "time": "00:06:54",
      "upperBoundTime": "00:07:57",
      "content": "But most of the time I call her we talking on our kids. She think, she older than me, my daughter telling her what to do. My son, I'm your man and all that. You don't need no man you got me ma. Right now my son, he's incarcerated but he'll be all right."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:57",
      "upperBoundTime": "00:07:59",
      "content": "Where is he?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:07:59",
      "upperBoundTime": "00:08:05",
      "content": "I don't know what jail he's in right now. But he'll be home next year some time."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:05",
      "upperBoundTime": "00:08:20",
      "content": "Okay. So just paint a picture of the Desire Project for me. If I'm standing on your front step of your door and looking at the neighborhood in the evening."
    },
    {
      "speaker": "Lawrence",
      "time": "00:08:20",
      "upperBoundTime": "00:09:49",
      "content": "Man, its how can I put it. It's a, it was a dangerous scene every day. Every time I come outside I either see somebody getting robbed, I either see somebody getting shot, or there's a drug deal gone bad right here. I was just surrounded by it."
    },
    {
      "speaker": "Lawrence",
      "time": "00:08:20",
      "upperBoundTime": "00:09:49",
      "content": "And the guy that I used to, I never had a brother, so the guy that I did used to look up to, he was a drug dealer. And I used to always wonder why he would try to pull me to the side and tell me what's right and what's wrong. He was telling me what was right and what was wrong, but his actions was showing otherwise. So I kind of pretty much picked up on his actions. Drug dealing, pretty car pass by, he in it."
    },
    {
      "speaker": "Lawrence",
      "time": "00:08:20",
      "upperBoundTime": "00:09:49",
      "content": "Then, it came a time when he just started taking me shopping like every Saturday. I'd get the Bell shoes, the Christian Dior outfits and stuff like that. And it kind of like brought me all the way into it and pretty much probably how I was going to be turned out to the streets like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:49",
      "upperBoundTime": "00:09:56",
      "content": "So how old were you when that change happened for you?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:09:56",
      "upperBoundTime": "00:10:01",
      "content": "I'm going to say at the age of 10, 11 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:01",
      "upperBoundTime": "00:10:02",
      "content": "Oh wow."
    },
    {
      "speaker": "Lawrence",
      "time": "00:10:02",
      "upperBoundTime": "00:10:04",
      "content": "Around that age."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:04",
      "upperBoundTime": "00:10:04",
      "content": "Really young."
    },
    {
      "speaker": "Lawrence",
      "time": "00:10:04",
      "upperBoundTime": "00:11:39",
      "content": "Yeah I was really young. I wind up stealing out the store. Let me share with you this really quick. I'm a good hearted person and I always been that way since I was a kid. I like helping people. And I had a best friend, name was Jamal. And we used to go out to the shopping malls, and we used to be in competition with each other who could make the most money by helping people bring their groceries to the cars. And they give us a quarter, 50 cent or whatever."
    },
    {
      "speaker": "Lawrence",
      "time": "00:10:04",
      "upperBoundTime": "00:11:39",
      "content": "And I never told them why he always ended up with more money than me because most of the time when I bring especially if it's an elderly lady kind of like much older than me, I wouldn't take her pay. I'd just say thank you ma'am that's alright and I will go on my way. But I never did told Jamal that's why you always beat me because I don't always take money. I didn't want to shatter his, I got him, I'm going to beat him this time."
    },
    {
      "speaker": "Lawrence",
      "time": "00:10:04",
      "upperBoundTime": "00:11:39",
      "content": "But I always was like that. And pretty much after time passed, I wound up my first time going to jail was the little juvenile B room thing. I stole a flashlight out of Swigs. And they caught me for it and I never wanted to go back to being that little kid again."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:39",
      "upperBoundTime": "00:11:48",
      "content": "What facility was that?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:11:48",
      "upperBoundTime": "00:12:18",
      "content": "Well they call it the B room, it's for juveniles. That's where they hold you until your mama come get you. I never did got nobody to call mom, but she ain't even have a phone. But my auntie that I was staying with, I get her to come get me. I beg her please don't tell my mama. Because mama going to be mad at me. But anyway, my auntie come get me and that's kind of like my first time started."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:18",
      "upperBoundTime": "00:12:19",
      "content": "Getting in trouble."
    },
    {
      "speaker": "Lawrence",
      "time": "00:12:19",
      "upperBoundTime": "00:12:20",
      "content": "Getting in trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:20",
      "upperBoundTime": "00:12:22",
      "content": "How old were you?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:12:22",
      "upperBoundTime": "00:12:24",
      "content": "About 10, 11, 10 years old at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:24",
      "upperBoundTime": "00:12:27",
      "content": "Okay. So what about school how was school for you?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:12:27",
      "upperBoundTime": "00:13:52",
      "content": "Oh man, I mentioned to you about my education. I got learning disorders and my education don't go that high. But I do understand right from wrong to just put it like that. And I think 5th grade season, I had got kept back in the 5th grade and that following year they kind of like kicked me out of elementary school and sent me on to junior high. Which I got to Carver Junior High, and I pretty much stayed in the same grade for like 3 years."
    },
    {
      "speaker": "Lawrence",
      "time": "00:12:27",
      "upperBoundTime": "00:13:52",
      "content": "I just couldn't get it. So I started going to juvenile facility more. And I don't know, I just, it just didn't turn out good for me. In school, I used to like P.E. time, playing basketball, running around the football field. And I think if I would've stood in school or could've did a little better, I probably would've been a nice little athlete or something."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:52",
      "upperBoundTime": "00:13:55",
      "content": "So what was the highest grade you ended up staying through?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:13:55",
      "upperBoundTime": "00:13:58",
      "content": "The 6th."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:58",
      "upperBoundTime": "00:14:00",
      "content": "For 3 years?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:14:00",
      "upperBoundTime": "00:16:05",
      "content": "Yeah for 3 years. But I didn't get much past the 5th grade. But I do know when I did get to the 6th grade and I got kept back that first year. They recommended me to a class for overage. They called it the overage class and what they do, you'll do 6th grade and 7th grade at the same time just that one year."
    },
    {
      "speaker": "Lawrence",
      "time": "00:14:00",
      "upperBoundTime": "00:16:05",
      "content": "So I got kept back again that year, in that class again because I just couldn't catch on. So they put me in what they call the special Ed class and my mama, they told my mama they put me in there. Mama wasn't having it, my son ain't nothing special about my son. But I think it comes from my daddy's side of the family."
    },
    {
      "speaker": "Lawrence",
      "time": "00:14:00",
      "upperBoundTime": "00:16:05",
      "content": ""
    },
    {
      "speaker": "Lawrence",
      "time": "00:14:00",
      "upperBoundTime": "00:16:05",
      "content": "I love my daddy's side of the family, they was good people to me. They raised me and everything and I know they loved me. But my daddy's side of the family we tongue tied. It took me one of my cousins, it took him till he was 10 years old to learn how to tie his shoes, one of my cousins on my ads side."
    },
    {
      "speaker": "Lawrence",
      "time": "00:14:00",
      "upperBoundTime": "00:16:05",
      "content": "I noticed it's in my family, it's in my bloodline. Because at times, I catch on, but if I don't continue, I got to like bury myself with studying. Just for me to remember something really the next day. Because if I don't study it I just ain't going to get it. And when I do get it, if I don't go over it for the next two days or a day or something I just totally forget it."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:05",
      "upperBoundTime": "00:16:15",
      "content": "Oh okay. Did you, we're going to get to Angola and all that in a minute; but did you enroll in GED classes when you came here?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:16:15",
      "upperBoundTime": "00:16:46",
      "content": "I took up a few classes, when they first started with the liturgy program back here. I got off into it and I see progress, I was progressing and I really liked it. But I was I think how I left school? I got locked up. I got into a fight and stole out the kitchen."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:46",
      "upperBoundTime": "00:16:48",
      "content": "As a juvenile?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:16:48",
      "upperBoundTime": "00:17:37",
      "content": "Yeah, I was still young then. You're talking about here? I got into, not GED I got into the liturgy program. After I made my little rounds and when I did get back to population I got back in school again. And I've been in school for a long time, a very long time and you can see where my grades go up then drop, they'll go up and they'll drop, they'll go up and they'll drop."
    },
    {
      "speaker": "Lawrence",
      "time": "00:16:48",
      "upperBoundTime": "00:17:37",
      "content": "Now I'm really starting to realize that. It ain't that I'm not applying myself, I'm applying myself; but I'm starting to realize that I really do have a learning disability."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:37",
      "upperBoundTime": "00:17:59",
      "content": "Yeah, and a learning disability isn't the same thing as intelligence. Some people just have a difficult time learning things. Alright well let's go back to where we were. What about, you mentioned a particular friend earlier, were there any other folks who were really close to you. Any grandparents for example?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:17:59",
      "upperBoundTime": "00:19:10",
      "content": "My daddy's mama. That's, she the only one I remember. I don't remember my mother's mama or her father. I don't remember my father's father, I only remember his mama. Which was another best thing in my life. And I guess by me being that only grandchild from that son, she kind of like took a favorite, she favored me. She favored me, you couldn't never tell her I did anything wrong, you couldn't tell her."
    },
    {
      "speaker": "Lawrence",
      "time": "00:17:59",
      "upperBoundTime": "00:19:10",
      "content": "She passed right when I got arrested for these charges. It probably I ain't going to say I did it, I don't want to have that on my conscience. But I know that if my grandmother was still living, I would have a better support in family cares then I have now."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:10",
      "upperBoundTime": "00:19:22",
      "content": "Yeah, sure. So, school, you're not able to move forward in school and then you drop out. And then what are you doing once you dropped out of school?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:19:22",
      "upperBoundTime": "00:20:03",
      "content": "Me and Jamal, my friend I was telling you about, we started breaking into houses and selling radios and anything we could pretty much steal. Because I wasn't getting no money from my mother or my father. And that's kind of like that's kind of like, that's what I was doing then. Then I got off into the auto theft. Stealing cars and one thing lead to another, I became a drug dealer."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:03",
      "upperBoundTime": "00:20:06",
      "content": "In the Desire Project?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:20:06",
      "upperBoundTime": "00:20:40",
      "content": "In the Desire Project. I was at the age of 13, life just starting for you, and you if you don't have that parent, that big brother to guide you in the right way. You pretty much was going to turn out the way I turned out. That's kind of like my life story starts there."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:40",
      "upperBoundTime": "00:20:47",
      "content": "Well you were describing life in that neighborhood and that's all you see."
    },
    {
      "speaker": "Lawrence",
      "time": "00:20:47",
      "upperBoundTime": "00:20:47",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:47",
      "upperBoundTime": "00:20:56",
      "content": "Yeah. So did you spend any time in any juvenile facilities for these things?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:20:56",
      "upperBoundTime": "00:21:55",
      "content": "I got caught on my first auto-theft charge, I think I was 13. I got caught in a stolen car and I stood in there, I stood in juvy for about a month or 2 months before I went to court. They gave me probation. The juvenile facility, it made me a bigger kid. I ain't going to say more man but a bigger kid and my heart to go do something more dangerous than what I just did."
    },
    {
      "speaker": "Lawrence",
      "time": "00:20:56",
      "upperBoundTime": "00:21:55",
      "content": "And with that being said, I got arrested for 2 guns I had got caught with 2 guns and I stayed in jail for like a year. I sort of did juvenile jail for like a year and a half."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:55",
      "upperBoundTime": "00:21:57",
      "content": "LTI?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:21:57",
      "upperBoundTime": "00:23:47",
      "content": "No I never went to LTI. And they lost me in the system. I never understand that, but they lost me in the system. I used to call my mother and my mother would tell me, she said, \"Man there's something, a subpoena for me to bring you to court and you already in jail.\" I said, \"Ma they must be tripping. Don't worry about it, throw it away.\" And it went on for like a year. I never went to court, I never went to court."
    },
    {
      "speaker": "Lawrence",
      "time": "00:21:57",
      "upperBoundTime": "00:23:47",
      "content": "And I still remember this guy name, Sergeant Dawson. I told Sergeant Dawson, I said, \"Sergeant Dawson, I've been in here over a year and I ain't never been to court yet.\" He said, \"What you in here for?\" I said, \"I got caught with some guns, with 2 guns.\" And he was like, \"Yeah well just get with me after the holidays when the courtrooms open back up and I'll call and see what's going on.\" And they didn't even know I was in jail. So, a year of my life was just gone."
    },
    {
      "speaker": "Lawrence",
      "time": "00:21:57",
      "upperBoundTime": "00:23:47",
      "content": "Now probably if you would've have made that mistake, I probably would've went to court the following month after my arrest, and I probably would've gave me 6 months. And just that 6 months would have turn my whole life around. But you just left me in juvy for like a whole year. And my mama, she doing drugs, so she don't know no better. I really don't even have nobody to turn to, so. And that's kind of like after that year there. I pretty much was on the streets after that."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:47",
      "upperBoundTime": "00:23:50",
      "content": "Okay, alright. Then you've become a father."
    },
    {
      "speaker": "Lawrence",
      "time": "00:23:50",
      "upperBoundTime": "00:23:53",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:53",
      "upperBoundTime": "00:23:55",
      "content": "How was that?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:23:55",
      "upperBoundTime": "00:24:59",
      "content": "It was, it was joy and it was pain at the same time. Because I really knew I wasn't ready for fatherhood. I wasn't ready for it, but after the birth of my son, I kind of like started taking life a little seriously. And I slowed down on a lot of things that I was doing."
    },
    {
      "speaker": "Lawrence",
      "time": "00:23:55",
      "upperBoundTime": "00:24:59",
      "content": "But I can't, I'm going to say this, it was kind of too late. Because I'm kind of like a head, a head of the gang. But after the birth of my son, I started slowing down on a lot of things that I was doing. And when my son was born, his mother, she never needed help to buy baby clothes, milk, pampers. I was there for him."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:59",
      "upperBoundTime": "00:25:02",
      "content": "Sure."
    },
    {
      "speaker": "Lawrence",
      "time": "00:25:02",
      "upperBoundTime": "00:26:06",
      "content": "And then my daughter came, she also had my daughter. My daughter came and not saying I was ready. But I understand now what I got to do to help her with the kids. And because I'm still out running the streets. So, it kind of much, my son just turned 1, my oldest girl she was born in June. My son turned 1 in July and my baby girl when she was born I was incarcerated already on these charges."
    },
    {
      "speaker": "Lawrence",
      "time": "00:25:02",
      "upperBoundTime": "00:26:06",
      "content": "She was born, I got arrested in August, she was born in November. And, right now I thank their mothers, I thank both of my kids mothers for allowing my kids to be in my life while I was incarcerated. They grew up knowing who their father was, father is."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:06",
      "upperBoundTime": "00:26:29",
      "content": "Let me ask you this life's complicated and I can tell there are many things going on in your life when this happened. But if you could point to one causal factor, the main reason that lead to up to this charge, what do you think it would be?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:26:29",
      "upperBoundTime": "00:29:00",
      "content": "I'm going to say, when I got kicked out of school. Because if I never get kicked out of school, I got put out of school I had a fight with one of the teachers. Mr. Murphy, I still remember his name. Alright, I go to juvenile jail for a month. How they used to give the kids the lunch tickets."
    },
    {
      "speaker": "Lawrence",
      "time": "00:26:29",
      "upperBoundTime": "00:29:00",
      "content": "So, at this time our lunch ticket, I was at Carver junior high, we used to get out names of the lunch tickets right. So, I missed my lunch ticket because I was in Juvie jail, so when I go back to school and I ask the teacher Mr. Robinson, I say man I need some lunch tickets. So they'll give you some blank lunch tickets. So now I'm trying to go to the cafeteria to eat. Mr. Murphy at the door, he's checking everybody lunch ticket. And he was like, \"No you can't eat, your name ain't on the lunch ticket.\""
    },
    {
      "speaker": "Lawrence",
      "time": "00:26:29",
      "upperBoundTime": "00:29:00",
      "content": "I'm saying, \"Well Mr. Murphy, Mr. Robinson gave me these because I missed my monthly lunch ticket thing.\" He said, \"Well you ain't eating.\" So he turned me around. So I go tell Mr. Robinson again, I say, \"Mr. Murphy don't want me to eat.\" He said, \"Take this, go down there tell Mr. Murphy I gave you that.\" I said, \"I told him that the first time.\" \"He ain't going to mess with you, go ahead.\" I go down there."
    },
    {
      "speaker": "Lawrence",
      "time": "00:26:29",
      "upperBoundTime": "00:29:00",
      "content": ""
    },
    {
      "speaker": "Lawrence",
      "time": "00:26:29",
      "upperBoundTime": "00:29:00",
      "content": "Mr. Murphy gave me a little shove and told me to go ahead. I said, \"Mr. Murphy don't push on me.\" Would you, come here, and he grabbed me and took me to the principal's office. And I swung on him, he swung back it was a little tussle. So they expelled, after I explained myself to the principal, they expelled me for like a whole year. That year, my auntie is no more, they sent to a school out in Mississippi, I'm like man that's too far. I could just go ahead on and skip this year and make up next year in Mr. Robinson class. How they do the overage class. I said I'll make up, but that year that I got kicked out of school I think was the cause of me."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:00",
      "upperBoundTime": "00:29:03",
      "content": "The beginning of the spiral."
    },
    {
      "speaker": "Lawrence",
      "time": "00:29:03",
      "upperBoundTime": "00:29:12",
      "content": "Yeah. If I never got kicked out of school I think I wouldn't be here. It wouldn't have never lead to drug dealing."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:12",
      "upperBoundTime": "00:29:17",
      "content": "Sure. Were drugs and alcohol part of your own lifestyle?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:29:17",
      "upperBoundTime": "00:30:08",
      "content": "Well, I sold drugs. I didn't do alcohol. And, now that I think about it, as I became a more responsible man, a more responsible father figure. Doing drugs, I watched how it tore my mom up, and I was tearing other people up the same way. And I feel not that it hit home, it really, I don't know. It kind of messed me up a little bit. I can't really explain my feelings, but I just don't like it. I just don't like it."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:08",
      "upperBoundTime": "00:30:13",
      "content": "I get it."
    },
    {
      "speaker": "Lawrence",
      "time": "00:30:13",
      "upperBoundTime": "00:30:20",
      "content": "But drugs, I sold drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:20",
      "upperBoundTime": "00:30:24",
      "content": "But it wasn't part of your own life?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:30:24",
      "upperBoundTime": "00:30:45",
      "content": "No, I never did drugs. I never did alcohol, it's not I got probably drunk one time in my whole life. When I was out there and I used to go to the clubs a lot and most of the time if you see me with a cup with some color water in it that's all it is was cool aid. I had me a little straw and I'd be sipping out of it, just trying to blend in."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:45",
      "upperBoundTime": "00:30:57",
      "content": "Sure. Before we started you told me that Manuel Nelson was your co-defendant in this. Now, what was your relationship like, were you guys tight?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:30:57",
      "upperBoundTime": "00:32:04",
      "content": "Me and Manuel, he's from it's real crazy because I'm from out the Desire Project and Manuel from out the Florida Project. And I really don't can't really say, but we became good friends because I moved out the Desire into the Florida project with one of my cousins. And Manuel used to play football and stuff in the court way."
    },
    {
      "speaker": "Lawrence",
      "time": "00:30:57",
      "upperBoundTime": "00:32:04",
      "content": "And it was always competition with another project and this project, so it was competition and I kind of like battled always like battling with Manuel. Because he was a good competitor and he'd bring out the best in you. And we kind of like got close like that. And we just took off from there. We hung out together, he's a good friend of mine."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:04",
      "upperBoundTime": "00:32:29",
      "content": "Yeah, that's good. So let me ask you this, let's say this particular incident didn't happen and you didn't get arrested, nothing. There was nothing like that. How do you think the rest of your what would've happened in the next few months and years of your life? I know it's hard to say for sure but how do you imagine it would've been?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:32:29",
      "upperBoundTime": "00:33:57",
      "content": "I pretty much I would've been, I probably wouldn't be a grandpa right now, because I got grandkids. Most definitely my 2 girls, well my youngest daughter, she had 3 kids. That wouldn't have happened, I would've kept better eyes on here. Because like I said, after my son was born, I stopped a lot of activities that I was doing."
    },
    {
      "speaker": "Lawrence",
      "time": "00:32:29",
      "upperBoundTime": "00:33:57",
      "content": "But if I was still there, and I know I probably would've left that life alone. Because I loved my kids and after the birth of my son. I was falling on the path of being that, I want to be here for him, because my daddy wasn't here for me. I don't want him to go through the same thing. But after my girls were born, I was like, oh I got to straighten all the way up now. But I think my life would've been much better than I had. I think I'd have a nice life."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:57",
      "upperBoundTime": "00:34:09",
      "content": "Okay. So let's switch gears a little bit. So I imagine you spent a little bit of time in the parish going through the whole trial and everything else. How old were you when you came to Angola?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:34:09",
      "upperBoundTime": "00:34:16",
      "content": "I was 19 when I came to Angola. I was 19."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:16",
      "upperBoundTime": "00:34:19",
      "content": "Okay, do you remember the bus ride?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:34:19",
      "upperBoundTime": "00:35:44",
      "content": "Yeah, it's after staying in the parish. After staying in the parish about a year, I think that I stood in the parish for almost a year. I did a lot of fighting. I made a little name for myself during that time. And I left the juvenile side in the parish and went to the adult side. And I asked for that. I don't want to be on the juvenile side in the parish no more, put me on the adult side. Because I knew I was coming this way."
    },
    {
      "speaker": "Lawrence",
      "time": "00:34:19",
      "upperBoundTime": "00:35:44",
      "content": "So I kind of like wanted to prepare myself for when I got up here. And I used to talk to a lot of the old guys that was up there. They've been up here before. And they kind of like gave me a little bit. And on the bus ride, you right I'm thinking about it. I'm coming here as a young man, I'm going to leave as a young man. So I got to just prepare myself for everything, for whatever. The bus ride I was kind of shaky, I was pretty much shaky a little bit. But I was ready."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:44",
      "upperBoundTime": "00:35:46",
      "content": "What were your first few months like here?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:35:46",
      "upperBoundTime": "00:36:27",
      "content": "My first few months here they were it wasn't horrifying, it wasn't that scary. But I stayed on guard, I stayed on guard. And the first thing that was in my mind was that I need to make a statement, I need to make a stand whenever it come. And a few guys they test me, I was put to the test."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:27",
      "upperBoundTime": "00:36:29",
      "content": "What did they do?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:36:29",
      "upperBoundTime": "00:37:46",
      "content": "Like for instance they had one guy when I was in the cells. One guy he came up to me, he wasn't talking aggressively, and he was talking kind of like a pimp on some sweet talk and stuff. So I asked him I'm kind of cocky I'm not scared or nothing like that. I said, \"Man what you gay or something, why are you talking like that.\" Man why you, then his whole attitude change. \"Why are you acting yourself? You don't know me to be that.\" \"That's how you should've came talking to me at first. What's up youngers how you doing,\" I didn't like that."
    },
    {
      "speaker": "Lawrence",
      "time": "00:36:29",
      "upperBoundTime": "00:37:46",
      "content": "I was one, like I said when I come here, I was on guard for whatever. I used to pay attention to a lot of things and I know, like they told me in the parish. Man they'll touch you quickly, so you just got to be ready for whatever. In my mind, I came here as a young man, I'm going to leave as a young man or a greater man or a bigger man."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:46",
      "upperBoundTime": "00:37:56",
      "content": "Sure. So can you describe that 19 year old person? Your 19 year old self?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:37:56",
      "upperBoundTime": "00:39:18",
      "content": "Man, real arrogant, arrogant, athletic, pretty much say what I want out my mouth. But respectful, I respected. I give respect first, and I respect everybody however you live your life here, I respect it. Who you is, I respect it. I give respect first, and that's how I kind of like was brought up. By my mother as well. Respect all adults."
    },
    {
      "speaker": "Lawrence",
      "time": "00:37:56",
      "upperBoundTime": "00:39:18",
      "content": "She always did told me give respect first and same respect back, accept that same respect back. And that's pretty much know how I live my life. I give respect to everybody. And how I want you to, how I treat you is how I want to be treated. And that's pretty much what's, how I was. I gave off that respect, and a lot of people gave that same respect back."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:18",
      "upperBoundTime": "00:39:25",
      "content": "So how are you different how? We're all different after 2 decades. In what ways have you changed?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:39:25",
      "upperBoundTime": "00:39:50",
      "content": "Quick to fight, sports I used to about sports a lot. At times I could be wrong because your opinion ain't the same as my opinion. And man that kid, man, I'm just glad I got past that kid."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:50",
      "upperBoundTime": "00:39:56",
      "content": "Yeah. What organizations have you been a part of here at Angola, what kinds of things have you done?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:39:56",
      "upperBoundTime": "00:41:02",
      "content": "Oh man, I did the drama club. I thank god I liked the drama club, I did substance abuse. We had a church group, they had a church group at camp C. CBF, Christian Brother's fellowship, I really enjoyed those guys. Pastor Watts and Charles Manuel."
    },
    {
      "speaker": "Lawrence",
      "time": "00:39:56",
      "upperBoundTime": "00:41:02",
      "content": "I did my substance abuse, or let me say I enjoyed substance abuse class because I took that. And I never was a drug addict like I said but I used to I started smoking cigarettes and I took that same concept from substance abuse and applied it with my cigarettes habit and I've been smoke free now for at least 8 years, and I feel real good about it because I think I added a few more years onto my life. But I don't know."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:02",
      "upperBoundTime": "00:41:07",
      "content": "So when you first got here did they put you in the field?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:41:07",
      "upperBoundTime": "00:42:15",
      "content": "Yeah I was a field worker, I stayed in the field for a few years and I got good work ethics. And that's how I know my life would be a lot better if I was still on the streets because I never had a job on the streets. But the work that I do now, and I'm a good worker, I did housekeeping up here. I worked at the bachelor quarters, I worked in the kitchen."
    },
    {
      "speaker": "Lawrence",
      "time": "00:41:07",
      "upperBoundTime": "00:42:15",
      "content": "I can cook a little, I got culinary skills. Now my new job is up front at the new administration building. And just being able to socialize with free world people kind of like, it prepares you for that time, whenever you get released, if you get released. You'll be able to communicate, stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:15",
      "upperBoundTime": "00:42:17",
      "content": "Sure. Are you talking about the building where all the records are?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:42:17",
      "upperBoundTime": "00:42:20",
      "content": "Right, that's where I'm working right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:20",
      "upperBoundTime": "00:42:22",
      "content": "Are you going to be there tomorrow?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:42:22",
      "upperBoundTime": "00:42:23",
      "content": "Yeah I'll be there."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:23",
      "upperBoundTime": "00:42:26",
      "content": "I'll be there too."
    },
    {
      "speaker": "Lawrence",
      "time": "00:42:26",
      "upperBoundTime": "00:42:28",
      "content": "I'll see you then."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:28",
      "upperBoundTime": "00:42:51",
      "content": "So let me ask you a couple of difficult things, okay. So, it's been over 20 years and you've been reminded as to why you're in Angola on a daily basis, how do you feel about the victims now? And the victims' families."
    },
    {
      "speaker": "Lawrence",
      "time": "00:42:51",
      "upperBoundTime": "00:43:37",
      "content": "How can I explain it? I mourn for them, I hurt for them, and I'm sorry for them. Because being myself I lost loved ones, and I know the hurt that it brought towards me when I was out there. And losing somebody close my cousins and stuff like that. But I'm sorry. All I got to say is I'm sorry, and I feel their pain, because I went through the same thing. And that's about all I can say to them."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:37",
      "upperBoundTime": "00:43:53",
      "content": "Sure. I understand. The other family of course that gets impacted when this happens is yours. So tell me about the effect of you getting a life sentence. What effect did that have on your family and loved ones?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:43:53",
      "upperBoundTime": "00:46:22",
      "content": "I know them, it kind of like my youngest daughter, it kind of like damaged her a lot. Because her mama could've kept better eyes on her. And she knew that daddy would've kept a closer eye on her than mama because the girls more drawn to the fathers than they is to they mothers."
    },
    {
      "speaker": "Lawrence",
      "time": "00:43:53",
      "upperBoundTime": "00:46:22",
      "content": "And my oldest girl, I think I know it damaged her a lot too, because sometimes she feel like, dad you wasn't here. I'm sorry, she don't really open up to me like my youngest daughter do. And now my son, that's my little man, he like whatever dad and I love you, I miss you every day. Stuff like that."
    },
    {
      "speaker": "Lawrence",
      "time": "00:43:53",
      "upperBoundTime": "00:46:22",
      "content": "But it hurt my family too. And I think I really put a hole in my mother's heart. I think I kind of like damaged my mama a lot because me and my mama we was close. Even though she lived in her little life the way she lived it. But I was her baby. And she mourned a lot. And I could be the cause of her in and out stages in her life."
    },
    {
      "speaker": "Lawrence",
      "time": "00:43:53",
      "upperBoundTime": "00:46:22",
      "content": "Because I feel like she needed me there at times, when she hurt and needed that hug from her man. Don't worry your son got you."
    },
    {
      "speaker": "Lawrence",
      "time": "00:43:53",
      "upperBoundTime": "00:46:22",
      "content": "And I now that damaged my sister too, the same way. When she needed that love from her man, don't worry about it. The man, your brother got you and stuff like that. Yeah, it damaged, it hurt my family a lot too."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:22",
      "upperBoundTime": "00:46:31",
      "content": "Sure. So let me ask you this, do you think you'll get out of here?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:46:31",
      "upperBoundTime": "00:48:16",
      "content": "Yes, I really do believe that this not the end of my, this not the end of my life end. This not where it ends for me. I think God got a bigger purpose for me. I'm a good guy, I'm good at heart. And I know my faith might not be where it's supposed to be at because when I lost my mama, I lost my daddy, I kind of like stepped back a little from God, and I shouldn't have did it. But I only stepped back, the step that I took back made me see clearer. Because if you stay up on something so long it's going to get blurry to you."
    },
    {
      "speaker": "Lawrence",
      "time": "00:46:31",
      "upperBoundTime": "00:48:16",
      "content": "But when I thought I was taking a step back, God only pushed me back just for me to see a clearer light. And my faith right now, I'm getting back to where I'm supposed to be with him. I got hope, I got faith. And no I don't believe that this going to be the end of my life here. And I think its coming. My time's coming because I see it. Gods opened up a lot of gates for what's going on now. And one day I'm going to be home."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:16",
      "upperBoundTime": "00:48:39",
      "content": "Okay. So let's say after a few years you put your paperwork in and go before the pardon board. What you'll have a short period of time to tell them who you are. What would you want them to know about you? They often say, well why should we give you a second chance?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:48:39",
      "upperBoundTime": "00:50:06",
      "content": "I'd like for the parole board to understand that. Coming from a child to a boy, to that teenage, to that man and the man I become now. The man that I became now, I love this man. This man here appreciates life. I understand life better than what I did 20 something years ago. So I value life. So with that being said, I just want to live a good life."
    },
    {
      "speaker": "Lawrence",
      "time": "00:48:39",
      "upperBoundTime": "00:50:06",
      "content": "I don't have that much time left here on earth. And I got grandkids I want to see grow. I want to see my girls do better. I want to see my son with his son. In order for me to see this, I got to be, I got to continue on being a responsible man that I became. I got to continue on being that daughter's dad, me and my daughters got a beautiful relationship and I cherish that. And I know they don't want to see me back this way no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:06",
      "upperBoundTime": "00:50:21",
      "content": "Sure. Throughout this whole experience, there have probably been ups and downs like anything in life, but what's been the worst part of this experience for you?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:50:21",
      "upperBoundTime": "00:50:24",
      "content": "Oh man."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:24",
      "upperBoundTime": "00:50:26",
      "content": "Of life without parole at Angola."
    },
    {
      "speaker": "Lawrence",
      "time": "00:50:26",
      "upperBoundTime": "00:51:38",
      "content": "Learning, I'm going to say learning myself has been an up and down experience for me. Because there's so much that I deal with now; but I just got to continue to understand that, it's life in prison. And you going to go through these ups and downs. But what makes you stronger is how you come out of a situation. It makes you more stronger. Because it could've been, I could be setting myself backwards for some crazy stuff."
    },
    {
      "speaker": "Lawrence",
      "time": "00:50:26",
      "upperBoundTime": "00:51:38",
      "content": "But I think just being patient with everything now. Because at one time I didn't have no patience, and that's really, having patience and just paying attention. Paying attention to what you go through and learn from it, that's the biggest thing, learn from the mistakes you made."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:38",
      "upperBoundTime": "00:51:46",
      "content": "Of all the things you've accomplished, what are you most proud of?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:51:46",
      "upperBoundTime": "00:52:30",
      "content": "Oh man, I'm really proud of me stop smoking these cigarettes. Because, man cigarettes I'm really proud that I got through that. But my learning experience, I'm proud of how I adapt to situations. Just stepping back and having a clear eye to see, you ain't only got to go in through this door, they got a side door you can go through too. Just sitting back, I'm just glad that I have patience now, and a better understanding of life. I'm just thankful for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:30",
      "upperBoundTime": "00:52:31",
      "content": "Sure."
    },
    {
      "speaker": "Lawrence",
      "time": "00:52:31",
      "upperBoundTime": "00:52:57",
      "content": "Because you got some guys whose understanding is real, real low. And they don't want growth with time. A lot of them stuck in time, so they want to continue to be that way forever. Me I don't, I want to continue to grow with life."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:57",
      "upperBoundTime": "00:53:07",
      "content": "Sure. So I've really enjoyed learning about you but is there something that we should've talked about that I didn't ask you about?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:53:07",
      "upperBoundTime": "00:53:10",
      "content": "I think we pretty much covered everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:10",
      "upperBoundTime": "00:53:13",
      "content": "Yeah, sure."
    },
    {
      "speaker": "Lawrence",
      "time": "00:53:13",
      "upperBoundTime": "00:53:39",
      "content": "I'm not a talkative guy. I don't talk much. I pretty much sit back and just listen to everybody talk, my opinions I pass them. And I'm a good guy to get along with, I'm real fun. I make people laugh and stuff like that when I do open my mouth. Kind of like a comedian or something."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:39",
      "upperBoundTime": "00:53:46",
      "content": "Okay, all right. Well that's good, why don't we end there?"
    },
    {
      "speaker": "Lawrence",
      "time": "00:53:46",
      "content": "All right, thank you."
    }
  ]
}
