{"name":"","transcript":[{"content":"Lawson Strickland Transcription REDACTIONS FINAL"},{"speaker":"Lawson","time":"00:00:00-0","content":"My name is Lawson Strickland. I was originally convicted of first degree murder and armed robbery and I'm on my 24th year of incarceration"},{"speaker":"Marcus","time":"00:00:08-7","content":"How old were you when you were arrested?"},{"speaker":"Lawson","time":"00:00:11-5","content":"I was 22. I was 22 years old."},{"speaker":"Marcus","time":"00:00:13-9","content":"Okay. I wanted to ask you some questions about your childhood coming up and then also more pointedly about the kinds of changes you've made in your life and in the last 22 years 24 years at Angola. Can you tell me a little bit about your family and the people who raised you?"},{"speaker":"Lawson","time":"00:00:40-8","content":"Right so I was raised in Virginia my mother- I didn't know my father. My father left I think I was maybe just a little over 1 my mother and father divorced and she remarried that's the father that was around till maybe I was 6 5 6. And then my mother ended up remarrying when I was 12."},{"speaker":"Lawson","time":"00:00:40-8","content":"And that individual remained the father figure but I grew up in a fairly decent family I went to mostly private schools spent a lot of time overseas. I didn't there was no real drug issues no drug problems no abuse problems. I had a fairly typical childhood not bad. I grew up near the beach near the ocean."},{"speaker":"Marcus","time":"00:01:28-2","content":"Where in Virginia?"},{"speaker":"Lawson","time":"00:01:29-0","content":"Virginia Beach yeah."},{"speaker":"Marcus","time":"00:01:35-9","content":"So the men that came into your life through your mother there was always a good relationship between you and everything."},{"speaker":"Lawson","time":"00:01:45-1","content":"Yeah I can say that as much as I remember. I don't really of course I didn't know my father and then my stepfather the first one the first stepfather. I was probably so young I don't quite its you're a kid now the man that my mom eventually married and who's to this day he was a positive influence he and I."},{"speaker":"Lawson","time":"00:01:45-1","content":"I don't think we ever had a real father son bond because by the time that he came around those issues had developed where this is just another guy but as an individual he's a really good guy he was a responsible guy he was a really good guy and we never really had any problems between us."},{"speaker":"Marcus","time":"00:02:26-8","content":"Did you have siblings?"},{"speaker":"Lawson","time":"00:02:28-2","content":"No. well I do have a half-sister but I never knew her because that came from my actual biological father went off and he had a daughter so I've never actually met her but I know she exists"},{"speaker":"Marcus","time":"00:02:38-6","content":"So you more or less grew up as an only child. And I think you said this but it's accurate to say that you grew up in a household where you felt you were cared for nurtured"},{"speaker":"Lawson","time":"00:02:52-1","content":"Well I grew up in a German household so I don't know how much nurturing was going on. I did go to private school. I went away to a private boarding school for a number of years so I grew up on my own. I grew up at a young age"},{"speaker":"Marcus","time":"00:02:52-1","content":"What was your age when you were going to boarding school?"},{"speaker":"Lawson","time":"00:03:07-3","content":"I started in 8th grade so that would've put me somewhere around 14 13 14. I went for 2 or 3 years I went to private boarding schools military schools not restrictive punishment military schools but just good private schools my family tried to keep me in private schools."},{"speaker":"Marcus","time":"00:03:25-3","content":"And then where did you graduate from"},{"speaker":"Lawson","time":"00:03:27-3","content":"I did not graduate. My senior year I missed too many days of school. I was that was on me I was going to the beach and I missed too many days of school so my senior year they said well look you gotta make these days up and I ended up not making them up I ended up just taking a job for that and I was gonna go back and repeat that senior year but then I ended up joining the military. I joined the military at 17 it was a recruiter that said hey man if you want to go right now you can go so I ended up just joining the military at 17."},{"speaker":"Marcus","time":"00:03:56-7","content":"With which branch."},{"speaker":"Lawson","time":"00:03:58-0","content":"US army."},{"speaker":"Marcus","time":"00:04:00-5","content":"And how long were you there?"},{"speaker":"Lawson","time":"00:04:03-0","content":"I was in the military for 5 years I got out of in 1992 I did almost my whole tour in Europe."},{"speaker":"Marcus","time":"00:04:09-3","content":"Ok and then where did you return to back in the states."},{"speaker":"Lawson","time":"00:04:12-1","content":"Fort Polk that's how I ended up in Louisiana. I came back to Fort Polk it was the end of the cold war they were closing down all the bases the gulf war had just ended and I had to come back to the United States and they sent me to Fort Polk and that's how I came to Louisiana."},{"speaker":"Marcus","time":"00:04:25-7","content":"So you have no family ties in Louisiana."},{"speaker":"Lawson","time":"00:04:27-9","content":"No."},{"speaker":"Marcus","time":"00:04:34-8","content":"Were drugs and alcohol part of your life?"},{"speaker":"Lawson","time":"00:04:37-3","content":"Never I drank socially I drank like any other 18 year old go to clubs but I didn't have a drinking problem and drugs I never had a drug problem."},{"speaker":"Marcus","time":"00:04:47-6","content":"Ok yeah and you were never kicked out of school."},{"speaker":"Lawson","time":"00:04:52-4","content":"No well I mean I was I wasn't kicked out of school my senior year because of disciplinary issues. I was kicked out just because I was tardy that was just on me"},{"speaker":"Marcus","time":"00:05:01-1","content":"Right what about girls in your life can you tell me a little bit about?"},{"speaker":"Lawson","time":"00:05:06-7","content":"I had girlfriends. I got married. I left when I was I was. I was probably like most 18 17 year 18 year old boys especially when I joined the military and went to Europe. I had a lot of meeting girls in bars but I ended up settling down by the time I was 20 and got married."},{"speaker":"Marcus","time":"00:05:24-6","content":"And you married a German girl?"},{"speaker":"Lawson","time":"00:05:26-1","content":"Married a German girl just like my mother."},{"speaker":"Marcus","time":"00:05:29-2","content":"And children?"},{"speaker":"Lawson","time":"00:05:29-9","content":"I got one daughter."},{"speaker":"Marcus","time":"00:05:30-9","content":"Can you tell me about her?"},{"speaker":"Lawson","time":"00:05:32-8","content":"I didn't know- my daughter's name is Nicole. I didn't know her last time I saw my daughter physically she was 6 months old and I was putting her on an airport at Dallas fort worth and that's the last time I ever saw her. My wife went back to Germany we had a home we had a home in Germany that was given to us as a wedding present I was going to return to Germany when I finished my time in fort Polk."},{"speaker":"Lawson","time":"00:05:32-8","content":"I only had six months in fort Polk and I was to return to Germany and we were going to live in Europe I wasn't going to come back to the states so once all of the issues surrounding my incarceration arose and I was actually sentenced and I was going to remain here my wife and I amicably divorced and she went on with her life she went on and she remarried someone else raised my daughter so I didn't have a relationship with my daughter."},{"speaker":"Lawson","time":"00:05:32-8","content":"I didn't really meet my daughter I used to write letters to my daughter and tried to make contact but I never forced the issue. I never did that and when my daughter got older its only actually this year that my daughter and I have actually begun to communicate. Just this year less than a year and she's 24 now 25."},{"speaker":"Marcus","time":"00:06:41-8","content":"And she's in Germany."},{"speaker":"Lawson","time":"00:06:42-9","content":"Yes she's in Germany and she really one of the driving reasons that she contacted me is that she just had her first kid so that made me a grandfather I guess that made her want to contact me."},{"speaker":"Marcus","time":"00:07:00-6","content":"Does anybody visit you here?"},{"speaker":"Lawson","time":"00:07:02-2","content":"I don't get visits. Maybe once every ten years."},{"speaker":"Marcus","time":"00:07:06-7","content":"Is your mum still alive?"},{"speaker":"Lawson","time":"00:07:08-0","content":"My mom is alive."},{"speaker":"Marcus","time":"00:07:10-8","content":"And I assume you're in communication with her."},{"speaker":"Lawson","time":"00:07:13-1","content":"I talk to her we talk regularly."},{"speaker":"Marcus","time":"00:07:20-3","content":"Tell me about the first time you got arrested."},{"speaker":"Lawson","time":"00:07:22-7","content":"First time I was arrested. I was arrested as a juvenile for shoplifting it was a shoplifting charge and I was 16. I don't know I was probably 17. I think it was me and it was me and 2 other guys I was in high school with it was in the summer time and I think we shoplifted some tapes from Walmart. And they ended up giving me community service I did like 40 hours of community service they didn't treat it as a real horrific thing and I did 40 hours of community service at a local park and then that was it."},{"speaker":"Marcus","time":"00:07:58-4","content":"And then you joined the military. And then out of the military when is the next time you get arrested?"},{"speaker":"Lawson","time":"00:08:02-3","content":"I was arrested actually the day after I was honorably discharged from the military as I was preparing to leave Louisiana to go back to Germany. I was arrested that day I was arrested and brought in for questioning behind my roommate in the military behind a series of burglaries and thefts that had been going on off post. They had arrested him because they found his vehicle at a crime scene a burglary and they arrested me and they brought me in and initially they charged both of us and another guy."},{"speaker":"Lawson","time":"00:08:02-3","content":"There was a third guy from fort Polk another soldier and they charged him as well and they charged all three of us but I think the real intention was they charged me and held me because they wanted me to give statements on my roommate which I didn't do. I just wanted to leave I just I was planning on leaving Louisiana that day. I had plane tickets to leave Louisiana that day so I had just been honorably discharged the day before that's all I wanted to do was leave the state and go back home."},{"speaker":"Marcus","time":"00:09:06-4","content":"Did you end up having to serve time on that one?"},{"speaker":"Lawson","time":"00:09:08-8","content":"I did not. As but I was in the parish jail for 4 months and like I said I just wanted to leave so I escaped from the parish jail my intent was just to go back. I figured what if you're going to come get me all the way in Germany to bring me back for this that's what you're going to have to do because I'm going back."},{"speaker":"Lawson","time":"00:09:08-8","content":"Now obviously this isn't the most rational thinking because how am I going to get back to Europe so it raises all kind of questions but at the time I was like man I'm not staying here. I'm gone. I'm outta here and as a result of that I was re-arrested a week later and charged with an armed robbery and a murder that occurred at a bank so the initial charges for why I was arrested were just done away with because now I was facing some very serious time."},{"speaker":"Marcus","time":"00:10:04-3","content":"Yeah and you're arrested kind of reality."},{"speaker":"Lawson","time":"00:10:12-6","content":"Oh yeah right."},{"speaker":"Marcus","time":"00:10:15-6","content":"And. So can you describe to me the young Lawson the 22 year old who is certainly looking at a life sentence without the possibility of parole?"},{"speaker":"Lawson","time":"00:10:30-7","content":"Well initially I didn't I was angry when I got here you talking about when I got here? When I got here I was extremely angry. I was angry when it happened. I was angry at how it had happened I felt a lot of things were unjustified and I carried a lot of that anger. I didn't the anger that I had I didn't it wasn't the sort of anger where I came to the penitentiary and was a negative inmate I didn't have a lot of disciplinary problems I didn't come here and that anger caused me to do a lot of disciplinary things it was."},{"speaker":"Lawson","time":"00:10:30-7","content":"I would almost say it was constructive anger because it caused me to do a lot of things almost to help myself I started writing a lot I started writing a whole lot I started trying to contact people outside of the prison and I did get into a lot of conflicts with the administration because I was always saying this is unjust I mean any little thing if they didn't have the food right this is unjust this is wrong and I would file on it so I was a thorn in their side for doing that and I initially filed a lawsuit for my first amendment rights with the old warden that used to be here so those sort of things I was doing all of that."},{"speaker":"Marcus","time":"00:11:49-6","content":"And you're doing that from death row?"},{"speaker":"Lawson","time":"00:11:51-3","content":"I was doing that- I actually when I first came up here I started a newsletter I started a newsletter that I published out of my cell it was called pariah that's what I named it and we started publish we used to have typewriters back then and I started doing the old cut and paste and everything and I started a newsletter talking about the criminal justice thing talking about the death penalty and I wanted to like really turn it into something."},{"speaker":"Lawson","time":"00:11:51-3","content":"I wanted it to be like really something so I was writing all these professors and I was writing all these people at LSU and I was trying to get them to contribute to this unknown prison thing. I was doing all that kind of stuff and I was just really creating more of a ruckus for the people up here than really they probably weren't used to that they probably would've been happier if I had just been acting crazy they probably would've been a lot happier with that. So I went through that phase for a lot of years."},{"speaker":"Marcus","time":"00:12:44-8","content":"So how many years did you stay on death row?"},{"speaker":"Lawson","time":"00:12:47-6","content":"I stayed on death row 7 years I got off in 2000."},{"speaker":"Marcus","time":"00:12:53-9","content":"Can you tell me about escaping from death row?"},{"speaker":"Lawson","time":"00:12:56-2","content":"In 1999 like I said I had a bit of an issue I don't have it so much anymore but I had a bit of an issue staying places where I felt like I wasn't supposed to be so in 1999 there was it was an opportunity to escape. And I felt like I'm going to not pass this opportunity up. I felt like a lot of people may not believe this but when I escaped in 1999."},{"speaker":"Lawson","time":"00:12:56-2","content":"I escaped with 3 other death row inmates. Now these are death row inmates now. I'm a death row inmate too but everybody thinks they're a different person and I of course felt like I was a different sort of death row inmate than these other death row inmates and I felt like I was the sort of death row inmate who didn't really want to cause any harm."},{"speaker":"Lawson","time":"00:12:56-2","content":"I just didn't want to be here anymore so I had to be extremely careful about who these other death row inmates were because these are death row inmates but it was me and 3 other death row inmates and we managed to escape over the year we plotted and did our little thing and we managed to escape we escaped November 7th 1999 which was 7 years to the day that I was arrested 7 year I did it 7 years to the day."},{"speaker":"Lawson","time":"00:12:56-2","content":"I was arrested and we cut our doors off ourselves and over a period of a week had cut the window out on the tier and we went out our doors at night during the when they were making rounds hitting the clocks on each tier and we went out the window and we went and climbed up on the fire escape and got up on top of the second story building and went across the roof of the building onto the administrative side of the compound so that when we came off the building with a rope we would be outside of the security fences and then we ran for the Mississippi river."},{"speaker":"Lawson","time":"00:12:56-2","content":"And they chased us we were supposed to have like a 9 hour head start and it ended up one of the doors that was on one of the cells there was a problem with it and it couldn't set right so the next time a security officer made a round on the tier he noticed that that door was wrong."},{"speaker":"Lawson","time":"00:12:56-2","content":"And that's what alerted them so instead of having 9 hours we had 30 minutes which wasn't enough. So the alert went out and they chased us around and they caught me trying to swim getting ready to swim in the Mississippi river and then it was just shortly after that shortly after that that immediately my death penalty was overturned which is the irony because you would think that any district attorney who has a death row inmate that they're saying needs to be executed because this is a horrible human being that."},{"speaker":"Lawson","time":"00:12:56-2","content":"We can no longer allow in society would have jumped on the fact that this inmate just tried to escape off death row but almost I think within 5 months my death penalty was overturned the district attorney overturned it. I didn't take a deal the deal was forced on me. I actually tried to keep my death penalty I tried to hold onto the death penalty I didn't want the life sentence I wanted the death sentence."},{"speaker":"Marcus","time":"00:15:55-3","content":"For what reason."},{"speaker":"Lawson","time":"00:15:55-8","content":"Well when you have the death penalty you have attorneys guaranteed legal representation you have guaranteed investigation every one of your appeals is going to be viewed by a court because of the seriousness of the sentence once the sentence is carried out there can be no oops we were wrong we got to make amends. You can't. The guys dead."},{"speaker":"Lawson","time":"00:15:55-8","content":"So the good thing about having the death penalty if there is a good thing about having it is that if you have any sort of issues or anything in your case you have the best chance of anyone of getting some sort of help of getting help. But when you have a life sentence you're just up here with a life sentence it doesn't matter what happens you're almost essentially by yourself unless you have private money."},{"speaker":"Marcus","time":"00:16:39-8","content":"I understand that. One of the reasons that we wanted to talk with you is that you're considered a trusted rehabilitated member of the community. Can you tell me how you're different from the person who wasn't?"},{"speaker":"Lawson","time":"00:17:02-2","content":"Well I mean there's no doubt that when I was younger there was issues I had issues because I wouldn't have been caught up in all the minor things or the smaller things that led to thing. I mean people don't end up in the situation that I'm in because they were living the perfect life so obviously I had issues the main thing I think with me now is that I've just gotten older."},{"speaker":"Lawson","time":"00:17:02-2","content":"I'm just older now. I'm almost 50 now I'm not 22 anymore I'm not 23 so I've had all of these years to mature out so I'm not as impulsive. I don't feel that maybe just because I'm right about something it gives me carte blanche to do whatever I feel is the solution to being right because sometimes even if you're right you can make your situation worse by just going off and being like well I'm right I don't have to worry about this"},{"speaker":"Lawson","time":"00:17:02-2","content":"I'm going to go do the right thing and that's one of the major issues is that by aging out by getting a little bit older by calming down you and then you spend years you spend years in the joint you spend years in here and you make a decision about what kind of life you want to live. How do you want to live how do you want to live even here in the prison."},{"speaker":"Lawson","time":"00:17:02-2","content":"Even in this environment there's multiple different ways you could live. You could spend your whole life living bad in prison doing bad you could spend your whole life on lockdown or you could say well what it's not the best it's not the best of circumstances but I can still do something for myself. I can still try to be somebody I can still try to accomplish something and all of this is still the developmental process whether you're on the street or whether you're in prison it's the same thing you're just doing it under different circumstances."},{"speaker":"Marcus","time":"00:18:47-0","content":"Yeah what kinds of organizations are you part of what kind of vocational training do you have what have you how would you summarize the opportunities that you may have taken advantage of at Angola."},{"speaker":"Lawson","time":"00:19:00-3","content":"Well the problem that I had was that after my escape this was such a huge thing because I had at that time I was a death row inmate that I was placed after my death penalty was overturned I was placed in what was called CCR. I did 23 years in solitary confinement I've only been out of the cell less than a year I did 23 years lockdown in solitary."},{"speaker":"Lawson","time":"00:19:00-3","content":"I did them all in solitary. So everything that I did I did with me for myself. I couldn't go to school I couldn't go to Votech I couldn't do anything that I strove for anything that I fought for was because I felt like I had to do this for me. Its only recently in the last year that they've that initially essentially what happened was is that the administration was here in the time when I was younger who knew me in that capacity they've left."},{"speaker":"Lawson","time":"00:19:00-3","content":"And the security officers that were tier sergeants and lieutenants who worked at a unit level who knew me as a person. They have now all become assistant wardens so it was those individuals who knew me as a person having the authority now that they were the ones that finally got me out of that cell because for years I was trying to get out of the cell and I could never get out of the cell. I would go for decades without a security report."},{"speaker":"Lawson","time":"00:19:00-3","content":"I go for decades without giving any disciplinary violations or anything but I just couldn't get out of the cell because there was the concept that we have to not like this individual just as a we're supposed to do this. But it was when these other individuals who knew me."},{"speaker":"Marcus","time":"00:20:37-2","content":"What is the punishment for escaping?"},{"speaker":"Lawson","time":"00:20:40-2","content":"Lockdown. Cell confinement. And then my punishment I felt like was more severe because they've had other guys escape that didn't do all that time but I think that my greatest sin and this is in hubris but I think my greatest sin was that they were scared that I was maybe a little bit too smart to let back out because they figure like well we didn't catch him last time he caught himself because of that one door we might not get him again the next time."},{"speaker":"Lawson","time":"00:20:40-2","content":"Because we're not going to know he's gone till he's gone. So that was their concern that's not something that I was doing or putting out there. I wasn't doing anything I said yeah 1999 I did what I did you caught me I'm not a problem I don't mess with your security. I'm not a disciplinary problem and I've just gone and done the time you've given me to do and I've tried to make the best of it so there was just that constant concern we're not going to let him out we're not going to let him out we're not going to let him out and it wasn't."},{"speaker":"Lawson","time":"00:20:40-2","content":"Like I said it wasn't until those people that had done all these years around me became administratively strong enough that they were the ones that said alright we can get you out now. We can get you out of the cell. So since I came out of the cell I became a tutor I run the camp C library they're trying to make me a social mentor so that I can teach thinking for a change and all of those sort of programs."},{"speaker":"Marcus","time":"00:22:03-6","content":"So you've been in solitary for 23 years. On death row."},{"speaker":"Lawson","time":"00:22:08-9","content":"That's solitary also all of that."},{"speaker":"Marcus","time":"00:22:11-1","content":"That's all solitary right and in CCR are you able to communicate with other inmates? Is it the same on death row?"},{"speaker":"Lawson","time":"00:22:17-4","content":"You are. It's the same it's the same when we say solitary people have the idea that solitary is you're locked in a room and you're just. It's not like that. Solitary is yes you are in an individual cell but there's individual cells right on other side of you and you can talk but it is detrimental to the degree where you spend all of those years essentially living in a room the size of your bathroom."},{"speaker":"Lawson","time":"00:22:17-4","content":"If you were to go home and go live inside your bathroom for 23 years that's where you live and you're not used to people sleeping around you. You're not used to walking around without chains on. I still stop at doors because I don't walk through doors because every door that ever since I've been incarcerated is a locked door. Someone had to come open that door."},{"speaker":"Lawson","time":"00:22:17-4","content":"I don't I can't just walk they just walk they just hey man and I'm like alright ok so it's that issue it's the social issue it's almost like socializing and animal that's lived in a house all by himself and now he's around a bunch of other dogs and he's never been around a bunch of other dogs."},{"speaker":"Lawson","time":"00:22:17-4","content":"So that's the real issue even if you're in an environment where you can talk to people in the cells next door to you and you are all watching the TV the same TV and talking about this that and the other there are a lot of social issues that go on with housing people like that even if it's not the full on solitary confinement where."},{"speaker":"Lawson","time":"00:22:17-4","content":"Because people don't interact they don't have normal interactions they don't look at each other when they don't when I talk to people in the cell next me I don't see that person. I could be starting over here at the ceiling while I'm talking to the guy over here so you don't all of those things are extremely difficult extremely hard to get used to after you do that amount of time just locked down."},{"speaker":"Marcus","time":"00:24:12-6","content":"Is it accurate for me to assume that the folks that were coming in and out of CCR while you were staying there at that point in time were not the most positive influences because they were all there for disciplinary reasons."},{"speaker":"Lawson","time":"00:24:25-0","content":"Oh yeah right well that's the problem is you had a core group of CCR guys when I came to Angola in 1993 CCR was a smaller number of individuals. It was a lot smaller and the guys that were in CCR back then were what we call real CCR. They were guys with multiple escape attempts they were guys that whenever they were put in population they stab somebody and they just realized that after a number of we're just going to put you in this unit and you're going to stay there and this is where you're going to stay."},{"speaker":"Lawson","time":"00:24:25-0","content":"Over the years CCR has become more of a dumping ground. So you have what us older CCR guys would say well that's not a real CCR guy they just got him in here and those would be a lot of those kind of guys where they were coming from camp J disciplinary unit and they just tired of sending them in the cell blocks and they just put them in CCR."},{"speaker":"Lawson","time":"00:24:25-0","content":"And they might do a year so there is there's always a lot of negative influences in the cell blocks the cell blocks in and of themselves whether you're in CCR or camp J or anywhere else are always negative influences because the cell blocks are the- people think a lot of times people think the worst time you can do or the most dangerous time you can do is in dormitories because you're in the open its open but that's not true because the people that can't live in prison society are the ones that live in the cells."},{"speaker":"Lawson","time":"00:24:25-0","content":"So you're living around all the people that have no interest in self-betterment have no interest in education have no interest in anything other than BS that's why you have all the disciplinary problems in cell blocks."},{"speaker":"Marcus","time":"00:26:01-5","content":"Yeah. So what did you do to improve your life?"},{"speaker":"Lawson","time":"00:26:05-5","content":"Oh I mean I read the western cannon I read the entire western cannon I taught myself to paint I studied philosophy I studied music. Basically just oh and I started writing. I always wanted to be a writer so I started writing."},{"speaker":"Marcus","time":"00:26:22-4","content":"So you got you had fairly good access to educational materials"},{"speaker":"Lawson","time":"00:26:28-4","content":"Educational materials I have, came off the street. There's no education in the cell block. There's nothing. I had support on the street. If you don't have support on the street and you're in that environment that I was in you're lost. You're dead."},{"speaker":"Lawson","time":"00:26:28-4","content":"There's nothing for you. Its counterproductive the cell blocks are counterproductive because you will not change anybody in the cell blocks if they do not have the internal capacity to change themselves in the cell blocks you will not make a person better by putting them in a cell for that long."},{"speaker":"Lawson","time":"00:26:28-4","content":"I understand the concept that if you have a guy who runs out there and stabs somebody you have to do something with him I mean that's you have to do something with him. But just taking an individual and putting him in a cell and saying look just sit there and we're going to bring all these other guys in here and y'all are just going to sit there and there's nothing for you to do but feed on each other feed on each other is why you get all the fighting and the stabbing and the throwing of stuff on each other."},{"speaker":"Lawson","time":"00:26:28-4","content":"Because there's nothing a lot of these individuals don't have internal resources so they feed on what's around them and by the administration or the prison system the philosophy of rehabilitation is that you're not giving them an alternative to change so they don't change they just get worse and worse and worse and then you have a lot of guys in the cell blocks who are just trying to just stay out of the mess, and do some time and they do try to better themselves they do but those individuals fight the uphill battle that the only way you can do it is you have to have your own resources."},{"speaker":"Marcus","time":"00:28:11-0","content":"So you're sort of an exception to that."},{"speaker":"Lawson","time":"00:28:13-5","content":"I know a lot of guys though I know some guys that have done more time than I know the Angola three I mean I knew them I did time with them. Hooks and Woodfox I mean I knew them personally I did time around them hooks Herman Wallace was one of the first people I met when I came to Angola one of the first people I talked to when I came to Angola and he had already done 23 years over 23 years in the cells and I was that that's how old I was."},{"speaker":"Lawson","time":"00:28:13-5","content":"So there are guys that do that amount of time in those cells who don't go crazy who don't eat themselves up and they manage through almost self-will to develop and to grow and to change and to continue the process of normal human development but you can say that those are the exceptions."},{"speaker":"Marcus","time":"00:29:10-0","content":"Yeah do you consider yourself rehabilitated?"},{"speaker":"Lawson","time":"00:29:18-8","content":"Yeah I mean the things that I was- the opinions or the attitudes that sort of stuff that I had when I was 20 years old I'm not that person I mean I'm not doing stuff like that anymore I mean they could make me a trustee tomorrow I'm not going anywhere."},{"speaker":"Marcus","time":"00:29:36-2","content":"Sure and I think what you also pointed to which is clearly happening with all the guys that I'm talking to is you age out."},{"speaker":"Lawson","time":"00:29:44-8","content":"You age out. You age out. You're not 20 anymore. You just get older."},{"speaker":"Marcus","time":"00:29:49-4","content":"Right. Let me ask you a question about your role in the crime and how you feel about that now. So your role in the crime for which you were convicted. Obviously there's a victim the victim's family. You've done 24 years. Do you think that that's enough?"},{"speaker":"Lawson","time":"00:30:13-6","content":"In my instance of course I do but I mean I understand. I think about I think about that night all the time and I don't think about it in I don't think about it in a remorseful way of oh man I wish I hadn't got caught I think about it as in it's a waste. It's a waste the whole thing was a waste. And individual lost their life. That's a waste that you can't get that back."},{"speaker":"Lawson","time":"00:30:13-6","content":"I lost my life. Everybody lost. Everybody lost everybody lost in that situation there was nothing good at all in that situation it's just a waste so you look back when you get older and you just think. How everything could have been different everything for everybody involved could've been different. How could you possibly have gotten yourself involved in something like that how could this possibly have happened? And there's nothing you can ever do to change anything that you did. You can't."},{"speaker":"Marcus","time":"00:31:16-2","content":"If you were to come in front of a parole board a pardon board. Clemency hearing what would you want them to know about you?"},{"speaker":"Lawson","time":"00:31:26-0","content":"I mean the only thing I could possibly point to given especially my circumstances where I didn't have 23 years to go out into this prison population and do all of that stuff is to say everywhere I went everyone I was around you can't find people that will say I was a negative influence. You can't find them. I don't hardly have any enemies in the penitentiary."},{"speaker":"Lawson","time":"00:31:26-0","content":"I did 20 something years in the penitentiary and I don't have hardly any enemies. How do you do that how do you go 20 something years and hardly have any enemies. So everywhere I went and everything I did and everyone I was around. I had a positive impact on them and then the time I got out of other cell within a short period of time everything I did was a positive impact on other people. That's all I have that's all I can show there's nothing else I can do."},{"speaker":"Marcus","time":"00:32:15-2","content":"Yeah. That's true. Now that you're out in the general population what's the worst thing you're dealing with now what's the worst thing about being"},{"speaker":"Lawson","time":"00:32:26-9","content":"Other people. Other people are hell. That's an old quote that's an old quote other people are hell. It's because like I said I did all those years- when I did 23 years in the cells I mean every day was my own day. Every day was my own day. I got up when I wanted to get up."},{"speaker":"Lawson","time":"00:32:26-9","content":"I didn't have work call I ate when I wanted to eat slept when I wanted to sleep I read TV I watched TV when I wanted to watch TV. I read books when I wanted to write if I wanted to stay up all night painting I could stay up all night painting so every day was my day and I didn't have anybody else to bother me because as long as whoever was on the tier didn't bother me I could go for a whole week without talking to another person or being bothered."},{"speaker":"Lawson","time":"00:32:26-9","content":"Just pursuing whatever I wanted to pursue being interested in whatever I wanted to be interested in. But now I live in a 96 man dorm. Where everybody has 2 feet of space and everybody is constantly coming to me for stuff especially now that I've the jobs that I have the jobs that I've managed to acquire since I came out of the cell requires me to be available to everybody. So I constantly have everybody coming to me hey man so my issue is dealing with the social aspect of having to deal with all of these different personalities."},{"speaker":"Lawson","time":"00:32:26-9","content":"And they are personalities they are personalities in penitentiary I have to negotiate in my mind dealing with people all day long because I got happy go lucky people they're fun to be around but I've also got the people that aren't happy go lucky and I have to deal with them in a slightly different way than I deal with these people here so I have to on a daily basis be able to read people because I have to do things for people."},{"speaker":"Lawson","time":"00:32:26-9","content":"I have to go get them this and get them that and handle this for them as part of my responsibilities for my job here in the prison and that is the biggest thing that I have to deal with. I have to deal with dealing with a multitude of personalities on a daily basis when I'm used to not having to deal with anybody."},{"speaker":"Marcus","time":"00:34:18-8","content":"I understand that that's a huge adjustment. What about if anything what's the best thing about it"},{"speaker":"Lawson","time":"00:34:26-2","content":"Being able to walk around. Being able to walk around. I haven't been able to walk around in 23 years. I never went out in the exercise yard that I didn't walk I was in restraints in chains. I didn't walked anywhere that I wasn't fully restrained and escorted by 2 security officers. So you put me in a dorm and you open it up in the morning and you say ok man you just go do whatever you want to do and just come back 10 o'clock so we can count you."},{"speaker":"Lawson","time":"00:34:26-2","content":"I can go to the hobby shop they got hobby shops at Angola so now I can do the type of art that I couldn't do in the cell because in the cells we could only have a small limited amount of art supplies that was non security related. I can go to the hobby shop now because they've given me access to the hobby shop and oil paint. So I can do all of these things now that I couldn't even remotely do."},{"speaker":"Marcus","time":"00:35:17-1","content":"So being in general population for you is the worst and the best."},{"speaker":"Lawson","time":"00:35:21-2","content":"Sure. I think that's almost probably for everybody I mean maybe more drastic."},{"speaker":"Marcus","time":"00:35:27-7","content":"Sure. let's say you do get out and you must have spent some time envisioning at this point in your life at this age what would you do so can you sort of paint a picture of what your plan would be what your goals would be?"},{"speaker":"Lawson","time":"00:35:27-7","content":"Well obviously I have to support myself but I have family support I have friend support so I write I'm a fairly successful writer now. I don't think I could support myself off it unless I sold a New York Times bestseller which I might. Never know."},{"speaker":"Lawson","time":"00:35:27-7","content":"I won a pen award last year so I might you never know what's coming- but most likely what I'd end up doing is my mother is in real estate she deals with major she has her own real estate company in Virginia and she deals with title and screw and all that sort of stuff so most likely what would happen is I would go back and with a small amount of money to start out with I'm probably going to start my own business painting old school classical Italian frescoes in homes."},{"speaker":"Lawson","time":"00:35:27-7","content":"That's most likely what's going to happen I could probably start that with under 10000 dollars. That's most likely what I'll do."},{"speaker":"Marcus","time":"00:36:42-9","content":"And you would have your mother as a source of support."},{"speaker":"Lawson","time":"00:36:44-8","content":"Sure. I have that's the one thing I don't have to worry about is if I were to get out tomorrow I don't really have to worry about those sorts of issues. Which is a blessing."},{"speaker":"Marcus","time":"00:36:55-7","content":"Ok. So this is maybe a very this is a very difficult question for me to ask you because I have trouble thinking about it and I'm not even going through it. But you also are living with the possibility of dying here."},{"speaker":"Lawson","time":"00:37:17-8","content":"Right."},{"speaker":"Marcus","time":"00:37:21-0","content":"Can you tell me how you cope with that idea?"},{"speaker":"Lawson","time":"00:37:24-3","content":"The way I cope with that idea is that I do not feel like I will ever go home. So I don't even worry about it. I'm not going home. State of Louisiana is not going to allow me to go home. I had the death penalty. My death penalty was vacated. I was resentenced to life so in essence I've already received one sort of pardon even though this wasn't done by the pardon board this was done by the legal system so my concept of it is, I file my paperwork to the pardon board with no expectation that they are going to release me from penitentiary."},{"speaker":"Lawson","time":"00:37:24-3","content":"I have no expectation that the Louisiana legislature is ever going to do anything with first degree murder. They're never going to change the laws. I have no expectation of ever leaving Angola. Now that being said that does not mean that I don't hope that something will change the only avenue I have that I feel is a legitimate avenue is through the legal system. I'm in a position where I still am I'm still in court my case is still alive even after 23 years you're not going to meet very many guys whose case is still alive after 23 years."},{"speaker":"Lawson","time":"00:37:24-3","content":"My case is so that gives me the hope that maybe some of these other guys whose cases are finalized and there is no more hope for them whatsoever so on that side I I'm like well maybe but in my mind I'm philosophically I'm an existentialist. I view the world existentially and that tells me you're just going to have to take it as it comes. It's the way it is. I'm most likely never going to go home very few people ever leave here you hear about for every one you hear about oh man they let so and so go there is a thousand that aren't going to go home so most likely I'm not going to go home that's just the reality of it it's what it is."},{"speaker":"Lawson","time":"00:37:24-3","content":"It's not going to change that I still have to get up every morning I still have to go to work every morning and I still have interests. I still have things that I want to pursue I still have a life of the mind I don't have the physically life that I may want I may not be able to go to the Himalayas and see Everest but I can still have a life of the mind so because I've carved out a reality where I do art and I've carved out a reality where I write. I can do that in a garret in the French quarter. Or I can do it here. It doesn't matter. I got myself a library job I'm a librarian so I have a library. I can go write in the library."},{"speaker":"Marcus","time":"00:39:53-0","content":"Right. You're creating a life of the mind."},{"speaker":"Lawson","time":"00:39:55-5","content":"Right that's all that's left."},{"speaker":"Marcus","time":"00:39:57-1","content":"That's meaningful to you regardless of the way you are."},{"speaker":"Lawson","time":"00:39:59-8","content":"So I can still have a meaningful existence."},{"speaker":"Marcus","time":"00:40:02-2","content":"Yes. Very good. You said you were you're a slightly more unique case in fact the most unique person that I've talked to because of not being able to take advantage of all these types of opportunities and yet finding a path by yourself is there something that I should have asked you that I didn't? Something that you wanted an opportunity to talk about that I didn't cover."},{"speaker":"Lawson","time":"00:40:30-3","content":"I can't think of anything off the top of my head. Probably as soon as I walked through the door I'll be like ah man but in general I mean I think everything that needed to be said I think that really the primary issue of all of us that you're talking to is the issue of like you said dudes just aging out they just and you'll be able to look at you can see the ones that have actually aged out."},{"speaker":"Lawson","time":"00:40:30-3","content":"And the ones that haven't if the guy is 50 years old and he's still at camp J in the cell blocks he hasn't aged out if the guy is 50 years old and he's got 40 degrees from Votech and he hasn't had a disciplinary report in 20 years why is he still here?"},{"speaker":"Lawson","time":"00:40:30-3","content":"But it's the social pendulum because the social pendulum in the 60s and 70s was toward rehabilitation and then you had the 70s and 80s with the drug war."},{"speaker":"Lawson","time":"00:40:30-3","content":"And the high crime rate and the pendulum swung back to incarceration these mandatory minimums and now the pendulum may swing back towards a more because Angola in and of itself even though there's guys that have been here longer than I have strange as that may sound I've spent almost a quarter century here the penitentiary has changed."},{"speaker":"Lawson","time":"00:40:30-3","content":"I even though I couldn't participate. I was still I've still been here having all those social programs that they have now it didn't exist when I first came here when I first came here you had the field. That's what you had you had the field you're going to go pick crops in the field. That's what you had. You didn't have all of this so the institution in and of itself is changing."},{"speaker":"Lawson","time":"00:40:30-3","content":"Is changing a lot now whether or not they're instituting all of these sort of rehabilitative programs and all of this training merely because they're satisfying some federal grant or whether they're actually saying if you do all of this then we will let you go home because you've demonstrated that you are not the individual who was- that remains to be seen that's the question that remains to be seen."}]}