{"name":"","transcript":[{"content":"Levelle Tolliver Transcription REDACTIONS FINAL"},{"speaker":"Levelle","time":"00:00:00-0","content":"My name is Levelle Tolliver been convicted of second degree murder out of Monroe Louisiana an I've been incarcerated since 1993 which is 26 years."},{"speaker":"Marcus","time":"00:00:14-7","content":"Right so you were 19."},{"speaker":"Levelle","time":"00:00:17-4","content":"I was 19."},{"speaker":"Marcus","time":"00:00:19-4","content":"Okay."},{"speaker":"Levelle","time":"00:00:21-3","content":"I went to trial in 98 and got found guilty in 1999. I got sentenced and subsequently landed here in Angola."},{"speaker":"Marcus","time":"00:00:31-3","content":"Right sure so I'd like to go back a little bit to your early years can you tell me a little bit about your family about the folks who raised you."},{"speaker":"Levelle","time":"00:00:42-6","content":"I have a pretty large family my immediate family was my mother my father and my oldest two brothers I'm the last of three boys."},{"speaker":"Marcus","time":"00:00:53-3","content":"Okay alright tell me about your parents."},{"speaker":"Levelle","time":"00:00:58-3","content":"They were pretty much good parents up until I was 5 years old. That's when I noticed that my dad wasn't coming home in the morning and for some reason him and my mother separated when I was five I found out later it was because of something his drug habits drug addiction was the reason for him and my mother's separation."},{"speaker":"Marcus","time":"00:01:23-1","content":"After that was he more or less absent from your life."},{"speaker":"Levelle","time":"00:01:26-3","content":"He was never absent because he used to always after he departed he used to always come back visit."},{"speaker":"Marcus","time":"00:01:34-4","content":"Okay and how was that for you how was that relationships."},{"speaker":"Levelle","time":"00:01:39-1","content":"If you if you've seen a lot of other interviews that I've had I love my dad I I'm different from a lot of people love they mother more than they love they dad I'm kind of the opposite I love my dad a lot not that my mother was a bad mother I love my mother. But I love my dad a lot because I think we pretty much are the same we pretty much equal I have a lot of my dad traits me and my a lot of people tell me and my dad look like twins twin brothers so I love my dad."},{"speaker":"Marcus","time":"00:02:17-8","content":"Were there other men in your mother's life who came into your life?"},{"speaker":"Levelle","time":"00:02:24-4","content":"Right and his name was Mr. Henry Davis and my mother ended subsequently ended up marrying him and he was he was a big part of my life too because I learnt a lot from him mannerisms how to be a gentleman he was real strict and he wasn't hard he wasn't abusive but he was real strict and he was big on church and school and work and learn this and learn that."},{"speaker":"Marcus","time":"00:02:58-9","content":"Did he get along pretty well with your two older brothers?"},{"speaker":"Levelle","time":"00:03:01-2","content":"Yes sir."},{"speaker":"Marcus","time":"00:03:03-0","content":"Okay so I'm assuming then that you didn't grow up in an abusive household."},{"speaker":"Levelle","time":"00:03:07-1","content":"No."},{"speaker":"Marcus","time":"00:03:08-7","content":"Okay or ever felt that you've got to make it on your own that there aren't adults around to help you."},{"speaker":"Levelle","time":"00:03:13-2","content":"No."},{"speaker":"Marcus","time":"00:03:14-5","content":"Okay alright so what's your relationship like with your brothers today?"},{"speaker":"Levelle","time":"00:03:21-3","content":"Right now we kind of on and off because of my long duration of incarceration so they here a minute and gone the next but earlier in my incarceration and growing up me and my brothers were real close and just like my dad my second oldest brother we a lot of people think me and all me my dad."},{"speaker":"Levelle","time":"00:03:21-3","content":"We all have the same father and the same brother and my second oldest brother and we and my dad we all look alike. So he was probably the closest one. My second oldest brother because we was always around each other we did a lot of things together."},{"speaker":"Marcus","time":"00:04:06-6","content":"Yeah when was the last time you saw him."},{"speaker":"Levelle","time":"00:04:08-9","content":"It's been like 5, 10 years or more."},{"speaker":"Marcus","time":"00:04:14-2","content":"Okay are they all in Monroe still?"},{"speaker":"Levelle","time":"00:04:16-6","content":"No everybody's relocated out of town my mother stays in Indiana my second oldest brother lived in Indiana and my oldest brother lived in California."},{"speaker":"Marcus","time":"00:04:23-9","content":"And where's your dad."},{"speaker":"Levelle","time":"00:04:25-9","content":"My dad is still in Monroe."},{"speaker":"Marcus","time":"00:04:29-4","content":"And when is the last time you saw your father."},{"speaker":"Levelle","time":"00:04:35-7","content":"About a year ago he got hit by a truck and I saw a picture of him in the hospital."},{"speaker":"Marcus","time":"00:04:41-1","content":"Okay alright so who visits you up here do you get visits still."},{"speaker":"Levelle","time":"00:04:47-4","content":"No."},{"speaker":"Marcus","time":"00:04:49-3","content":"I mean I know that a lot of guys say that visits start to go."},{"speaker":"Levelle","time":"00:04:51-4","content":"Visits yeah visits decline real fast."},{"speaker":"Marcus","time":"00:04:54-8","content":"Yeah I mean it's just this is the middle of nowhere."},{"speaker":"Levelle","time":"00:04:58-4","content":"Yeah but only because of the reason like I said a lot of my immediate family has departed from the state of Louisiana everybody has moved on job a better job opportunities and things of that nature. So, my oldest brother like I said he been in California for the last 15 years and my second oldest brother he moved to Indiana with my mother."},{"speaker":"Marcus","time":"00:05:22-9","content":"Yeah right so do you stay in touch with them through email."},{"speaker":"Levelle","time":"00:05:29-9","content":"Right."},{"speaker":"Marcus","time":"00:05:31-9","content":"And phone calls."},{"speaker":"Levelle","time":"00:05:34-0","content":"Phone calls, email letters."},{"speaker":"Marcus","time":"00:05:35-0","content":"Sure."},{"speaker":"Levelle","time":"00:05:35-0","content":"You know?"},{"speaker":"Marcus","time":"00:05:40-3","content":"Sure so what about school coming up how was that for you said that your stepfather was very strict about school and church and so forth tell me a little bit about how school was for you."},{"speaker":"Levelle","time":"00:05:49-7","content":"School was like a safe haven for me I loved school I'm a high school graduate I graduated in 1992 and I played football and Friday nights was like my favorite Fridays period you have the pep rallies and things of that nature leading up to the football game and that was like my favorite day of school Fridays and school was like a safe haven."},{"speaker":"Levelle","time":"00:05:49-7","content":"Because I stayed at school all day not to just you because if I go home I would have to stay in the house or around the house and that was kind of boring for me that was kind of boring for me. So I stayed at school I'm pumping lifting weights running around the school campuses and just doing all kind of things."},{"speaker":"Marcus","time":"00:06:43-0","content":"Yeah sure so sports were a big part of your"},{"speaker":"Levelle","time":"00:06:45-2","content":"Sports was a major part."},{"speaker":"Marcus","time":"00:06:48-9","content":"Sure yeah when you came here did you continue to play football?"},{"speaker":"Levelle","time":"00:06:51-6","content":"Yes."},{"speaker":"Marcus","time":"00:06:57-3","content":"Alright so school was good you graduated do you have any specific memory of a teacher or a coach who was influential on your life?"},{"speaker":"Levelle","time":"00:07:06-3","content":"A lot of teachers and a lot of coaches because I played football since I was small but if I have to say one teacher or one coach it would have to be coach Callahan and that was like my high school coach and he would be all he used to always tell me man whatever you do make the smart choice whatever choices you make in life."},{"speaker":"Levelle","time":"00:07:06-3","content":"Make it a smart choice and I never understood that he said man Tolliver make the smart choice whatever you do man make the smart choice he used to always tell me passing by make the smart choice and right now today I still reflect on it I'm going to make what's the smart choice."},{"speaker":"Marcus","time":"00:07:54-1","content":"Right he clearly left and impression."},{"speaker":"Levelle","time":"00:07:56-4","content":"Yes it did."},{"speaker":"Marcus","time":"00:07:59-0","content":"Did you find yourself getting in trouble at school at all were you ever kicked out of school?"},{"speaker":"Levelle","time":"00:08:02-9","content":"I was kicked out of school twice I know for sure."},{"speaker":"Marcus","time":"00:08:07-9","content":"Okay what was that behind."},{"speaker":"Levelle","time":"00:08:10-6","content":"Physically abusing someone I had no business doing I had we had growing up I used to watch wrestling a lot and that kind of messed my mind up. So I used to see something and go straight to school and look I had a partner of mine that we used to."},{"speaker":"Levelle","time":"00:08:10-6","content":"I said man look you hold him like this his head this patented move that they used to do at and there I go and I see what the road warriors do one night and next morning I'm in school doing it and that god that subsequently led me to get suspended from school indefinitely and when that happened I had the worst whooping in my life and I never got kicked out of school again."},{"speaker":"Marcus","time":"00:08:51-8","content":"Okay what was who was behind that whipping?"},{"speaker":"Levelle","time":"00:08:54-5","content":"My mother, my mother most definitely my mother."},{"speaker":"Marcus","time":"00:09:01-4","content":"Yeah was there fighting in the neighborhood as well?"},{"speaker":"Levelle","time":"00:09:01-4","content":"A lot of fighting lot of fighting in the neighborhood."},{"speaker":"Marcus","time":"00:09:08-1","content":"Can you paint a I've never been to Monroe I know where it is on the map but I've never been there can you describe your neighborhood like if the two of us were in front of your door looking out into the neighborhood when you were in high school can you what am I seeing and hearing?"},{"speaker":"Levelle","time":"00:09:29-2","content":"My neighborhood was pretty much a quiet neighborhood low income but quiet not too much happening but if you would go further down the street to where things was happening like the drug dealings and the gang violence and that's where I kind of took a left turn at so I kind of got out the yard and went down the street and that was a bad choice."},{"speaker":"Marcus","time":"00:09:58-7","content":"That's where trouble was."},{"speaker":"Levelle","time":"00:10:01-4","content":"That's where trouble was and so when you walk out my house you going to see a beautiful little neighborhood nice little gated community whatever low income but it's nice whatever not too much happening. And you go down the street a little further about a mile up the street and that's where all the chaos at the apartment complex and hanging on the block and the gangs and the drug dealings."},{"speaker":"Marcus","time":"00:10:25-7","content":"Sure and how old were you when you started to get into some of that."},{"speaker":"Levelle","time":"00:10:30-3","content":"I would have to say 15."},{"speaker":"Marcus","time":"00:10:33-8","content":"Okay but you graduated from high school so whatever's going on you're still in school."},{"speaker":"Levelle","time":"00:10:39-5","content":"I was still in school."},{"speaker":"Marcus","time":"00:10:41-7","content":"You found another school."},{"speaker":"Levelle","time":"00:10:43-5","content":"Found another school and so now when I leave school. So at it came a point to now I was hanging in the streets and cant too many people say that they was hanging in the street and had the opportunity to graduate from high school that's just not it don't happen often."},{"speaker":"Marcus","time":"00:11:02-6","content":"Yeah."},{"speaker":"Levelle","time":"00:11:04-4","content":"Well I'm one of those who can say I was hanging in the streets I was still able to graduate but when I graduated that left turn was not the right turn."},{"speaker":"Marcus","time":"00:11:14-1","content":"Okay so was it do you think football had a lot to do with why you stayed in school."},{"speaker":"Levelle","time":"00:11:25-1","content":"Right that was a big part that was the big part that was a big reason why I graduated and stayed in school."},{"speaker":"Marcus","time":"00:11:27-1","content":"Got it so I'm assuming that you were in a relatively loving household and adults who cared making sure that you were, okay did you and you had some little issues in school sounds like and what about brushes with the law before this charge did you end up getting arrested and convicted of anything."},{"speaker":"Levelle","time":"00:11:51-9","content":"That was steamed it for me getting involved in the streets my first arrest my first arrest was probably shoplifting and after that I had a big old gang fight in the convenience store and we got 7, 8 of us we all in there fighting I'm the only one to go to jail I never could figure that out and after that murder charge."},{"speaker":"Marcus","time":"00:12:21-6","content":"Okay did you have any convictions prior to the murder charge?"},{"speaker":"Levelle","time":"00:12:25-4","content":"No other convictions I mean I probably got convicted of a little shoplifting because I got busted shoplifting but I was a juvenile then."},{"speaker":"Marcus","time":"00:12:34-0","content":"Right."},{"speaker":"Levelle","time":"00:12:35-9","content":"And with the store I wind up it's a little misdemeanor disturbing the peace by fighting something like that."},{"speaker":"Marcus","time":"00:12:44-5","content":"Yeah sure so this was the first serious."},{"speaker":"Levelle","time":"00:12:46-9","content":"Yeah this was the first serious offense."},{"speaker":"Marcus","time":"00:12:48-5","content":"So, what about relationships with girls do you do anybody stand out in your mind."},{"speaker":"Levelle","time":"00:12:55-1","content":"I would have to say I had my high school sweetheart Kim and what I learned about my relationship with Kim is that it was real honest the real sweetheart because I might have me and Kim might have dated a year and a half to two years before I even got a kiss and I was I'm like man do nothing?"},{"speaker":"Levelle","time":"00:12:55-1","content":"We supposed to be doing something but she never gave in and I learnt she was real classy and I learned a lot from Kim. So I would have to say my high school sweetheart."},{"speaker":"Marcus","time":"00:12:55-1","content":"Okay are you still in touch at all?"},{"speaker":"Levelle","time":"00:13:40-8","content":"With Kim? Very seldom but it's our relationship is still beautiful."},{"speaker":"Marcus","time":"00:13:45-3","content":"Right but people move on."},{"speaker":"Levelle","time":"00:13:48-0","content":"Right."},{"speaker":"Marcus","time":"00:13:51-5","content":"Any children."},{"speaker":"Levelle","time":"00:13:53-1","content":"I have one daughter."},{"speaker":"Marcus","time":"00:13:55-9","content":"Well tell me about her what her name is."},{"speaker":"Levelle","time":"00:13:59-4","content":"My daughter her name is Bria Alicia Moore and she's 25 today well yeah she's 25 now and beautiful our relationship is beautiful I of course had to raise her while I was incarcerated. So I never was there I think she was like 6 months when I got arrested."},{"speaker":"Marcus","time":"00:14:22-5","content":"Okay was this Kim's daughter?"},{"speaker":"Levelle","time":"00:14:24-2","content":"No it was outside my relationship with Kim but me and her mother we kind of wasn't like me and Kim we was the opposite we had issues but my relationship with my daughter now."},{"speaker":"Levelle","time":"00:14:24-2","content":"That's why I try to raise talk to her give her sound advice the same thing my step dad and my dad gave me this is what you look for in a man she graduated high school well and she has a nice job now she has two girls she has two little daughters."},{"speaker":"Marcus","time":"00:15:05-1","content":"You're a grandfather."},{"speaker":"Levelle","time":"00:15:07-2","content":"Right don't feel like it and she has two little daughters' two beautiful daughters and I just try to give her sound advice and just try to keep her head focused because she's struggling now she's a single parent."},{"speaker":"Marcus","time":"00:15:21-5","content":"Right do you see them at all."},{"speaker":"Levelle","time":"00:15:24-2","content":"Outside of pictures not outside of pictures."},{"speaker":"Marcus","time":"00:15:27-4","content":"Okay so I don't really want to get into too many details about the but I'm asking you about your life so it'd be strange for me not to ask you to just briefly summarize how this happened what got you here?"},{"speaker":"Levelle","time":"00:15:44-2","content":"Probably one of the worst mistakes I ever made in my life if I wanted to sum it up."},{"speaker":"Marcus","time":"00:15:55-0","content":"I mean let me ask you this if you had to put it down to one factor and I know that that's not the way life really is but what the main cause is behind why you got here."},{"speaker":"Levelle","time":"00:16:09-1","content":"Trying to prove myself in a situation I had no business being in trying to prove that I was a man in a gang that I had no business dealing with or trying to prove myself to some people. I had no business dealing with is the manufacture of why I'm in here today because and plus alcohol and drugs mixing in with that's I made probably one of the worst mistakes I've ever made in my life."},{"speaker":"Marcus","time":"00:16:38-6","content":"Okay and alcohol and drugs was that part of the lifestyle or just something you did recreationally."},{"speaker":"Levelle","time":"00:16:45-6","content":"It wasn't a part of my lifestyle it was recreational."},{"speaker":"Marcus","time":"00:16:48-3","content":"Do you remember the bus ride I guess you did you go to hunts?"},{"speaker":"Levelle","time":"00:16:55-7","content":"Yes."},{"speaker":"Marcus","time":"00:16:58-0","content":"Okay do you remember the bus ride from hunts to Angola what was going through your mind."},{"speaker":"Levelle","time":"00:17:05-1","content":"Well I where the hell am I was in a part of this state and I had no idea where I was at places I've never been places I've never seen nothing but trees and it was like the long road leading up here. It was like it was just this dark trail until I just all of a sudden come to this place and I was like wow man what I can't even remember getting here if you tell me to walk and leave I don't even know how I got here man."},{"speaker":"Marcus","time":"00:17:43-9","content":"Right did you get here at night?"},{"speaker":"Levelle","time":"00:17:45-9","content":"No it was like early in the morning."},{"speaker":"Marcus","time":"00:17:47-9","content":"Early in the morning."},{"speaker":"Levelle","time":"00:17:50-0","content":"Early in the morning but that road was still dark."},{"speaker":"Marcus","time":"00:17:52-8","content":"Yeah so I'm trying to get a sense of what do some of your memories of your first few weeks here what was it like for you."},{"speaker":"Levelle","time":"00:18:02-1","content":"Confused."},{"speaker":"Marcus","time":"00:18:04-2","content":"Do you have any specific things?"},{"speaker":"Levelle","time":"00:18:05-1","content":"Yeah confusing I was paranoid scared not knowing what's going to happen you have this big misconception about prison. So you worried if someone's going to try you or do you something soon and that makes you paranoid and schizophrenic. So I was real agitated aggravated always aggravated waking up with an attitude it was a dog moment."},{"speaker":"Marcus","time":"00:18:30-9","content":"Yeah did you did they put you in the field."},{"speaker":"Levelle","time":"00:18:36-8","content":"Yes sir and that was something like I've never been through before in my life."},{"speaker":"Marcus","time":"00:18:40-8","content":"Yeah can you describe that what was that."},{"speaker":"Levelle","time":"00:18:44-3","content":"Being in a long line of about 3, 4 hundred guys two at a time and the whole format of holding your twos up while a guy over you with a gun that's an experience but it's hard to explain but its real it's a real rough experience its mind boggling its real mind boggling because you don't have no control you being controlled you being look walk this don't walk out of line this way if not I got this gun."},{"speaker":"Levelle","time":"00:18:44-3","content":"So it's not like you have you got to be like a soldier and it was real mind boggling for me because I was like damn I was real scared not to move this too far this way and don't go too far that way you have to stay hey man hey I'm telling it was real mind boggling."},{"speaker":"Marcus","time":"00:19:49-4","content":"Yeah and hard I imagine."},{"speaker":"Levelle","time":"00:19:51-4","content":"Yes real hard but the work actually the actual physical work probably didn't bother me but it was just the process of getting there and getting back to the main prison complex the lining up and the counting and that's what experience for me."},{"speaker":"Marcus","time":"00:20:15-8","content":"So how long did that last?"},{"speaker":"Levelle","time":"00:20:18-4","content":"That didn't last too long for me because I knew one thing if anything got to change I got to get out the field."},{"speaker":"Marcus","time":"00:20:25-9","content":"Right."},{"speaker":"Levelle","time":"00:20:27-7","content":"So I might have given my 25 years of being incarcerated here in Angola all together I might have done 2 years in the field 3 years in the field I don't last long in the field I hurry up see you in the field if that don't make you act right you don't want to act right."},{"speaker":"Marcus","time":"00:20:44-9","content":"Right so you were doing that for a couple years and then how do you get out what do you do."},{"speaker":"Levelle","time":"00:20:57-9","content":"Good behavior and apply for a job anywhere."},{"speaker":"Marcus","time":"00:21:00-6","content":"Okay and what was that job."},{"speaker":"Levelle","time":"00:21:02-1","content":"The tag plant got me out the field and I worked in the tag plant for 8 years straight as a paint spray inspector that's the guy that when it's been sprayed when it's been cut the tag been cut the numbers been printed on it and it goes through the paint machine and goes through the heater and dry I'm the guy that checks it and say okay this is ready to be put on a car."},{"speaker":"Marcus","time":"00:21:24-6","content":"Eight years of that."},{"speaker":"Levelle","time":"00:21:25-9","content":"8 years of that."},{"speaker":"Marcus","time":"00:21:30-2","content":"So one of the themes that we're exploring with this project is transformation."},{"speaker":"Levelle","time":"00:21:36-3","content":"Right."},{"speaker":"Marcus","time":"00:21:39-8","content":"I assume that you when you look back on your life would you characterize it that way that you've kind of gone through a transformation of sorts."},{"speaker":"Levelle","time":"00:21:48-3","content":"A complete transformation."},{"speaker":"Marcus","time":"00:21:50-5","content":"Yeah."},{"speaker":"Levelle","time":"00:21:52-6","content":"Is what I call it?"},{"speaker":"Marcus","time":"00:21:54-2","content":"Can you explain that to me a little bit?"},{"speaker":"Levelle","time":"00:21:56-1","content":"It's like I told you earlier when I first come I was this confused scary paranoid not wondering I mean wondering what would happen not knowing what would happen and that kind of had me on edge see now I don't have those words and that's how I know I've made a complete transformation."},{"speaker":"Levelle","time":"00:21:56-1","content":"So now I wake up now and there's no worries and I give god a lot of credit for that because I had a god fearing experience I went through a dark moment physically and I had to cling to god because god is almighty all powerful."},{"speaker":"Marcus","time":"00:22:45-2","content":"What kind of experience was that?"},{"speaker":"Levelle","time":"00:22:48-8","content":"I caught a stomach infection which caused high blood pressure and fluid to build up in my body and it killed the feelings in my legs I was confined to a wheelchair for like a year and a half."},{"speaker":"Marcus","time":"00:22:57-7","content":"Oh wow."},{"speaker":"Levelle","time":"00:22:59-7","content":"Yeah and that."},{"speaker":"Marcus","time":"00:23:02-1","content":"How long ago was that?"},{"speaker":"Levelle","time":"00:23:04-9","content":"That was like a year and a half ago just last year almost I think almost two years ago I was confined to a wheelchair for a year and a half."},{"speaker":"Marcus","time":"00:23:13-1","content":"So is that all cleared up."},{"speaker":"Levelle","time":"00:23:15-3","content":"Yes by the grace of God yes sir."},{"speaker":"Marcus","time":"00:23:17-3","content":"Great so before we started filming you were telling me about bishop."},{"speaker":"Levelle","time":"00:23:23-9","content":"Yes."},{"speaker":"Marcus","time":"00:23:28-1","content":"How he inspired you to run can you tell me about that?"},{"speaker":"Levelle","time":"00:23:31-3","content":"Yeah I used to watch basketball games and play basketball games on the basketball court and while basketball games was going on I used to always see this old guy just running around the yard he would lap me like three or four times and every time he slapped me he had something he would say he was like come on youngster come on here and just run right by me I'm like man this old guy man and he would come around again."},{"speaker":"Levelle","time":"00:23:31-3","content":"I'm sitting on the ledge come on youngster doing nothing come on youngster I'm telling you to come on here and he's running by so one day I said man if this old guy how old that man is I asked a guy how old he is man Bishop Tanner here he's every bit of 70 close to 70, 68, 69 I said and run the yard like that?"},{"speaker":"Levelle","time":"00:23:31-3","content":"Say man he run that yard every day like that I said what if he's 69 almost 70 and can lap that yard laps this yard 6 7 times the least I could do is run it once I mean I'm up early 30s early 30s man if I don't start running and that led me to I that's why I run the yard and I always think about Bishop Tanner here if he can run the yard at 70 almost 70 yeah I got to get a few laps around this yard whether I want to or not."},{"speaker":"Marcus","time":"00:24:58-0","content":"Did he become something of a spiritual mentor for you as well?"},{"speaker":"Levelle","time":"00:25:02-2","content":"Very oh man yeah."},{"speaker":"Marcus","time":"00:25:04-2","content":"I'm just noticing the T shirt."},{"speaker":"Levelle","time":"00:25:06-5","content":"Yes he's really he's real spiritual and I used to love to hear him preach he's like one of my favorite he's still my favorite preacher he's he have a unique way of delivering god's word and that was always amazing to me and he's going to always have something profound always leave something what I'm saying and that he's going to always leave something."},{"speaker":"Marcus","time":"00:25:33-6","content":"Sure so what's you can you walk me through your typical day here now I mean you're not in the field you're not in the tag plant I mean you kind of you've been here for a while so what do you do when you get up in the morning till you get to bed at night."},{"speaker":"Levelle","time":"00:25:49-7","content":"I've learned first of all that you have to give god thanks for waking up when I wake up so I pray and I thank god for waking me up to see another day and that pretty much eases my mind so now I try to live a carefree life here in prison because I'm of course I'm a lot older now. And I feel like I can outthink any situation."},{"speaker":"Levelle","time":"00:25:49-7","content":"Before I approach any I can make wise sound decisions now so with the help of prayer and staying in God's conscience and staying focused on god that helps you make the right decision now. So my days pretty much even though I'm in prison my days are pretty much lovely because I don't have no worries now."},{"speaker":"Marcus","time":"00:26:39-7","content":"So what do you do when you get up do you have a job?"},{"speaker":"Levelle","time":"00:26:43-1","content":"Yes I'm a barber."},{"speaker":"Marcus","time":"00:26:45-2","content":"Oh."},{"speaker":"Levelle","time":"00:26:46-5","content":"I cut hair."},{"speaker":"Marcus","time":"00:26:47-7","content":"Oh yeah."},{"speaker":"Levelle","time":"00:26:50-4","content":"A lot of people love for me to cut hair because I'm also a jokester. So by you getting your haircut and I'm telling jokes and you laughing now you might get a messed up haircut sometimes."},{"speaker":"Marcus","time":"00:27:00-1","content":"The jokes are better than the haircut."},{"speaker":"Levelle","time":"00:27:02-4","content":"Yeah the jokes are way better than the haircut."},{"speaker":"Marcus","time":"00:27:06-3","content":"Okay so you cut hair in the dormitory."},{"speaker":"Levelle","time":"00:27:07-9","content":"In the dorm or but I cut hair at the transitional unit where a lot of guys need a smile where a lot of guys need to."},{"speaker":"Marcus","time":"00:27:17-9","content":"Is that when they're first coming over here."},{"speaker":"Levelle","time":"00:27:20-4","content":"That's just yeah."},{"speaker":"Marcus","time":"00:27:22-4","content":"So that's their first couple of days."},{"speaker":"Levelle","time":"00:27:25-6","content":"That's their first couple of days and then it's the transitional unit with the mental illness."},{"speaker":"Marcus","time":"00:27:29-8","content":"Okay I get it TU."},{"speaker":"Levelle","time":"00:27:32-7","content":"Yeah TU that's the transitional unit."},{"speaker":"Marcus","time":"00:27:34-5","content":"Okay yeah I was getting confused with something else TU those guys have been here a while."},{"speaker":"Levelle","time":"00:27:38-3","content":"AU too I cut AU hairs too."},{"speaker":"Marcus","time":"00:27:42-3","content":"Yeah okay so that's your main thing you're the barber one of the barbers here."},{"speaker":"Levelle","time":"00:27:46-5","content":"I'm one of the barbers one of the many barbers here and I enjoy that because you have an opportunity of dealing with a lot of different people and like I said a lot of people I learnt that people love to see me coming rather than see me leave they love to see me coming hate to see me leave and I noticed that about who I am today."},{"speaker":"Marcus","time":"00:28:09-1","content":"Yeah that's a good thing to be able to say yeah."},{"speaker":"Levelle","time":"00:28:11-0","content":"Yeah."},{"speaker":"Marcus","time":"00:28:15-7","content":"Are there other organizations that you've been a part you talked to me about being part of that play."},{"speaker":"Levelle","time":"00:28:17-8","content":"Right."},{"speaker":"Marcus","time":"00:28:20-2","content":"In addition to that are there other clubs and things that you've been part of over the years."},{"speaker":"Levelle","time":"00:28:20-2","content":"Yes I'm a member of the lifer's association JCs literary arts and probably the best one of all the drama club."},{"speaker":"Marcus","time":"00:28:20-2","content":"Okay yeah how is that for you doing that."},{"speaker":"Levelle","time":"00:28:40-2","content":"Drama club? Well it gets it gives me a safe haven again somewhere I can get outside because acting really takes me outside of prison and I love acting I'm great at acting."},{"speaker":"Marcus","time":"00:29:02-3","content":"So what part did you have in the life of Christ Play?"},{"speaker":"Levelle","time":"00:29:05-5","content":"I was Judas in the life of Christ play cast the first stone with they made a documentary DVD cast the first stone and I was Judas."},{"speaker":"Marcus","time":"00:29:15-6","content":"Okay I'll have to look for that."},{"speaker":"Levelle","time":"00:29:20-1","content":"You have to watch it."},{"speaker":"Marcus","time":"00:29:26-3","content":"Okay so let me get a little bit serious for a minute. 26 years have passed you just turned 46 yesterday."},{"speaker":"Levelle","time":"00:29:37-2","content":"Yes sir."},{"speaker":"Marcus","time":"00:29:39-8","content":"That's a very long time away from the crime that brought you here."},{"speaker":"Levelle","time":"00:29:43-3","content":"Right."},{"speaker":"Marcus","time":"00:29:46-2","content":"When you look back at what happened and you think of the victim now what are you how what are your thoughts?"},{"speaker":"Levelle","time":"00:29:59-9","content":"Man very remorseful. A lot of remorse it's like I said it's probably one of the biggest mistakes I ever made in my life and it's probably a mistake I'll spend the rest of my life trying to correct. That wasn't the real me that night with the help of alcohol and drugs not that I'm saying that that's an excuse but that turned me into probably the biggest monster I've ever seen in my life."},{"speaker":"Levelle","time":"00:29:59-9","content":"I have vivid memories of what happened but through my legal issues and reading about it and kind of putting trying to put things together I was a monster that night I'm real remorseful because I took someone life and when I lost my auntie who was real close to my mother's oldest sister."},{"speaker":"Levelle","time":"00:29:59-9","content":"That was probably the most painful thing that I had ever felt it seemed like and I was like wow now I can see what they went through when I took their brother their son their father or their uncle and I was like wow I can't if I had the power to redo it like everybody else this probably wouldn't have happened I don't but I'm totally sorry but that wasn't the real level that wasn't the real me once again I can't say I'm sorry enough it was."},{"speaker":"Marcus","time":"00:32:00-3","content":"Yeah I mean the reason that I think it's important to have an opportunity to express that but I also think that it's complicated because you've also been punished for 26 years."},{"speaker":"Resp","time":"00:32:13-2","content":"You can't keep dwelling on it because it will drive you crazy. I've seen a lot of people who constantly dwell on it I knew I guy not to say no names but I knew a guy who accidentally killed his wife but now when he sleeps he talks in his sleep to his wife and he's always and like he talk come on come on man you I was like wow so you can't keep dwelling on it because it will drive you crazy."},{"speaker":"Marcus","time":"00:32:48-1","content":"Yeah and the other things is that there's at least 2 families who get affected by this."},{"speaker":"Levelle","time":"00:32:50-6","content":"Right."},{"speaker":"Marcus","time":"00:32:52-6","content":"So your ability to empathize with his family because of your aunt is I think also is increased by watching your own family go through the struggle of watching you here."},{"speaker":"Levelle","time":"00:33:04-8","content":"Exactly."},{"speaker":"Marcus","time":"00:33:06-9","content":"So tell me a little bit about the impact that this has all had on your family."},{"speaker":"Levelle","time":"00:33:12-2","content":"I was a mama's boy what they call a mama's boy my mother loves me because I'm the last of her three sons and the impact it had on my mother I could see it when she come when she used to come and I used to have to be like put on this persona like mama I'm alright she used to always ask is you alright anybody say mama I'm good."},{"speaker":"Levelle","time":"00:33:12-2","content":"She used to always worry herself and I be like mom you going to worry yourself sick and just like I said she used to get sick she used to and everyone wondering why she get sick she had a stroke and then she had another stroke on top of that stroke and I'm like mom listen don't worry about me."},{"speaker":"Levelle","time":"00:33:12-2","content":"I'm going to be alright I will get out of prison I'm going to get out of this situation one way or the other we just got to trust god and I'm going to do the necessary things that I have to do to better myself as a person to get out of prison you don't have to worry about that no more and she worried herself until she had a stroke and now she got all these physical ailments. So really it was a major impact on my mother."},{"speaker":"Marcus","time":"00:34:28-8","content":"Yeah. How about that brother you talked about your second oldest brother."},{"speaker":"Levelle","time":"00:34:36-3","content":"My main man. He still supports me whenever I need financial support he's there he went through a few mishaps himself going to jail but he's never done nothing real serious and I thank god for me going through what I went through as in regards to me bettering myself because now I have something I can give him."},{"speaker":"Levelle","time":"00:34:36-3","content":"So now he's on the right track see so but it's a learning experience like I tell him man you going forward bruh but it's not what you do it's what you do when you get up it's what you do when you get up you got to get up and what you do after you get up that's real that's important."},{"speaker":"Marcus","time":"00:35:29-5","content":"So I guess this is a difficult question but I know that you said to your mother that you're going to get out you're going to do better yourself and get out you also see people that just don't get out."},{"speaker":"Levelle","time":"00:35:45-8","content":"Right."},{"speaker":"Marcus","time":"00:35:52-7","content":"Do you sometimes think that might be you? I guess I'm trying to learn about how you cope with the reality of a life without parole sentence."},{"speaker":"Levelle","time":"00:36:04-5","content":"How do I cope? Once again its man it's with god's help but I try to do it with an open mind open heart with an open spirit and what I mean by that is you can't dwell on you not getting out or if you continue to do the things to try to get out something is going to happen if you continue to push something is going to happen. I learned here in prison they got PUSH P-U-S-H it's an acronym it say pray until something happens."},{"speaker":"Levelle","time":"00:36:04-5","content":"I do that. Five times a day all day every day I'm always praying. Something's going to happen because I believe in god and I know that god is the author of all things and he has the final judgment he has the final answer. So I just stay focused on god and I stay focused on doing the right things now if you a god conscious man you going to always make the right decisions."},{"speaker":"Marcus","time":"00:37:16-6","content":"Do you believe you're going to get out of here?"},{"speaker":"Levelle","time":"00:37:18-2","content":"Yes sir."},{"speaker":"Marcus","time":"00:37:20-1","content":"Okay and I suppose that would have to be through the pardon board."},{"speaker":"Levelle","time":"00:37:22-1","content":"Right."},{"speaker":"Marcus","time":"00:37:24-6","content":"It is a hopeful time that people are going home we're seeing that."},{"speaker":"Levelle","time":"00:37:27-7","content":"I pray to god."},{"speaker":"Marcus","time":"00:37:34-8","content":"If you if you you're able to successfully go through that process and they say okay we'll commute your sentence to 99 years make you parole eligible whatever and that day comes around and you get paroled do you have a specific vision for this next chapter of your life?"},{"speaker":"Levelle","time":"00:37:56-5","content":"Yeah yes I do. I can't make up the lost time I've lost with my daughter. So my first thing I want to do is spend as much time with her whether she's old whether she's young it doesn't matter. Because she needed me I feel like more than anybody else that may not be true but that's the way I feel my daughter is probably my most prized possession."},{"speaker":"Levelle","time":"00:37:56-5","content":"Because she's a part of me she's a real big part of me and she shared her struggles with me a lot with through the email now but it wasn't email she used to write me look I'm struggling with this I'm struggling with that she's always reaching out to me for some kind of advice something and I know that she really needs a father she really needs that strong presence in her life."},{"speaker":"Levelle","time":"00:37:56-5","content":"She tried to find that but then with her baby dad she got a baby by this dude and a baby by that dude. But that shows me that she's reaching out she's searching but she can't find that what she's looking for and I tell her always look if you need anything reach out to me I see you growing I see you reaching out for something you really don't know what you want so whatever it is you looking for just confide in your father and I feel like if and when I get out I owe her a lot of time."},{"speaker":"Marcus","time":"00:39:51-5","content":"What do you see yourself doing to support yourself?"},{"speaker":"Levelle","time":"00:40:01-0","content":"I found out that I have I have a love for helping or supporting people who can't help thyself or do for thyself on my free time when I don't work or when I'm not cutting hair I go to the hospital on my own time and I take care of a paraplegic who I played football with up here his name is Cantrell park clean him bathe him. Because he can't do this for himself he can't take care of himself."},{"speaker":"Levelle","time":"00:40:01-0","content":"I started out just cleaning him but when I went over to the hospital it's more than just him over there like that you might have a guy over there with no legs. Trill can't move from his neck on down."},{"speaker":"Levelle","time":"00:40:01-0","content":"And he needs people to feed him he needs people to clean him he needs people to cut his hair he needs people to brush his teeth okay we got another guy over there who don't have no legs he have to be pushed to the shower he have to be cleaned he have to be taken care of he have to be groomed. So I see myself taking care of those who are not able to take care of themselves?"},{"speaker":"Marcus","time":"00:41:12-1","content":"How often do you find yourself going over there?"},{"speaker":"Levelle","time":"00:41:14-7","content":"Every chance I get if I'm not busy that's where I'm at."},{"speaker":"Marcus","time":"00:41:20-4","content":"Right and did he have an injury you said you played football with him was it a football injury?"},{"speaker":"Levelle","time":"00:41:24-0","content":"It was a football injury on the football field."},{"speaker":"Marcus","time":"00:41:30-1","content":"Right."},{"speaker":"Levelle","time":"00:41:32-1","content":"I think he broke a few vertebrae in his neck or back or something."},{"speaker":"Marcus","time":"00:41:37-4","content":"So what's that worst part about being in Angola for you now?"},{"speaker":"Levelle","time":"00:41:41-6","content":"Now I mean just being away from my family being away from loved ones not being able to go where you want to go when you want to go not being able to spend time with your mother not being able to attend family reunions things of that nature where you can get love."},{"speaker":"Marcus","time":"00:42:03-5","content":"Yeah."},{"speaker":"Levelle","time":"00:42:06-8","content":"And care from so not being able to communicate with you I mean just to commune with your family and loved ones so that's probably the worst part of being incarcerated."},{"speaker":"Marcus","time":"00:42:19-9","content":"Yeah what's the best thing about Angola for you?"},{"speaker":"Levelle","time":"00:42:22-4","content":"It was an eye opener for me I hate to say that it took me to come to prison for me to realize who I really am but it took me to come to Angola I thank Angola for that. There's no telling where I would have been had I not come here maybe dead maybe strung out on drugs maybe strung out on alcohol but I think Angola for that."},{"speaker":"Levelle","time":"00:42:22-4","content":"Because it takes you away from that even though they have drugs here maybe here and there but it's not plentiful like it is on the street and they don't have no guns here they got guns but not like they do on the street and drugs and guns don't mix drugs and guns don't mix whether you a user whether you a seller of drugs and guns do not mix somebody is going to get hurt eventually."},{"speaker":"Marcus","time":"00:43:30-6","content":"Yeah."},{"speaker":"Levelle","time":"00:43:32-7","content":"So Angola took me away from that Angola took me away from the game Anola let me realize open my eyes to where those dudes who you are representing or who you saying are your partners where they at now? They back are all turn when you get locked up ain't no more gangs it's a fairytale because they gone turn they backs on you."},{"speaker":"Marcus","time":"00:43:59-2","content":"Sure. Did you have codefendants in your case?"},{"speaker":"Levelle","time":"00:44:03-0","content":"Yes two of them."},{"speaker":"Marcus","time":"00:44:04-6","content":"And are they here."},{"speaker":"Levelle","time":"00:44:06-9","content":"Yes sir."},{"speaker":"Marcus","time":"00:44:08-5","content":"Serving life sentences as well. So last question is there something that in my quest to try to learn about your life is there something that I should have asked you that I didn't ask you that you would have wanted an opportunity to talk about."},{"speaker":"Levelle","time":"00:44:20-6","content":"Yeah you should have asked me who was my favorite actor I just told you I was the coldest thespian you probably laid your eyes on."},{"speaker":"Marcus","time":"00:44:27-2","content":"Alright well tell me who your favorite actor is."},{"speaker":"Levelle","time":"00:44:30-1","content":"Denzel Washington. Leading up to the plays I kind of watched a lot of Denzel Washington movies."},{"speaker":"Marcus","time":"00:44:40-6","content":"Yeah he's a great actor."},{"speaker":"Levelle","time":"00:44:43-6","content":"Great actor and I took a lot of facial if you watch the DVD I give good a lot of facial expressions."},{"speaker":"Marcus","time":"00:44:51-9","content":"I'm going to go find that."},{"speaker":"Levelle","time":"00:44:53-7","content":"Yeah and that's where I get all of these."},{"speaker":"Marcus","time":"00:44:56-1","content":"It's called Cast The First Stone?"},{"speaker":"Levelle","time":"00:44:56-5","content":"Cast The First Stone."},{"speaker":"Marcus","time":"00:44:58-5","content":"Okay I'll find that I heard about it."},{"speaker":"Levelle","time":"00:45:03-5","content":"Yeah it's real profound I had fun and I learned a lot about TV and I learnt a lot about acting and that's probably another thing I would mess with when I leave."},{"speaker":"Marcus","time":"00:45:15-4","content":"Alright that's a good place to stop."}]}