{"name":"","transcript":[{"content":"Manuel Nelson Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"So let's start by, tell me a little bit about growing up and your family and the people who raised you, the people who were important to you."},{"speaker":"Manuel","time":"00:00:09-2","content":"Okay, I grew up in New Orleans, Louisiana, ninth ward, Florida housing project. My family was loveable, they loved me, and I knew that they cared about me. My mother, she raised me, as well as my grandmother. She worked hard all her life. I had another side of my family raise me which was my uncle. Which was a different type of way they raised me than my mother."},{"speaker":"Marcus","time":"00:00:43-5","content":"Were there men in your mother's life that ended up becoming a part of your life?"},{"speaker":"Manuel","time":"00:00:43-5","content":"At the time, early in my life, no. Later in my life, yes. She got married, and he became stepfather and of course I agreed with that."},{"speaker":"Marcus","time":"00:00:48-8","content":"What was that relationship like?"},{"speaker":"Manuel","time":"00:01:06-5","content":"Really, he wasn't a father figure at first. It's like I was more or less forced to look at him as a father figure because he was the only male, grown man in the household. It became good then he died in an accident and there was no more after that and I was like sixteen years old. After that there was no more it was just me and my mom."},{"speaker":"Marcus","time":"00:01:40-6","content":"Did you have some role models who were adults, people you could look up to? Or was it more your peer group, your friends?"},{"speaker":"Manuel","time":"00:01:52-9","content":"It was more my friends. I mean I had my uncles I looked up to but, they wasn't really the role model I should've been looking up to in a sense. They was more or less just, I guess you could say just living the life that they wanted to live instead of life that life's supposed to be. More music, streets. There wasn't no doctor in my family, there wasn't no teacher in my family. There wasn't no type of people that you say, ok I want to be a teacher like my uncle or I want to be a doctor like my mother. There wasn't really too much of that."},{"speaker":"Marcus","time":"00:02:48-1","content":"Growing up what did you want to be?"},{"speaker":"Manuel","time":"00:02:51-3","content":"Well to tell you, I wanted to be a football player and a police officer. That changed quickly, so football player. I went to school, played football. Went to kind of drifting off a little bit from school, poor neighborhood, seeing my mother struggle. She ain't supposed to be struggling like that. So I wanted someone in my life doing what I did for my mother. I didn't have the education or the mind to do what I was supposed to do to help my mother. So basically it was a part of my little life"},{"speaker":"Marcus","time":"00:03:47-4","content":"Is that what you think took you down that path?"},{"speaker":"Manuel","time":"00:03:52-1","content":"Yes sir, I do. I was more of like, okay, she don't deserve to struggle, and she don't deserve to work hard like this. And me going to school all of my life, she's going to be worn down. I saw her cry, times I went without lights in the house, food, like something's got to give. So when I walk out my house I see, okay, I can make it better. That's how it was."},{"speaker":"Marcus","time":"00:04:46-9","content":"I think that's a common experience. Do you have a specific memory of your home? Like if I was standing right outside of your house what would the scene look like?"},{"speaker":"Manuel","time":"00:04:54-0","content":"It would look, well if you just walk up and look, it would be, happy. Children playing sports, everything, in the day time. But if you walked up at night time that's dangerous, don't look good, somewhere you don't want to be. You could feel the fear, you could feel it. You don't want to be there at night. But in the daytime it's beautiful, children playing, everything's great."},{"speaker":"Marcus","time":"00:05:36-1","content":"Did you find yourself getting into a lot of fights growing up?"},{"speaker":"Manuel","time":"00:05:39-6","content":"Yes sir. It was, that's how you had to defend yourself. For example like the bully thing, couldn't get bullied. Not where I'm from. You've got to fight, or you won't have nothing. That was another thing. You just have to defend yourself and I believe that's where it raised from, that anger. It just stick with you, protection. It came more protecting than really trying to live."},{"speaker":"Manuel","time":"00:05:39-6","content":"If I could protect my family, that's all that get to be done. And that's just the way my neighborhood was, you've got to protect yourself. I had my group of friends. Everybody had their group of friends. And that's just the way it is. It's not gangs. And it wasn't as serious the way it is now, but it was serious and it was dangerous."},{"speaker":"Marcus","time":"00:06:58-1","content":"What was the, the crimes for which you were convicted, what was the dispute about?"},{"speaker":"Manuel","time":"00:07:09-2","content":"I was charged and convicted of second degree murder. The facts the district attorney presented, they said it was based on drugs, crack cocaine. That was the district attorney's theory. And that's how they got a conviction of two witness that was on crack cocaine that they presented."},{"speaker":"Marcus","time":"00:07:47-8","content":"But you know what the dispute was about."},{"speaker":"Manuel","time":"00:07:51-1","content":"Yeah, I wasn't there. I know now exactly what happened, but I wasn't present when this happened."},{"speaker":"Marcus","time":"00:08:02-8","content":"So, tell me about the guy who walked through Angola's gates that first day. Who was that guy? How would you describe that man?"},{"speaker":"Manuel","time":"00:08:18-6","content":"Wow confused, scared, angry, just wonder what happened, why it happened, if I'm going to ever go home, if I'm going to ever see my family. How people are going to look at me. I let my family down I let myself down, my friends down, teachers. It was, just, speechless. It just like, wow. I'm in penitentiary, Angola penitentiary. If I'm going to make it out, or I'm going to be here forever. That's what it was. Do I deserve to be here forever? Do I deserve to get out? So many thoughts, you don't know what to, you're still like, what happened? How did I get here?"},{"speaker":"Marcus","time":"00:09:52-4","content":"So now twenty-three years later, what advice would you give that person?"},{"speaker":"Manuel","time":"00:10:04-2","content":"When they first come in, my first advice would be this. Follow the rules. Follow the rules. I know you don't like them, but follow the rules. Stay away from the crowd that you saw before you came to prison, the crowd you saw on the street, it's that same crowd here. Stay away from that crowd. Get your education. Don't mess with the guards. You wouldn't come here, they would've never known it was you. You follow the rules, you're going to have no problems."},{"speaker":"Marcus","time":"00:10:48-7","content":"So are you giving your old self that advice because you got in trouble, it took you awhile to learn those things?"},{"speaker":"Manuel","time":"00:10:57-3","content":"Took me a long time. I was going to fault somebody. Somebody I didn't put myself here, somebody put me here. I ain't put me here. So whoever don't agree with what I agree with, you put me here? You were at fault. I was in denial. The guards, they was you all put me here. They're the ones who put me here, they're keeping me here. That's not it. Until you get out of denial, until you realize that however you got here, you did it or not, however you got here, you've got to better yourself here. Makes no sense for you to keep fighting."},{"speaker":"Manuel","time":"00:10:57-3","content":"Getting into it with the guards. There's no end. Now I think that. No way in the world. You've got to care. You've got to care about something. You've got to sacrifice for something. If it's not you okay, try to teach the ones that's just coming, don't do what you did. That was supposed to talk to you when you was out there in the world. Ain't nobody told you \"Don't do that\" But now I can encourage somebody that comes to prison, \"Don't do it\""},{"speaker":"Marcus","time":"00:12:25-1","content":"So in those twenty-three years. So you were here when you were here when you were twenty-three. How long into those twenty-three years did it take for you to make that change?"},{"speaker":"Manuel","time":"00:12:39-8","content":"I totally changed, I'm going to say at least, at least ten years. At least ten years, might be a little more."},{"speaker":"Marcus","time":"00:12:53-6","content":"So sometimes those changes are the result of like gradually coming to a place or other times there's an event, or person that talks to you a certain way, or some experience that you have that switches you around. What was it for you?"},{"speaker":"Manuel","time":"00:13:13-9","content":"I believe it was my daughters. Just like three, three and four. And I was just like, looking, like wow, they're thirteen, fourteen years old and, \"Daddy I'm not mad at you, dad I'm not mad at you,\" \"I know you won't leave us,\" I was like, \"Okay, so what are you going to do now?\" Got to do the right thing. Just got to apply by the rules and pray to god that nothing come to you where you have to, more or less entertain it, I guess you could say that. Because it's a prison, we can't forget it's a prison, it's a prison, and it's a prison. Things do happen. That really got me, my two daughters that really set me straight. Like ok man."},{"speaker":"Marcus","time":"00:14:21-3","content":"Are you still in contact with them?"},{"speaker":"Manuel","time":"00:14:22-9","content":"Yes sir. Write them, talk to them. I have grandchildren now. That's really waking me up because I'm praying to god I don't have to put my grandkids on my visit list. That's a thing. And it's like a curse in a sense, it's like I followed in my father's footsteps, exactly. So I'm thinking that the curse has been broken because I had daughters."},{"speaker":"Manuel","time":"00:14:22-9","content":"Maybe if I had sons it would've kept, I'm not sure, just. I'm not sure maybe that's what happened and I'm thankful for that. It's, I've changed. I'm really, sounds self-centered but I'm proud of myself. I look back then and looking at the processes I've come through this prison until now. I could take a little verbal abuse, \"Yes sir\" \"Yes ma'am\" And I've taken that."},{"speaker":"Marcus","time":"00:15:54-2","content":"Without responding, without being violent, without."},{"speaker":"Manuel","time":"00:15:59-3","content":"Without responding. That was my problem, anger, denial. But once I realized, hold up man, it ain't got to be like that. You ain't got to be mad. It's easy. It's really easy. Follow the rules. Stay away from the company. Just keep moving. Educate yourself, surround yourself with educated people, and just keep moving."},{"speaker":"Marcus","time":"00:16:36-1","content":"Do you have some folks here that you can really look up to for guidance?"},{"speaker":"Manuel","time":"00:16:43-3","content":"I got one. Younger than me. Everett. Around the same area in the, of reflection of Calvin Duncan. Calvin Duncan my hero in here. Calvin Duncan will tell you, \"Look, you better get yourself together, learn something,\" I used to chase around a football, anger. But you know, Everett, great guy."},{"speaker":"Marcus","time":"00:17:15-2","content":"We'll be talking to him."},{"speaker":"Manuel","time":"00:17:17-9","content":"Great guy. Great, do anything, can help you. Got to be positive just like Calvin Duncan. Positive, follow the rules, if you don't, I can't talk to you. It's on the person though. Really right now, where I'm at, it's on the person to change. Time going to help you change, it's on the person, twenty-some years in prison, it's on you."},{"speaker":"Manuel","time":"00:17:17-9","content":"Everybody knows you, all the guards know you, and most of the prisoners know you, so really you have an easy way to change. You can change. You don't have to prove yourself or prove a point. You can change. And, fortunately, thank God that, good and bad that when I came Calvin was here teaching the law class, he's like a mentor then. They have mentors now, but he was a real mentor."},{"speaker":"Marcus","time":"00:18:37-8","content":"I expect you're a mentor to someone else now, too."},{"speaker":"Manuel","time":"00:18:40-3","content":"Oh yeah. Every chance I get I try to talk to anyone that's been here with me. Because we all need a mentor, no matter how long we've been here we all need a little reminder. We're in prison, we get depressed and disgust, all that come with the program. Every chance I get I mentor somebody. \"What's up? What you doing? Get it together man, I know how you feel,\""},{"speaker":"Manuel","time":"00:18:40-3","content":"People don't know how you feel when you lose your family, especially when you're at fault. The hardest thing is you always want to blame somebody. Lose your family, you're mad, it's hard to deal with that. Especially when you first come to prison. Even the first five years in prison is so hard because you're still trying to figure out who you are. You don't know. Then you're looking at guys in here twenty, thirty years more than you. And they're telling you, \"Work on your case, stay out of trouble,\""},{"speaker":"Manuel","time":"00:18:40-3","content":"But you have this other side too. You have a negative and a positive. First five years, it's hard. After ten years, it starts slowing down. The older you get the more you the biggest part is you're not mature, you're not. Whatever you're looking for when you first get here, you see that it's not there. So you have to go another way, you have to find another route to take. You're looking at the grey hairs popping out of your head, you're looking at your kids becoming adults. Everything you see, you see totally different."},{"speaker":"Manuel","time":"00:18:40-3","content":"Things that you hear, it be like, if it ain't the right thing it's like acid pouring in your ear. Time, just age and time is so important. Oh man, some of these guys have been here forty, fifty years, don't have nobody. And I look at them like damn, how can I help you, what can I do? And it just, it's tough. And I'm hoping that I'm not, praying that I won't be that guy."},{"speaker":"Marcus","time":"00:21:53-7","content":"What's your typical day like here? Now."},{"speaker":"Manuel","time":"00:21:57-5","content":"I guess you could say it's waking up in the morning, some days are basically the same. Brush your teeth and everything, roll call as usual in prison, you go to your job, do your job, and after your off time you read, or you write, or you play sports. Some guys watch TV. It's basically like a regular, a regular routine you constantly do. You basically, once somebody tells you what they do, you look at that for the next ten fifteen years, the same thing, and they have spots in this prison where its slow, they have spots where its fast and you have in between."},{"speaker":"Marcus","time":"00:23:03-6","content":"What's your job?"},{"speaker":"Manuel","time":"00:23:06-0","content":"Oh I'm a trustee. I work at death row. And I basically I make sure that the guys on death row, basically their visits, when they come visit them, their food be right, and a clean area where they can sit, water. That's where my, my job. As a personnel. But for as a state job I just clean offices."},{"speaker":"Manuel","time":"00:23:06-0","content":"But I enjoy when the visits come see their family. I try to make sure everything is as comfortable as possible. The guys on death row, make sure that, food, if they have some food, make sure they get it. That's where I'm at. I like death row. I talk to a lot of them. It's amazing what you can see, it's amazing what you can hear. It's amazing."},{"speaker":"Marcus","time":"00:24:21-7","content":"And they spend so much time alone, I imagine that they value."},{"speaker":"Manuel","time":"00:24:25-4","content":"Yes, Sometimes they just want to talk, I'm not in contact with them where I can just talk like that, it's a maximum security, but if I bring them food and a security guard with me, \"Hey son how you doing?\" \"Alright? You're alright?\" That means a lot to them. Of course I have to be escorted with security."},{"speaker":"Marcus","time":"00:24:51-9","content":"So you're there every day?"},{"speaker":"Manuel","time":"00:24:56-0","content":"Every day. Every day. Every day. It's rough, you see so much. You see so many different people, you hear so many people's stories that sometimes you forget about your own. Because you know what I mean, you find one more intriguing. Seventeen, eighteen, twenty-one, twenty years old? Man, they come here at twenty-two years old you've been here how long? Wow, it's."},{"speaker":"Marcus","time":"00:25:39-4","content":"Twenty-three"},{"speaker":"Manuel","time":"00:25:43-4","content":"It's an island by itself. It's a place that you don't want to be at. It's a place that can help you when you go home. This place can help you when you go home."},{"speaker":"Marcus","time":"00:26:03-3","content":"If you were to go before a parole board or pardon board, what would you want them to know about you?"},{"speaker":"Manuel","time":"00:26:10-2","content":"First thing I would like them to know is that I am not the same person I was, twenty-three, twenty-two years ago. Even before that, sixteen, seventeen, eighteen years old, I'm not that type of person. Next thing I want them to know is that my sacrifice is all about my community, my family."},{"speaker":"Manuel","time":"00:26:10-2","content":"I want to stop somebody from coming to prison. They don't know, they don't know. They don't know what they're doing. They don't understand what they're doing. It need, something needs somebody to. I don't know where it should start at, but we need to find out. I mean, that's all I can say to them. I don't know what else to say."},{"speaker":"Marcus","time":"00:27:16-2","content":"A lot of the time parole boards ask you to talk about remorse. Talk about how you feel about the victims. Where are you on that?"},{"speaker":"Manuel","time":"00:27:35-2","content":"Oh I'm deeply sorry for the victim. I'm sorry for the victim's family, the victim's son. I'm deeply sorry. I really am. And it's just not the victim, the victim in my situation. It's other people's victims also. I'm sorry, I mean if I can there would be no victims. If it's possible."},{"speaker":"Manuel","time":"00:27:35-2","content":"I'm totally sorry. I'm sorry is all I can say with that I mean. I wish it never happened to nobody. Because I know the victim's son or nephew might be on their way in prison in Angola in my situation and the circumstance or the crime might have caused them to come this way because of what happened to their father or their uncle."},{"speaker":"Manuel","time":"00:27:35-2","content":"That might have because some kind of dysfunction in their mind where they feel like okay, what happened to my father ain't going to happen to me, I'm going to make sure. And that's a lead way to come to prison so I'm totally sorry for that. And that's why I say I wish I can just help in some kind of way."},{"speaker":"Marcus","time":"00:29:11-8","content":"Let me ask you a question about the person you're codefendant in the case. He's also serving a life sentence."},{"speaker":"Manuel","time":"00:29:18-5","content":"Yes sir."},{"speaker":"Marcus","time":"00:29:20-2","content":"Are you in touch with him?"},{"speaker":"Manuel","time":"00:29:22-6","content":"Yes sir."},{"speaker":"Marcus","time":"00:29:24-6","content":"You came up together, probably I imagine."},{"speaker":"Manuel","time":"00:29:26-8","content":"Yeah we kind of, different areas. But we do know each other. He's a brother of mine and I'm going to be there for him all the way and I'm going to make sure he's on the track like I'm on the same track. Because if he veer of I feel like I lost. I got to help him, I got to try everything in my power to keep him where I'm at. He's good, he's on the right track. He's a trustee also in camp F. He's doing pretty go. He's been back there at least ten years with me. He's great. He's a good guy, again, neighborhood, and area."},{"speaker":"Manuel","time":"00:29:26-8","content":"That's so, that plays a big part, your neighborhood. Inside your home is probably so much love and so beautiful but when you step out that door you're confused. You're a child you be confused. It's lovely here but its fun over here. It's dangerous right here but it's fun. But inside your home it's beautiful and love. So I mean, you're trying to weigh it."},{"speaker":"Manuel","time":"00:29:26-8","content":"So when you see the dysfunction going on in your home where it's lovely beautiful and happy now you see all kind of little arguments and stuff. Ok I see this over here too. So now you're trying to be a man, find out what can you do. You don't really know who you are. Sixteen seventeen years old you don't know how to take care of no family, you don't even know nothing yet. So you lead to it's messed up."},{"speaker":"Marcus","time":"00:31:41-7","content":"How old were you when you were first arrested?"},{"speaker":"Manuel","time":"00:31:44-1","content":"Seventeen years old. Going to learn how to drive a car. Me and my friends, go get a car, get in the car and learn how to drive. Everybody had a car. It's crazy. But I don't think, that was just peer pressure, that just was follow the leader, want to follow. Couldn't afford no car, my mom couldn't buy no car. I had nobody that would buy me no car. Barely had a bike."},{"speaker":"Marcus","time":"00:32:38-7","content":"Did you ever, you said that at one point you thought you might be a football player or a policeman. Did you finish high school?"},{"speaker":"Manuel","time":"00:32:49-9","content":"Eleventh grade. Had one year left, one year?"},{"speaker":"Marcus","time":"00:32:56-2","content":"But since coming to Angola you've finished that, right?"},{"speaker":"Manuel","time":"00:32:58-7","content":"Yes sir."},{"speaker":"Marcus","time":"00:33:05-6","content":"And have you been inmate counsel?"},{"speaker":"Manuel","time":"00:33:10-4","content":"No. But I knew my case, I know the law."},{"speaker":"Marcus","time":"00:33:13-9","content":"Okay. Well you made a reference to it with Calvin I wasn't sure if maybe you worked on."},{"speaker":"Manuel","time":"00:33:18-4","content":"No he taught me the basics. Post-conviction release, habeas corpus, identifying claim, examining errors taught me a little bit about arguments. So I know my situation, I know if something not going right. If something needs to be addressed. So I basically kind of know. I think I could be one. It takes a lot of sacrifice. You really have to be into it because you have people's lives on your hand and it's a lot of confidentiality. You got to really care about that, really. You've got to put yourself completely out of the way because it's so many people that need counsel."},{"speaker":"Marcus","time":"00:34:16-8","content":"What do you think are the major difficulties, challenges of dealing with a life sentence?"},{"speaker":"Manuel","time":"00:34:28-5","content":"The most difficult part is, how you feel about yourself. Do you feel you'll ever get out of prison? Do you feel you should better yourself in prison if you might not get out of prison? Should I get a GED? Well I ain't going home, what am I getting a GED for? Should I get a trade?"},{"speaker":"Manuel","time":"00:34:28-5","content":"Well I ain't going home, why should I get a trade? To work on phone, to learn how to do engineer, air conditioners on phone for the rest of my life? So that's the biggest part you have to deal with. Doing the right thing, do you feel like you're going to be able to go home and work and support your family? That's the biggest thing right there."},{"speaker":"Marcus","time":"00:35:28-6","content":"It's trying to balance improving yourself and then saying, but I'm never getting out. It's dealing with that frustration."},{"speaker":"Manuel","time":"00:35:36-7","content":"I think that's the most, to me, I think that's the most biggest thing to deal with."},{"speaker":"Marcus","time":"00:35:43-5","content":"What is the best thing about Angola?"},{"speaker":"Manuel","time":"00:35:53-1","content":"The best thing is learning who you are. Again, the best thing about Angola, they have all these different trades, they have all these different things you can do, you can learn, or knowing it, getting there. I learned this, I got my GED, I learned this trade, I learned that trade, and I got a chance to go home. They've got people on the outside working on lifers. You can see the changes, that's the, you can see the changes. People coming into Angola trying to help you, people trying to see exactly what's going on."},{"speaker":"Manuel","time":"00:35:53-1","content":"I think that's the biggest part of Angola because if you, anywhere else, I'm not sure but I believe if you're anywhere else you wouldn't see it as you see it now. If you were in DCI correctional center I don't think you'll see it. Where they have a lot of guys that have five years, ten years, twenty years. But you have so many lifers here so you kind of see changes as you've been here. At one time you didn't see this. You interviewing me, ain't happening. So I think Angola does play a part, it's got the best part."},{"speaker":"Marcus","time":"00:37:15-2","content":"There's this thing, there's this strange irony in the fact that the folks who are serving the shortest sentences, usually have the toughest time turning their lives around, and the guys with life sentences, reach this point, it's almost like a point of acceptance. So the folks who have really rehabilitated are unlikely to be released. How do we fix that?"},{"speaker":"Manuel","time":"00:37:55-0","content":"Exactly. Well, only way you fix that is you let the guys that are rehabilitated get a chance to get out. If you never give them a chance to get out how do that they're going to do the right thing? You're saying that, okay, we're going to give y'all this program, and we're going to give you this program."},{"speaker":"Manuel","time":"00:37:55-0","content":"You need this to go on a board, you need this to do this, okay. I get all this, but you're still not giving me a chance to prove myself. Only way I can prove myself is if you let me, if you let me out, I get out. I can do everything Angola can give me. But the only way I can show you is if you give me a chance to go home."},{"speaker":"Manuel","time":"00:37:55-0","content":"They guys that have short time, they don't know. They don't know what they're getting into, they just think that they're coming to Angola, that's it. They don't know nothing about nothing in Angola. They're separated as far as struggles in Angola. They don't know about going in the fields. They don't know about fighting, protecting yourself. They don't know about none of that. They come to Angola and they get in the programs."},{"speaker":"Manuel","time":"00:37:55-0","content":"So it's ok, they don't know. But guys that have been here all these years, they know. They've been through everything you can think about. So now they've rehabilitated, they have trades, they have their GED, and they're counsel, they're ministers, and what's it for? What's it for? Learn how to fix eighteen wheelers and tractors and the range crew with the livestock's. If you don't give them a chance to go home, how will they prove it?"},{"speaker":"Manuel","time":"00:37:55-0","content":"You let ten, ten go home with these trades and they show you good jobs, working, giving back to their community, being mentors. That should show you, they've got to have ten more, they've got to have ten more in there. We just let ten go, they've got to have ten more somewhere. And that's the only way they're going to see it. As far as putting it on paper, they've got to have action."},{"speaker":"Marcus","time":"00:40:48-3","content":"Do you think twenty-three years is enough time?"},{"speaker":"Manuel","time":"00:40:51-9","content":"Yes sir, I think twenty-three years is more than enough time. I really believe so. It's just the character of the person should prove that. If a person's been down fifteen years and has all these different qualities about themselves and people saying, oh this is a good person, or good inmate, they have so many people saying, oh this is a good person, this is what he did, this is what he do, this is his character, he hasn't been in trouble in ten years, he hasn't been in trouble in twenty years. What more do you want? What more do you have to prove?"},{"speaker":"Manuel","time":"00:40:51-9","content":"You got to be walking with a cane? You got to be blind? You got to be in a wheelchair? What more do you need? I've been trustee at least nineteen years. If I have it right I've been probably thirteen years a real write up or like aggravated, fighting, all that stuff. What more you got to prove? Some guys ain't had a write up in thirty years, been trustee forty years. What you got to prove? What's left to prove?"},{"speaker":"Marcus","time":"00:42:15-8","content":"Is there a question that I should've asked you? Is there a question you wish I had asked you that I didn't ask you? Something you want to talk about."},{"speaker":"Manuel","time":"00:42:23-0","content":"Basically, we covered everything. Basically covered everything. I appreciate, I thank you. If it don't go no farther than this, however, I appreciate, anything positive that's coming to this prison, with me and a lot more guys, I appreciate it."},{"speaker":"Marcus","time":"00:42:54-1","content":"Well I know that this is your life and you sharing your story is a big deal to me. It's making this project possible so I feel privileged that you would do it, so thank you."},{"speaker":"Manuel","time":"00:43:06-2","content":"No problem."}]}