{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Marcus Artis_Transcription MK REDACTIONS_bjs FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:16",
      "content": "I'd like it if you could start by stating your name, the crime that you were convicted of, the age that you were at the time of crime, and how much time you've served."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:16",
      "content": ""
    },
    {
      "speaker": "Artis",
      "time": "00:00:16",
      "upperBoundTime": "00:00:27",
      "content": "My name is Marcus Artis. I was convicted of a crime when I was 18 years old from Oberlin, Louisiana a small town."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:27",
      "upperBoundTime": "00:00:36",
      "content": "And how much time have you served now?"
    },
    {
      "speaker": "Artis",
      "time": "00:00:36",
      "upperBoundTime": "00:00:41",
      "content": "Currently I got locked up when I was 18, 20 I'm in my twenty-third year, August the 29th."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:41",
      "upperBoundTime": "00:01:08",
      "content": "So I'm going to start by asking you a few questions about your childhood and about the time before this happened and then we'll switch gears a little bit talk a little bit about what happened and then mainly about what you've been doing in the last 20, 30 years. So first let's just start with your family. Can you tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Artis",
      "time": "00:01:08",
      "upperBoundTime": "00:01:53",
      "content": "Well yes, I was raised by my mother and a father, about of them was Christians as far back as me can remember. My dad also a preacher, I'm a preacher's son. I was raised as a preacher's son. So I had one foot in the church house and one foot out three in the streets, hanging out with the fellas and what not."
    },
    {
      "speaker": "Artis",
      "time": "00:01:08",
      "upperBoundTime": "00:01:53",
      "content": "But they say it takes a village to raise a child, that's pretty much how I grew up. I got a collective of aunties and aunts that helped raise me. Sometimes I spent summers over here, spent summers over there doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:53",
      "upperBoundTime": "00:01:58",
      "content": "Where is this small town?"
    },
    {
      "speaker": "Artis",
      "time": "00:01:58",
      "upperBoundTime": "00:02:01",
      "content": "Oberlin."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:01",
      "upperBoundTime": "00:02:03",
      "content": "Oh yes I know Oberlin. Yeah that's a very small town."
    },
    {
      "speaker": "Artis",
      "time": "00:02:03",
      "upperBoundTime": "00:02:08",
      "content": "It's very small. Yeah. That's where I grew up at."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:08",
      "upperBoundTime": "00:02:12",
      "content": "And so were your parents together when you were growing up?"
    },
    {
      "speaker": "Artis",
      "time": "00:02:12",
      "upperBoundTime": "00:02:14",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:14",
      "upperBoundTime": "00:02:15",
      "content": "What about siblings?"
    },
    {
      "speaker": "Artis",
      "time": "00:02:15",
      "upperBoundTime": "00:02:19",
      "content": "Yeah I got a younger sister and a younger brother."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:19",
      "upperBoundTime": "00:02:20",
      "content": "What are their names?"
    },
    {
      "speaker": "Artis",
      "time": "00:02:20",
      "upperBoundTime": "00:02:39",
      "content": "My younger brother's name is Titus and my younger sister's name is Latrice. We all grew up in the house together. It was all family orientated. We do a lot of fishing and hunting growing up. Do a lot of things outside?"
    },
    {
      "speaker": "Marcus",
      "time": "00:02:39",
      "upperBoundTime": "00:02:49",
      "content": "Do you think it's accurate for me to characterize your coming up as being a situation where you felt loved and cared for by adults?"
    },
    {
      "speaker": "Artis",
      "time": "00:02:49",
      "upperBoundTime": "00:02:51",
      "content": "Oh yes very."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:51",
      "upperBoundTime": "00:02:58",
      "content": "What about school?"
    },
    {
      "speaker": "Artis",
      "time": "00:02:58",
      "upperBoundTime": "00:03:32",
      "content": "Oh man school was fun. I loved school. I wasn't a very popular guy but I had my portion of friends. I graduated a class of I think like 50, 52? There pretty much everybody I would consider my friends, even though I didn't socialize with some of them on an everyday basis."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:32",
      "upperBoundTime": "00:03:36",
      "content": "Is there a particular teacher you remember?"
    },
    {
      "speaker": "Artis",
      "time": "00:03:36",
      "upperBoundTime": "00:04:20",
      "content": "Oh yes Ms. Markentelle. She was one of my favorites. She showed me the attention and love I guess I needed as a child. She made me feel like she really cared about me. She was at my graduation. I think she, what grade, I met her my fifth or sixth grade year but it seemed like she was there every year no matter if she was teaching me or not. She was like so she took me for some reason. She was the first person that hugged me when I crossed when I got my diploma."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:20",
      "upperBoundTime": "00:04:30",
      "content": "Yeah what about the folks who still come up and see you or any folks from high school who you're still in touch with?"
    },
    {
      "speaker": "Artis",
      "time": "00:04:30",
      "upperBoundTime": "00:04:49",
      "content": "Oh yeah I got some friends that I stay in touch with. I don't get visits as often as I used to. I've got a couple of girlfriends I still communicate with. Basically that' about it."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:49",
      "upperBoundTime": "00:04:58",
      "content": "Actually that was my next question so what about girlfriends?"
    },
    {
      "speaker": "Artis",
      "time": "00:04:58",
      "upperBoundTime": "00:05:12",
      "content": "I had a few. Going back to my eighteenth year, there's this from Alexandria I used to date. Me and her still communicate."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:12",
      "upperBoundTime": "00:05:15",
      "content": "Tell me about her."
    },
    {
      "speaker": "Artis",
      "time": "00:05:15",
      "upperBoundTime": "00:06:06",
      "content": "She come from, she's a very sweet girl. She come from also a family, her mother and father was together all her life. Her family was bigger than mine. She had more siblings. She was the baby. Her mother just loved me. I was one of her first boyfriends. And her daddy liked me."
    },
    {
      "speaker": "Artis",
      "time": "00:05:15",
      "upperBoundTime": "00:06:06",
      "content": ""
    },
    {
      "speaker": "Artis",
      "time": "00:05:15",
      "upperBoundTime": "00:06:06",
      "content": "He was one of the, I want to say a mentor that I didn't listen to our shoot out. He was giving me advice on as far as what decisions to make at my age and I still didn't listen."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:06",
      "upperBoundTime": "00:06:08",
      "content": "Any children?"
    },
    {
      "speaker": "Artis",
      "time": "00:06:08",
      "upperBoundTime": "00:06:10",
      "content": "No, no children."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:10",
      "upperBoundTime": "00:06:23",
      "content": "So I really do love small towns in Louisiana like traveling through and seeing but I've never been to Oberlin. I have a rough idea where it is. But I'd like to have a picture in my mind of your neighborhood."
    },
    {
      "speaker": "Artis",
      "time": "00:06:23",
      "upperBoundTime": "00:06:26",
      "content": "Oh yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:26",
      "upperBoundTime": "00:06:32",
      "content": "Yeah. Can you describe let's say the two of us are sitting on your front porch looking out on an afternoon, paint me a picture."
    },
    {
      "speaker": "Artis",
      "time": "00:06:32",
      "upperBoundTime": "00:06:56",
      "content": "Okay we're sitting on my porch. You've got big trees squirrels running around in the yard. You've got dogs barking. It's a bunch of animals it's like it's a bunch of green. Trees. Grass. People walking through the neighborhood might be barefooted."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:56",
      "upperBoundTime": "00:07:00",
      "content": "Are there houses around?"
    },
    {
      "speaker": "Artis",
      "time": "00:07:00",
      "upperBoundTime": "00:07:31",
      "content": "Oh yeah. We've got houses. The street I lived on I think it had about four or five houses on that street. Not far apart. We lived on I think maybe like an acre. The house next to us was on an acre. Somehow houses were on an acre or two. No fences. We ain't have no fences. So you go from one yard to the next."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:31",
      "upperBoundTime": "00:07:33",
      "content": "Everybody knew everybody."
    },
    {
      "speaker": "Artis",
      "time": "00:07:33",
      "upperBoundTime": "00:07:36",
      "content": "Yeah everybody knew everybody. Small town."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:36",
      "upperBoundTime": "00:07:39",
      "content": "Was it integrated racially?"
    },
    {
      "speaker": "Artis",
      "time": "00:07:39",
      "upperBoundTime": "00:08:15",
      "content": "No well the section that I grew up in is called the Quarters which was the black section of Oberlin. The white section was uptown over by the courthouse. They had sidewalks. We don't have sidewalks in our neighborhood but the white section all of them had sidewalks. That would be the difference when you go from one neighborhood to the next. But everybody still have trees and walk around."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:15",
      "upperBoundTime": "00:08:19",
      "content": "What about your high school?"
    },
    {
      "speaker": "Artis",
      "time": "00:08:19",
      "upperBoundTime": "00:08:45",
      "content": "Oh yeah it's integrated. Whites and blacks. We all got along. Most of the racial tension came from the generation before which was their mom and dad so as far as the children we all got along. Some of the students took to their upbringing, as far as how their mother and father was raising them as far as the racism, racial barrier or whatever."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:45",
      "upperBoundTime": "00:09:06",
      "content": "Sure. So I want to know a bit more about, so school was good. You graduated from high school. What else did you do in your spare time coming up as a teenager? What did you do for fun?"
    },
    {
      "speaker": "Artis",
      "time": "00:09:06",
      "upperBoundTime": "00:09:34",
      "content": "Hunting and fishing. Playing sports. I played sports. Basketball, football, track and field. I played all that. Outside of that though fishing and hunting that's stuff I enjoyed doing. That's basically about it. Hanging out with the fellas."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:34",
      "upperBoundTime": "00:09:42",
      "content": "Sure. Any kind of trouble with the law prior to this?"
    },
    {
      "speaker": "Artis",
      "time": "00:09:42",
      "upperBoundTime": "00:09:52",
      "content": "No this is my first time in trouble. First time in trouble. I never was a trouble maker. I got along with everybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:52",
      "upperBoundTime": "00:10:03",
      "content": "So let's do this. You never kicked out of school?"
    },
    {
      "speaker": "Artis",
      "time": "00:10:03",
      "upperBoundTime": "00:10:04",
      "content": "Never kicked out of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:04",
      "upperBoundTime": "00:10:15",
      "content": "So this is a little bit atypical right. Because in most cases there's a little bit of a tapping out. Somebody's gone down the wrong path here. For you it doesn't sound like that."
    },
    {
      "speaker": "Artis",
      "time": "00:10:15",
      "upperBoundTime": "00:11:18",
      "content": "Well what this my situation was I got started hanging out with a group of friends. Of course everybody upbringing wasn't the same. So the group of friends I had it was kind of diverse, like my cousin he was one of the ones that I hung out with regularly. He was raised by a single parent. He knew his dad but he wasn't living in the house together. So his perspective on things is quite different from mine."
    },
    {
      "speaker": "Artis",
      "time": "00:10:15",
      "upperBoundTime": "00:11:18",
      "content": "And I had another partner of mine I used to hang out with. His mom and dad was together but they wasn't Christians. So that was another perspective. We had different influences that we was under. Started hustling, selling drugs and smoking weed, and drinking alcohol. Just experiencing those things that we see the older generation doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:18",
      "upperBoundTime": "00:11:26",
      "content": "So yeah so drugs and alcohol was that part of your life? I mean aside from hustling with it, were you using?"
    },
    {
      "speaker": "Artis",
      "time": "00:11:26",
      "upperBoundTime": "00:11:30",
      "content": "Yeah I was smoked weed and drank."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:30",
      "upperBoundTime": "00:11:33",
      "content": "Do you think it would ever be something that you would think of as a problem?"
    },
    {
      "speaker": "Artis",
      "time": "00:11:33",
      "upperBoundTime": "00:12:28",
      "content": "Of course. I mean smoking weed and drinking alcohol it alters the decision making process. I think it would do more harm than good in your life to be abusing either substance, due to the fact that it take on your decision making or your perception of what's going on around, your reality of it impairs your judgment. That's one of the harmful ways that I think, or one of the things I think that should be the reason that you're not using."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:28",
      "upperBoundTime": "00:12:39",
      "content": "Well actually said so let me ask you about that. Let's say this had not happened. I imagine you've spent a bit of time thinking about what your life could have been. Paint me a picture about that. What do you think you would have been doing?"
    },
    {
      "speaker": "Artis",
      "time": "00:12:39",
      "upperBoundTime": "00:13:12",
      "content": "Okay well at the time I was considering, I had three options. I either was going to go to service to help pay for my schooling, or I was going to get a good job to help pay for my schooling, or I was going to do my barber business, and get my barber license. That was a three options I was considering. I hadn't made my mind up yet. Like I said I just graduated in May and three months later I was locked up."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:12",
      "upperBoundTime": "00:13:19",
      "content": "Yeah almost around this time, right? The end of July?"
    },
    {
      "speaker": "Artis",
      "time": "00:13:19",
      "upperBoundTime": "00:13:39",
      "content": "And I would envision that I would be successful in either one of those areas. Either I would have been retired from the service and had my career going or I'd have been a successful small business owner."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:39",
      "upperBoundTime": "00:13:45",
      "content": "Yeah. What about your siblings? What do they do now?"
    },
    {
      "speaker": "Artis",
      "time": "00:13:45",
      "upperBoundTime": "00:14:01",
      "content": "Oh my sister, she's been working for a casino since I've been locked up. She's getting ready retire from there. My brother is working. He's trying to get it right. He's getting older."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:01",
      "upperBoundTime": "00:14:02",
      "content": "He's an older sibling?"
    },
    {
      "speaker": "Artis",
      "time": "00:14:02",
      "upperBoundTime": "00:14:14",
      "content": "No I'm the oldest. I'm the oldest out of the three."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:14",
      "upperBoundTime": "00:14:17",
      "content": "Do you see yourself obviously with a family I would imagine?"
    },
    {
      "speaker": "Artis",
      "time": "00:14:17",
      "upperBoundTime": "00:14:40",
      "content": "Yes indeed. Yeah she, the chick I was telling you about earlier one of my childhood girlfriends, she used to tell me, \"You know you got to hurry up and come home. I'm getting too old to be talking about making babies.\" But yeah I probably would have had some kids by now for sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:40",
      "upperBoundTime": "00:14:54",
      "content": "If you had to identify one, it's very rarely one thing, but if you have to identify a main reason that you ended up here."
    },
    {
      "speaker": "Artis",
      "time": "00:14:54",
      "upperBoundTime": "00:14:59",
      "content": "Being naive. Not knowing, not listening."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:59",
      "upperBoundTime": "00:15:12",
      "content": "Did you, firearms always play a role in these things. Did you feel the need to have a firearm?"
    },
    {
      "speaker": "Artis",
      "time": "00:15:12",
      "upperBoundTime": "00:15:15",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:15",
      "upperBoundTime": "00:15:17",
      "content": "Did you have a firearm?"
    },
    {
      "speaker": "Artis",
      "time": "00:15:17",
      "upperBoundTime": "00:15:55",
      "content": "Yeah, I have shotguns and rifles, stuff that I hunted with but as far as around pistols, knives, and all that, I didn't have a need for all that. Of course that in my neighborhood we grew up in, we had fights. I fought a lot but at the end of the day everyone was friends after that. Like one of the guys that supports me now, my friend from my childhood. Man, me and him used to fight all the time, get suspended from school, come home and hang out together because we the only two in the neighborhood anyway. Everybody else was at school."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:55",
      "upperBoundTime": "00:15:57",
      "content": "But these fights didn't involve weapons, right?"
    },
    {
      "speaker": "Artis",
      "time": "00:15:57",
      "upperBoundTime": "00:15:59",
      "content": "No, no."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:59",
      "upperBoundTime": "00:16:05",
      "content": "Tell me about being given a life without parole sentence at the age of 18."
    },
    {
      "speaker": "Artis",
      "time": "00:16:05",
      "upperBoundTime": "00:16:31",
      "content": "Man, that's kind of, it didn't slam me all at first because all this was all new to me and I didn't think I would ever have to do this much time. I'd thought I'd been home, so it's kind of gradually built up on me."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:31",
      "upperBoundTime": "00:16:36",
      "content": "At what point do you think you fully understood the?"
    },
    {
      "speaker": "Artis",
      "time": "00:16:36",
      "upperBoundTime": "00:17:22",
      "content": "The severity of my, probably when I got up here. Probably maybe '98, '99 probably in 2000, year 2000. Going through different courts, after courts, that's when it starts to be like, \"Hey man, this situation you're in.\" Then being around guys that done twenty, thirty, forty years and just looking at my surroundings I'm like, \"Man I'm in a hell of a situation.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:17:22",
      "upperBoundTime": "00:17:57",
      "content": "I'm going to ask you about your first few days and months here, but before I get to that will you sort of go to the before this happened part of your life. Is there something that you think might be important about your life story that I didn't ask you about? Something that you think should be part of that picture?"
    },
    {
      "speaker": "Artis",
      "time": "00:17:57",
      "upperBoundTime": "00:18:54",
      "content": "Well let me see. Well maybe coming up I think if I had someone really take the time out to really explain why not to do certain things because my Pops he was more of a \"Do as I say, not as I do,\" parent and I didn't understand a lot of the reasons why not to do certain things. So I went and figured out and found out for myself. That's what led me to get off into certain things. But other than that, I can't think of anything that."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:54",
      "upperBoundTime": "00:19:03",
      "content": "So one of the things that I think you're talking about, as the oldest child too, is maybe just missing a positive adult role model."
    },
    {
      "speaker": "Artis",
      "time": "00:19:03",
      "upperBoundTime": "00:19:16",
      "content": "Yeah exactly. The influences that I was under I probably wouldn't have been under if my pops would have had the time to be able to really explain or make me understand."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:16",
      "upperBoundTime": "00:19:19",
      "content": "What did he do for a living?"
    },
    {
      "speaker": "Artis",
      "time": "00:19:19",
      "upperBoundTime": "00:19:23",
      "content": "Oh he did some odd jobs."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:23",
      "upperBoundTime": "00:19:25",
      "content": "You said he was a preacher but what else did him."
    },
    {
      "speaker": "Artis",
      "time": "00:19:25",
      "upperBoundTime": "00:19:45",
      "content": "Yeah. He worked for the city for a long time until he got into that motorcycle accident that broke his back, and then he started drawing disability. But before the disability he was working for the city. They'd drive around in big dump trucks and they'd cut trees and all kinds of city."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:45",
      "upperBoundTime": "00:19:46",
      "content": "What about your mom?"
    },
    {
      "speaker": "Artis",
      "time": "00:19:46",
      "upperBoundTime": "00:20:05",
      "content": "She worked too. She had several jobs too coming up before she got a stable job. They did all kinds of stuff. I remember mama worked on a tree farm. Whatever they could to earn money, they did it."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:05",
      "upperBoundTime": "00:20:09",
      "content": "Did you ever get into motorcycles?"
    },
    {
      "speaker": "Artis",
      "time": "00:20:09",
      "upperBoundTime": "00:20:31",
      "content": "Yeah. I had my first little motorcycle was a little 50. My older cousin he had outgrown it and I was coming up in the generation behind him, so they passed it on to me. That was a culture I come from. Dirt bikes. Four wheelers. Three wheelers, horses."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:31",
      "upperBoundTime": "00:20:37",
      "content": "Do you remember the last bike you had?"
    },
    {
      "speaker": "Artis",
      "time": "00:20:37",
      "upperBoundTime": "00:20:43",
      "content": "Oh yeah. It was a 70, a little dirt bike 70. And I had a four wheeler."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:43",
      "upperBoundTime": "00:20:43",
      "content": "And horses."
    },
    {
      "speaker": "Artis",
      "time": "00:20:43",
      "upperBoundTime": "00:21:04",
      "content": "Yeah and horses. I love horses. My uncle had the horses. My older cousin, that's who I hung out with the most, he was one of the influences of course. That's how I got off into drinking and smoking."
    },
    {
      "speaker": "Artis",
      "time": "00:20:43",
      "upperBoundTime": "00:21:04",
      "content": ""
    },
    {
      "speaker": "Marcus",
      "time": "00:21:04",
      "upperBoundTime": "00:21:22",
      "content": "All right well so let's switch gears a little bit. Obviously one of the reasons that they wanted to chat with you is that a lot has happened since then and you clearly, we all are different people 23 years later."
    },
    {
      "speaker": "Artis",
      "time": "00:21:22",
      "upperBoundTime": "00:21:25",
      "content": "Most definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:25",
      "upperBoundTime": "00:21:32",
      "content": "And I'd like to learn a little bit about that transformation but could you just take me back for a second. I'm sure you remember the bus ride here."
    },
    {
      "speaker": "Artis",
      "time": "00:21:32",
      "upperBoundTime": "00:21:33",
      "content": "Oh man yes. Long."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:33",
      "upperBoundTime": "00:21:43",
      "content": "Yeah. Tell me about that. What's going on? Describe that kid. What's going through your mind? What kind of person is that?"
    },
    {
      "speaker": "Artis",
      "time": "00:21:43",
      "upperBoundTime": "00:22:07",
      "content": "Well, I can remember one of the things that was going through my mind because this is an unfamiliar situation to me. So what's going through my mind is all of things that I've heard, all of the things that certain people tell me that have been in this situation, different advice people was giving me."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:07",
      "upperBoundTime": "00:22:11",
      "content": "What was that advice?"
    },
    {
      "speaker": "Artis",
      "time": "00:22:11",
      "upperBoundTime": "00:22:27",
      "content": "About the culture. Adapting to the culture that was here at the time or the culture that was here at their time. They was giving me based upon on their knowledge everybody was giving me advice on how to adjust and how to go about doing things when I got here."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:27",
      "upperBoundTime": "00:22:29",
      "content": "But specifically what were they telling you?"
    },
    {
      "speaker": "Artis",
      "time": "00:22:29",
      "upperBoundTime": "00:22:44",
      "content": "Oh man. It was this, \"Look, man. Don't mess with nobody. Stay to yourself. Don't take no wooden nickels. Somebody try to offer you something, don't take that.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:22:44",
      "upperBoundTime": "00:22:49",
      "content": "Was it good advice?"
    },
    {
      "speaker": "Artis",
      "time": "00:22:49",
      "upperBoundTime": "00:23:49",
      "content": "Yeah. I would say but out of all the stories that they was telling me when I got here I was looking for something that really didn't present itself. I remember I got to the cell about, I had been here a week and I kind of I know I sat back and I figured everything out. See what was going on I said, \"Aw man. This is ain't as rough as I thought it was going to be.\" I said, \"I ain't going to have no problems.\" Because I was seeing that if you carried yourself as a man they was going to respect you like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:49",
      "upperBoundTime": "00:23:51",
      "content": "And tell me a little bit about what does that actually mean?"
    },
    {
      "speaker": "Artis",
      "time": "00:23:51",
      "upperBoundTime": "00:24:08",
      "content": "Well I mean that just means that you don't want to be no punk. You're not going to be no punk."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:08",
      "upperBoundTime": "00:24:18",
      "content": "So does that mean responding to any kind of insult with violence?"
    },
    {
      "speaker": "Artis",
      "time": "00:24:18",
      "upperBoundTime": "00:24:25",
      "content": "Yeah the culture here, I mean they had guys here that was trying to prey on the newcomers."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:25",
      "upperBoundTime": "00:24:29",
      "content": "Yeah. So how does that work?"
    },
    {
      "speaker": "Artis",
      "time": "00:24:29",
      "upperBoundTime": "00:25:05",
      "content": "Well I mean if they see that you're scare, they're going to press, they're going to abuse you. They're going to try to do everything they can. Whether its sex or some of them just play on you for commissary. You've got people playing on you for all kinds of different reasons. Whatever their vices is that's what they're going to use you for. And if you allow them to use you, then that's what they're going to do but that's like I said the statement of me saying that when you be a man, everybody going to respect you as a man."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:05",
      "upperBoundTime": "00:25:24",
      "content": "I hear that a lot and one of the things that also means is that you can get in trouble doing that. For fighting or whatever it is. It's kind of a Catch 22. Did you find yourself getting in trouble when you first got here?"
    },
    {
      "speaker": "Artis",
      "time": "00:25:24",
      "upperBoundTime": "00:25:55",
      "content": "No I didn't. I didn't have, my transition here, and it wasn't as rough as I thought it was going to be. Like I said everything, it was all new to me so everything that it was a gradual thing for me as far as doing time or whatever, I guess because everything was new to me because I was learning as I go."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:55",
      "upperBoundTime": "00:26:08",
      "content": "So what kind of person was that? I mean when you see some of the guys coming in, the 18 year olds, do you see yourself in them?"
    },
    {
      "speaker": "Artis",
      "time": "00:26:08",
      "upperBoundTime": "00:26:10",
      "content": "Yeah. Some of them yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:10",
      "upperBoundTime": "00:26:16",
      "content": "So what kind of a person is that? Describe the 18 year old Marcus Artis."
    },
    {
      "speaker": "Artis",
      "time": "00:26:16",
      "upperBoundTime": "00:26:49",
      "content": "I was the average eighteen year old. Energetic, I was off into the sports. I would hang out with the fellas and those that I thought was cool. And I kind of chose the people that I wanted to be friends with. I didn't let everybody in. Just young, energetic lost kid."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:49",
      "upperBoundTime": "00:26:56",
      "content": "Okay sure. So how are you specifically different now? In what ways are you different?"
    },
    {
      "speaker": "Artis",
      "time": "00:26:56",
      "upperBoundTime": "00:27:16",
      "content": "Oh well the time that I've done here, I've made the decision to make the best of my situation. Meaning to try to educate myself to learn the necessary things that need to get past this situation."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:16",
      "upperBoundTime": "00:27:17",
      "content": "Give me some examples."
    },
    {
      "speaker": "Artis",
      "time": "00:27:17",
      "upperBoundTime": "00:27:59",
      "content": "Calvin Duncan. Law class. That was one of my efforts towards that end. I knew I needed to educate myself in this area in order to maybe win my case or gain my freedom. So that's one of the ways, that's one of the things that I did to educate myself. Also I've gotten into schools, carpentry, but whatever I thought that, I do cut hair here."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:59",
      "upperBoundTime": "00:28:03",
      "content": "Without ever getting a barbers license."
    },
    {
      "speaker": "Artis",
      "time": "00:28:03",
      "upperBoundTime": "00:28:57",
      "content": "Well actually that's still in the air right now. They're supposed to start a barber school. So my name is in there too. I'm hoping that they do. That would be a plus. If I could get my barber license I go back home, before I'm getting out of here, that would be a plus too. But that's how I spent my time. Hanging around with the guys that's involved in the community in a positive way."
    },
    {
      "speaker": "Artis",
      "time": "00:28:03",
      "upperBoundTime": "00:28:57",
      "content": "Church, different programs, they have a substance abuse program, anger management program 100 hours. Anything I thought that would make a better me that's what I was off into. That's what I wanted."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:57",
      "upperBoundTime": "00:28:59",
      "content": "Would you say that's still the way you live your life?"
    },
    {
      "speaker": "Artis",
      "time": "00:28:59",
      "upperBoundTime": "00:29:02",
      "content": "Oh yeah. Most definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:02",
      "upperBoundTime": "00:29:04",
      "content": "Tell me about a typical day. What's your typical day like? When you get up in the morning?"
    },
    {
      "speaker": "Artis",
      "time": "00:29:04",
      "upperBoundTime": "00:29:07",
      "content": "Oh it's full."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:07",
      "upperBoundTime": "00:29:10",
      "content": "I mean like if we weren't interviewing you right now, how would your day have gone today?"
    },
    {
      "speaker": "Artis",
      "time": "00:29:10",
      "upperBoundTime": "00:29:25",
      "content": "Okay well it's like this morning I got up and went straight to the finish up some paperwork I had to do concerning the club's concession. I'm doing the books like a slight secretary maybe accounting work."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:25",
      "upperBoundTime": "00:29:26",
      "content": "Which club?"
    },
    {
      "speaker": "Artis",
      "time": "00:29:26",
      "upperBoundTime": "00:30:02",
      "content": "New Destiny. It's the church. After that I would spend maybe an hour or two there then I go to work. On the compound, I work at the silk screen. Then when count clears at twelve I come down and go back to the office. Because it's a day to day operation except on Thursday to do the books and make sure everything is caught up. Cook, clean, I do all that."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:02",
      "upperBoundTime": "00:30:04",
      "content": "You cook?"
    },
    {
      "speaker": "Artis",
      "time": "00:30:04",
      "upperBoundTime": "00:30:06",
      "content": "Yeah most definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:06",
      "upperBoundTime": "00:30:10",
      "content": "What do you cook? I assume you're cooking for yourself."
    },
    {
      "speaker": "Artis",
      "time": "00:30:10",
      "upperBoundTime": "00:30:16",
      "content": "Oh yeah. I cook steaks, pork chops, crawfish, shrimps, anything. If it can be cooked, I cook it."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:16",
      "upperBoundTime": "00:30:20",
      "content": "Where does all that come from? You eat that in the cafeteria?"
    },
    {
      "speaker": "Artis",
      "time": "00:30:20",
      "upperBoundTime": "00:30:22",
      "content": "No. In the club concession."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:22",
      "upperBoundTime": "00:30:24",
      "content": "Oh I see."
    },
    {
      "speaker": "Artis",
      "time": "00:30:24",
      "upperBoundTime": "00:30:28",
      "content": "New Destiny, the church has a concession that supports the church."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:28",
      "upperBoundTime": "00:30:34",
      "content": "I've got you. Okay so that's how they raise some money. What's your favorite thing to cook?"
    },
    {
      "speaker": "Artis",
      "time": "00:30:34",
      "upperBoundTime": "00:30:50",
      "content": "Cornbread. I like cooking that cornbread. Then I cut hair, so that's my time is consumed every day. If I'm not doing that I'm cutting hair."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:50",
      "upperBoundTime": "00:30:52",
      "content": "Sure do you have all your own equipment?"
    },
    {
      "speaker": "Artis",
      "time": "00:30:52",
      "upperBoundTime": "00:30:55",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:55",
      "upperBoundTime": "00:31:09",
      "content": "So you mentioned the New Destiny, you've got to some other skills that you've gotten under your belt, and barbershop stuff. What other organizations have you been a part of earlier on here at Angola?"
    },
    {
      "speaker": "Artis",
      "time": "00:31:09",
      "upperBoundTime": "00:31:11",
      "content": "Malachi Dads."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:11",
      "upperBoundTime": "00:31:23",
      "content": "Okay which is interesting to me so you don't have children and Malachi Dads from my understanding is learning how to parent from prison. So how is that helped you? I'm sure it's helped you a little bit."
    },
    {
      "speaker": "Artis",
      "time": "00:31:23",
      "upperBoundTime": "00:31:32",
      "content": "Yes I mean it helps me, I've got nieces and nephews that I exercise that mentor, that fatherhood over them."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:32",
      "upperBoundTime": "00:31:35",
      "content": "So how has that helped you?"
    },
    {
      "speaker": "Artis",
      "time": "00:31:35",
      "upperBoundTime": "00:31:45",
      "content": "Well it enabled me to learn to communicate better with them. It helped me as an overall person."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:45",
      "upperBoundTime": "00:31:58",
      "content": "Can you give me a specific example about some of the things that you do in Malachi dads? How specifically has it helped you communicate with your nieces and nephews?"
    },
    {
      "speaker": "Artis",
      "time": "00:31:58",
      "upperBoundTime": "00:32:43",
      "content": "Well just knowing more about myself for one and knowing how to communicate with the younger generation. Being able to spend time with them and the different programs they got like the Returning Hearts program. Just being able to connect with them on their level if that answers your question."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:43",
      "upperBoundTime": "00:32:48",
      "content": "Sure. So how often do you guys meet in Malachi Dads?"
    },
    {
      "speaker": "Artis",
      "time": "00:32:48",
      "upperBoundTime": "00:32:58",
      "content": "Well they have a class annually. There's annually class. It's not a per say meeting that we go to."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:58",
      "upperBoundTime": "00:33:01",
      "content": "But there's a curriculum, right?"
    },
    {
      "speaker": "Artis",
      "time": "00:33:01",
      "upperBoundTime": "00:33:08",
      "content": "Yeah it's different. It's kind of like school. They got different graduating classes."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:08",
      "upperBoundTime": "00:34:03",
      "content": "So when you look back after all these years, let's say that you've explained the circumstances that you are a part of this thing but you ended up getting all the blame for it but by Louisiana law it's also reasonable to assume that you could have been convicted as a principal to the crim."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:08",
      "upperBoundTime": "00:34:03",
      "content": "When you look back on your role in this and then the victim and all of the things that have happened because when these things happen it's a ripple effect that gets everybody involved. How do you, it's 23 years later, I mean do you .is it remorse? Is it regret? Is it anger? I'm trying to get a sense of how you make sense of that now?"
    },
    {
      "speaker": "Artis",
      "time": "00:34:03",
      "upperBoundTime": "00:34:48",
      "content": "Well what I think about the situation is I go through a range of emotions. Being remorseful. Being angry. Mostly in my cell. That the effect it had on not just me, just the people that are around me, the victim's family just everybody. Everybody that was involved. This really was a lose/lose situation."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:48",
      "upperBoundTime": "00:34:53",
      "content": "In your own family, who do you think was most affected by you coming to prison?"
    },
    {
      "speaker": "Artis",
      "time": "00:34:53",
      "upperBoundTime": "00:34:56",
      "content": "My mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:56",
      "upperBoundTime": "00:34:57",
      "content": "So tell me a little bit about that."
    },
    {
      "speaker": "Artis",
      "time": "00:34:57",
      "upperBoundTime": "00:36:44",
      "content": "Me and my mother was closer than me and my father was. I guess being that the situation between them and their relationship that's usually the, how do they say that? That love where the daughters are closest to the father, and the sons are closer to the mother. She probably, well I know she wanted me to make better decisions than I did make."
    },
    {
      "speaker": "Artis",
      "time": "00:34:57",
      "upperBoundTime": "00:36:44",
      "content": "She used to always tell me, \"Boy, them boys don't love you. I don't know why you hang out with them. Woop woop this.\" And I would ignore all that saying that, \"Mom you don't know. You don't know like I know. They love me. These my boys.\" But not. Just being naive."
    },
    {
      "speaker": "Artis",
      "time": "00:34:57",
      "upperBoundTime": "00:36:44",
      "content": "But when I got into this trouble it seemed like my mother's health was going down. Dealing with all the stress and the social embarrassment of having a child locked up. Just the stress of having a child, and being separated from a child or losing a child to the system."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:44",
      "upperBoundTime": "00:36:46",
      "content": "Are your parents still alive?"
    },
    {
      "speaker": "Artis",
      "time": "00:36:46",
      "upperBoundTime": "00:36:48",
      "content": "I just recently lost my mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:48",
      "upperBoundTime": "00:36:55",
      "content": "Oh I'm sorry. Do you remember your last interaction with her?"
    },
    {
      "speaker": "Artis",
      "time": "00:36:55",
      "upperBoundTime": "00:37:21",
      "content": "Yes she had just came to visit me about a week prior. And maybe the following weekend that one of my family members took her to the casino and she died in a casino. But my sister worked there."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:21",
      "upperBoundTime": "00:37:24",
      "content": "So kind of unexpectedly."
    },
    {
      "speaker": "Artis",
      "time": "00:37:24",
      "upperBoundTime": "00:37:44",
      "content": "Well not exactly unexpectedly. We knew that her health was failing. She was going and taking dialysis three times a week. She was having heart trouble, and she wasn't strong enough to go through the surgery that she needed. She was relying on medication."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:44",
      "upperBoundTime": "00:37:49",
      "content": "What did you guys talk about in that moment?"
    },
    {
      "speaker": "Artis",
      "time": "00:37:49",
      "upperBoundTime": "00:38:00",
      "content": "Just not very much. Just expressed our love for one another. We ate. We didn't do much talking."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:00",
      "upperBoundTime": "00:38:02",
      "content": "Do you get to cook for her when she comes?"
    },
    {
      "speaker": "Artis",
      "time": "00:38:02",
      "upperBoundTime": "00:38:08",
      "content": "No I didn't get a chance to cook. She had got some fish and salad. I didn't get a chance to cook for her."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:08",
      "upperBoundTime": "00:38:23",
      "content": "I've heard some guys say that it's one thing for me to have to deal with every day being in here but what's really difficult is watching my family go through all this stuff."
    },
    {
      "speaker": "Artis",
      "time": "00:38:23",
      "upperBoundTime": "00:38:27",
      "content": "Yeah that's what hurts me the most."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:27",
      "upperBoundTime": "00:38:30",
      "content": "I don't think people think about that when they think about the prison experience."
    },
    {
      "speaker": "Artis",
      "time": "00:38:30",
      "upperBoundTime": "00:38:54",
      "content": "I mean that's what hurts me the most, just seeing the effect it have on them. Not only in my community but my family structure there's a big hole that, the big void that I left."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:54",
      "upperBoundTime": "00:39:09",
      "content": "Sure. So things have changed a lot. Everyone says that Angola is not the way that it used to be and that things are much better here but it's still prison. What's the worst part of the experience now for you?"
    },
    {
      "speaker": "Artis",
      "time": "00:39:09",
      "upperBoundTime": "00:39:20",
      "content": "Just being away from family. If that answers your question."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:20",
      "upperBoundTime": "00:39:27",
      "content": "Oh sure."
    },
    {
      "speaker": "Artis",
      "time": "00:39:27",
      "upperBoundTime": "00:39:51",
      "content": "Just this whole culture, this whole like said the whole dehumanizing experience of being in the system. That's probably the worst part of this situation."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:51",
      "upperBoundTime": "00:40:28",
      "content": "Yeah. So you've seen some of the changes that have been coming around for those who were convicted of something that happened before their 18th birthday. Now that's left folks like you who were six months into their 18th birthday in a really sort of odd situation where it really does it feel arbitrary to you?"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:51",
      "upperBoundTime": "00:40:28",
      "content": "Does it make you feel hopeful? How do you feel about some of those changes for juvenile reform?"
    },
    {
      "speaker": "Artis",
      "time": "00:40:28",
      "upperBoundTime": "00:41:06",
      "content": "Well I'm very hopeful. Looking at this situation and how it affects me it inspires me to keep facing forward, keep working towards that end. As I see the changes that's kind of how it motivates me, keep me motivated. Think that eventually I'm going to achieve."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:06",
      "upperBoundTime": "00:41:16",
      "content": "Do you see a clear difference between people who are kind of giving up on the idea that they'll ever get out and those who just kind of keep that light going?"
    },
    {
      "speaker": "Artis",
      "time": "00:41:16",
      "upperBoundTime": "00:41:59",
      "content": "I mean man in their actions you can see the guys that have given up. That's part of the part of the prison that a lot of people don't see. You can go out on the yard you see guys falling out on mojo. Just like you go through the neighborhood, you've got your bums, you've got your drug addicts. They got people instead of picking up positive things they pick up negative things to try to escape their reality or their perspective on their reality."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:59",
      "upperBoundTime": "00:42:33",
      "content": "Yeah sure. So what's your coping mechanism? Everybody has to come up with some way of dealing with this very difficult and sometimes a hopeless feeling of being here for so long with a life sentence with a sentence essentially saying this is a death sentence? What is it for you and how do you cope with it?"
    },
    {
      "speaker": "Artis",
      "time": "00:42:33",
      "upperBoundTime": "00:44:02",
      "content": "Well for me I tried several different ways of coping with my situation. Sports. But first even resorting back to how I was smoking weed but after realizing, after the high had gone, after the whole season is over with, I'm still faced with the harsh reality of being in a situation and having to do something to get out and going down that path is counterproductive. Why would I continue to do something that contributes to me being here if I'm trying to get out?"
    },
    {
      "speaker": "Artis",
      "time": "00:42:33",
      "upperBoundTime": "00:44:02",
      "content": "So that really was one of the things that made me switch over to doing things differently trying something new. Which is getting off into the different programs. Educating myself. Get involved. Get back in church."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:02",
      "upperBoundTime": "00:44:13",
      "content": "Yeah I mean I think what you see is the idea that people decide, \"I'm just going to live a meaningful life here. This is also my community.\""
    },
    {
      "speaker": "Artis",
      "time": "00:44:13",
      "upperBoundTime": "00:44:28",
      "content": "I'm not dead. If I'm going to do time, I might as well do the best time I can."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:28",
      "upperBoundTime": "00:44:36",
      "content": "So of all the things that you've accomplished over the last 20 odd years, what are you most proud of?"
    },
    {
      "speaker": "Artis",
      "time": "00:44:36",
      "upperBoundTime": "00:45:50",
      "content": "I've thought about the question and I couldn't, maybe finishing carpentry school. I felt like that was a big part of the things that would contribute to me being successful on the outside. That was one of those things. Finishing experiencing God. I think it was eighteen in that program. And taking that I was a peer educator here for a little while. I was certified through the Red Cross, a peer educator on HIV and AIDS, I was proud of that too. That's basically it."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:50",
      "upperBoundTime": "00:46:06",
      "content": "Yeah. That's quite a bit. So I mean these are the kinds of things that a parole board, a pardon board in your case, would be very interested in knowing about. Are there other things that you would want the pardon board to know about you other than the things that you've shared with me already?"
    },
    {
      "speaker": "Artis",
      "time": "00:46:06",
      "upperBoundTime": "00:46:56",
      "content": "Yeah I think I would just express to them that I would be more able or equipped to be successful in today's society with what I've gained with my incarceration. The knowledge, the things I've learned, my overall perspective on what it is to be a productive citizen in today's society."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:56",
      "upperBoundTime": "00:47:29",
      "content": "So is there something I should have asked you that I didn't? Trying to explain a little bit about why we're doing this and what we're doing. Is there something about the experience that you've gone through that you think people may not know that much about that's important to know."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:56",
      "upperBoundTime": "00:47:29",
      "content": "Something about perhaps life without parole that's important for the legislative, the legislature to know or for people in general to know? I mean something I should have asked that I didn't."
    },
    {
      "speaker": "Artis",
      "time": "00:47:29",
      "upperBoundTime": "00:47:41",
      "content": "I can't really think of anything."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:41",
      "upperBoundTime": "00:48:07",
      "content": "Okay then I'm going to end with a very difficult question then okay? So how much time is enough time? How much time is enough time? If we're going to do away with life without parole, what should it be? What's a reasonable amount of time for something like second degree murder?"
    },
    {
      "speaker": "Artis",
      "time": "00:48:07",
      "upperBoundTime": "00:49:02",
      "content": "Man I would say that probably would okay if we had probably about 20 years. I would say 20 years. And also I would add to that it would be based on the individual, the progress or the situation of the individual because you' got some guys that's dealing with mental issues and they need professional help instead of just locking them up and throwing away the key or whatever. And you got some guys that just made mistakes under the influence of drugs and alcohol."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:02",
      "upperBoundTime": "00:49:21",
      "content": "Yeah I mean so I think what let me make it a bit more fair of a question. So obviously each individual case would have to be looked at but there also has to be some kind of notion of retribution, right? Of punishment. You can't just say well he's and that's the thing I mean what is that threshold? What's a reasonable amount of time before we look at you again? I guess that's what I'm asking."
    },
    {
      "speaker": "Artis",
      "time": "00:49:21",
      "upperBoundTime": "00:49:25",
      "content": "Man I mean I said 20 but I'm thinking man in between 10 and 20."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:25",
      "upperBoundTime": "00:49:27",
      "content": "Yeah."
    },
    {
      "speaker": "Artis",
      "time": "00:49:27",
      "upperBoundTime": "00:49:58",
      "content": "That's a lot of time being away, being taken. That's more than enough time. I mean because you got you can go to college for four years and be a totally different person. When I say that the education that you need to make the transformation into a better person it don't take that much time. But ten years? In between 10 and 20?"
    },
    {
      "speaker": "Marcus",
      "time": "00:49:58",
      "upperBoundTime": "00:50:00",
      "content": "Yeah. Okay."
    },
    {
      "speaker": "Artis",
      "time": "00:50:00",
      "upperBoundTime": "00:50:13",
      "content": "I think that would be a significant amount of time to make a difference or at least to know if that person is ready to reenter society. See what he does in those ten years."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:13",
      "content": "Okay. I think that's a good place to stop."
    }
  ]
}
