{"name":"","transcript":[{"content":"Melvin Davis_Transcription REDACTIONS FINAL"},{"speaker":"Melvin","time":"00:00:00-0","content":"My name is Melvin Davis. I'm currently from New Orleans. I was convicted in 1996 of second-degree murder."},{"speaker":"Marcus","time":"00:00:39-3","content":"How old were you at the time?"},{"speaker":"Melvin","time":"00:00:41-2","content":"Twenty."},{"speaker":"Marcus","time":"00:00:43-7","content":"Okay."},{"speaker":"Melvin","time":"00:00:46-3","content":"Yeah. Four months actually until my twentieth birthday."},{"speaker":"Marcus","time":"00:00:48-0","content":"Okay so now how much time is it that you have served here at Angola?"},{"speaker":"Melvin","time":"00:00:50-8","content":"Twenty-two years here in Angola, twenty-four years total so far."},{"speaker":"Marcus","time":"00:00:55-7","content":"Okay two years in the parish. And, you told me earlier, you were convicted with your brother and somebody else. All of you are serving life sentences."},{"speaker":"Melvin","time":"00:01:02-8","content":"Yes."},{"speaker":"Marcus","time":"00:01:04-2","content":"Let me start by learning a little bit about you, it's the main point of this project. Can you tell me a little bit about your family and the folks who raised you?"},{"speaker":"Melvin","time":"00:01:14-7","content":"Oh yeah. My mom I was raised by my mom and my step dad. My biological father really was like a deadbeat to us. He wasn't really there for us. And I know that he used to beat my mom a lot. So I kind of like remember some of it but not all of it. Actually my stepfather, he was kind of like a hero to me."},{"speaker":"Marcus","time":"00:01:43-6","content":"When did he come in to your life?"},{"speaker":"Melvin","time":"00:01:45-4","content":"Oh when I was young when I was very young. At first we had our problems because I was trapped in between my dad and him. I leaning towards him, I started leaning towards him more after I got a basic understanding of as I started growing, I started understanding where he was at with what he wanted to teach us and what he wanted us to learn."},{"speaker":"Melvin","time":"00:01:45-4","content":"So I took a lot from him because he was actually an Evangelist and he used to preach a lot, we used to go to different gospel singers, church, and things like that. But he's a good man. I can give him have to tell him that that he actually was a good man."},{"speaker":"Marcus","time":"00:02:29-6","content":"And what was his relationship like with your mother?"},{"speaker":"Melvin","time":"00:02:33-1","content":"Oh beautiful."},{"speaker":"Marcus","time":"00:02:34-7","content":"So there wasn't any violence like there was with your father?"},{"speaker":"Melvin","time":"00:02:37-5","content":"No."},{"speaker":"Marcus","time":"00:02:41-0","content":"Okay, where in New Orleans did you grow up?"},{"speaker":"Melvin","time":"00:02:42-7","content":"Actually Uptown."},{"speaker":"Marcus","time":"00:02:44-7","content":"Where?"},{"speaker":"Melvin","time":"00:02:45-7","content":"On Camp St."},{"speaker":"Marcus","time":"00:02:48-3","content":"Camp and what?"},{"speaker":"Melvin","time":"00:02:49-7","content":"On Camp and Austerlitz."},{"speaker":"Marcus","time":"00:02:51-3","content":"Oh yeah."},{"speaker":"Melvin","time":"00:02:53-5","content":"Block over from Gerry Town."},{"speaker":"Marcus","time":"00:02:55-9","content":"So I was going to ask you to explain your neighborhood but I have a very good idea. So tell me about your siblings. You mentioned a brother but who else?"},{"speaker":"Melvin","time":"00:03:01-1","content":"Oh man. I have two sisters. I'd say both of them are older than me, but one is my baby sister. She's, Michelle is the youngest. Dan is the oldest. My brother Ronny is the oldest, my brother Danny is the second oldest, my brother Donald is the third oldest, and I'm the youngest out of them out of the boys."},{"speaker":"Marcus","time":"00:03:20-7","content":"Oh okay."},{"speaker":"Melvin","time":"00:03:25-2","content":"And me and my baby sister we were actually, I think, tighter than everybody else. Yeah, throughout the whole years even in childhood we was always close. Even now we are real close. Yeah."},{"speaker":"Marcus","time":"00:03:37-2","content":"So you and your brother are here. How about the other brothers? How have they fared?"},{"speaker":"Melvin","time":"00:03:44-1","content":"Oh they've fared real good. My brother Donald he works offshore. Actually he flies to New York if he works offshore. He'd been doing that for maybe for about twenty-four years now."},{"speaker":"Marcus","time":"00:03:53-8","content":"Wow."},{"speaker":"Melvin","time":"00:03:55-4","content":"He stays in the East. My other brother, Danny, he drives for some kind of movie company down in New Orleans and he owns some landscapes and he married a doctor out of Mississippi. She works in a hospital out in New Orleans east."},{"speaker":"Marcus","time":"00:04:14-6","content":"Are your parents still alive?"},{"speaker":"Melvin","time":"00:04:17-3","content":"Yeah hold up. My dad's dead, but my mom and my stepdad are still alive."},{"speaker":"Marcus","time":"00:04:20-9","content":"And they're together still?"},{"speaker":"Melvin","time":"00:04:22-6","content":"Yes."},{"speaker":"Marcus","time":"00:04:23-9","content":"Okay, great. Still living in Uptown?"},{"speaker":"Melvin","time":"00:04:27-7","content":"Actually they moved off of Camp Street and moved back into Seventeenth Ward on Green Street."},{"speaker":"Marcus","time":"00:04:34-9","content":"So is it fair to say that once your stepfather came into your life that you grew up knowing that there were adults in your life that and siblings, I suppose who cared for you or did you feel that you kind of had to make it on your own?"},{"speaker":"Melvin","time":"00:04:48-3","content":"I kind of felt like that at first that I had to make it on my own. I don't know, I'm going to say it was by my fault because I don't believe that he came into our lives to do us any wrong. But I was wanting so much for my real dad to be there and by him not being there that kind of made me have kind of like a negative attitude towards him because I was like since he was moved out of the way, he came in and like took something away that I had but I didn't have. But he replaced what I didn't have and he had what I needed and he was there for me so I can say that he did a good job."},{"speaker":"Marcus","time":"00:05:33-4","content":"How old were you when that change happened?"},{"speaker":"Melvin","time":"00:05:37-0","content":"I'll say I was maybe about nine."},{"speaker":"Marcus","time":"00:05:43-2","content":"So you're elder siblings, they'd kind of moved on by then in terms of."},{"speaker":"Melvin","time":"00:05:50-0","content":"Well no."},{"speaker":"Marcus","time":"00:05:51-6","content":"In terms of you're the oldest brother needing a father figure?"},{"speaker":"Melvin","time":"00:05:54-3","content":"Yeah."},{"speaker":"Marcus","time":"00:05:55-9","content":"I'm assuming there, six or seven years older than you. It's a different thing for a seventeen year old or sixteen year old than a nine year old and how'd you experience that change. Did your other siblings have trouble with the change?"},{"speaker":"Melvin","time":"00:06:09-0","content":"I would say maybe my oldest sister. I think she did, she kind of like but she fanned out."},{"speaker":"Marcus","time":"00:06:18-8","content":"How's your relationship with them all now?"},{"speaker":"Melvin","time":"00:06:26-5","content":"Actually it's great. It's great, but like I said I'm actually, I and my baby sister are really."},{"speaker":"Marcus","time":"00:06:33-2","content":"Still."},{"speaker":"Melvin","time":"00:06:37-2","content":"We're really close. But my broth my oldest sister and my two younger brothers are real close, but we yeah."},{"speaker":"Marcus","time":"00:06:42-4","content":"What is Ronny's relationship like with the rest of your family?"},{"speaker":"Melvin","time":"00:06:50-5","content":"I'd say it's kind of its good but it's not I would say it's like its good but it's not really as stable as mine is with them."},{"speaker":"Marcus","time":"00:07:01-2","content":"Have you had similar experiences in prison as in, are you both trustees? Have you both gone through the same kind of process or sometimes you see either best friends or siblings they come to prison and they were doing everything the same and then they just go off on totally different paths. How has it been for you compared to your brother?"},{"speaker":"Melvin","time":"00:07:18-0","content":"I would say that he made trustee and he's in Bible College."},{"speaker":"Marcus","time":"00:07:18-0","content":"Okay."},{"speaker":"Melvin","time":"00:07:26-2","content":"But I made trustee and I work downstairs in the library."},{"speaker":"Marcus","time":"00:07:31-1","content":"Okay."},{"speaker":"Melvin","time":"00:07:33-1","content":"But we're kind of like, because I'm heading towards fighting for freedom and he's venturing towards educating himself pastoral some kind of thing like that."},{"speaker":"Marcus","time":"00:07:45-5","content":"But sounds like both of you have taken advantage of things."},{"speaker":"Melvin","time":"00:07:48-8","content":"Yes."},{"speaker":"Marcus","time":"00:07:51-2","content":"Of doing well here. It just reminded of exactly where I met you because you were sitting in the law library. I knew it was somewhere here but now I know exactly where it was. So if you had to describe your friends growing up, what was your social life like outside of your family?"},{"speaker":"Melvin","time":"00:08:28-2","content":"I can say basically I was kind of like a loner. I didn't have too many people I could actually call my friends. But I had one in particular who was actually my friend. We kind of like grew up together. Sad to say he's in prison right now also but we actually grew up together."},{"speaker":"Marcus","time":"00:08:47-1","content":"Here in Angola?"},{"speaker":"Melvin","time":"00:08:48-5","content":"No, he's at Hunt. He was here but they shipped him to Hunt."},{"speaker":"Marcus","time":"00:08:51-3","content":"So aside from him, you said you had kind of kept to yourself. If you I think the baby sister I'm picking up on that being a very significant relationship in your life. Was there someone you felt that you could go and talk to about your problems coming up?"},{"speaker":"Melvin","time":"00:09:11-6","content":"I knew that it would be her and she actually told me that when this charge occurred that I could have come and talked to her. But I never gave her really the whole layout of everything. But it was kind of like too late for that."},{"speaker":"Marcus","time":"00:09:35-8","content":"What about school? How was school for you?"},{"speaker":"Melvin","time":"00:09:40-5","content":"That was kind of troubling. I never really had a real problem with learning, but it was just my I would say attention, attention span. I was kind of like way off into something else instead of really focusing on what I needed to be really focusing on. And cutting class, I did a lot of that. Put out of school, I got put out of school."},{"speaker":"Marcus","time":"00:10:05-4","content":"For cutting school?"},{"speaker":"Melvin","time":"00:10:07-0","content":"Yeah from cutting class and fighting."},{"speaker":"Marcus","time":"00:10:09-4","content":"Where were you in school?"},{"speaker":"Melvin","time":"00:10:10-9","content":"Well I went to me can't remember the exact street was on or Marengo, back down on number seven?"},{"speaker":"Marcus","time":"00:10:18-0","content":"Yeah."},{"speaker":"Melvin","time":"00:10:19-8","content":"I went to Sophie B. Wright on Napoleon and Prytania. I went downtown, I went to that was on Tuoro. And Bo Wheat on Laurel."},{"speaker":"Marcus","time":"00:10:34-4","content":"And what was the highest year of school that you completed?"},{"speaker":"Melvin","time":"00:10:37-1","content":"I would say the eighth grade."},{"speaker":"Marcus","time":"00:10:37-1","content":"So if you drop out of school at eighth grade, what are you doing?"},{"speaker":"Melvin","time":"00:10:43-8","content":"Actually I went to work. I went to work."},{"speaker":"Marcus","time":"00:10:46-8","content":"What were you doing?"},{"speaker":"Melvin","time":"00:10:51-8","content":"I was working as like what I don't know what it's called, maybe like a shorthand cook at a McDonald's in Kenner."},{"speaker":"Marcus","time":"00:10:57-0","content":"So you're working full time?"},{"speaker":"Melvin","time":"00:11:01-2","content":"Yeah you could say that, you could say that can I say this here?"},{"speaker":"Marcus","time":"00:11:03-6","content":"Yeah."},{"speaker":"Melvin","time":"00:11:03-6","content":"Actually when I had got this charge right here I had actually just got a job at McKenzie on Prytania. And I never got the opportunity to start one day of work. They actually called for me when I was in custody and told me I could come to work and I wanted to be a baker because I love to bake."},{"speaker":"Marcus","time":"00:11:23-4","content":"Well they're still there. So you got put out school at eighth grade, you're working at McDonald's in Kenner. Are you driving there?"},{"speaker":"Melvin","time":"00:11:36-1","content":"Well sometimes."},{"speaker":"Marcus","time":"00:11:38-9","content":"Did you have your own car?"},{"speaker":"Melvin","time":"00:11:42-1","content":"No I used to actually my baby sister let me used to use hers."},{"speaker":"Marcus","time":"00:11:44-1","content":"Any other jobs outside of McDonald's?"},{"speaker":"Melvin","time":"00:11:49-3","content":"I worked at Lamar's Landing. The river walk right outside I mean where the water fall outside by the river walk. I worked there for about maybe two years."},{"speaker":"Marcus","time":"00:12:00-3","content":"And at this point you're just working when you're twenty-one and this happens you're working with the idea that you're just going to keep working, right? At this point? College isn't in your future because."},{"speaker":"Melvin","time":"00:12:09-3","content":"No."},{"speaker":"Marcus","time":"00:12:13-6","content":"Okay, I get that. I still get are you getting into any kind of trouble once you left school and started working?"},{"speaker":"Melvin","time":"00:12:20-4","content":"Not really. But I was arrested for possession of stolen property."},{"speaker":"Marcus","time":"00:12:26-8","content":"Was that your first arrest?"},{"speaker":"Melvin","time":"00:12:30-4","content":"As an adult? Yeah."},{"speaker":"Marcus","time":"00:12:34-2","content":"Well what about let's start with the juvenile."},{"speaker":"Melvin","time":"00:12:38-9","content":"Juvenile I was arrested maybe twice."},{"speaker":"Marcus","time":"00:12:40-7","content":"What was that behind?"},{"speaker":"Melvin","time":"00:12:43-4","content":"Possession of stolen things and burglary, I believe."},{"speaker":"Marcus","time":"00:12:46-9","content":"Alright and as an adult? As an adult what was?"},{"speaker":"Melvin","time":"00:12:50-8","content":"The possession of a stolen vehicle and this charge here."},{"speaker":"Marcus","time":"00:12:56-7","content":"So this charge here obviously the most serious one and that's what's, changed the course of your life. When you look back on that time in your life and let's say that this particular charge didn't happen, how do you envision the rest of your life? How do you think it might have gone? I mean were you going down a wrong road anyway or were you?"},{"speaker":"Melvin","time":"00:13:27-6","content":"I can say honestly I could say it's a possibility that it would have turned out bad. But it's also a possibility that it would have been meant for the good also because I had work ethic about myself. I loved to work and I loved to bake and that's what I wanted to do."},{"speaker":"Melvin","time":"00:13:27-6","content":"So that's why I tried to get the job at McKenzie because I wanted to be a baker because actually my dad was a chef at the Marriott Hotel."},{"speaker":"Melvin","time":"00:13:27-6","content":"And he kind of taught me a few things. I used to go by his house and he used to teach me a few things, but actually I can say I wanted to be a baker and I think I would have fanned out that way than this here."},{"speaker":"Marcus","time":"00:14:15-6","content":"What about firearms? Were firearms fairly easy for you to access?"},{"speaker":"Melvin","time":"00:14:20-3","content":"I'd say that I'd seen them but I wasn't and I had one before but I got rid of it. I wasn't too much fond of violence."},{"speaker":"Marcus","time":"00:14:31-2","content":"And well if you've got a regular job and you're not supporting yourself doing drugs or anything then there's less of a need to have one, I guess, too. Wouldn't you say that?"},{"speaker":"Melvin","time":"00:14:42-3","content":"Yes."},{"speaker":"Marcus","time":"00:14:48-9","content":"Okay let me ask about drugs and alcohol. Was that part of your life?"},{"speaker":"Melvin","time":"00:14:53-7","content":"Alcohol, no. As for marijuana, yeah. Yeah, I would."},{"speaker":"Marcus","time":"00:14:58-6","content":"Was it something that was creating problems for you in your life?"},{"speaker":"Melvin","time":"00:15:01-1","content":"No I wouldn't say that because I wasn't just running behind drugs or anything like that. Females, yeah I would say that."},{"speaker":"Marcus","time":"00:15:11-0","content":"Well that was the next question. Go ahead and tell me about that. Tell me about relationships that you had."},{"speaker":"Melvin","time":"00:15:16-0","content":"Oh man. I had quite a few. I'd say maybe the best one I probably had was with my baby sister's friend."},{"speaker":"Marcus","time":"00:15:23-7","content":"What was her name?"},{"speaker":"Melvin","time":"00:15:25-6","content":"Naja. She was actually from North Dakota. Real beautiful. And we hit it off, but then nobody known that we'd actually been dating until maybe years later. That's when my sister actually found out when she said she had no idea that me and her friend were actually dating."},{"speaker":"Marcus","time":"00:15:55-4","content":"Any children?"},{"speaker":"Melvin","time":"00:15:58-2","content":"I think so. I'm not too sure, but I think so."},{"speaker":"Marcus","time":"00:16:03-8","content":"But nobody you've ever had any kind of relationship with or known any names of any kids or anything like that?"},{"speaker":"Melvin","time":"00:16:06-6","content":"No."},{"speaker":"Marcus","time":"00:16:13-3","content":"Okay so before moving on to your time in the parish and then here in Angola, is there something else about your coming up that you think is important to knowing who you are if someone really wants to understand, \"Who is this Melvin Davis person?\""},{"speaker":"Melvin","time":"00:16:13-3","content":"No."},{"speaker":"Marcus","time":"00:16:33-5","content":"Alright. The fact of the matter is that you've been here longer than you were not here and so the things that have shaped your life certainly have to do with the place that we're in. Can you describe the person, now that you have twenty-four years of perspective, tell me about that twenty-year old Melvin Davis."},{"speaker":"Melvin","time":"00:16:54-6","content":"Oh man."},{"speaker":"Marcus","time":"00:16:56-9","content":"Coming through the gates of Angola. What was he like?"},{"speaker":"Melvin","time":"00:17:04-5","content":"I would say I would know for sure that I was shy and I was confused as to what led me to come here and once I came through the gate it was like I don't know what the hell is like but it was kind of like hell, dealing with the different people, the different possibility of what they can do to you, being scared I really don't know what else to add to that, but I was scared and I didn't know what to do. I was just lost and I couldn't get the help that I needed when I came here. It was just like it was just a lost place period."},{"speaker":"Marcus","time":"00:18:10-7","content":"What kind of help would you have liked to have had?"},{"speaker":"Melvin","time":"00:18:13-8","content":"Legal assistance. Better guidance on how handle situations that occur in prison."},{"speaker":"Marcus","time":"00:18:22-7","content":"Did you I mean everybody hears stories about Angola. This is clearly a different prison than it was back then, but was where you constantly worried about your safety when you first came here."},{"speaker":"Melvin","time":"00:18:39-5","content":"I was when I first came."},{"speaker":"Marcus","time":"00:18:41-9","content":"For good reason from what I understand."},{"speaker":"Melvin","time":"00:18:44-7","content":"Because when I first came I seen all kind of stuff. I mean right off the bat I was like whoa."},{"speaker":"Marcus","time":"00:18:50-1","content":"Yeah? Like what?"},{"speaker":"Melvin","time":"00:18:52-0","content":"I'd seen a guy get beat in the head with a brick. I was like I don't want to be no part of that or whatever he did I really showed that I tried to stay away from that."},{"speaker":"Marcus","time":"00:19:05-4","content":"Was there a lot of sexual violence here as well?"},{"speaker":"Melvin","time":"00:19:07-5","content":"I seen not a lot of sexual violence, but I'd seen I don't know how you would well I guess I don't want to say that it was violence it was more of a participation thing."},{"speaker":"Marcus","time":"00:19:24-3","content":"Sure, I understand that too. So it's a crazy environment that you're in. What kind of a person are you now compared to that person? In other words, how are you different now, today we all are different, but how are you different from that?"},{"speaker":"Melvin","time":"00:19:39-0","content":"I'd say that I'm more educated now. I can honestly say that. I kept a lot of letters that I used to write. I used to make copies of them. And I look back on them and I look and I was like, \"Wow.\" Grammar toe up. And looking back from where I have come from participating in some wild activities or fighting, stealing, lying, being deceptive, all kind of other little things but from then to now? Oh yeah I have progressed a lot."},{"speaker":"Melvin","time":"00:19:39-0","content":"I educated myself. I currently work in the law library as inmate council. I studies a lot, I reads a lot. My comprehension is way up from what it used to be. I no longer participate with drugs. Negativities I don't have time for that all anymore. I just try to do the best that I can do. That's what I try to do, I try to do the best that I can do. All situations, I try to make the best out of it."},{"speaker":"Marcus","time":"00:20:56-8","content":"Did you go ahead and get your GED while you were here?"},{"speaker":"Melvin","time":"00:21:01-4","content":"Actually I can say this here. I had one left and the other day, I think it was Tuesday of last week, I missed it by one point."},{"speaker":"Marcus","time":"00:21:12-9","content":"Oh okay. But you're on the path?"},{"speaker":"Melvin","time":"00:21:15-3","content":"Yeah I just had one subject left and I missed it by one point."},{"speaker":"Marcus","time":"00:21:17-8","content":"Okay so when do you retake that?"},{"speaker":"Melvin","time":"00:21:20-6","content":"It's supposed to be September the 10th."},{"speaker":"Marcus","time":"00:21:25-9","content":"So September of 2018 could be when you have your GED?"},{"speaker":"Melvin","time":"00:21:27-9","content":"Yeah, yeah."},{"speaker":"Marcus","time":"00:21:30-6","content":"That's pretty exciting."},{"speaker":"Melvin","time":"00:21:34-4","content":"Yeah, yeah it is."},{"speaker":"Marcus","time":"00:21:37-4","content":"And in the meantime, you're reading if you're working in the law library you're it's a different kind of education, right?"},{"speaker":"Melvin","time":"00:21:40-8","content":"Right. It is."},{"speaker":"Marcus","time":"00:21:45-3","content":"You could be you could have there's sort of knowledge that you have to have to get a degree, to get your GED. Then there's a whole bunch of other stuff that you could be learning about that may not help you with your GED but so I imagine if you're there, you're reading all the time. Do you think you've developed a degree of expertise on the law?"},{"speaker":"Melvin","time":"00:22:00-8","content":"I can say in certain aspects I have."},{"speaker":"Marcus","time":"00:22:02-7","content":"Yeah I mean, post-conviction I guess."},{"speaker":"Melvin","time":"00:22:04-7","content":"Yeah. Because that's basically what we honestly deal with on a day-to-day basis."},{"speaker":"Marcus","time":"00:22:13-0","content":"Are there some folks in inmate council who have been able to help you, who you can turn to for guidance?"},{"speaker":"Melvin","time":"00:22:19-0","content":"Of course. Everett Offray."},{"speaker":"Marcus","time":"00:22:20-9","content":"Oh yeah."},{"speaker":"Melvin","time":"00:22:22-7","content":"Yeah, he's a good mentor."},{"speaker":"Marcus","time":"00:22:24-4","content":"Yeah I had the privilege of interviewing him last year."},{"speaker":"Melvin","time":"00:22:27-6","content":"Darren Hooks, yeah, he's a good mentor."},{"speaker":"Marcus","time":"00:22:32-6","content":"Alright, good. If you could go back and give that young Melvin Davis some advice about how to get through this experience, everyone's going to make some mistakes what would you tell him?"},{"speaker":"Melvin","time":"00:22:47-3","content":"I'd start from the beginning, for one thing. The old slogan they say, \"Stay in school.\" Yeah I'd stay in school. Stay away from the negativity because honestly I have a great family and I should've stay up under their wing. I picture myself I would have stayed like especially with my third oldest brother, he actually asked me to come with him to come get the job. If I could've went with him I'd probably honestly be working out there too."},{"speaker":"Marcus","time":"00:23:32-9","content":"So aside from your working in the law library, what other have you been a part of other organizations here at Angola while you've been here?"},{"speaker":"Melvin","time":"00:23:39-8","content":"Well I thought about it. I actually thought about joining JC's, but I wanted kind of like to clean some of this stuff off my plate first."},{"speaker":"Marcus","time":"00:23:52-1","content":"Yeah, get the GED?"},{"speaker":"Melvin","time":"00:23:53-7","content":"Yeah. That's one thing for sure and then I'd have freer time."},{"speaker":"Marcus","time":"00:23:58-9","content":"Have you managed to stay clear of disciplinary issues while you've been here?"},{"speaker":"Melvin","time":"00:24:02-8","content":"I'd say the last write-up I had was maybe I think maybe three years ago and it was basically like a loco write up for like messing up the count, but before that, last time it was twelve years almost thirteen years before I had a write up."},{"speaker":"Marcus","time":"00:24:17-5","content":"Wow. And so you've figured out how to stay away from that."},{"speaker":"Melvin","time":"00:24:20-7","content":"Yes."},{"speaker":"Marcus","time":"00:24:27-3","content":"I want to ask you about the impact of what happened, how that's impacted your family. I think in this case it's particularly difficult because it's two of you it's you and your brother at the same time. What effect did that have on your family? You've got all your other siblings are doing things. You've got your mother and stepfather engaged in sort of doing the right thing or whatever and then this happens. What how did your family take it? What happened?"},{"speaker":"Melvin","time":"00:25:02-2","content":"It was hard. Actually it was hard for all of us, especially my mom. She took it real hard and my baby sister. She took it real hard. At first it was kind of like a separation. Actually when I got arrested, I didn't talk to my family until maybe like much later because we both were angry."},{"speaker":"Melvin","time":"00:25:02-2","content":"I think it was basically it was more on my part than not wanting to contact them because it was kind of like. \"If you would have done right, you wouldn't be in the position that you was in.\" It took a hard toll on them. It beat them down."},{"speaker":"Marcus","time":"00:25:49-0","content":"Was your family in the courtroom?"},{"speaker":"Melvin","time":"00:25:54-0","content":"Honestly, no."},{"speaker":"Marcus","time":"00:25:56-3","content":"That might've been too much for."},{"speaker":"Melvin","time":"00:25:58-1","content":"Yeah."},{"speaker":"Marcus","time":"00:26:00-1","content":"Yeah."},{"speaker":"Melvin","time":"00:26:01-6","content":"I know my mom she actually stopped coming to see me maybe a few years ago. I was trying to get her to stop before then because I'd seen the toll it was taking on her. It was weighing her down."},{"speaker":"Marcus","time":"00:26:15-1","content":"So who visits you up here now?"},{"speaker":"Melvin","time":"00:26:19-9","content":"Actually my sister again and my two brothers, they come. And my stepdad, he comes with my baby sister."},{"speaker":"Marcus","time":"00:26:27-2","content":"And when they visit you, do they visit you and your brother at the same time?"},{"speaker":"Melvin","time":"00:26:30-5","content":"Yes."},{"speaker":"Marcus","time":"00:26:33-2","content":"Yeah, that makes sense. Do you all meet together?"},{"speaker":"Melvin","time":"00:26:36-3","content":"Yes."},{"speaker":"Marcus","time":"00:26:43-3","content":"You said your mom took it particularly hard. Did she change?"},{"speaker":"Melvin","time":"00:26:51-0","content":"I wouldn't say she actually changed, but I think she had a-whole-other different outlook of the situation, one that I couldn't I still can't really understand, but I can understand coming from a parent in her position being Christian and she may feel that \"God put you in that place for a reason.\" But I'm like I don't believe that."},{"speaker":"Marcus","time":"00:27:21-1","content":"Right."},{"speaker":"Melvin","time":"00:27:24-0","content":"I don't want to say I accepted this, but I embrace it because it allowed me to actually get my life on the better path from where I was headed not saying that I was heading in the wrong direction, but it gave me a better outlook and I've grown a lot."},{"speaker":"Marcus","time":"00:27:46-7","content":"Sure, yeah. I've talked to people who there's no question they say that coming to Angola was the best thing that happened to them. But there's a lot of good people do a lot of very useful things for their lives here that most people don't associate with prison. If a parole board, or a pardon board in your case, were to ask you for \"Why should we give you a second chance?\" What kind of information do you want them to have about you?\""},{"speaker":"Melvin","time":"00:28:34-8","content":"If I were to have to tell them something, I really don't know what I would say. But I know I could tell them, \"Look at my jacket, my record.\" Maybe ask Security. And I'd bet you that'd they'd tell them I'm a changed person; I'm nowhere near the person that I used to be."},{"speaker":"Melvin","time":"00:28:34-8","content":"Again I appreciate the opportunity because I didn't have those opportunities out there to be able to learn all these trades over here that are free the education. It's been very helpful. And being around so many influential people that constantly encourage you throughout the day. It helps me with the struggles that I used to have. Again I don't know exactly what would I have, what can I say."},{"speaker":"Marcus","time":"00:29:41-5","content":"Well are there you mentioned the trades just now. Are there any other opportunities that you've taken advantage of here at Angola?"},{"speaker":"Melvin","time":"00:29:47-0","content":"Actually when I finish, I would like to its two that I'm actually interested in. Its HVAC and generators, repair generators. Those are the two that I'm caught in between in."},{"speaker":"Marcus","time":"00:29:59-2","content":"Did it take a while for you to be here in the prison before you started taking advantage of these educational opportunities? I mean it's been twenty-four years. Why do you think it's taken you this long to get into some of these things?"},{"speaker":"Melvin","time":"00:30:18-7","content":"You know actually."},{"speaker":"Marcus","time":"00:30:21-2","content":"Or maybe I'm getting it wrong."},{"speaker":"Melvin","time":"00:30:25-0","content":"Yeah actually when I was up here in 1996 in the Main Prison, they moved us from the Main Prison to Camp C and I was in school in the old Bible College over there then."},{"speaker":"Marcus","time":"00:30:38-2","content":"Oh okay."},{"speaker":"Melvin","time":"00:30:41-1","content":"By them uprooting us and sending us back there, they just placed us in a dorm and they didn't replace us back into educational programs that we was a part of up here, they wasn't back there by being such a small Camp. So we was cut off from the educational programs that we could've and actually programs that they was were had they did have back there was it actually had to be implemented by inmates."},{"speaker":"Marcus","time":"00:31:15-4","content":"Okay."},{"speaker":"Melvin","time":"00:31:16-9","content":"Like maybe substance abuse, a law class or something like that. Yeah."},{"speaker":"Marcus","time":"00:31:20-1","content":"That was at Camp C."},{"speaker":"Melvin","time":"00:31:22-6","content":"Yes."},{"speaker":"Marcus","time":"00:31:24-5","content":"Yeah I didn't realize that, that when you do get moved to various camps that does change what you like all the education stuff is here in the main building."},{"speaker":"Melvin","time":"00:31:38-4","content":"It's up here. Now they have GED classes back there, but that's basically all they have. Everything else is up here."},{"speaker":"Marcus","time":"00:31:47-2","content":"What was your job when you were at Camp C?"},{"speaker":"Melvin","time":"00:31:51-7","content":"I used to work in the laundry for eight years. I was a tier walker and also orderly."},{"speaker":"Marcus","time":"00:31:59-2","content":"Oh okay. A healthcare orderly. What's your favorite job that you've had here?"},{"speaker":"Melvin","time":"00:32:06-6","content":"Actually the law library, yeah."},{"speaker":"Marcus","time":"00:32:10-3","content":"So this may seem like a strange question, but what's the worst part about prison for you?"},{"speaker":"Melvin","time":"00:32:23-3","content":"Actually waking up here every morning. Having to wake up and see that you have a guy on both sides of you, you look up somebody's up there in the bed looking at the bars, having to knock on the door to get out of the door, showering with men all day long, it's just."},{"speaker":"Marcus","time":"00:32:53-2","content":"So some people when you're faced with life-without-parole, the severity of that is so great that people tend to have to create some kind of coping mechanism for that and you here all kinds of things, some people sort of talk about tricking their minds into thinking something else. I heard a couple of pastors, inmate ministers they talk about the difficulty of dealing with like false hope that you have to put in front of you."},{"speaker":"Marcus","time":"00:32:53-2","content":"Some people become very religious. How do you I mean again when all this hope's one's going to get out, but if you really think about the reality that people also are dying here every month. How do you handle the prospect of never getting? It's something I'm exploring with the project."},{"speaker":"Melvin","time":"00:33:54-9","content":"To me, I created a mental block also. Actually from day one when I got sentenced, actually the deputy had to come and look at my armband to make sure that I was actually printed in the courtroom because the judge kept calling my name and I never answered him and he had to make sure that I was in the courtroom. But right then and there I created a mental block that I wasn't going to accept what it was that he was saying that he was actually giving me a life sentence. I never accepted that I had a life sentence."},{"speaker":"Melvin","time":"00:33:54-9","content":"The hope that I have is great knowing the things that I know and I have thought about it like, \"Man there's people that are dying here. There's a possibility I might not never get out,\" but that's not something that is embedded in my mind. It's far from my mind because I know that having hope, having a purpose, and having a drive, you basically can accomplish anything."},{"speaker":"Melvin","time":"00:33:54-9","content":"And I can't just sit around and just contemplate that I'm not never going to get out of prison because that's just like beating a dead horse, but as long as I know that I can read, I can write, I have a basic understanding of the things that I'm doing it gives me that extra push because I know what I have to do for myself as a man that I just can't sit around and just hope that they pass some kind of laws or something like that."},{"speaker":"Melvin","time":"00:33:54-9","content":"That's \"No\" I'm not even worried about that. If that happens, it happens but I'm going to keep doing what I'm doing what's best for me that gives me the push that keep me in that mindset that I know that one day that, if I keep doing what I'm doing, that I'm going to accomplish my goal and ascertain my freedom."},{"speaker":"Marcus","time":"00:35:53-2","content":"So let me make sure I'm understanding so are you saying that, \"I'm just going to keep my head down, keep doing what I'm doing in the hopes that the law will change so I can get out?\""},{"speaker":"Melvin","time":"00:36:04-8","content":"No, I'm not saying."},{"speaker":"Marcus","time":"00:36:06-2","content":"Because you already said, \"Because I'm not doing that.\" So what're you waiting for? How are you going to be getting your freedom by doing what you're doing? I'm trying to understand."},{"speaker":"Melvin","time":"00:36:19-2","content":"I'm going to say that by obtaining the information that I have obtained that can that I can put it into writing and put it before the court."},{"speaker":"Marcus","time":"00:36:34-5","content":"I've got you."},{"speaker":"Melvin","time":"00:36:38-9","content":"The court can see it."},{"speaker":"Marcus","time":"00:36:40-8","content":"By continuing to fight your legal case?"},{"speaker":"Melvin","time":"00:36:42-3","content":"Exactly."},{"speaker":"Marcus","time":"00:36:44-0","content":"Okay I understand perfectly. And it's also something that keeps your focus. I imagine that that's helpful too. I was also reading that the other thing that I was going to ask you I was also reading that, \"I'm going to continue to have a meaningful life while I'm here,\" So that's another way of handling that. I think I was hearing a bit of both in what you were saying."},{"speaker":"Melvin","time":"00:37:04-4","content":"Yes."},{"speaker":"Marcus","time":"00:37:09-6","content":"So of the various things that you've accomplished, what are you most proud of?"},{"speaker":"Melvin","time":"00:37:18-0","content":"Oh man. It's a few. But I would say actually, becoming inmate council. Yeah. I can actually see me doing that on the outside. If I have the opportunity to I'd like to."},{"speaker":"Marcus","time":"00:37:41-8","content":"How long have you been inmate council?"},{"speaker":"Melvin","time":"00:37:45-3","content":"Almost six years."},{"speaker":"Marcus","time":"00:37:50-0","content":"Okay. Do you find that it's helpful to your sense of well-being to be able to help other people when they come?"},{"speaker":"Melvin","time":"00:37:55-8","content":"Of course."},{"speaker":"Marcus","time":"00:37:57-1","content":"Because it keeps you in that whole mind frame, yeah. It sounds like you started as inmate council right after Calvin Duncan left."},{"speaker":"Melvin","time":"00:38:08-4","content":"Yeah I did."},{"speaker":"Marcus","time":"00:38:12-3","content":"Alright so let's say you are successful either through the courts with your case or through a pardon hearing at some point? What's your vision for the future? How would you envision your life after this?"},{"speaker":"Melvin","time":"00:38:33-7","content":"I would say this here. I'm not looking to be way up here. As long as I can be level, to me, knowing where I come from, it would be satisfying to me."},{"speaker":"Marcus","time":"00:38:51-9","content":"Okay, what's level?"},{"speaker":"Melvin","time":"00:38:56-9","content":"I would say in between I don't know how would they say I don't know the terminology that they use right above middle class."},{"speaker":"Marcus","time":"00:39:08-0","content":"Okay."},{"speaker":"Melvin","time":"00:39:10-9","content":"That would be enough for me."},{"speaker":"Marcus","time":"00:39:13-4","content":"Upper middle class?"},{"speaker":"Melvin","time":"00:39:13-8","content":"Upper middle class. That'd be enough for me."},{"speaker":"Marcus","time":"00:39:16-0","content":"And how would you define that?"},{"speaker":"Melvin","time":"00:39:18-5","content":"I would say maybe as for money wise, maybe like $90,000 a year. Somewhere around up in there. Maybe with a four bedroom home. Maybe two nice vehicles. That'd be straight with me."},{"speaker":"Marcus","time":"00:39:42-2","content":"That's a nice vision."},{"speaker":"Melvin","time":"00:39:44-1","content":"Yeah."},{"speaker":"Marcus","time":"00:39:47-9","content":"What about family? Do you think you might want to?"},{"speaker":"Melvin","time":"00:39:53-0","content":"I wouldn't mind getting married, but I think kids, I think it may be a little bit too late for that being in maybe a few more weeks I'll be forty-five, but I think that's kind of to be raising kids."},{"speaker":"Marcus","time":"00:40:09-3","content":"In terms of the type of work you would do, what area do you see that being?"},{"speaker":"Melvin","time":"00:40:14-8","content":"I see law. I would like to do that."},{"speaker":"Marcus","time":"00:40:16-8","content":"Yeah you'd mentioned it. So I mean it was good for me to sit down and learn more about you, is there something that I should've talked to you about that we didn't? I ask you that question after we'd talked about your childhood but looking back on what we've talked about, should I have asked you something that I didn't?"},{"speaker":"Melvin","time":"00:40:43-1","content":"I can't think of anything."},{"speaker":"Marcus","time":"00:40:45-5","content":"Alright. Okay."}]}