{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Merlin Renard Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:07",
      "content": "So can you tell me a little bit about your family and the people you came up with, what your childhood was like?"
    },
    {
      "speaker": "Merlin",
      "time": "00:00:07",
      "upperBoundTime": "00:00:29",
      "content": "Well I had a good childhood, my parents had several children, I was the oldest of all of them. I was in a good household, but I just lived in the wrong community."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:29",
      "upperBoundTime": "00:00:33",
      "content": "Where did you live?"
    },
    {
      "speaker": "Merlin",
      "time": "00:00:33",
      "upperBoundTime": "00:01:20",
      "content": "In Saint Bernard project in New Orleans. Majority black community, a lot of things going on...we'll call it peer pressure. By me not having nobody older than me, as a brother, since I'm the oldest. My mom and dad they tried their best."
    },
    {
      "speaker": "Merlin",
      "time": "00:00:33",
      "upperBoundTime": "00:01:20",
      "content": "I went through school, I had good grades in school. But when I reached my teenage stages, I took a different turn in life. It wasn't nothing that my parents did, I chose that, I thought that was right while it was wrong."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:20",
      "upperBoundTime": "00:01:22",
      "content": "Were your parents together?"
    },
    {
      "speaker": "Merlin",
      "time": "00:01:22",
      "upperBoundTime": "00:01:28",
      "content": "Yeah they were married. No divorces till."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:28",
      "upperBoundTime": "00:01:30",
      "content": "Sure."
    },
    {
      "speaker": "Merlin",
      "time": "00:01:30",
      "upperBoundTime": "00:01:33",
      "content": "And it stayed like that until they passed away."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:33",
      "upperBoundTime": "00:01:37",
      "content": "So would you characterize your home as a loving home?"
    },
    {
      "speaker": "Merlin",
      "time": "00:01:37",
      "upperBoundTime": "00:02:07",
      "content": "Yeah, like I said, due to the community that we was staying in. Inside the home was beautiful. We didn't want nice things, we had nice clothes, and we had food to eat. My daddy kept a job, my mama kept a job. The love was there. The love was there."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:07",
      "upperBoundTime": "00:02:10",
      "content": "Was there a lot of fighting in your neighborhood?"
    },
    {
      "speaker": "Merlin",
      "time": "00:02:10",
      "upperBoundTime": "00:02:56",
      "content": "A lot of fighting, a lot of killings that you'd see that you wouldn't ordinarily see in another neighborhood outside the black community. But seeing this in the community like every day. This was, how I may put this, part of my survival. If somebody messed with my little brother, I had to take his cause. Somebody I had to fight. That's the way it was in the type of neighborhood I was raised in. You couldn't just turn the other cheek, you had to fight."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:56",
      "upperBoundTime": "00:03:05",
      "content": "Is that how, sounds like you're describing what most people think about prison."
    },
    {
      "speaker": "Merlin",
      "time": "00:03:05",
      "upperBoundTime": "00:03:53",
      "content": "Well, when I first come to prison, it basically said you had to fight to survive. But as time changed within prison, the prison changed. It's not like it was when I first come here. You had to fight, you had to have a weapon to protect yourself with. But this day and time now, it was a change in like the mid 90s, the penitentiary was gradually changing. And when they changed, the prison changed."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:53",
      "upperBoundTime": "00:04:17",
      "content": "So take me back, it's a long time, 35 years. Take me back to your neighborhood and if I was standing on the stoop of your house, the way you remember it as a teenager. What would it look like, what would I see and hear and smell?"
    },
    {
      "speaker": "Merlin",
      "time": "00:04:17",
      "upperBoundTime": "00:06:04",
      "content": "You sure would smell my mama cooking, that's for sure. You would see a beautiful family, as I said earlier, inside of our home. Outside is a whole totally different atmosphere. Once you step out that door, anything might happen. But you would see love within the home. You would experience that peace. I remember one time my dad was able to sleep on his porch. That's how peaceful it was back then, and that was in like in the early 70s."
    },
    {
      "speaker": "Merlin",
      "time": "00:04:17",
      "upperBoundTime": "00:06:04",
      "content": "But at the time when all the shootings, the killings, he had to take refuge inside. But once you were inside our home, it's beautiful. I used to watch, I was the oldest. I took take care of my little brothers and sisters and they watched TV. They're all, stuff like that. My dad he would come home, take his bath, sit down and read his paper, look at the news. My mom be sitting there, she look at the news too, or in the kitchen cooking, but, that's what you would see inside."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:04",
      "upperBoundTime": "00:06:11",
      "content": "Tell me a little bit about the friends that you had. The ones that were closest to you, the ones that you would run with."
    },
    {
      "speaker": "Merlin",
      "time": "00:06:11",
      "upperBoundTime": "00:06:21",
      "content": "I remember one friend I had, he had moved in the project and we were like brothers. We took a liking to each other."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:21",
      "upperBoundTime": "00:06:24",
      "content": "What was his name?"
    },
    {
      "speaker": "Merlin",
      "time": "00:06:24",
      "upperBoundTime": "00:07:20",
      "content": "Frank, his name was Frank. He was taller than me, all my friends were taller than me. I had a gold teeth, he bought it for me. Come out of Job corps, got his little check, and bought me a gold teeth. But when I got busted on his charge, when I got arrested on his charge, a couple years being in the parish, he still hadn't visited. And the visitor was in the attorney booth, I don't have no attorney."
    },
    {
      "speaker": "Merlin",
      "time": "00:06:24",
      "upperBoundTime": "00:07:20",
      "content": "When I go down there it's Frank, he's a preacher. Got his collar on and I say \"What done happened\" \"Brought in change\" That I should change. But that was one of my best friends."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:20",
      "upperBoundTime": "00:07:22",
      "content": "How long was that after you were incarcerated?"
    },
    {
      "speaker": "Merlin",
      "time": "00:07:22",
      "upperBoundTime": "00:07:24",
      "content": "Huh?"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:24",
      "upperBoundTime": "00:07:28",
      "content": "How long was that visit after you were incarcerated?"
    },
    {
      "speaker": "Merlin",
      "time": "00:07:28",
      "upperBoundTime": "00:07:36",
      "content": "From the time I was incarcerated until the time I got the visit from him? About 3 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:36",
      "upperBoundTime": "00:07:36",
      "content": "And was that in the parish prison?"
    },
    {
      "speaker": "Merlin",
      "time": "00:07:36",
      "upperBoundTime": "00:08:55",
      "content": "Yeah that was in the parish prison, I was still in the parish. Then I had other friends that, we lived the same lifestyle. Burglarizing people, doing all the wrong stuff. My mom and my dad used to always tell me \"You're going to make your bed hard and you're going to have to sleep in it, because you're running with the wrong crowd\"."
    },
    {
      "speaker": "Merlin",
      "time": "00:07:36",
      "upperBoundTime": "00:08:55",
      "content": "But at that time being young and naive I thought that was the glamorous type of life. Nice clothes, nice cars, and all the while this wasn't the way. So I had the bad friends on one side and I had the good friends on the other side. But, you look back at all that, the best friend was always there; and the bad ones wasn't. Probably due to the environment I grew up in."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:55",
      "upperBoundTime": "00:08:59",
      "content": "Are you in touch with any folks from your childhood today?"
    },
    {
      "speaker": "Merlin",
      "time": "00:08:59",
      "upperBoundTime": "00:11:00",
      "content": "Yeah, and they changed. You wouldn't believe this, the ones that I'm in touch with, both of them preachers at their own churches. We share word from the Bible and other friends, like the female friends that I'm in contact with they changed their lives. Everybody changed, everybody drew their line and said enough is enough. Let me try this side, see how it works. So, once they left the old side and went to the new side which was the spiritual side, it went to working. So now they're living a happy life. He writes me, emails me with the word."
    },
    {
      "speaker": "Merlin",
      "time": "00:08:59",
      "upperBoundTime": "00:11:00",
      "content": "We discuss the word on the phone, stuff like this here. And I'm gradually growing into the spiritual aspect of my life now. I used to always wonder why my mama used to tell people that I was going to be a preacher. I'd say, \"Mama Stop telling people that\". \"Well you're going to be a preacher\". I ask God each night, say my prayers every night."
    },
    {
      "speaker": "Merlin",
      "time": "00:08:59",
      "upperBoundTime": "00:11:00",
      "content": "Whatever your will is for me God, let me see and I will do it."
    },
    {
      "speaker": "Merlin",
      "time": "00:08:59",
      "upperBoundTime": "00:11:00",
      "content": "I hope that be his will for me I become a preacher. But I can't become it on my own accord, he has to lead me in that direction. So, my friends did change, they became spiritually changed in their lives now, from how they once were living. They got their own churches now. That's a beautiful thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:00",
      "upperBoundTime": "00:11:12",
      "content": "Yeah. Do you look at some of the guys who are on that other side, the bad ones that you said, did you end up seeing a lot of them come here to Angola?"
    },
    {
      "speaker": "Merlin",
      "time": "00:11:12",
      "upperBoundTime": "00:11:54",
      "content": "Yeah, a few of them have done time at Angola, oh yeah. Not as much time as I had but they had got out. These are the ones I'm talking about, they got out and they changed. One of my friends was worse than me. When I found out recently I said we can't be talking to the same person. He said, but I'm telling you brother, he told me to give you his phone number and address. I said, didn't even know how to read or write. He knows how to read and write now, he's a preacher."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:54",
      "upperBoundTime": "00:11:57",
      "content": "Yeah, it's also 40 years."
    },
    {
      "speaker": "Merlin",
      "time": "00:11:57",
      "upperBoundTime": "00:12:41",
      "content": "So, I went and I called him, I said \"Man, its amazing\". He said, \"What?\" I said, \"Charlie Brown told me how you changed your life\". \"Yeah\", he said, \"It was a gift from God\". I said \"Sure it was brother\". I said, \"I'm proud of you, brother\". He said \"Man what's happening with you, when you getting out\". I said, \"When God get ready for me to be released I'm going to be here to do it\". And that's when he change that bill. And God made that happen."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:41",
      "upperBoundTime": "00:12:43",
      "content": "You don't have any children do you?"
    },
    {
      "speaker": "Merlin",
      "time": "00:12:43",
      "upperBoundTime": "00:12:46",
      "content": "I have two."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:46",
      "upperBoundTime": "00:12:49",
      "content": "Two."
    },
    {
      "speaker": "Merlin",
      "time": "00:12:49",
      "upperBoundTime": "00:13:16",
      "content": "A daughter and a son. One of them is a nurse, and one, my son, he's a painter. He goes around painting inside buildings and outside, he's a big contract man. That's what he's doing. But my daughter she's a registered nurse in, I forgot, how she described it, home care provider for old people who got their own homes, she go there and tends to them."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:16",
      "upperBoundTime": "00:13:18",
      "content": "Sure, nursing care."
    },
    {
      "speaker": "Merlin",
      "time": "00:13:18",
      "upperBoundTime": "00:13:26",
      "content": "Some ways she, described it, proper wording. That's what she do and then she's a registered nurse."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:26",
      "upperBoundTime": "00:13:29",
      "content": "Have you been able to keep a relationship with them?"
    },
    {
      "speaker": "Merlin",
      "time": "00:13:29",
      "upperBoundTime": "00:14:20",
      "content": "Oh yeah, they love their dad and I love them. Now I'm trying to build a relationship with my grandchildren, I got 5 of them. The oldest one he wants to play football, so he told me, \"I talked to my mama, I want to play football but she won't let me play,\" I said \"All right, I'm going to call her and talk to her.\""
    },
    {
      "speaker": "Merlin",
      "time": "00:13:29",
      "upperBoundTime": "00:14:20",
      "content": "I talked to her and she let him play. Now, the LSU coaches, they're looking at him. I see how things go, that didn't come from you that come from God. Everything in life has a reasoning that comes from God. This is what you got to recognize."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:20",
      "upperBoundTime": "00:14:22",
      "content": "Did you believe that when you were 18?"
    },
    {
      "speaker": "Merlin",
      "time": "00:14:22",
      "upperBoundTime": "00:14:24",
      "content": "What?"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:24",
      "upperBoundTime": "00:14:28",
      "content": "What you just said about God."
    },
    {
      "speaker": "Merlin",
      "time": "00:14:28",
      "upperBoundTime": "00:14:30",
      "content": "Yeah, I really do."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:30",
      "upperBoundTime": "00:14:32",
      "content": "Did you believe it when you were 18?"
    },
    {
      "speaker": "Merlin",
      "time": "00:14:32",
      "upperBoundTime": "00:14:33",
      "content": "What about God, about believing?"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:33",
      "upperBoundTime": "00:14:36",
      "content": "Did you feel the same way about God when you were 18 as you do now?"
    },
    {
      "speaker": "Merlin",
      "time": "00:14:36",
      "upperBoundTime": "00:18:40",
      "content": "I did, I'm going to tell you why I did. I lost focus. When I went to the, I had me, and a friend of mine who got his own church, he a preacher now. We had committed a robbery, which I asked God to forgive me many times. An old man, and the process we was juveniles, 15 years old. The whole time I'm in this detention center waiting to go to court, I prayed. And I mean I prayed with tears in my eyes and everything. I said God give me just one more chance and I'm going to do right. And I told him all my desires in life, what I wanted. God is real. And God gave me everything I asked him for."
    },
    {
      "speaker": "Merlin",
      "time": "00:14:36",
      "upperBoundTime": "00:18:40",
      "content": "And when I got out and stood out a couple months, 3 months, 4 months, 5, 6 months. I lost track. I went back to my old ways. But in my prayer, I said if I do wrong, allow me to parish in prayer, if I do wrong. Wrong place wrong time. I asked God to forgive me for that, and he forgave me, and I've been here 39 years. And it took me, when I come to Angola in '87. That's when I came to Angola but the charge occurred in '78, I got convicted in '78, and between '87 and 1997, that's when I came to realize this ain't going to work, I need God in my life."
    },
    {
      "speaker": "Merlin",
      "time": "00:14:36",
      "upperBoundTime": "00:18:40",
      "content": "And I know he's real. God gave me what I asked for. I said, \"God I want a daughter, I want two children, I want my first born to be a girl, I want my second born to be a boy, and I want them to have a beautiful and healthy mother\". God gave me all that, he's real. He gave me what I asked him for, and I forgot. I went out, like I said, 3, 4, 5, 6 months later I forgot what God gave me."
    },
    {
      "speaker": "Merlin",
      "time": "00:14:36",
      "upperBoundTime": "00:18:40",
      "content": "If only I'd stood focused, I wouldn't be sitting before y'all now. And God would've probably blessed me with more if I'd have stood focus, but I know he's real. I know he exists, spiritually. And this is what my life is based upon now. Doing the right thing for him. Even if I can't become a preacher, maybe I can save someone, if I'm released from this prison. Save a youth, save somebody. Let them know where I come from, what I went though, you don't need to go through that."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:40",
      "upperBoundTime": "00:18:44",
      "content": "Aren't there some younger folks here who look up to you as a mentor?"
    },
    {
      "speaker": "Merlin",
      "time": "00:18:44",
      "upperBoundTime": "00:21:42",
      "content": "Yeah they have a lot of them, where I'm housed now. They have a lot of them, they'll sit down. We go to commissary and talk. I said \"don't do like I did\". He said, \"What do you mean?\" I said, \"When I first come to Angola, I thought this was the place to be, I lost track, that's why I've been here that long\". He said \"Well how long you been here?\" I said, at the time I said 30 years, now it's 39. He goes wow I said there's some that have been here longer."
    },
    {
      "speaker": "Merlin",
      "time": "00:18:44",
      "upperBoundTime": "00:21:42",
      "content": "I say \"Boy the basic thing is man, educate yourself while you're here, and change your outlook on the life that you once lived. And take it and put it on another level. Seek rehabilitation. I said \"I got my GED, any kinds of activity they got, I got it\". I said, \"You could do the same\". They got a thing they call risk factor. People look at your risk factor number. If it's low you're good, if it's high it ain't good. All you got to do is ask the convocation what your risk number is."
    },
    {
      "speaker": "Merlin",
      "time": "00:18:44",
      "upperBoundTime": "00:21:42",
      "content": "But first you got to start getting into these programs and educate yourself. I said, \"You finish school?\" He said \"No\". Get in school, get your GED. If the free man ask you to do something, although it is not your job to do it, you're not assigned to do it, do it. You're molding yourself, you're conditioning your mind, cause the same way you got the rules when you're young, there's rules on the street you got to follow as well. You can run a stop sign and don't get a ticket, you think you can run a red light don't get the ticket."
    },
    {
      "speaker": "Merlin",
      "time": "00:18:44",
      "upperBoundTime": "00:21:42",
      "content": "When a sign don't walk, it mean don't walk. Its rules, we call them rules. I try to give them the best advice I can give them. But I always let them know, you got to make the change, I can't make it for you, you got to live your life, I can't live it for you. But always try to focus on the better things in life instead of the bad things in life because you done went through the bad. Let me ask you a question, what you got out the bad? What did you accomplish out the bad situations in your life? Nothing. But if you do the good things in life that you're supposed to do, watch what you accumulate."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:42",
      "upperBoundTime": "00:21:54",
      "content": "So, can you describe what your typical day is like here?"
    },
    {
      "speaker": "Merlin",
      "time": "00:21:54",
      "upperBoundTime": "00:24:03",
      "content": "I try to have a routine, I try to mold myself to get ready for the streets. I've come to grow and mature since I've been incarcerated. I get up 4 o'clock every morning. Cause I'm starting to mold myself. I got to mold myself so if I'm released from prison, I got to get a job."
    },
    {
      "speaker": "Merlin",
      "time": "00:21:54",
      "upperBoundTime": "00:24:03",
      "content": "So seeing as I have to be at work for 7 o' clock, I'd have to get up 2, 3, hours earlier to take care of my hygiene and say my prayers to God, drink me a cup of coffee in the morning before I go to work. This is what I do every morning here. I take care of hygiene, take care of my, I get down on my knees and I pray, I read a verse of my Bible."
    },
    {
      "speaker": "Merlin",
      "time": "00:21:54",
      "upperBoundTime": "00:24:03",
      "content": "Then I go sit down watch the news while I'm drinking my coffee, then I go to work. I work by shifts. I go to work, now when I'm not working, I'm in a hobby shop, doing leather work, and I got my schedules."
    },
    {
      "speaker": "Merlin",
      "time": "00:21:54",
      "upperBoundTime": "00:24:03",
      "content": "Before I go in the hobby shop, alright tomorrow I'm off, go back in the dorms, take me a quick shower, email or something, then go to the hobby shop till 3 o'clock. Go back in the dorm, sit back, read me a verse of the Bible, take my shower, and catch the 5 o'clock news. Now if I get tired after that, they gone let. Between 6 and 8 I'm a be in that bed, Ima be gone. That's my day, that's my day."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:03",
      "upperBoundTime": "00:24:05",
      "content": "What's your job?"
    },
    {
      "speaker": "Merlin",
      "time": "00:24:05",
      "upperBoundTime": "00:25:30",
      "content": "I clean the showers. There 4 showers I got to cell. There's a cell block where them dudes got 23 hours in the cell, either 1 hour on the hall or 1 hour in the yard. They don't have no that clean the showers. So they assign me and another offender, his clean one side and I clean one side. All they got is 8 showers, he got 4, and I got 4. It takes me about an hour to clean. Then I'm off for the rest of the day. It's not no hassle, and it's a good job because security's not on your back. Once what you got to do, security ain't going to be on your back."
    },
    {
      "speaker": "Merlin",
      "time": "00:24:05",
      "upperBoundTime": "00:25:30",
      "content": "\"Well Merlin the shower ain't clean, this is wrong with the shower\" I always put in my mind, alright when I get the job, you give me the job, tell me how you want the job did. Once you tell me how you want it done, that's how it's going to be done, because you already told me. I'm going to do it. They'll come round to check, \"good work\". But I do that to keep them from being on my back. I'm a grown man, I should know what to do because you told me what to do, how you want it."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:30",
      "upperBoundTime": "00:25:33",
      "content": "How long have you had that job?"
    },
    {
      "speaker": "Merlin",
      "time": "00:25:33",
      "upperBoundTime": "00:25:45",
      "content": "I'm going on 3 years now, and they love me. The inmates love me, \"Man you clean them showers\" And security love me, no problem."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:45",
      "upperBoundTime": "00:25:56",
      "content": "So let me ask you this, it may seem like a ridiculous question. But, what do you consider the worst part of serving a life sentence at Angola?"
    },
    {
      "speaker": "Merlin",
      "time": "00:25:56",
      "upperBoundTime": "00:25:59",
      "content": "The worst part."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:59",
      "upperBoundTime": "00:25:59",
      "content": "Aside from serving a life sentence at Angola."
    },
    {
      "speaker": "Merlin",
      "time": "00:25:59",
      "upperBoundTime": "00:26:02",
      "content": "I'm going to tell you the worst part of serving a life sentence at Angola is denying my children their father. And I hurt my mom, my daddy, and my family. It hurts for my aunty and them not to see their nephew. It hurts me that my dad and my mom had to die without me being out there. It hurts me dearly for my children to become adults and I wasn't there to see them become adults. That what hurt me the most? And the victim's family, that I hurt them."
    },
    {
      "speaker": "Merlin",
      "time": "00:25:59",
      "upperBoundTime": "00:26:02",
      "content": "Anything else in here is obsolete to me. The thing about the people I hurt here, that's the worst thing to me in serving a life sentence. The people that you're hurting are family, remember that you took from a family. It hurts. I talk to my daughter, or my son, and they might have a problem. And he shared with me but I'm not out there to help him with it, and that's what hurts."
    },
    {
      "speaker": "Merlin",
      "time": "00:25:59",
      "upperBoundTime": "00:26:02",
      "content": "That's what hurts, I've even had, my brothers and my sisters come visit me and they'll tell me about a problem they're having and I can't even go about fixing it. And they'll come at me for advice. I've been incarcerated 39 years. I say why you all come that. \"Because we know you're going to give us the right answer\". But that's the worst thing in my life, being incarcerated, denying my family."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:02",
      "upperBoundTime": "00:28:28",
      "content": ""
    },
    {
      "speaker": "Merlin",
      "time": "00:28:28",
      "upperBoundTime": "00:31:19",
      "content": "The best thing about Angola I became a man. Whereas I see life for what it really is. It taught me, to become a chore, to know the value of life if I'm ever given freedom again, and it taught me that. It showed me that, the program that I done been through, taught me that."
    },
    {
      "speaker": "Merlin",
      "time": "00:28:28",
      "upperBoundTime": "00:31:19",
      "content": "And, I look at, if it weren't for Warden Cane that was here. All the programs that he allowed to be implemented in this institution while he was here, it helped. It helped us. It helped me, I can speak for me. It helped me to grow and know what I want, when I'm released."
    },
    {
      "speaker": "Merlin",
      "time": "00:28:28",
      "upperBoundTime": "00:31:19",
      "content": "He done great things at Angola, while he was here. I mean you got inmates that you wouldn't even believe, when they first got here the things that they was doing, how they had to change. Because this man, this one man wanted a change and he gradually made us change our way of thinking, our way of doing things at Angola. He give us something to strive for, hope. And he kept that there."
    },
    {
      "speaker": "Merlin",
      "time": "00:28:28",
      "upperBoundTime": "00:31:19",
      "content": "No matter what he did with his whatever, he want us to have hope, he wanted us to have a way out. He implemented many programs where we can get involved in so it could help us down the line on the pardon board or on the parole board."
    },
    {
      "speaker": "Merlin",
      "time": "00:28:28",
      "upperBoundTime": "00:31:19",
      "content": "Sometime it's going to come to a point where if you take these programs, don't forget what you learned from these programs, because a parole board member or a pardon board member might ask you what you got out of these programs and might ask you something about these programs. So you got to stay focused and remember what you're taught and learned in these programs."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:19",
      "upperBoundTime": "00:31:34",
      "content": "Do you remember the day that you learned that your parole eligibility would be revoked? For you and a whole bunch of folks who committed your crimes between."
    },
    {
      "speaker": "Merlin",
      "time": "00:31:34",
      "upperBoundTime": "00:34:17",
      "content": "Yeah, I know, yeah. When we went to going through that process, I was always under the impression that they couldn't do it. You can't take something away that you're giving us, by law. And I ain't going to say I stopped hoping, because hope will always be there. But I kept saying in my mind you can't do this. You give me a sentence with parole and now you take it, you can't do this. And I knew they couldn't do it but how to make them see that they couldn't do this. But when they done it, I never lost hope."
    },
    {
      "speaker": "Merlin",
      "time": "00:31:34",
      "upperBoundTime": "00:34:17",
      "content": "It's amazing for me to, I'm healthy, and I'm 57 years old. I took my old man physical whatever you want to call it and I'm healthy. I got a little slightly high blood pressure but glad I just take 1 pill for that. They've got people taking nitroglycerin and all that, that's when they really got it bad. But nobody could never tell me, I see 39 years of being incarcerated. But, I never lost hope. When they took the eligibility away I said no they can't do that. And I used to study law when I was in the parish all the way up till I come to Angola."
    },
    {
      "speaker": "Merlin",
      "time": "00:31:34",
      "upperBoundTime": "00:34:17",
      "content": "Doug and Calvin and all them they wanted me to get in a law program with them because that's what we were doing in the parish, messing with law. I said no I'm going to leave that to y'all because I'm a good researcher they know that. And I kept on and I said no brother I'm going to lose, I'm not going to be discouraged because I know they can't do it."
    },
    {
      "speaker": "Merlin",
      "time": "00:31:34",
      "upperBoundTime": "00:34:17",
      "content": "But I can't do nothing about that until I reach that 40 year period, if I do reach it. But once I do reach it, then I know what to do about it. And I just ain't ever lost hope."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:17",
      "upperBoundTime": "00:34:39",
      "content": "So, the other thing, that, if you wouldn't mind speaking to. What do you want people on the outside to know about the realities of serving life without the possibility of parole?"
    },
    {
      "speaker": "Merlin",
      "time": "00:34:39",
      "upperBoundTime": "00:38:34",
      "content": "Oh that's a reality, that's I feel like life without parole in the state of Louisiana, to me, is a harsh punishment. And I'm going to say it like this, you got 2 statutes, you got 1st degree murder, that carry 2 penalties, either the death penalty, and if they jury can't come back with the death penalty, then judge automatically sends you to life."
    },
    {
      "speaker": "Merlin",
      "time": "00:34:39",
      "upperBoundTime": "00:38:34",
      "content": "Then you got 2nd degree murder, carries a mandatory life sentence. Why have these 2 statutes with the same thing. Manslaughter carries 40 years but they got a parole eligibility date. Whereas you could take 2nd degree murder across the board with a parole eligibility date. But if you've got inmates in there for 2nd degree murder with no parole mechanism for them, and you want these offenders to rehabilitate give them something to rehabilitate for, and you'll see the overwhelming change in Angola."
    },
    {
      "speaker": "Merlin",
      "time": "00:34:39",
      "upperBoundTime": "00:38:34",
      "content": "They got dudes now because they feel like the '73 and the '79 bill is for a dude that been convicted in between that time, that it affects them. And I tell the dude, \"How were you sentenced?\" \"I got second degree murder but I was sentenced without parole for\" \"Did you have the 20 out of 40?\" \"No\". It's not going to affect you if you wasn't sentenced for the 20 or the 40. So now what is our next step? They're stuck."
    },
    {
      "speaker": "Merlin",
      "time": "00:34:39",
      "upperBoundTime": "00:38:34",
      "content": "No, your next step is to fight for what is right, parole eligibility across the board. But, serving a life sentence without parole benefits is just too farfetched, I got to put it like that, it's too harsh. Because if you want us to do right and abide by your rules and regulations, then give us something to do it for. Now once you get out there in society, it's on you."
    },
    {
      "speaker": "Merlin",
      "time": "00:34:39",
      "upperBoundTime": "00:38:34",
      "content": "But can never forget, you going to always have one bad apple someway in the group, you're going to always have one bad apple. Then he got to come back to pay the consequences, you don't let him out no more, he had a chance. But serving a life sentence without parole is hard. And you make enemies, do things that you don't really normally want to do. You take some offenders, they do things to not face reality or what they're faced with. They try to camouflage it."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:34",
      "upperBoundTime": "00:38:36",
      "content": "Can you explain that?"
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "Well you might get some kind who use drugs. Some kind will get their ass on drugs just to get out the rim of reality. And this drug might be harmful, it might cripple them in some kind of way. But they use it to get out of reality. But if you give them some type of hope, or they might want to stay in the cells for a long period of time, years and years and years."
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "And do things that's not in the norm, sling urine on security while they're in the cell, because they're not in the right frame of mind. They look at what they got, a life sentence without parole, and they ain't got no hope so they ain't got nothing to lose. So they do crazy things, throw urine on security. Poopoo, however you're going to put it, they say that and they throw it on security or throw it on another inmate. Cause they ain't got no hope. These are kinds of things that they do when they don't have no hope."
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "But if you give them hope, and I know dudes right now in the cells, offenders right now in the cell, they see that gradually bills are being passed. Each year some men pass. All the sudden they coming out the cells. So you give them something. They're coming on out the cells, they getting to school, they trying to take a trade. Whatever the free man tell them to do they abide by it, \"Alright sir let me take care of it\". Because now they got something to look forward to."
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "But if you don't give them nothing to look forward to, they'll always go backwards and do outrageous things. More talk crazy to security or fight security because they"
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "ain't got nothing to lose. But now you've given them hope. I see a lot of guys coming out the cells. I say, \"Why you coming out of the cell?\", \"Oh man they passed that bill\". I said but always recognize 1 thing, see them people that are sitting on that board, they not crazy. Oh you just come out the cell this year, because what you're on the parole board."
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "And they've got a right to deny you. Give them a little more time and let's see if you're going to act up, if you don't act up and you continue on doing the right thing they'll release you, the 2nd time. And I said \"Don't think you can play games with the parole board or the pardon board, you can't\". They got a mental health worker up there, you got a security officers who's been in correction for years."
    },
    {
      "speaker": "Merlin",
      "time": "00:38:36",
      "upperBoundTime": "00:42:36",
      "content": "They know our pattern, they look at our jacket, and can tell our pattern, and if they really see a change. They're going to make their judgment, but they're going to tell you why they denied you. You'll have to accept it, but don't let that discourage you, continue on doing well."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:36",
      "upperBoundTime": "00:42:55",
      "content": "That was great, I appreciate you sharing that. Merlin, tell me something, is there something that I, a question that you wished I had asked you. Or something you wanted to tell me about something you want people to know that I didn't touch on?"
    },
    {
      "speaker": "Merlin",
      "time": "00:42:55",
      "upperBoundTime": "00:44:48",
      "content": "Well, I'm like this here, when I be on the yard I look at dudes in the morning going in the field, going to work in the field. That type of job, or what they want, even if they call it punishment. What is you trying to accomplish out that? By working an offender in the fields, he can't take that home with him as a trade. But if you take him out in the field and have every camp, like where I'm at camp D, and put up buildings where you can get these inmates trades and let them get their GEDs and certificates."
    },
    {
      "speaker": "Merlin",
      "time": "00:42:55",
      "upperBoundTime": "00:44:48",
      "content": "Start letting them get something that's meaningful, that'll help. But you got a whole line made by 107 inmates in there to go pick some corn or soybeans. They're not doing that in New Orleans, they're not doing that in Baton Rouge, and they're not doing that in Shreveport. You got to educate them. This ain't no education, working in the field, its part of punishment. Get you some more workers, implement more programs, and gradually take them out the fields and let them get that education that they really need. And you will see overwhelming change."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:48",
      "upperBoundTime": "00:44:52",
      "content": "How long does an average inmate spend in the fields when they come to Angola? I think everybody starts in the fields, right?"
    },
    {
      "speaker": "Merlin",
      "time": "00:44:52",
      "upperBoundTime": "00:47:30",
      "content": "Yeah, majority. I never went in the field. But to have an inmate come in and go that's where it starts at. It all depends on the individual himself, how long he wants to be out there. They could allow you to be out there 90 days, 6 months, a year, 2 years, and 3 years. You just come to Angola. Alright say if you get an inmate come to Angola, let him work in the field 90 days without no write ups. Once he works 90 days in the field with no write ups you see he can get a job."
    },
    {
      "speaker": "Merlin",
      "time": "00:44:52",
      "upperBoundTime": "00:47:30",
      "content": "See in 90 days if you got anything available. Let him do 90 days in the field without a write up. Once he do the 90 days, give him a job, put him in a program. After you get a GED, put him in trade school and let him take every trade they got, about a year, he could do that. Gradually, you do that, everything going to be alright. Because you've given him something to fight for, you're giving him something positive to grow on."
    },
    {
      "speaker": "Merlin",
      "time": "00:44:52",
      "upperBoundTime": "00:47:30",
      "content": "Whereas if you just take him and put him in in the field you might leave him in there 6 months, you might leave him in there a year. That's not nothing positive. He got to work in the field in the summertime and the wintertime. And if the. But I feel like 90 days in the field is long enough if you don't get no write ups. If you don't get no write ups and you got jobs available, give him that job, then after that talk to him about getting in school, see if he want to get in school."
    },
    {
      "speaker": "Merlin",
      "time": "00:44:52",
      "upperBoundTime": "00:47:30",
      "content": "Now he's going to say yeah. They be trying to get into school, but they keep them in the field for so long."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:30",
      "content": "Okay, well that's a good point."
    }
  ]
}
