{"name":"","transcript":[{"content":"Michael Thomas Transcription REDACTIONS FINAL"},{"speaker":"Michael","time":"00:00:02-2","content":"I'm Michael Glenn Thomas the crime of conviction was 2 counts of first degree murder. I was 19 years old at the time and I have consequence was a plea bargain of 2 life sentences to avoid the death penalty."},{"speaker":"Marcus","time":"00:00:18-0","content":"And how much have you served."},{"speaker":"Michael","time":"00:00:20-7","content":"About 7 months short of 30 years."},{"speaker":"Marcus","time":"00:00:25-1","content":"Okay, so as I had said earlier the purpose of this interview is just for me to learn about you. So I want to start by going back to your childhood. Can you tell me a little bit about the folks who raised you and where you were raised?"},{"speaker":"Michael","time":"00:00:40-9","content":"I'm the youngest of five siblings brother dale is the oldest I have 3 sisters' two of which were twins. So I'm the youngest by 7 years. My parents both worked my father had a refrigeration and appliance business and my mother worked with my father."},{"speaker":"Michael","time":"00:00:40-9","content":"So it was a lot of relatives and some of my siblings that kind of raised me, because my parents wasn't always in the home. The only time I was really with them was when I was at my dad's work and most of the time he was out on the call doing stuff. So most of the time I was in the shop by myself entertaining myself pretty much."},{"speaker":"Michael","time":"00:00:40-9","content":"They divorced in 72 when I was 2 years old I don't know if they divorced before or after I made 2 but I still have memories from way from then even before then."},{"speaker":"Michael","time":"00:00:40-9","content":"So I lived, my mother when they separated, my mother went to live with her parents my grandparents on a farm in Beauregard Parish in DeRidder, real quiet we lived way down a dirt road. We had neighbors like miles apart from one another so I was raised on a farm until my mother remarried."},{"speaker":"Michael","time":"00:00:40-9","content":"I think she remarried in 76 and then I moved to we went from a farm to a bayou community and both communities were I meant relatively small its real quiet of course you have your situations that you have just like in any community. But I was relatively kept quiet it was just a quiet community I learned from my step farther and my step brother how to hunt fish track and different aspects of being in a bayou community"},{"speaker":"Marcus","time":"00:02:30-9","content":"Sure now where was that"},{"speaker":"Michael","time":"00:02:33-9","content":"The bayou community? That was in Terrebonne parish a little stop like community called Bourg it was a really nice place it was quiet."},{"speaker":"Marcus","time":"00:02:32-5","content":"Sure and how long were you there for?"},{"speaker":"Michael","time":"00:02:44-1","content":"I was there up until 83 and I was having little conflicts with my stepfather not?"},{"speaker":"Marcus","time":"00:02:52-7","content":"You were 13 at the time?"},{"speaker":"Michael","time":"00:02:53-6","content":"I was 13. So I went to live with my father and my father was a good man I've never been verbally physically or sexually abused by neither my parents or my relatives but I wasn't ready for that transition to go from a real quiet small community to living in a city in Lafayette. Everything's in your backyard. Whereas where I was if you wanted to go buy groceries, you had to travel, a good little ways to go to town get ice cream."},{"speaker":"Michael","time":"00:02:53-6","content":"So it was an event that you really appreciated, whereas a city everything was in your backyard and it was fast, everything was fast and I just I wasn't used to it and I started acting out because the school that I went to the middle school that I went to it was segregated at one time, my mother went to this school and it was segregated."},{"speaker":"Michael","time":"00:02:53-6","content":"When I went there it was about 75% black and the rest white and there was a lot of fighting at the school people from other schools used to come over to fight. And I'm not contributing to that because that was almost predominantly black because it was both black and whites were fighting, and it was just a very hectic time for me and I acted out I started skipping school, being truant."},{"speaker":"Michael","time":"00:02:53-6","content":"It was a very hard time for me but I stayed with my father because he wanted me to stay with him. And it was just a very hard time for me from that point on my life started I knew it I could sense it but it's like I didn't have any will to change it."},{"speaker":"Michael","time":"00:02:53-6","content":"As a shy kid growing up I took to drinking alcohol because everybody in my family drank alcohol. They were social drinkers, they didn't go out to really bars and stuff sometimes they did but they were more social drinkers like in the house they'd have a little poker game and stuff like that and I took to drinking and drinking just alcohol really destroyed my life form that point on."},{"speaker":"Marcus","time":"00:04:56-2","content":"So from a fairly early age 13, 14 you started drinking"},{"speaker":"Michael","time":"00:05:00-7","content":"I started drinking that's right and I actually left home my mother ended up divorcing my stepfather and moved to Lafayette to be by me and my other brothers and sisters. So I went back to live with her, and its I moved second semester of 8th grade I moved to another school, my mother took me out of that school that I was having problems at, brought me to another school."},{"speaker":"Michael","time":"00:05:00-7","content":"And for the first time it was weird because it's like in a country community type school away from the city, and for the first time in my life I was a popular kid. I moved here and I was popular all the guys wanted to hang out with me the girls wanted to date me. And I kind of reveled in that. I didn't take advantage of it abused it but because it was so different to me. I enjoyed it I liked being out there but yet I had a car, and I can get in it to go to the city and go drink."},{"speaker":"Michael","time":"00:05:00-7","content":"And I just I couldn't once I got that alcohol that addiction for that alcohol my life just like I said it just took a drastic turn for the worse."},{"speaker":"Marcus","time":"00:06:10-7","content":"And maybe we can get to that in a little bit more detail were there other adult's grandparents who were very special in your life coming up?"},{"speaker":"Michael","time":"00:06:21-0","content":"There was a few my grandmother who I lived with when I was on the farm. I really admired her because this woman worked all day long. She taught me how to tell time by going to feed the chickens and getting the eggs, I used to always wait and say grandma when is it time to go excuse me."},{"speaker":"Marcus","time":"00:06:59-8","content":"You take your time Michael, we're not in a hurry."},{"speaker":"Michael","time":"00:07:13-6","content":"She truly was a good Christian woman."},{"speaker":"Marcus","time":"00:07:21-5","content":"Do you remember your last interaction with her?"},{"speaker":"Michael","time":"00:07:23-8","content":"It was in the parish in, the parish jail she used to come visit me."},{"speaker":"Marcus","time":"00:07:30-8","content":"Was this in Lafayette parish."},{"speaker":"Michael","time":"00:07:34-2","content":"Lafayette parish."},{"speaker":"Marcus","time":"00:07:42-0","content":"Aside from your grandmother, were there some other adults who took a special interest in you?"},{"speaker":"Michael","time":"00:07:48-5","content":"My dad's youngest brother my uncle Carroll he was a Vietnam veteran. I had other uncles in my family that were veterans but he and I just we clicked. He was very kind to me. He was strict on his children but he was very kind to me and sad to say but I used to look forward to the times when he was drinking, because he would talk, he would open up and talk about Vietnam and Vietnam was a war of attrition terrible many people died."},{"speaker":"Marcus","time":"00:08:37-4","content":"Yeah. You and I are about the same age"},{"speaker":"Michael","time":"00:08:43-9","content":"Really?"},{"speaker":"Marcus","time":"00:08:46-1","content":"I remember as a child learning about that. But I didn't have anybody related to me who was in the war"},{"speaker":"Michael","time":"00:08:52-4","content":"Oh Really?"},{"speaker":"Marcus","time":"00:09:02-6","content":"I assume that your grandmother has passed away."},{"speaker":"Michael","time":"00:09:04-2","content":"Yes."},{"speaker":"Marcus","time":"00:09:05-5","content":"Do you still have a good relationship with your other relatives that you've mentioned your uncle?"},{"speaker":"Michael","time":"00:09:10-2","content":"The ones that I haven't the ones that were still alive at the time I was arrested we stayed in contact they used to come visit me a lot and when I got up here a few of them used to come visit me and then it just kept passing away I just had an aunt that passed away two days ago."},{"speaker":"Marcus","time":"00:09:25-5","content":"I'm sorry."},{"speaker":"Michael","time":"00:09:27-0","content":"Just all the older ones they're old like I said I was the youngest of 7 my mother was 29 when she had me my father was 36. So the age that they are its well my mother just turned 77 and she was 48 when I became arrested."},{"speaker":"Marcus","time":"00:09:46-5","content":"Okay is your father still living?"},{"speaker":"Michael","time":"00:09:48-2","content":"No he passed away in 2001 right before I got into the seminary he passed away. So he didn't get to see me get accepted or graduate. My mother did and that is the crowning moment of my life. Showing her that I'm capable of doing something with my life. That I can succeed at whatever I put my mind to and when I was able to hand her that that degree."},{"speaker":"Marcus","time":"00:10:18-5","content":"Oh yeah that was a proud moment I'm sure."},{"speaker":"Michael","time":"00:10:23-5","content":"Yes."},{"speaker":"Marcus","time":"00:10:30-5","content":"You said that school had started to get very difficult for you but then you moved to a new school where things were much better. Do you have a particular memory of a teacher who took an interest in you or what are some of your memories from that school the school that you moved to when your mother moved back to Lafayette?"},{"speaker":"Michael","time":"00:10:51-9","content":"All the teachers were very it was a small community all the teachers were great one thing that really sticks out though is we had an 8th grade prom. A graduation if you graduate because from there you go to high school there was no junior high there you go straight 9th grade 10th, 11th, 12th high school. So we had a graduation and my sister I was the only ,this is all the way in the country we had."},{"speaker":"Marcus","time":"00:11:19-6","content":"You were outside of Lafayette."},{"speaker":"Michael","time":"00:11:19-6","content":"Right so this is in a town called Judice in Lafayette, real small town and it wasn't uncommon to see kids driving these big combines and tractors down the road they don't have a license."},{"speaker":"Michael","time":"00:11:19-6","content":"So my sister I'm I had forgotten my ticket to go to the graduation in my locker box and the lockers were inside the gym and I had to go get it and my sister had her car there she was living with my mother and me and that was my eldest sister. So I told her I said, \"Tracy I need to go to the school, would you mind driving me to the school.\" It's just down the road not even well maybe a mile. She said she threw me the keys said, \"Of course here go.\" I said, \"You're serious.\" She said, \"Sure.\""},{"speaker":"Michael","time":"00:11:19-6","content":"So my other cousins they were visiting me, they jumped in the car, they want to go drive. So I'm backing out of the driveway she's on the front porch I said you sure she said, yeah go. So I left, I went to the school and I drove up. They had one of the female teachers who was also a gym coach was there with all the girls in the school they were decorating the inside of the gym and they had already put posters over where my locker was at, and they saw me and they said, \"Get out of here you can't be in here, you can't see all this stuff right now.\""},{"speaker":"Michael","time":"00:11:19-6","content":"I told the teacher what had happened and she said, \"Look when you show up this evening just let me know and I'll let you in.\" Well when everybody when all the girls came outside to tell me bye and they noticed the car they said, \"You drove here in that.\" And I said, \"Yeah I did.\" And they said, \"You're driving tonight? What I'm going to say? I said, \"Yeah sure I'm driving.' so everybody wanted me to go pick them up."},{"speaker":"Michael","time":"00:11:19-6","content":"So when I got back I told my sister what happened she said, \"Well I guess I got to let you use the car. I said yeah but I don't know where everybody lives at. I said I gave them the phone number and they going to call I said I'm not going to go in town or far away to go pick anybody up but long story short I ended up with a whole car full of people. I was the only person that drove to the 8th grade graduation. I'm surprised guys didn't show up in the combines and stuff out in the country. But it was a fun time it really was."},{"speaker":"Marcus","time":"00:13:45-9","content":"Yeah so tell me about high school how was high school for you."},{"speaker":"Michael","time":"00:13:49-0","content":"High school it was Acadiana High School, it also out in the country. It 4-8 school it was a pretty big school. We had an awesome football team. I tried out for football and I made it was I played freshman for a little while and it just I didn't have anybody to come pick me up after practice I had to walk home and I just I didn't have that that support family support. I don't think they wanted me to play in the first place."},{"speaker":"Michael","time":"00:13:49-0","content":"So I got out of that but high school it was it was memorable in the aspect that older adolescents you could say and people had cars and they were going out stuff like that and that that didn't help as far as the drinking side goes but I remember going to pep rallies going to do that but other than that I started I started skipping."},{"speaker":"Michael","time":"00:13:49-0","content":"I know one of the questions you're going to ask is about if I ever got kicked out of school and there was there was a time, this girl that I was dating at the time."},{"speaker":"Michael","time":"00:13:49-0","content":"She was my first love whatever you want to define love as when you're that young. She started being unfaithful and I'm the kind of guy that despite all the stuff that was going on in my life and all the divorces and things going on in my family, I believed in then and I still do believe in a monogamous relationship."},{"speaker":"Michael","time":"00:13:49-0","content":"And she started cheating on me and I was acting out and something happened in class where a teacher told me to do something and nothing in any way related to the teacher. I said something I don't know if I cursed her or if I called her something I don't what it was, but I know something happened and I don't remember if I was suspended or if I was sent to detention after school something I don't remember what it was but I know there was an event that happened and I know it was directly related to me acting out because the girl I was dating at the time was cheating, was not being faithful at the time and I sort of remember about that."},{"speaker":"Marcus","time":"00:16:14-8","content":"So when you would skip school would it be primarily to drink?"},{"speaker":"Michael","time":"00:16:19-0","content":"To drink and just go ride around go joyriding in the car."},{"speaker":"Marcus","time":"00:16:23-3","content":"Sure did you graduate from high school?"},{"speaker":"Michael","time":"00:16:28-6","content":"No I dropped out and I moved with my mother was living in Crowley, Louisiana and I applied to get my general equivalency diploma some people call it good enough dummy diploma but I went to get it because I wanted to go into the army but I got it."},{"speaker":"Michael","time":"00:16:28-6","content":"I went to take my preliminary test Ms. Faulk I'll never forget her name she was my instructor. You take a preliminary test to see where you're score at where you're weak where your weak points are at so you can go back and study. Well I scored so high on that that. I didn't know I scored high on it but it was like a month or two passed and I didn't get any notices to come back to class."},{"speaker":"Michael","time":"00:16:28-6","content":"So I went I drove to the school and I talked to Ms. Faulk and she said oh we forgot must of forgot to mail you a letter or something. But you scored so high on the test that you just going to come straight in and take the final exam. I said well okay. So I took that and I got my diploma and I wanted to I asked to put it from high school where I went to high school at but they made it from Crowley Spartans, I went from being a Spartan."},{"speaker":"Michael","time":"00:16:28-6","content":"But that was a nice community too Crowley. It was the streets were set up like a grid like 1, 2, 3 a, b, c kind of grid and there was a main street with a courthouse and jail was all in the center the odd part about that is at the time I had a Buick Regal and this was a time when people were putting a lot of speakers in their cars and subwoofers and stuff and I had this in my car. And I used to pass through the main street and the jail people that was in the jail the yard that they used to go on for recreation was right there, not a few feet from the road."},{"speaker":"Michael","time":"00:16:28-6","content":"So I'd see them and I'd pass by they'd tell me to crank my radio up and I'd turn my radio up, go by real slow so they could listen to the music and I'd make come back around and I thought it was kicks and here it's kind of ironic here now I'm incarcerated."},{"speaker":"Marcus","time":"00:18:39-6","content":"Only there's nobody that can get close enough to drive past you with the music playing. So, like to get you to explain what led to these charges that got you down here but before I do that what do you have a particular memory that you kind of hold onto from your childhood a very pleasant memory, what's your best memory of your time before this?"},{"speaker":"Michael","time":"00:19:16-1","content":"I used to love to go camping my stepbrother Ricky he was 7 years older than me he taught me he and I used to be tight as thieves thick as thieves however you want to say it. We used to go camping out a lot and my thing I used to lay in a hammock we brought a tent but I liked the hammock put a mosquito net over you build a fire next to you eat whatever you killed out there in the woods."},{"speaker":"Michael","time":"00:19:16-1","content":"That's what I enjoy, just getting away from society, getting away from all of the noise and confusion and just being alone with nature that's what I love."},{"speaker":"Michael","time":"00:19:16-1","content":"I say being alone with nature now but I'm out there with a shotgun destroying nature. It's just what you do is what you do I didn't see that back then."},{"speaker":"Marcus","time":"00:20:16-3","content":"Yeah, I get it I understand, so you'd mentioned a girlfriend, in high school, did you have other intimate relationships before this happened?"},{"speaker":"Michael","time":"00:20:34-1","content":"The last one, and I'm ashamed to say it occurred, when I was in my second intimate relationship it was the girl that I wanted to really wanted to marry I wanted to marry my first love, but as I said I believed in monogamous relationships. When we broke up I went to live in san Antonio with my father at the time who was living right across the street from."},{"speaker":"Marcus","time":"00:20:49-7","content":"And how old were you then."},{"speaker":"Michael","time":"00:20:55-1","content":"I was 16 I believe 16, 17."},{"speaker":"Marcus","time":"00:21:00-0","content":"Okay you're still but wait so this is before you do the GED."},{"speaker":"Michael","time":"00:21:06-6","content":"Right."},{"speaker":"Marcus","time":"00:21:05-2","content":"You go to San Antonio where your father's living for summer or something like that, is that it?"},{"speaker":"Michael","time":"00:21:13-9","content":"Yeah I lived there for a little while past summer into school I just never went to school there my other family cousins did go to school but I opted not to go I wasn't forced to go so I just worked with my dad. I came, we lived right across the street from Ackerman Air Force Base and that's where my love for the military really came from because I used to sit on top of the apartment complex, and watch these jets in the evening time do all them maneuvers and stuff over the town."},{"speaker":"Michael","time":"00:21:13-9","content":"I came back and I met my first, actually I met my second love, my second intimate relationship I had the very first night I was back and she was my first love's friend. I didn't know that at the time I noticed a couple years later, and she was an awesome individual smart. She was like a savant, this girl, whatever. She was very educated beautiful, she played whatever instrument she wanted to play. Intelligent I admired her. I admired her and it was intimidated and jealous at the same time."},{"speaker":"Marcus","time":"00:22:26-8","content":"What's her name?"},{"speaker":"Michael","time":"00:22:26-6","content":"Michele Monclova, extraordinary individual. She's the type of person that is faithful and sometime into our relationship, alcohol, I started not believing in the relationship anymore I guess because I guess feelings from my first relationship bled over, and I'm thinking eventually this is going to come to an end. She's going to be unfaithful and here it is I'm going to get hurt all over again."},{"speaker":"Michael","time":"00:22:26-6","content":"So here I go with my stupid self, I start acting out. I start cheating and doing things because I'm thinking, I'm going to beat you to the point, that's an alcohol gives you this weird mindset and way of looking at things and this is what was going on with me."},{"speaker":"Michael","time":"00:22:26-6","content":"So I met this, by going out, I was introduced to this to this older woman. I was 18 at the time she was in her mid-20s and it was more of I was fascinated at this older woman to me an older woman and that this older woman would be interested in me. I mean so her and I started going around together and we became intimate and she was actually arrested with me when I got arrested. She had nothing to do with the crime, didn't know nothing about it she was the third and last of the relationships that I got into."},{"speaker":"Marcus","time":"00:23:57-2","content":"Do you have any children?"},{"speaker":"Michael","time":"00:23:59-0","content":"No and that's a miracle in itself. No children thank God maybe if I would have had a child with my first love I think that might have it could have done one of two things but I think it would have ended in a positive way. Because I practically raised some of my nieces and my nephews because my sisters used to always go out all the time so they used to leave my nieces and my nephews with me and I was taking care of them for a little while."},{"speaker":"Michael","time":"00:23:59-0","content":"So I think a child although it would have been out of wedlock I think a child would have helped me focus."},{"speaker":"Marcus","time":"00:24:37-8","content":"Sure. So you said that you got you didn't really get kicked out of school but you got into trouble one time when you were acting out, were you ever arrested before this charge?"},{"speaker":"Michael","time":"00:24:47-4","content":"I was never arrested I was never arrested."},{"speaker":"Marcus","time":"00:24:50-8","content":"So tell me a little bit about how you ended up going down on this particular charge."},{"speaker":"Michael","time":"00:24:56-8","content":"It did, I said before it's not it's not a cop out its not accepting responsibility but alcohol done it I didn't really do drugs I toyed around played around with mushrooms. Acid, I smoked marijuana I could count how many times on one hand and still have fingers left one time was a very bad experience I got smoke marijuana and they say marijuana makes you hungry well I ate a bunch of food and I believe that gave me some type of intestinal fluid."},{"speaker":"Michael","time":"00:24:56-8","content":"My mother had to come from Lafayette all the way down to parish to come get me and bring me to a walk in clinic, and my equilibrium was shot, I was throwing up. Now I never smoke marijuana after that because I don't know if the doctor told my mother they found the whatever that stuff is in my system or not but it scared me to death and I never messed with marijuana but the alcohol I couldn't shake."},{"speaker":"Michael","time":"00:24:56-8","content":"And I've read when I was arrested. Apparently I gave some type of statement a confession whatever it is and I've read it and I've read it over and over and over again for many years and to the point to where I don't know what is true anymore I know in my heart I'm guilty."},{"speaker":"Michael","time":"00:24:56-8","content":"What exactly transpired that night, I'm not particularly sure. Even the memories that I do have I don't know if I trust them or not because when I I do think about it sometimes it puts I remember and sometimes the thoughts that I think I remember something else will come up that's totally a contradiction."},{"speaker":"Michael","time":"00:24:56-8","content":"So in that I took four years of I have a bachelor's degree and every year I've taken some type of psychology class and one of the things that all my professors told me to do told us all not to do is self-diagnose."},{"speaker":"Michael","time":"00:24:56-8","content":"So but I you try not to but you do anyway, something what is this, is this a repressed memory? Because tragedy I said or is this me not wanting to take responsibility and I said no the latter is not true because I do take responsibility although I don't remember exactly what happened, and what's true and what's not true I know I was there, I know I played a part in it."},{"speaker":"Michael","time":"00:24:56-8","content":"But I don't know exactly what happened and that's and every day I wake up in this place I'm faced with that reality. I don't know exactly what happened. I think if I could have just been strong enough to say no to the alcohol, if I wouldn't have had and I don't blame any of my family at all."},{"speaker":"Michael","time":"00:24:56-8","content":"If I just would have had some adult a male adult just grab me by my collar and shake me up and pull me and say, \"Hey look I see where your life is headed, if you don't turn around.\" I think that would have done made all the difference in the world for me."},{"speaker":"Michael","time":"00:24:56-8","content":"But the main causal factor beyond any doubt in my mind is alcohol, why alcohol is not considered like marijuana, a controlled substance I don't know because you look at how many people die on the highways, in wrecks and just drinking alcohol, you become crazy. People who overindulge in alcohol they get violent they do dumb things look at how many people die each year because of alcohol."},{"speaker":"Marcus","time":"00:28:50-5","content":"Sure so you don't have any clear memories of what happened but you do know that."},{"speaker":"Michael","time":"00:29:02-9","content":"I was there I was involved to what participation I'm not particularly sure and it's not me not taking responsibility because I do I am guilty of this crime on both individuals I just don't know exactly what happened. And I know I think about the victims the victim's family I knew the victims I knew the male Chris the girl I only met her I couple of times."},{"speaker":"Michael","time":"00:29:02-9","content":"But Chris I knew, I used to, I did work for him, I think about them no individual deserves to pass away have their live taken like this no individual I don't care what you have done I think about them often I think about their family. I know Chris. He must have been the breadwinner of the family. He was a very intelligent human being I believe he was responsible if I'm not mistaken he had invented what's called a blowout preventer for a rig, offshore rigs? And I don't know if he was to get royalties from that his but aside from all of that being breadwinners and not this is individuals who have family just like I do."},{"speaker":"Michael","time":"00:29:02-9","content":"And I know how much my family loves me that's the it gives me little bit of introspective to their family because I know how much my family loves me and if something were to happen to me where how they would feel because of my mother and my father and all of the relatives. So I think of them often every day, there's not a day that goes by I don't think about the family."},{"speaker":"Marcus","time":"00:30:36-1","content":"Did you carry a firearm did you have access to firearms?"},{"speaker":"Michael","time":"00:30:43-0","content":"No other than growing up hunting, no firearm was used in the commission of this crime."},{"speaker":"Marcus","time":"00:30:53-7","content":"So if you had to identify a causal factor it would be alcohol?"},{"speaker":"Michael","time":"00:30:57-1","content":"Alcohol."},{"speaker":"Marcus","time":"00:31:00-5","content":"Okay I'm sure that you've spent a lot of time doing this it would be a natural thing to do to think what if this night hadn't happened."},{"speaker":"Michael","time":"00:31:10-8","content":"Exactly."},{"speaker":"Marcus","time":"00:31:13-2","content":"How do you envision that your life would have progressed from there for the next few months and years what would that look like?"},{"speaker":"Michael","time":"00:31:18-9","content":"If I could have gotten away from the alcohol I was wanting to go into the army. I wanted go into the buddy system with one of my cousins two of my cousins we were like the 3 amigos I was the oldest one was jimmy he successful he got into the army and then it was me and then my youngest cousin Brent both got into the army."},{"speaker":"Michael","time":"00:31:18-9","content":"Brent was the youngest by a year, we were all separated by a year I wanted to go on the buddy system with him he left before I did, well before I got I went in. I wanted to make a career out of the army I being living in San Antonio and watching these jets."},{"speaker":"Michael","time":"00:31:18-9","content":"Because I had a GED I knew I couldn't get into the marines. The air force is where I really wanted to go but I saw my life as going in the army I wanted to be an aircraft mechanic and from a mechanic I wanted to be an engineer I wanted to learn to design and from an engineer I wanted to be a test pilot and so forth. I saw myself as by now being retired but being a consultant in aeronautics or in jet propulsion that's what I wanted to do, that's what I really wanted to do"},{"speaker":"Marcus","time":"00:32:38-3","content":"Sure so I want to shift gears a little bit and get to your time since coming here I imagine that you spent a little time in the parish jail you've mentioned that your grandmother visited you there and then coming up here. How old were you when you got here?"},{"speaker":"Michael","time":"00:32:56-5","content":"I think I was at my 21st when I was going through ARDC at Hunts I think I turned 21 there. I got here in May I believe."},{"speaker":"Marcus","time":"00:33:09-5","content":"So before we get to that is there something else about the first 20 years of your life that is really important in sort of shaping your life that I didn't ask you about or you didn't get a chance to talk about."},{"speaker":"Michael","time":"00:33:21-0","content":"First 20 years pre-Angola?"},{"speaker":"Marcus","time":"00:33:24-0","content":"Yes."},{"speaker":"Michael","time":"00:33:26-0","content":"What shaped my life?"},{"speaker":"Marcus","time":"00:33:26-5","content":"Is there something that I should have asked you about your childhood about your adolescence that I didn't?"},{"speaker":"Michael","time":"00:33:33-1","content":"Well before I broke down talking about my grandmother. My grandmother was a woman of faith and I just admired her. She used to sing a song of The Old Rugged Cross all the time. And though I didn't understand it at the time faith and a creator a higher being something other than yourself I saw the effects of it on her and how she loved and took care of her family."},{"speaker":"Marcus","time":"00:34:14-6","content":"Would you say that looking back now she was a role model for you?"},{"speaker":"Michael","time":"00:34:18-1","content":"Absolutely."},{"speaker":"Marcus","time":"00:34:24-1","content":"Was she alive long enough to be able to visit you here at Angola?"},{"speaker":"Michael","time":"00:34:25-7","content":"No she passed away in the parish. No I take it back she passed away I think within the first year or two since me when I got here."},{"speaker":"Marcus","time":"00:34:35-1","content":"So let's talk a little bit about coming here. I imagine you sobered up in the jail and began to have a clearer sense of what had happened of what you were facing"},{"speaker":"Michael","time":"00:34:58-7","content":"Right exactly."},{"speaker":"Marcus","time":"00:35:00-6","content":"You're then on the bus heading to Angola with 2 life sentences what's going through your mind on that bus ride?"},{"speaker":"Michael","time":"00:35:07-2","content":"I was scared to death we turned on this road to come here this is before they reconstructed the road made the high hills flat and kind of straightened it out this was a long winding road with ravines to your left and to your right and I feel like I'm in a bus with a maniac driver because he is just cruising down this road. I'm thinking we going to flip, we going over the edge, this is my fate right here."},{"speaker":"Michael","time":"00:35:07-2","content":"Will we make it but I'm frightened."},{"speaker":"Michael","time":"00:35:07-2","content":"I've been told about Angola, my dad at one point in my life, my dad told me when I was messing up he said boy you gone end up in Angola and I'm not thinking Angola prison I'm looking at a globe, and I'm seeing Angola Africa and I'm sitting there wondering why they're going to send me to Angola Africa for, way over there in another continent but when I got here I was very frightened. I was terrified. I was uneducated. I was gullible. And I was just scared."},{"speaker":"Michael","time":"00:35:07-2","content":"And when I got here going through this process and I didn't know what was going on they said because of my age they going to send me to work in the cell block, they didn't want to put me in population at my age. They put me in the working cell block and it was crazy the way these people were acting"},{"speaker":"Marcus","time":"00:36:40-2","content":"Yeah tell me about your first few weeks here what was that like?"},{"speaker":"Michael","time":"00:36:43-8","content":"Going out in the field, if I was not in the field I was locked in the cell with another individual a little bitty small cell it's not even big enough for one person and you have to the commode and sink everything right there all it's like all your humanity is just taken from you, because now you have to share a shower with another man, and somebody sitting on the commode right here feet from you."},{"speaker":"Michael","time":"00:36:43-8","content":"You having to deal with all these kind of I don't want to say it desensitizes you because it didn't, I never got comfortable in that situation even now 30 years having to shower next to or use a restroom next to another man, it's just unnatural having to do that you should have some type of privacy, and it's just everything is just taken from you in that aspect and part of you says you deserve it. Because look at what you've done you deserve it."},{"speaker":"Michael","time":"00:36:43-8","content":"Some people do it turns them into straight up animals certain behaviors that they would never do in in the public, in society they adopt here and that becomes their normalcy, their new normal. I've never people who know me can tell you that I've never given way to that type of behavior. If it's not something I wouldn't want my mother to see or if I was to go in front of the parole and pardon board."},{"speaker":"Michael","time":"00:36:43-8","content":"I wish they would put a GoPro, and see my life but the bad part about that is they would see other people's lives. But to see how I interact with other people things that I accept things I don't accept, things I participate in and what I definitely don't wish they could see that. They would really know me because when you go for a pardon parole clemency hearing they get the brief history on paper black and white who you are that's not everything about you. If I'm educated that doesn't mean I'm a better person. If I'm not transformed if my minds not renewed that doesn't make me a better you have to have another way of thinking of viewing things. Education opens up options for you but it doesn't make you a better person."},{"speaker":"Marcus","time":"00:39:19-4","content":"Sure I understand and so you're just trying to get used to this very different lifestyle where you have no privacy."},{"speaker":"Michael","time":"00:39:30-8","content":"Exactly."},{"speaker":"Marcus","time":"00:39:32-3","content":"What you're saying is it's something you tried not to get used to?"},{"speaker":"Marcus","time":"00:39:32-3","content":"Michael #00:39:36-4# Did you find yourself getting into a lot of fights?"},{"speaker":"Michael","time":"00:39:40-3","content":"I've gotten into one physical altercation since I was here. No I knew it was going to come somebody I had a relative two relatives that was in the parish jail with me told me soon as you get over here go to the biggest person you can find and hit them I'm like what that's crazy what kind of nonsense is that and they go well that'll show people that you're not afraid to fight."},{"speaker":"Michael","time":"00:39:40-3","content":"So I said I'm not going do something like that. I said but if somebody is aggressive towards me I will defend myself. The very first fight that I got into, I tried to avoid, I saw this situation was building up when I finally was in population, I was in the dorm and now homosexuality was real rampant in here it still is but its more subtle the way it's done, just like technology increased well people's ability in the way they do things changes here too, it evolves."},{"speaker":"Michael","time":"00:39:40-3","content":"So I was I used to try to wait as late I used to go stay on call, I'll stay out of the dorm as late as I could so I could come in take a shower most of the time I was by myself and I cleaned the shower and everything. Well there was one individual who just kept on kind of putting things out there verbally, he was in the shower and he kept asking me can I can't handle my business. I know what he's talking about he's talking about masturbate while I'm in the shower. I say, \"Look I don't care what you do when I'm not in here, but while I'm in here. Don't do that.\" And he kept asking me and whenever he kept asking me, that's when I walked up to him and I hit him in the shower. We got in a fight in the shower and there was there was a couple of people that was back there in the shower at the time and they hollered."},{"speaker":"Michael","time":"00:39:40-3","content":"And the officers come and he was in the dorm shaking down somebody's box, but he heard the commotion so he came. So we stopped and tell me he come in and said I know somebody was fighting I heard it he said who was fighting everybody said nobody fighting in here. So he there's a beeper that they carry around. He hit the beeper and security came they separated everybody made everybody go in their bunks."},{"speaker":"Michael","time":"00:39:40-3","content":"And one thing they do, if they don't' know who did what, they'll pick somebody out and say okay you getting locked up for fighting. He was back there by the shower and as a person who was fighting I don't want to see someone get locked up for something I did. So I came forward and I said I was fighting, before I did that I went up to the guy I said look I'm going and letting them know I was one of them who was fighting. I said you do what you want to do I said but I'm going to let him know that I was the one who's fighting. So this guy doesn't get locked up."},{"speaker":"Michael","time":"00:39:40-3","content":"And he confessed too and one of the lieutenants at the time well he was a captain at the time, he asked me well he pulled me aside and said what happened and I was truthful with him I told him exactly what happened. I said this guy kept on asking me about masturbating in the shower and I told him don't do that while I'm present. I said when he kept going asking about it that when I said I hit him first."},{"speaker":"Michael","time":"00:39:40-3","content":"And it actually as embarrassing as that is, it actually turned out in my favor because I went from a field line to a working to another part of the penitentiary, where you worked you got out of the field and you worked you got a regular job. So that worked to my benefit, because there was a lot of people who spoke up on my behalf who knew me since the time I was here."},{"speaker":"Marcus","time":"00:43:22-1","content":"Sure how long into your stay here did that happen?"},{"speaker":"Michael","time":"00:43:24-8","content":"Well that was in 2001, so I got here in '92."},{"speaker":"Marcus","time":"00:43:34-0","content":"alright when you obviously one of the reasons that we wanted to talk to you is that you're another example of a person who came here very young, who is considered to be transformed, turned their lives around after coming up to three decades but how would you describe that earlier Michael Thomas? The Michael Thomas that came here how would describe that man?"},{"speaker":"Michael","time":"00:44:12-6","content":"I was uneducated then and gullible. I lacked confidence. I was shy I'm still shy to a degree it's just part of me as an introvert melancholy to the bone. Now from being here for such a long period of time the other offenders convicts and security personnel officers that know me have confidence, and they know who I am."},{"speaker":"Michael","time":"00:44:12-6","content":"They know that I my name is not ringing in the ears as somebody they need to watch and they chasing after me I'm a wrongdoer. I have confidence in that wherever I go people see me as that if I'm somewhere I'm supposed to be there. Of course I still go through the shake downs, I expect that because that's what an officer is supposed to do when you go from one area to another, but there's nothing on me for me to get written up for, because I just don't do that."},{"speaker":"Michael","time":"00:44:12-6","content":"I'm trying to go home. I don't want to spend the rest of my life here, but education has given me confidence. I have very few limited friends here because you've heard the thing of ulterior motives. A lot of people here they want to be near you or by you or want to be associated with you because if it's a good thing they want that's great but some people have other things whether its money, material possessions something like that they want part of that."},{"speaker":"Michael","time":"00:44:12-6","content":"So there's very few actual close friends that I have here that are my confidant who I confide in, but I'm more confident now than I was then. Over all I'm just more confident when I go somewhere I don't worry about people messing with me anymore because people know, I've even had people who people that I know that still are in prison penitentiary stuff, they don't do it in front of me, matter of fact they let me know so I could vacate the premises, so I'm not around them."},{"speaker":"Marcus","time":"00:46:37-5","content":"So what kind of stuff are you talking about?"},{"speaker":"Michael","time":"00:46:41-4","content":"They smoking marijuana doing drugs other illegal activities they won't hand me something that's illegal, and say here can you bring this to so and so because they know I won't do it."},{"speaker":"Marcus","time":"00:46:52-8","content":"You're not going to do that. Alright if you could have gone back and given that young Michael Thomas some advice knowing what now 3 decades of wisdom to look back on, what would you tell him?"},{"speaker":"Michael","time":"00:47:10-2","content":"Go slow take your time pick your friends wisely allow time to elapse you could witness a person's character play out because what people are in front of you when they first meet you, doesn't necessarily translate further on as you know them. . You will see a metamorphosis take place, that's pretty much it."},{"speaker":"Michael","time":"00:47:10-2","content":"Well one other thing get educated learn open up your open up your world with educational options have some transferable skills."},{"speaker":"Marcus","time":"00:47:53-8","content":"When did you graduate from the seminary."},{"speaker":"Michael","time":"00:47:59-2","content":"2005. I had just got in. When I did in 2001 they just started this new cycle where classes came around every 4 years, and they just started, so at the end of the 4 years all my credits were done, everything I needed to graduate, all my classes were taken care of."},{"speaker":"Marcus","time":"00:48:25-9","content":"Got it. Can you describe what your days are like now? So you graduated from the seminary everybody there at Angola has a job can you walk me through your routine when you wake up in the morning till you go to bed? What is your daily routine?"},{"speaker":"Michael","time":"00:48:42-1","content":"I know you've heard it before but if you doing something you love it's not a job and well I wake up in the morning I'm not stressed for time officers don't come get me up and say hey you need to get up and you need to be somewhere I'm in a position where I work where I'm allowed some leniency when I get to work and when I leave work."},{"speaker":"Michael","time":"00:48:42-1","content":"I'm working I'm still classified as an inmate minister. I'm not a pulpit behind a pew type minister I'm more of a one on one type counseling somebody. Many people come to me throughout the day the weeks the months with different complications and they talk to me and they confide in me because they know I'm going to tell them the truth and it may be a little harsh but I'm going to tell them the truth I don't do it to hurt them I do it to wake them up."},{"speaker":"Michael","time":"00:48:42-1","content":"I get up in the morning most of the time I don't eat breakfast. I sleep a little later because I stay up a little later. So I go down to the gym that's where I'm assigned to as a janitor, I do janitorial work, and we have a shop that's called the Toy Shop Incorporated, you may have heard about it. What we do is we build and refurbish toys and distribute toys and bicycle to underprivileged kids throughout Louisiana whoever wants to be part of the programs."},{"speaker":"Michael","time":"00:48:42-1","content":"So the majority of my day I'm in the toy shop. I do besides janitorial work I maintain the flammable cabinet that we have. I maintain the a tool cabinet that we have and a tools is just tools that are considered weapons scissors, other type of cutting tools I maintain all of that. If we have a machine or a tool that needs to be repaired, fixed I do that. I do electrical work and plumbing work."},{"speaker":"Michael","time":"00:48:42-1","content":"I don't have any certificates in those areas but my mentor was Tommy Joyner he used to be the president as I mentioned before of the Toy Shop and actually founder of the toy shop who made parole he was that 73 to 79."},{"speaker":"Marcus","time":"00:51:08-4","content":"Second degree."},{"speaker":"Michael","time":"00:51:10-7","content":"Right that that had the parole and they took it from them and they gave it back and he was one of the first ones to make it so he was my mentor for 10 11 years now. Once I do all that go to the shop and see whatever needs to be fixed done repaired whatever I started working on my own hobby my hobby craft or if there's any type of what they call special project if the warden needs something to be worked on whatever that's brought into the shop I'm involved with that also."},{"speaker":"Marcus","time":"00:51:38-5","content":"What are you making in the hobby shop?"},{"speaker":"Marcus","time":"00:51:38-5","content":"Michael:I was doing stainless steel jewelry and gold plated items I quit doing stainless steel because I wanted because I mass produced it I used to my inventory consisted of 2000 almost 3000 pieces of jewelry I take to the rodeo. I did very well supported myself very well with that."},{"speaker":"Marcus","time":"00:51:38-5","content":"That's one of the things I pride myself in because since 2005 I've never really had to ask my family for any money. I've been able to take care of myself. Now I've had some highs and lows where they have sent some money to me but been able to take care of myself. I put myself here my family didn't and as a man I feel it's my responsibility if I'm given the opportunity to take care of myself I should."},{"speaker":"Marcus","time":"00:51:38-5","content":"Should I do that through the hobby craft now tommy the president he turned bowls wooden bowls and out of segmented bowls and out of trees solid bowls and I picked up where he left off, and I'm making that transition. Now I got about 50 of them done now already at the rodeo and so I mean I jumped headlong into it I still have my gold plated stuff but that's pretty much what I do."},{"speaker":"Marcus","time":"00:53:02-2","content":"Did you make the necklace that you're wearing?"},{"speaker":"Michael","time":"00:53:03-5","content":"Yes I did this necklace I did as a just same thing as my graduation ring, I did it as a tribute to my mother my birthstone. My birthdays in April may birthstone is a diamond my mother's is in August."},{"speaker":"Marcus","time":"00:53:20-5","content":"I see yeah."},{"speaker":"Michael","time":"00:53:25-1","content":"She's at the center of my life."},{"speaker":"Marcus","time":"00:53:28-6","content":"Yeah that's great. So you do that and it sounds like you're good at it."},{"speaker":"Michael","time":"00:53:32-4","content":"I've been successful with it."},{"speaker":"Marcus","time":"00:53:35-1","content":"And then after that what's your evening like?"},{"speaker":"Michael","time":"00:53:37-5","content":"I pretty much wind down in the evening like one of the privileges as a trustee I'm a I'm the secretary in the Toy Shop so there's a office there that I can go to, and I'm allowed to relax. I'm allowed to have a television, now some people would disagree with that but it's a privilege it's not a right. It can be taken from me at any time I don't abuse the privilege."},{"speaker":"Michael","time":"00:53:37-5","content":"I'm not somebody to sit in front of a TV all day because there's jobs but I just wind down wind down by h watching television or reading studying."},{"speaker":"Marcus","time":"00:54:19-8","content":"Sure, earlier on you had said that you live with the thought of your victims and their families all the time and that one of the things that allows you to truly see the harms that's caused is by seeing your own family have to watch you go through this life here in prison. Can you describe a little bit what the impact has been with your family? To watch this whole thing unfold?"},{"speaker":"Michael","time":"00:54:54-0","content":"My mother, she aged, the weight the gravity of me being her youngest because I live with the reality that the majority of my family looked at me as being the smart one, the educated one, the one who was going to be, make a success out of his life. Because I had made good grades in school and having that all taken away from my mother, not being able to, my mother shouldn't have to be worried about taking care of herself right now that's what your kids are there for to take care of you when you get a certain age and I'm not able to do that and that hurts."},{"speaker":"Marcus","time":"00:56:01-9","content":"I understand."},{"speaker":"Michael","time":"00:56:05-5","content":"At the peak of my hobby shop my hobby craft sales I was able to send my mother money, every April and every October I've sent down a few hundred dollars and she was you don't have to do that we have money. That's not the point. I should do that. That's my responsibility to do that when I can."},{"speaker":"Michael","time":"00:56:05-5","content":"And I did that for her she said well what do you want me to spend it on. I said spend it on yourself. If you have a bill to pay that whatever is priority whatever is important that you need to take care of, it's not a lot it's not like if I had a well-paying job if I was in society where I could send her thousands of dollars, rather than a couple of hundred dollars."},{"speaker":"Marcus","time":"00:56:57-7","content":"I understand. Is your mother healthy enough to travel here to visit you?"},{"speaker":"Michael","time":"00:57:00-4","content":"Not without assistance. Her mind is really, she thinks she forgets a lot. I think she remembers more than I will ever remember, but her body is just tore up from hard work, and I think hard work and the toll of me being in here, her baby being in prison this long. She's trying to survive long enough to see me get out and I fear she won't make it."},{"speaker":"Marcus","time":"00:57:34-5","content":"I hope she does."},{"speaker":"Michael","time":"00:57:36-0","content":"Sorry?"},{"speaker":"Marcus","time":"00:57:37-7","content":"I hope she does."},{"speaker":"Michael","time":"00:57:39-1","content":"Hope she does too. If I don't see her in this life I have faith. My faith is what carries me through. I believe I'll see her in the next one."},{"speaker":"Marcus","time":"00:57:46-4","content":"Sure. So look this is a difficult question actually but it gets to the heart of why we're sitting here talking, when you've lived with for the last 3 decades with 2 life sentence in Louisiana as you said earlier life. Life means life or it's a death sentence"},{"speaker":"Michael","time":"00:58:18-3","content":"Right."},{"speaker":"Marcus","time":"00:58:19-9","content":"Can you tell me a little bit about how you cope with the possibility of not leaving here?"},{"speaker":"Michael","time":"00:58:27-7","content":"I cope with hope that one day excuse me, before I get too old and unable to take care of myself that the hearts and minds of people will be changed have the compassion on those like myself, to give us a second. They say this is a nation of second chances well lets be that nation to all people, all citizens regardless of what they may have done."},{"speaker":"Michael","time":"00:58:27-7","content":"Not saying that you disregard what happened, but if you believe in the human being the human spirit the ability to change and overcome obstacles like America has done, when look at where we were civil wars and everything else we've come through you have to believe in the human spirit to overcome."},{"speaker":"Michael","time":"00:58:27-7","content":"Everyone has something they have had mistaken they've made, some not as severe as others everybody has gone through something that has made a transition. If you believe in yourself enough to believe that you've changed and you've done better why not believe in the next man that he or she is capable of doing it too and has done it."},{"speaker":"Michael","time":"00:58:27-7","content":"Allow that person a second chance. Everybody has worth regardless of who they are, regardless of what economic status they have, rich or poor middle class we're all human beings, we're all Americans I m not democrat republican, I'm an American is what I am."},{"speaker":"Marcus","time":"01:00:07-7","content":"So, what you're saying I think is that you deal with it by keeping hope alive that something will change"},{"speaker":"Michael","time":"01:00:17-4","content":"Keeping hope alive that sentence reform will change that parole eligibility."},{"speaker":"Marcus","time":"01:00:22-7","content":"Yes and we are seeing things change."},{"speaker":"Michael","time":"01:00:26-1","content":"We are its changing."},{"speaker":"Marcus","time":"01:00:27-6","content":"Slowly but it's changing."},{"speaker":"Michael","time":"01:00:31-6","content":"Right well when you're dealing with a very antiquated system and people who have been conditioned to think a certain way for so long it takes time to change people's hearts and their minds."},{"speaker":"Marcus","time":"01:00:41-4","content":"Yeah it does. If you get a chance to go before a pardon board on of the questions that they often ask is why should we give you a second chance Mr. Thomas? What do you think you would say to that?"},{"speaker":"Michael","time":"01:01:02-4","content":"Well I want to say well why shouldn't give me a second chance. What I'd say listen consider my life since I've been here what I've done, what I've accomplished is there any obstacle that's too hard to overcome if you really put your heart and your mind to it. And when a person really does overcome it and makes it be my biggest thing is transformation not education is important because it gives you options. But a person has to be their mindset has to be changed and to not think so negatively about things think more positively and change the way, hey see people see aspects of life."},{"speaker":"Michael","time":"01:01:02-4","content":"And I've lived that since I've been here it's an ongoing process I'm not done I think people work on themselves until the day they pass away you constantly evolve in the way you think the way you see things. And I'd want them to think about if the education part is real it works but see me as an individual as a human being who's changed their thinking and because I've changed my thinking its helped me get do things educational wise to open up once I've completed to open up the options that I have."},{"speaker":"Marcus","time":"01:02:32-0","content":"Sure what's the worst thing that you deal with in Angola today, I think I mean what's the worst part of the experience probably changes as you're here, what is it now."},{"speaker":"Michael","time":"01:02:47-0","content":"Wait let me make sure I understand it correctly."},{"speaker":"Marcus","time":"01:02:49-8","content":"So I'm asking you what's the worst thing about Angola for you today and I had said that when you first got here it might have been x but as time goes you get accustomed to things as things change different things become the worst part I'm just imagining. What is the worst part of it for you now?"},{"speaker":"Michael","time":"01:03:08-4","content":"It's the idea sometimes that because I'm an offender I'm in prison people see you as being untrustworthy, that you're incapable of telling the truth that you're unreliable, and that happens from offender to offender, correction officer to offender."},{"speaker":"Michael","time":"01:03:08-4","content":"One time I I'll give you a specific instance where there was a guy that was in our shop a security officer, a ranking security officer that walked in on him while he was using a cell phone illegally can't have cell phones in the penitentiary, not offenders any way. And he was in the toy shop whenever he committed this offense whenever he done this. I had absolutely no knowledge of this until after the event was over with."},{"speaker":"Michael","time":"01:03:08-4","content":"The shop was subsequently closed down and it wasn't going to be reopened until everybody took a lie detector test. I'm now apprehension it's the idea that you think that I'm guilty, if you didn't think I was guilty why would I have to take a lie detector test, why can't you just take my word for it. But I had to take a lie detector test. Apprehension is off the charts for me I'm thinking now these people think I'm lying they think I'm involved and I pass but I barely passes."},{"speaker":"Michael","time":"01:03:08-4","content":"And after that the guy who was giving the thing said well this proves that you either knew about it, or you involved in something else. I'm like God this is what I feared practically the most is that you think I'm incapable of telling the truth, you don't take my word for what it is."},{"speaker":"Marcus","time":"01:05:08-3","content":"Yeah so the idea of just sort of being stereotyped"},{"speaker":"Michael","time":"01:05:10-6","content":"Exactly."},{"speaker":"Marcus","time":"01:05:14-1","content":"Constantly yeah I understand that what's been the best thing about Angola for you."},{"speaker":"Michael","time":"01:05:18-2","content":"Quite honestly the best thing is where I'm at now in the toy shop it's the ministry I think of it this way. There's underprivileged children out there whose family can't provide certain things for their family or as much as they would like to for their children. I spoke to an officer that was from ascension parish, he's a deputy I'm not sure exactly what is his rank, or his official duty."},{"speaker":"Michael","time":"01:05:18-2","content":"And I told him I said all going to distribute these toys, and bicycles to these kids and honestly they come from us, but we don't do it because we want a pat on the backs, the Atta boys stuff like that, we do it from the heart. And if there's one child that may be thinking or may be feeling left out unworthy he may be thinking this other people down the street that have these bicycles and these toys and they may want to go steal something."},{"speaker":"Michael","time":"01:05:18-2","content":"Because they don't have something I said by giving them this toy that prevents that one child from committing something they shouldn't do which could later lead to bigger things crime starts somewhere. Now of course there's crimes of passion things that all of a sudden happen but they say out of the blue, but if I can prevent a child from going down the wrong path by giving them something showing him that he's worthy, he's thought of, then that's all, that's the best thing for me."},{"speaker":"Marcus","time":"01:06:57-2","content":"Sure I think I have a sense of what you might say to this question, but what are you most proud of."},{"speaker":"Michael","time":"01:07:04-7","content":"My crowning moment was being able to get my mom that degree not a diploma, a college degree, my bachelor's degree in Christian ministry, giving that to her. I wish my father was there but my mother."},{"speaker":"Marcus","time":"01:07:20-3","content":"Yeah that must have been a really nice feeling."},{"speaker":"Michael","time":"01:07:23-3","content":"She has that in her house she hangs it on the wall."},{"speaker":"Marcus","time":"01:07:36-0","content":"If you're released from prison do you have a sense of what that next chapter of your life is going to look like."},{"speaker":"Michael","time":"01:07:41-8","content":"Sure I don't know if I'll be allowed to but I would like to affiliate myself with some type of organization that counsels at risk young men try and keep people, prevention is the best medicine. It's good to cure somebody they say cure while they're in prison but why not prevent, try to prevent it. Now there are organizations out there who are doing that I want to be involved with that. I would like to train to be a first responder, I see these Cajun Navy."},{"speaker":"Marcus","time":"01:08:23-5","content":"Sure."},{"speaker":"Michael","time":"01:08:29-6","content":"That's something I'd like to get involved with."},{"speaker":"Marcus","time":"01:08:32-3","content":"Yeah that would be a noble thing."},{"speaker":"Michael","time":"01:08:35-0","content":"Yeah I mean I've taken life it'd be an honor to be able to lay down my life if I had to for my fellow man. If they would allow me to go in the army I would do that too not because of conflict to get into conflict but if I can keep the conflict from reaching our shores that is noble."},{"speaker":"Marcus","time":"01:08:58-0","content":"So I know that you had a little bit of trepidation about talking about this."},{"speaker":"Michael","time":"01:09:05-3","content":"That's an understatement."},{"speaker":"Marcus","time":"01:09:07-6","content":"I think you've done a fantastic job and I've really enjoyed learning about you."},{"speaker":"Michael","time":"01:09:11-3","content":"Oh thank you."},{"speaker":"Marcus","time":"01:09:14-4","content":"Is there, my final question is, is there something that I should have asked you that I didn't something that I didn't give you a chance to talk about that you might have wanted a chance to talk about"},{"speaker":"Michael","time":"01:09:24-7","content":"No I think we pretty much covered it"},{"speaker":"Marcus","time":"01:09:30-3","content":"Okay maybe if we've covered it, maybe I'll end with this the last question for people who aren't interested in prison have never been in a prison don't know what goes on in a prison, and is just kind of busy with their own life on the outside. What would you want them to know about the reality of life without parole?"},{"speaker":"Michael","time":"01:09:58-0","content":"Life without parole. If they could imagine their own life pick the best moment years whatever they are of your life that happened take them away. If you could imagine that never happening, whether it was marriage, whether it was having a child, a job that went well, take that away from you imagine a life without those things. And that's the harsh reality of life without parole."},{"speaker":"Michael","time":"01:09:58-0","content":"You have men here that have met every criteria possible to be given a second chance and to live without not everyone because things are changing. But to live without the knowledge that it may be possible that you going to die here, that's the reality. If you think of the best the proudest moments of your life never happening flip it and make it the exact opposite, the worst happening all the time, and that's life without parole."},{"speaker":"Michael","time":"01:09:58-0","content":"Its heavy. Its carrying a weight on you every day for me every day that I wake up with the realization I'm still here it's a weight I carry around every day and it doesn't get any lighter. The older I get the heavier it gets and I'm not getting any stronger. So it's definitely weighing me down, I feel it emotionally, spiritually, physically, its taking a toll."},{"speaker":"Marcus","time":"01:11:51-1","content":"Sure yeah that's a good pace to stop."}]}