{"name":"","transcript":[{"content":"Michael Doggett Transcription REDACTIONS FINAL"},{"speaker":"Michael","time":"00: 00: 00-0","content":"My name is Michael Doggett. I'll be 63 next month. I was born August 14th, 1954 and I'm serving a life sentence for first-degree murder since September 29th, 1978."},{"speaker":"Marcus","time":"00: 00: 30-6","content":"And you were born in Norfolk?"},{"speaker":"Michael","time":"00: 00: 32-5","content":"Norfolk, Virginia yeah"},{"speaker":"Marcus","time":"00: 00: 34-8","content":"Can you tell me a little bit about growing up, about the people who raised you, your family, people who were closest to you?"},{"speaker":"Michael","time":"00: 00: 41-8","content":"Well I was an only child. I grew up in Alabama and moved away from there after I graduated from high school and everything. But I guess I probably had a normal childhood. Basically like anybody else from around where I was from anyway. It was a country place. I grew up as an athlete, I played whatever sport was in season at the time. And I never got in trouble really as I was growing up. I was probably an average student and all that."},{"speaker":"Marcus","time":"00: 01: 36-0","content":"Was there any fighting in your house?"},{"speaker":"Michael","time":"00: 01: 38-6","content":"No. My mom and dad were married 60 something years. They're both past away now but they were married right until my mom died first."},{"speaker":"Marcus","time":"00: 01: 58-0","content":"So would it be fair to say that you grew up in a loving household with adults that took care of you and took an interest in you?"},{"speaker":"Michael","time":"00: 02: 02-8","content":"Sure."},{"speaker":"Marcus","time":"00: 02: 04-7","content":"So and you just said that you graduated from high school, did you go on to any college after that?"},{"speaker":"Michael","time":"00: 02: 13-6","content":"I took some courses at night. Structural steel fitting and learn how to read blueprints and stuff. And junior college in Meridian, Mississippi."},{"speaker":"Marcus","time":"00: 02: 13-6","content":"I want to try to get a clearer picture of what it was like for you to grow up in, you said in a rural part of Alabama?"},{"speaker":"Michael","time":"00: 02: 27-9","content":"Yes."},{"speaker":"Marcus","time":"00: 02: 39-0","content":"So if I was looking out your front door, what would I see and hear?"},{"speaker":"Michael","time":"00: 02: 49-5","content":"Well it wasn't like I just lived in the woods. I mean there were other houses around me. There was like a neighborhood we'll say. And there was another say 10 houses within a quarter of a mile of mine. But it wasn't a community really either. There was no name for it. Most of the rest of the people who lived there were kin to each other; I was kind of the oddball out. We moved there later on after they did and built our house and everything."},{"speaker":"Michael","time":"00: 02: 49-5","content":"But it's still in the country. You look across the street from the house and there's a cow pasture, maybe a mile wide and a mile across. And I mean, I kind of was more or less alone. I mean I associated with some of those people in the neighborhood but at the same time I didn't hang out with them either."},{"speaker":"Marcus","time":"00: 04: 00-2","content":"Do you remember the first time you were arrested?"},{"speaker":"Michael","time":"00: 04: 04-9","content":"I got arrested on a traffic violation one time when I was 16. I was speeding through a park. I didn't even know, they didn't have the speed limit signs up, I didn't know the speed limit was 5 miles an hour. Wow imagine that. There were no parks where I'm from so I'm not used to driving in one."},{"speaker":"Michael","time":"00: 04: 04-9","content":"Anyway I got arrested because I was out of state and had to post bond before I could even leave. I only got arrested 3 or 4 times in my life before this. And never got convicted to have to serve any time. I got for a misdemeanor one time a suspended sentence. I never served any time before."},{"speaker":"Marcus","time":"00: 05: 10-6","content":"Were you employed?"},{"speaker":"Michael","time":"00: 05: 12-9","content":"Yeah"},{"speaker":"Marcus","time":"00: 05: 14-8","content":"At the time"},{"speaker":"Michael","time":"00: 05: 16-4","content":"Actually at the time of this crime I was between jobs, but I mean from the time I graduated from high school, I was employed the biggest majority of the time. I was married for, I was married by the time I got out of high school matter of fact and my first wife and I divorced like I was, I think I had just turned 22, I lose track of the years now, it's been a long time. But I think I had just turned 22 when I got the divorce."},{"speaker":"Marcus","time":"00: 05: 59-4","content":"Do you have any children?"},{"speaker":"Michael","time":"00: 06: 01-6","content":"I got 2, 2 sons."},{"speaker":"Marcus","time":"00: 06: 04-3","content":"Tell me about them."},{"speaker":"Michael","time":"00: 06: 07-0","content":"Well my oldest was not even in school when I got this charge here and my youngest was like a year and something. He wasn't even 2 yet. So I really don't know them. I mean I visit them. My mom and dad brought them down here every 2 months, as long as they were growing up. But basically after they got driving age, their own selves well, one of them got in trouble and ended up at the penitentiary in Mississippi."},{"speaker":"Michael","time":"00: 06: 07-0","content":"And I've not heard from him or talked to him since that time and it's been roughly 20 years ago. He could contact me if he wanted, fact of the matter. Recently I got a letter from his wife, didn't even know he was married. Been married 4 years. My oldest son, right now I haven't talked to him in over a year. We might go 3 years and not have any contact at all and then talk to him every day or once a week for the next 6 months maybe. His daughter's just turned 12 years old now. I've been in pretty close contact with her up until the last year."},{"speaker":"Marcus","time":"00: 07: 51-7","content":"What's the story? What's their understanding of why you're here?"},{"speaker":"Michael","time":"00: 07: 59-9","content":"I just took a wrong road. Basically once my first wife and I divorced I guess by being married and come straight out of high school already married, I missed a lot of them times there as a bachelor. And maybe I was catching up but it did something to me when my wife and I divorced and separated me from my kids basically. And I never had done, I might have smoked marijuana twice in my life before I was 22 years old. And back then, I started partying a lot, doing drugs, and it was downhill from there."},{"speaker":"Marcus","time":"00: 08: 58-9","content":"So drugs and alcohol were a big part of your life right when this happened?"},{"speaker":"Michael","time":"00: 09: 03-1","content":"Yeah I would say that. I don't know, it seemed like it was a way to just forget about things. And basically the last thing that happened is I had gotten word that my oldest son had had a seizure and was in the hospital. And I just, I couldn't get in touch with nobody. I had lost touch with my ex-wife and I couldn't get in touch with my parents even."},{"speaker":"Michael","time":"00: 09: 03-1","content":"And I just kind of lost it. I stole a car and just started out, determined I was going to get there and I never did make it. I had choices. We all do and I made the wrong ones. I can't blame it on drugs, it was on my bad choices, my own self."},{"speaker":"Marcus","time":"00: 10: 16-9","content":"So how do you make sense of serving a life sentence without the possibility of parole?"},{"speaker":"Michael","time":"00: 10: 27-8","content":"Well you really have no choice but to accept it. You could go and keep something in court and fight and fight and fight and there's guys all around me that do that. They never quit fighting. I mean even Charles Manson has a parole hearing every year and that's something we've never had here. Lifers have never had parole hearings."},{"speaker":"Michael","time":"00: 10: 27-8","content":"So you just come to the realization. You just do it like one day at a time because you don't really have nothing to look forward to down the road. You understand that unless things change drastically that we're going to die here. And you accept that after awhile."},{"speaker":"Marcus","time":"00: 11: 23-4","content":"Can you tell me about what Angola was like when you first got here. In '78?"},{"speaker":"Michael","time":"00: 11: 31-1","content":"It was '79 when I got here. I can tell you it was a big difference then to now. At that time, you, I mean well, imagine the technology then. You didn't even, you didn't have cell phones, and you didn't have stuff like that. I was here when they started putting security officers in the dorm 24/7. I had already been here a few years when that started. And before that, I mean, the strong survived and the weak just was around, I mean you came here, you knew when you got here you was going to have to fight for yourself."},{"speaker":"Michael","time":"00: 11: 31-1","content":"Fight for your manhood in other words. Now you don't have to do that. These youngsters come in now. It's just, I wouldn't know where to start, how to explain it, the difference in it. There's so many things that things that have taken place over the years to change the mentality here."},{"speaker":"Michael","time":"00: 11: 31-1","content":"Warden Cain came in and brought more religion to the prison. I think that was probably the biggest change of all the years I was here. It changed people's basic way that we dealt with each other. But when I first came here, you earned your respect. Now we just basically respect each other, we really do."},{"speaker":"Marcus","time":"00: 13: 28-5","content":"Do you think the younger generation does as well?"},{"speaker":"Michael","time":"00: 13: 31-7","content":"They do because they come in and they adapt to what's here basically. They change it a little bit but it takes a little time. So they adapt to what's here at first and then it's going to change because anything evolves. And thus prison life does."},{"speaker":"Marcus","time":"00: 13: 51-6","content":"Can you tell me what a typical day is for you? Today?"},{"speaker":"Michael","time":"00: 14: 01-6","content":"Typical day for me is, like I work for a couple of clubs and I pick up the orders that come in for the concessions for the weekend for visiting. And the rest of the time I spend my time in the hobby shop. And I do metal work in the hobby shop, make belt buckles and jewelry and stuff like that. And I have an easy job that I don't have to be at very often so I have a lot of free time to do what I, basically I try to stay busy in the hobby shop as much as I can."},{"speaker":"Michael","time":"00: 14: 01-6","content":"I try to stay busy at least 16 to 17 hours a day whether it's reading, anything like that. Because I just, I try to keep my mind occupied. I guess I've probably read thousands and thousands of books over these 30 plus years that I've been here. Because I do a lot of reading when I'm in the dorm instead of just laying around with an idle mind, staring at the walls or something."},{"speaker":"Marcus","time":"00: 15: 15-0","content":"What do you like to read? Do you like to read fiction?"},{"speaker":"Michael","time":"00: 15: 19-7","content":"Actually mostly fiction but sometimes, I get on a kick and I want to read about World War II, I know my dad was in World War II and he was also in Korea. And so one time I figured out, hey I'm going to learn about Korea because I wasn't really born until right at the end of it. So I didn't hear the news about it as it was going on like I did with Vietnam and the Gulf Wars and stuff like that now. So I studied the Korean War, so I would learn about it."},{"speaker":"Marcus","time":"00: 16: 05-1","content":"We're all obviously very different people as older adults than we were when we were in our late teens and early twenties. How are you different than the person who came here, the 24-year-old?"},{"speaker":"Michael","time":"00: 16: 28-3","content":"I would say I'm a lot more mature. I was, I didn't realize it at the time but I was naïve to a lot of things growing up in the country, being a country boy. I really had not experienced a lot of things that kids growing up in the big cities had experienced. So I didn't know what to expect out of life in general. But I'm more mature, more educated now. Because you learn little things every day. You don't always realize it till later on but basically you do, every day of your life."},{"speaker":"Marcus","time":"00: 17: 22-5","content":"What advice would you give that person now? If you could go back and help him out"},{"speaker":"Michael","time":"00: 17: 32-0","content":"I don't know. That would be hard to say because none of us ever listened to advice when we needed it. But I would say don't do drugs number one. And always listen to your elders when they tell you something because they know, cause they've been through it already and they've experienced it, they've learned it through experience. And that's something as a younger person you don't respect that, somebody else's knowledge. Now I do."},{"speaker":"Marcus","time":"00: 17: 32-0","content":"It seems to me that one of the common themes is that people have an enormous amount of value for the hobby shop at Angola. And one of the things they talk about is how important these programs are to helping people, turn their lives around. But it wasn't always that way. Have those types of programs been around for a long time?"},{"speaker":"Michael","time":"00: 18: 48-5","content":"No. Basically, there's no rehabilitation programs at all here for lifers. We've not been able to get in schools and stuff like that. Until, I think now you can get in school as a lifer. But for most of these years I've been here, you couldn't. You weren't eligible to go to like Vo Tech School."},{"speaker":"Michael","time":"00: 18: 48-5","content":"You could get a GED, you could get in that school. You could get into Bible College. But basically rehabilitation in this place here, you did it yourself if you did it. If you feel rehabilitated it's because you rehabilitated yourself, not because you were helped."},{"speaker":"Marcus","time":"00: 19: 41-5","content":"Do you when you look back on the 38 years, and you've clearly changed. Was it a very sudden experience for you or was it a very gradual experience? In other words, did a light bulb go off and you were like \"Ah I don't want to live like this anymore\" Or did you slowly find your way into it"},{"speaker":"Michael","time":"00: 20: 12-5","content":"It was a slow process and for different people it's different time limits too. Some people are just quick and others it takes them a long time. It took, I would say 12 to 15 years. Of course you mellow out when you get older anyway. But when I come here, of course times were different too, by the time I got here I had heard all those stories about Angola. And I mean, it's hard to explain what I'm talking about because it was such a drastic difference."},{"speaker":"Michael","time":"00: 20: 12-5","content":"When you come here you had to fight for your manhood first off. Somebody was going to try you within the first couple of days. And then now you got this attitude and you've got to maintain this attitude. And so it's about I guess the kind of crowd that you fall in around the situation. Like when I come in here they put you straight in the cellblock. And the guys that was around me in the cellblock were strong and rebellious type. They were in their, for disciplinary reasons basically."},{"speaker":"Michael","time":"00: 20: 12-5","content":"So I kind of fell in with the wrong crowd at first. And it cost me a lot of disciplinary reports and made me end up having to stay in the cellblock for about a year and a half. And if you stayed 90 days out of trouble, usually you'd come on out in population. Well it took me a year and a half get out in population because I stayed in trouble all the time. And then, I don't know you come to a point when you realize man the things you doing is costing you. Everything you do costs you. Costs you your health or whatever."},{"speaker":"Michael","time":"00: 20: 12-5","content":"Costs you because you're going to end up having to do more time because of the, it may just be you go to disciplinary court and you lose 15 days good time. Well I don't have good time. But if I ever get a time cut and I need the good time now, I lost 15 days here and I lost 10 days here. Of course you won't get out the first day you're in here anyway but the longer you're here, the more that becomes."},{"speaker":"Michael","time":"00: 20: 12-5","content":"The most important thing in your life is stay on the right track so you got a chance. And if you ever get that chance, at least you have a clean record. And like, right now I think I've got 14 years in without a write up and before this time here I don't think I'd ever been 5, 6 years without a right up ever."},{"speaker":"Marcus","time":"00: 23: 42-5","content":"When you think back on the crime, when it's a crime of violence people always say \"Well what about the victims?\" When you look back, it's a long time. How do you feel about it today? Honestly."},{"speaker":"Michael","time":"00: 24: 10-7","content":"I have maybe talked about my crime 3 or 4 times in these 38 years I've been here. Because it still, it was just as traumatic to me in its own way as it was to the surviving victims. I don't like to talk about it. Something that I just basically avoid thinking about it even because it still hurts me."},{"speaker":"Marcus","time":"00: 24: 50-5","content":"How much punishment is enough punishment?"},{"speaker":"Michael","time":"00: 24: 56-1","content":"Well I don't know. I think the punishment should be looked at in each individual case myself. Because, I mean I believe in the death penalty in certain cases, I really do. It might be different from a case that you believe should have had the death penalty. If you believe that, I don't know if you believe in the death penalty or not."},{"speaker":"Michael","time":"00: 24: 56-1","content":"But I feel like I've did enough time anyway, I'll say that. I'll say that I've almost got 39 years in, a couple months away from 39 years and I feel like that's enough for just about any crime. If you're not going to give a person a death sentence and go ahead and kill them."},{"speaker":"Marcus","time":"00: 26: 07-3","content":"If a parole board, if you did come up for a parole board, what would you want them to know about you? You're going to have a very short period of time, they're going to have your conduct record, and they're going to have your criminal history. But they don't know anything about you outside of that. What do you want them to know?"},{"speaker":"Michael","time":"00: 26: 26-0","content":"Well, that's a hard question to answer. I guess I would want them to know if I had outside support. In other words, a place to go, maybe a job like that. But I'd also want them to know that I'm sorry for my crime. I'm not the same person that I was. I have control over my life now anyway. I'm not going to ever make the same mistakes that brought me down this path. And I mean, I don't know. That'd be the most important things that I think I'd want them to know though."},{"speaker":"Marcus","time":"00: 27: 19-1","content":"Yeah a great fear of folks who have that decision to make, that parole decision to make of course is a political decision that should they let somebody go and that person ends up reoffending. Especially with respect to violence that they have to live with that decision. So they have to just be convinced that you would not be a likely person to reoffend."},{"speaker":"Marcus","time":"00: 27: 19-1","content":"What do you think that prison administrators, you yourself have pointed out that this punishment philosophy has changed? Angola is a totally different place it was when you first came here. So many changes Warden Cain brought about. What could prison administrators do to encourage rehabilitation that they could do better?"},{"speaker":"Michael","time":"00: 28: 31-0","content":"Well the first thing, and I've noticed this over the years, is the education level in here. Most guys in here, they didn't finish high school. A lot of them didn't go maybe barely into junior high. They ended up in juvenile homes, stuff like that. And they never really got much schooling. You can tell by, I mean, I've been in a lot of programs over the years through the clubs and stuff where a guy maybe has to get up and read and you can tell. Struggle over a sentence, take 3 times longer than he should take to read one little sentence or something."},{"speaker":"Michael","time":"00: 28: 31-0","content":"You can tell that the education is just not there. Maybe it's the sign of the times too. Because I don't think education is what it was when I was growing up going to school. They don't go by the same standards anymore. But that would be the very first thing that I think needs to be attended to in here. If you don't have a high school diploma or a GED, they should be forced to take school. That's automatic right off the top. I think that would help this place more than anything."},{"speaker":"Marcus","time":"00: 30: 11-4","content":"What's the worst thing that you have to deal with in your daily life now? I know you said that this place was violent and that was a major concern when you first got here. What's the worst thing about it now?"},{"speaker":"Michael","time":"00: 30: 26-8","content":"The worst part I guess now is just having to be around all the different egos and personalities. You live in a dormitory with 85 other guys and you have to deal with them all, if you want to watch something different than what's on the TV. Try to influence everybody, did you want to watch this program here? And there's so many things."},{"speaker":"Michael","time":"00: 30: 26-8","content":"There's always every shift of security, there's always at least one security guard that's around you it seems like it's annoying. They'd blow a whistle all the time, holler and scream or something. Something to get on your nerves it seems like. So every day it's really a different thing to look towards dreading coming up that day."},{"speaker":"Marcus","time":"00: 31: 34-3","content":"Yeah. What about the best thing?"},{"speaker":"Michael","time":"00: 31: 43-2","content":"It may be looking forward to the first morning cup of coffee. Not really a lot of good things to look forward to in here. Just another day. Even holidays, maybe you're going to have a good meal at Christmas or Thanksgiving maybe. That maybe give you something to look forward to because sometimes we do have a good meal. And there's not a lot to look forward to, I don't really have other than that morning cup of coffee to look forward to every day."},{"speaker":"Marcus","time":"00: 32: 23-6","content":"Did somebody teach you how to do metal work or did you pick it up yourself?"},{"speaker":"Michael","time":"00: 32: 27-8","content":"I picked it up myself basically. Trial and error and peeping over somebody else's shoulder maybe steal a little trick here and there."},{"speaker":"Marcus","time":"00: 32: 52-8","content":"I'm finding that very few people understand the breadth of offenses for which one could serve a life sentence in Louisiana. Does that make sense to you?"},{"speaker":"Michael","time":"00: 33: 07-5","content":"No, it never has. Like I said a little while ago, I think every case should be looked at for what it is. I've known guys, a lot of guys in here over the years that had a life sentence for a dime bag of heroin. A $10 bag of heroin, really? That could never make sense to me."},{"speaker":"Marcus","time":"00: 33: 35-3","content":"There are quite a few people who get caught up in the habitual offender law"},{"speaker":"Michael","time":"00: 33: 41-5","content":"Yeah habitual offender law. My, probably my best friend in the world right now, just recently 2 months ago got out. The new bill that just came out I think last year that affected habitual offender status, it allowed him to make parole and get out."},{"speaker":"Michael","time":"00: 33: 41-5","content":"Myself I've never understood, if a guy has already committed a crime then found guilty of it, served his time for it, then how can you enhance his sentence on a new crime because of something he already did and he's served his time on it. I don't understand that. I'll never understand that. Nobody could ever explain that to me to make me understand that because it's beyond understanding."},{"speaker":"Marcus","time":"00: 34: 38-4","content":"I think that's a very reasonable point. To play the devil's advocate, what people would say is that if you keep offending, you're not learning from the previous punishment. And as a result, we expect you to be a higher risk so we're going to put you away for longer. I think that's the logic behind it. I don't necessarily agree with it but that's the logic behind it."},{"speaker":"Michael","time":"00: 35: 03-6","content":"I think you're right, that's the way certain people do look at it. But I think it's wrong."},{"speaker":"Marcus","time":"00: 35: 14-5","content":"Yeah in terms of paying the price, you've paid it. What are you most proud of?"},{"speaker":"Michael","time":"00: 35: 24-0","content":"I don't really have anything to be proud of. I've kept my integrity I guess and I've kept my manhood in here. So I guess that'd have to be the basic things that I'm proud of. Other than that I don't have anything else to be proud of really."},{"speaker":"Marcus","time":"00: 35: 45-8","content":"Well surviving 38 years at Angola"},{"speaker":"Michael","time":"00: 35: 48-6","content":"Yeah, yeah"},{"speaker":"Marcus","time":"00: 35: 54-4","content":"There aren't many folks that I know who could do that. Let's say when you're released, do you have a vision of what your life would be like?"},{"speaker":"Michael","time":"00: 36: 14-1","content":"Actually I do. I understand that it's probably going to be hard for me to get a job and I'm not a young man. I mean I'm still, I'm basically healthy and I still have a few years that I could work a physical job even. But I know it's going to be hard. I don't have any credit. And everything's changed; I haven't been able to keep up with the technology that's been advancing since I've been in the penitentiary."},{"speaker":"Michael","time":"00: 36: 14-1","content":"I've never used a cell phone. Barely know how to use a remote control for a TV even. I mean, I'm not commuter literate. I know there's some big achievements for me, ahead of me. Stuff that I've never experienced so I'm just going to have to buckle in and try to overcome them one step at a time though. My first step would be getting a job. I mean I do have trades."},{"speaker":"Marcus","time":"00: 37: 40-0","content":"Sure. So, as I've explained we're trying to bring some awareness about the faces and the lives and stories behind the data points of life without parole in this state. Is there something I didn't ask you that I should've asked? Something I should be asking the folks I'm talking to that I'm skipping over? Or something you want folks to know that you think we're missing something?"},{"speaker":"Michael","time":"00: 38: 14-7","content":"No I think I've basically covered a lot of ground. I think you did a great job."},{"speaker":"Marcus","time":"00: 38: 24-1","content":"Thank you for your time."}]}