{"name":"","transcript":[{"content":"Monte White Transcription REDACTIONS FINAL"},{"speaker":"Monte","time":"00:00:00-0","content":"My name is Monte White. I was convicted of first degree murder in June of 1997, June 22, 1997, and I received a life sentence for first degree murder in New Orleans."},{"speaker":"Marcus","time":"00:00:15-1","content":"How old were you?"},{"speaker":"Monte","time":"00:00:16-8","content":"Twenty-two years old at the time."},{"speaker":"Marcus","time":"00:00:18-5","content":"And how much time have you already served?"},{"speaker":"Monte","time":"00:00:20-6","content":"Twenty years, sir."},{"speaker":"Marcus","time":"00:00:24-9","content":"I am going to ask you some questions about your life before that. Just growing up in New Orleans. And then I want to talk to you about some of the things you've done in the last twenty years here. Obviously the crime that you were convicted for is a major part of your life story because it took your life in a very different direction, but the point actually the point isn't to get into the details of the crime. Can you start by just telling me a little bit about your family, the people who raised you?"},{"speaker":"Monte","time":"00:01:01-9","content":"Well I grew up in a part of New Orleans called the lower ninth ward and both parents was in the home, my mother and my father. My mom and dad they have ten children, six boys and four girls. I'm the second oldest out of the ten. And all of us grew up in the same home in the lower ninth ward and it was practically church every Sunday, bible study every Wednesday, Friday night's choir rehearsal so church was always a part of our life growing up."},{"speaker":"Monte","time":"00:01:01-9","content":"And a big responsibility was placed on me at a young age from my mother and father to take care of my younger brothers and sisters when they had to work. So, things was good with them."},{"speaker":"Marcus","time":"00:01:46-3","content":"Did they get along?"},{"speaker":"Monte","time":"00:01:47-5","content":"Yes, sir. My mother and father they got along real well, everything was good. Family was great, had no complaints growing up. But when I started getting in trouble at a young age because of the responsibility that was placed on my by my parents as far as protecting the young ones."},{"speaker":"Monte","time":"00:01:47-5","content":"When we're not around it's your job as the next in charge to take care of the young ones. My oldest brother was always in school and work so I'm there taking care of them."},{"speaker":"Marcus","time":"00:02:15-1","content":"Right, and taking care of them means sort of protecting them from violence too."},{"speaker":"Monte","time":"00:02:23-5","content":"Right, protecting them from violence, fixing food, cooking for them, making sure they was taken care of till mother and father came home."},{"speaker":"Marcus","time":"00:02:32-8","content":"What about school for you?"},{"speaker":"Monte","time":"00:02:34-5","content":"School was great. I was getting in trouble in school, fighting and stuff because, I used to come home, sometimes I didn't want to fight back one time in elementary school. My dad he would always be on me, 'you're coming home again? Beat up again? I'm going to go to school and make sure you and that child that jumped on you, both get a beating."},{"speaker":"Monte","time":"00:02:34-5","content":"If I've got to come to school, I'm going to tear your tail up,' stuff like that. So that was a part of me growing up tough in the ninth ward., if you wasn't tough you was getting ran over, , people mess over you and your family, and so by me being that responsible at a young age I had to be tough."},{"speaker":"Marcus","time":"00:03:14-3","content":"So a lot of fights?"},{"speaker":"Monte","time":"00:03:15-8","content":"Yeah a lot of fights, in school. From elementary all the way to high school."},{"speaker":"Marcus","time":"00:03:20-9","content":"Where'd you go to high school?"},{"speaker":"Monte","time":"00:03:21-7","content":"Lawless High, Lawless Senior High School. That's also in the ninth ward."},{"speaker":"Marcus","time":"00:03:33-4","content":"Was there, fighting in the house?"},{"speaker":"Monte","time":"00:03:36-7","content":"Amongst my brothers and sisters at times, 'you ain't my daddy, you ain't my mama don't be putting your hands on me,' 'I'm going to tell mama and daddy when they come home that you put your hands on me,' so little fights behind that. You gone do what I say you do. Mom and dad left me in charge. You gone do that and little fights came behind that? Because it was ten of us, six boys, four girls, so a lot of misunderstanding and..."},{"speaker":"Marcus","time":"00:04:03-6","content":"Any physical violence between your parents?"},{"speaker":"Monte","time":"00:04:07-4","content":"No, sir. None."},{"speaker":"Marcus","time":"00:04:10-4","content":"So would it be safe to say that you grew up knowing that there were adults who cared for you and were interested in your wellbeing and loved you?"},{"speaker":"Monte","time":"00:04:24-6","content":"Yes sir, it's safe to say that. I had that in the home."},{"speaker":"Marcus","time":"00:04:29-0","content":"Ok. Do you remember the first time you got arrested?"},{"speaker":"Monte","time":"00:04:34-3","content":"Yes sir, I believe so. The first time I got arrested and one time as a runaway. I ran away from home, got my had my first little girlfriend. Now like they say, man your nose wide open, you're wide open behind that girl., my daddy used to let me come, he'd tell me, 'come home before the streetlights come on,' so I'm all hooked up behind this first piece of girlfriend."},{"speaker":"Monte","time":"00:04:34-3","content":"I disobeyed that bout, 'come home before the streetlights come on,' I'm so hooked up and wrapped up on her when she say, 'look, don't go home tonight just stay here with me,' and I started doing that my daddy, mama went to worrying about me, looking for me, I was young then and I didn't care about them worrying about me or looking for me, I was worrying about that girl."},{"speaker":"Marcus","time":"00:05:19-2","content":"How old were you?"},{"speaker":"Monte","time":"00:05:20-1","content":"About fifteen."},{"speaker":"Marcus","time":"00:05:22-2","content":"Okay, sure. Do you have a, I'm trying to picture your neighborhood. I'm familiar somewhat with the ninth ward and the lower ninth ward. If I was sitting on the stoop next to you when we're both fifteen, and looking out in the neighborhood, what would I be seeing, hearing, smelling? Give me a sensory picture there."},{"speaker":"Monte","time":"00:05:53-2","content":"If we were both sitting on the stoop at fifteen you'd see a lot of different cars, nice cars passing by. People walking and talking, socializing. Where I stayed at, it was about a mile or two from where a lot of the actual violence was going on in the ninth ward. Now you could hear the gunshots, you could even smell the firing, the, what you'd call the smoke from the gun. It travels through the air."},{"speaker":"Monte","time":"00:05:53-2","content":"And we'd sit there, me and you would be talking be like, 'man that's my car right there, I like that, soon as I get old enough I'm going to get me one just like that,' no you was excited seeing what you see."},{"speaker":"Monte","time":"00:05:53-2","content":"You didn't see that much violence unless you went away from out the neighborhood where I stayed at. It was going on constantly on the outskirts of my neighborhood."},{"speaker":"Monte","time":"00:05:53-2","content":"Because it was a lot of older folks staying right in that neighborhood area where I stayed, lot of older folks. Wasn't really that much youngsters besides my family because we was the biggest family on that block of the neighborhood."},{"speaker":"Marcus","time":"00:07:00-6","content":"The Whites."},{"speaker":"Monte","time":"00:07:01-5","content":"Yeah the whites."},{"speaker":"Marcus","time":"00:07:07-2","content":"Were drugs and alcohol a part of your life?"},{"speaker":"Monte","time":"00:07:09-2","content":"No sir. As I got older my favorite drink was, strawberry hill. That strawberry hill, it really wasn't no strong drink it was like a wine cooler. Yeah, I enjoyed that. The drugs, I wasn't ever a drug person but a person might say, 'yeah you was under the influence of drugs, if you sold you was under the influence of it,', but taking it, that wasn't my thing. Because I wasn't raised like that."},{"speaker":"Marcus","time":"00:07:43-3","content":"Right. So you started making some money by selling drugs?"},{"speaker":"Monte","time":"00:07:48-7","content":"Yes sir. I was taught first to work. Mom and daddy taught us first to work. And being messed with older women growing up I was led to that lifestyle of the streets. Things went to getting hard for my parents, as far as money. Growing up the church used to raise offering for us and stuff."},{"speaker":"Monte","time":"00:07:48-7","content":"'We're going to raise a collection for the White family this evening,', 'Pool as much as you can the collection plate is for sister and Brother White,' and, as I got older I ain't want my sister and brothers to have to keep on struggling like that. They couldn't get a pair of Jordan's, my mom and daddy couldn't afford it all the time them Nikes."},{"speaker":"Monte","time":"00:07:48-7","content":"The favorite name brand tennis shoes that the kids liked growing up, and they still like them same things today. When I got up into the streets, I was able to provide that for them. Nice school clothes, uniforms, stuff mama and daddy couldn't afford. I got tired of people always giving us. 'I'm going to go get this myself for y'all, y'all going to be alright,' yeah."},{"speaker":"Marcus","time":"00:09:00-8","content":"So you were pretty good at it."},{"speaker":"Monte","time":"00:09:02-7","content":"Yes sir."},{"speaker":"Marcus","time":"00:09:07-8","content":"When you're dealing drugs, you also kind of have to, it's a lifestyle that involves violence or the threat of violence, too. Did you carry a gun?"},{"speaker":"Monte","time":"00:09:24-4","content":"Yes sir."},{"speaker":"Marcus","time":"00:09:34-1","content":"Did you finish school?"},{"speaker":"Monte","time":"00:09:35-4","content":"No, I went all the way to the eleventh grade."},{"speaker":"Marcus","time":"00:09:37-4","content":"To the eleventh grade."},{"speaker":"Monte","time":"00:09:38-1","content":"Yes sir."},{"speaker":"Marcus","time":"00:09:38-6","content":"And then did you drop out and then started selling drugs?"},{"speaker":"Monte","time":"00:09:42-3","content":"No sir. I was selling while I was in school."},{"speaker":"Marcus","time":"00:09:44-7","content":"Okay. Why did you stop school?"},{"speaker":"Monte","time":"00:09:49-3","content":"Oh I got kicked out in eleventh grade. Always getting in trouble, fighting."},{"speaker":"Marcus","time":"00:09:59-7","content":"Okay. You referred to some girlfriends earlier on. Is there one that stands out in your mind you can tell me about?"},{"speaker":"Monte","time":"00:10:05-5","content":"Yes sir. The girlfriend that I has now who has been helping me a lot, her name is Montrell. And, Montrell Morris."},{"speaker":"Marcus","time":"00:10:12-8","content":"Did her before?"},{"speaker":"Monte","time":"00:10:14-2","content":"Yes sir. I knew her before I got incarcerated. We just was friends. It never wasn't more than that. What it is right now no we considered going together now, back then it was just friends. I had a girlfriend, she had a boyfriend."},{"speaker":"Marcus","time":"00:10:31-4","content":"Do you have any children?"},{"speaker":"Monte","time":"00:10:32-6","content":"Yes sir, I have three. Two boys and a girl."},{"speaker":"Marcus","time":"00:10:35-7","content":"Can you tell me about that? Yeah tell me about that."},{"speaker":"Monte","time":"00:10:36-9","content":"They're beautiful, they're wonderful. They listen to me, they respect me even though I'm in prison. I come here when my kids were just crawling. They was crawling in '97. My two sons was born October the 25th of '96 and my other son was born December the 28th of '96."},{"speaker":"Monte","time":"00:10:36-9","content":"And my daughter, Matrell, was born June the 17th of '97. And I helped raise them from in here. Used to send money to them and stuff when they was young, to they mamas when they was young. And, they've never been in the backseat of a police car, don't even know what that looks like, other than me telling them what it is. And I'm proud of that."},{"speaker":"Monte","time":"00:10:36-9","content":"My daughter goes to Southeastern, one of my sons goes to Grambling University, no not Grambling, Southern, I'm sorry. My other son he do photography work. And they listen to me, I talk to them all the time. All of them say, 'daddy I want you to come home,'"},{"speaker":"Marcus","time":"00:11:36-6","content":"They're nineteen, twenty, twenty-one? That age?"},{"speaker":"Monte","time":"00:11:38-5","content":"Twenty-one. Yes sir. Three different women, their mothers get along."},{"speaker":"Marcus","time":"00:11:43-5","content":"That's good. Do they come up here to see you?"},{"speaker":"Monte","time":"00:11:46-7","content":"Yes sir. I'm waiting on them to come see me now. I'm waiting on a date so they can let me know when they're ready to come see me because one of them I had to put on for a special visit."},{"speaker":"Marcus","time":"00:11:56-6","content":"Okay. About five people can come at once, is that right?"},{"speaker":"Monte","time":"00:12:01-8","content":"Yes sir."},{"speaker":"Marcus","time":"00:12:05-4","content":"Just from doing this drive so many times for this project I realize that it's not easy for people to come up here."},{"speaker":"Monte","time":"00:12:13-9","content":"No. Its wear and tear on the vehicle, all that adds up. People don't always have the money."},{"speaker":"Marcus","time":"00:12:20-6","content":"Absolutely. If you had to. Let's put this particular crime to the side for a minute. You're selling drugs and sort of one thing leads to another. What do you think if you had to say, sum up in one thing that really led you down the wrong road, what would that be?"},{"speaker":"Monte","time":"00:12:49-2","content":"The wrong influences of others."},{"speaker":"Marcus","time":"00:12:53-0","content":"Any people in particular?"},{"speaker":"Monte","time":"00:12:56-2","content":"Growing up, you're automatically supposed to know right from wrong, and when something is wrong you don't mess with it. I advise people out there that know right from wrong when you see something that's wrong, don't participate in it, get away from it. If there's something that you can do to help that person that's doing wrong, do that. If there's no help for them then you wash your hands with them and you continue to do that which is right. Because once you get in trouble it's hard to get out."},{"speaker":"Marcus","time":"00:13:24-0","content":"Did you have a...you didn't have someone telling you that."},{"speaker":"Monte","time":"00:13:30-0","content":"I had my daddy telling me, 'son I hear about you doing this and that in the streets, leave that alone,' I really never took my father's advice because my father, he had never been in the streets. My mother, my father's side of the family, none of them had ever been in the streets but me."},{"speaker":"Monte","time":"00:13:30-0","content":"All of a sudden I come along and I take a liking to that and I didn't take heed from him because I know he didn't, he don't know what I'm going through. He don't know what it's like out there. He only was judging, basing his opinions on what I should and should not be doing off of what he was reading in the paper or seeing on the TV, on the news."},{"speaker":"Marcus","time":"00:14:06-9","content":"What's your relationship like with your parents now?"},{"speaker":"Monte","time":"00:14:10-1","content":"Oh it's great. Yes sir, it always has been. My daddy, my father always preach because he's a preacher, a deacon preacher, always preaching to me about doing the right thing. And my mother's the same way. Our relationship always was good."},{"speaker":"Marcus","time":"00:14:29-6","content":"So I want to spend some time talking about some of the things you've accomplished since you came here. But, we're talking to you because you're considered somebody who's a trusted member of the community and somebody who's turned their life around. But, can you describe the person who arrived here at Angola twenty years ago?"},{"speaker":"Monte","time":"00:14:55-6","content":"Yes sir. The person I was twenty years ago. I'm no longer that person now. I came here, I got a few write ups, nothing real serious., theft, destroying state property, a pair of jeans that I cut like the state pants that I'm wearing now I cut into shorts because it was real hot and I didn't have no money to buy shorts out the canteen so I had an extra pair of jeans"},{"speaker":"Monte","time":"00:14:55-6","content":"I cut into short and got a write up for that. I'm going to say, honestly, you say twenty years ago, fifteen of those years ago I wanted to go right back out there in the streets and do what I was doing before I got locked up. Making the money, meeting the women, having a good time, people looking up to me, respecting me. But five of those years ago, which now is a total of twenty years, I wasn't ready, fifteen years ago, to go home."},{"speaker":"Monte","time":"00:14:55-6","content":"And I wasn't proud to say I was ready because I knew I was going to go right back and do the same thing. But it just took five years ago for me to say, I'm actually ready now., I just became a grandfather, I have a grandson, three months old., I'm proud of that and I look back at all my friends that's dead now, died when I was on the street, wasn't able to live to see their own kids grow up and then start another generation of them. I have a lot to be proud of."},{"speaker":"Marcus","time":"00:16:25-8","content":"What do you think would've happened to you didn't get arrested and incarcerated?"},{"speaker":"Monte","time":"00:16:25-8","content":"I'm going to say I definitely would've been dead. Because of the reputation in the ninth ward that I did have as being strong., the white family ain't no push over, you can't run over them long as Monte there, , you can't do that family nothing. And, a lot guys was backstabbing you, women was setting guys up. So I know if I wouldn't have come here,"},{"speaker":"Monte","time":"00:16:25-8","content":"I thought what I was doing on the street was manly things, but that wasn't being no man, I still was a child. I came here and became a man. I'm thankful for me being in prison, I'm not thankful for the amount of time that I have, but I'm thankful for being here because if I wouldn't have, I wouldn't be able to talk to my kids, maybe my kids, I'd be dead, maybe my kids would be in jail now if I wasn't here to tell them about how not to live."},{"speaker":"Marcus","time":"00:17:23-5","content":"Yeah, it's a pretty powerful message coming from a parent, in this situation. Like don't make the same mistake kind of thing. Let me get it correctly, so did you say you kind of had this sort of transformation five years ago or fifteen years ago?"},{"speaker":"Monte","time":"00:17:40-1","content":"Five years ago."},{"speaker":"Marcus","time":"00:17:40-8","content":"Five years ago, okay so the first fifteen years you were here you were still kind of in the old mentality?"},{"speaker":"Monte","time":"00:17:46-9","content":"Wanting to hustle, wanting to do the wrong thing, but I wasn't getting in trouble like I was on the street because I know in here you can't run and hide. You've got to face your troubles in here."},{"speaker":"Monte","time":"00:17:46-9","content":"On the street you can run and hide, you can take certain things to get that out your mind, but in here you've got to face reality every day. And I was working, baking, cooking, which I love to do right now today. Baking and cooking and still doing my little hustling or whatever."},{"speaker":"Monte","time":"00:17:46-9","content":"Just to say if I was to go on the streets fifteen years ago I would've been right back or dead. But looking back and five years ago I'm like, 'man I can't keep on living like this here,' because my mom and my daddy getting older and I don't want them to die knowing I'm still in the same state of mind as I was before I got locked up."},{"speaker":"Marcus","time":"00:18:43-2","content":"Yeah so let's talk a little bit about that. So what led to that turning point? Right, so sometimes a light bulb goes off for some people. Other people it's a mentor who teaches them something and some people discover god. I mean there's a whole bunch of different ways in which people transform their lives, the turning point. What was the turning point for you?"},{"speaker":"Monte","time":"00:19:04-3","content":"Just constantly hearing and seeing people get messed around. Going to the shade every week, coming back guys, some happy for me, some not. 'Man you get a visit every other week, man I wish my family would love me like that,' some guys said, ' you got a lot to be thankful for man, man you need to chill out man with the little wrongdoing."},{"speaker":"Monte","time":"00:19:04-3","content":"I'm not in your business or anything but man the little hustling, little dipping and dabbing stuff that you're doing man you need to stop all that man, get on to your family. You've got family that loves you,' I'm like man. That was a turning point because I do have a lot to be thankful for."},{"speaker":"Monte","time":"00:19:04-3","content":"And looking at the ones that don't have what I have, family support, friends, true friends, that's giving you positive advise, I have that and a lot of guys don't and it's hurting that people don't have the same. And they're going down that wrong road. They have a reason to violate or to do wrong things."},{"speaker":"Monte","time":"00:19:04-3","content":"That's they're reason cause they don't have no love ones, no family support and I have that. And I said, 'I don't really have no reason to do the wrong things no more,' now if I don't stop, lord bless me to go home and do the same things, so I had to stop. Kids telling me, 'man daddy don't be getting in no trouble no more man, when you come home, man we got you man you gone be straight,'."},{"speaker":"Marcus","time":"00:20:29-7","content":"Were you getting in trouble? For those fifteen years you were getting sent to the cell block?"},{"speaker":"Monte","time":"00:20:34-0","content":"Yes sir. I've been in cell blocks probably about three times in my whole twenty years. I'm talking about for a couple of weeks. One time I stayed in the cell block nine months. That was the longest in a cell and I'm not experiencing that no more. That's the longest time I've ever been in a cell block in twenty years, nine months. Though ain't nothing real serious, nothing real serious that I'm going to go in the street get an outside charge, nothing like that. Little work offence, stuff like that."},{"speaker":"Marcus","time":"00:21:08-2","content":"Yeah. If you could go back in time and talk to the Monte that came here right as he's come in here, the first week, or maybe if you see somebody who's in their early twenties who's coming in with a life sentence just kind of looking around trying to figure out and they come up to you and ask you for advise, what would you tell them?"},{"speaker":"Monte","time":"00:21:36-5","content":"I'd say, 'man you've got time, you really want to hear what I've got to tell you?' and if he'd say, 'okay, yeah,' I'm going to say, 'well come on let's take a walk,' and I'd let him know, 'don't get into the drugs, don't get into the gambling, do what the administration say, and that way you and the administration will always be cool or respectful with one another."},{"speaker":"Monte","time":"00:21:36-5","content":"Respect them they going to respect you, you might have a person that's got a chip on their shoulder in uniform or with a number like myself but treat everybody like you want to be treated. Until otherwise. If a person don't want to be treated with respect and honor then you don't treat them that way, just get away from them. You don't want to never escalate nothing farther than what it's supposed to be. Do the right thing, get you some education if you ain't got no high school diploma, they've got schools for that."},{"speaker":"Monte","time":"00:21:36-5","content":"You want to get in certain classes dealing with certain areas in your life, like anger and stress management. A lot of guys come here with anger issues. You get in anger and stress management they'll teach you how to cope and deal with your anger issues. Alcohol, substance abuse, alcoholics anonymous and stuff like that. If you had an alcohol issue on the street, they've got classes that will help you get through that, how to cope with it."},{"speaker":"Monte","time":"00:21:36-5","content":"No you ain't have no family, they've got classes up here to help you learn how to be able to deal with a family, a new family, or learning how to get your own family. They've got things like that. So the advice that I could give that person would be advice that could carry him on through his time being here. Me and him don't know how long he will be here, but what I'm giving you can help you go a long ways. Do your job, and you won't have to worry about no sweat off the people."},{"speaker":"Marcus","time":"00:23:23-5","content":"Yeah, that all sounds like good advice to give somebody coming here actually. This is kind of a difficult question because I don't know the answer. I have a tough time wrapping my head around life without parole. How do you make sense of it? How do you cope with it?"},{"speaker":"Monte","time":"00:23:51-8","content":"It's hard. Sometimes honestly I feel like I'm not going home. Because life means life in Louisiana. I feel like that at times and I also feel like there's a chance for me too. Because now guys are going home more than we've ever seen before. And I know a lot of them that already left here felt the same way I feel at times. Not all the time. Sometimes you get hopeless."},{"speaker":"Monte","time":"00:23:51-8","content":"You don't get that mail, that letter in the mail, that money order, or a family member's supposed to come see you this day and they don't come, you call, they're not answering. Sometimes you get hopeless, then when all those things start happening again you get that joy back, oh man there's a chance I'm going home."},{"speaker":"Monte","time":"00:23:51-8","content":"'Oh such and such went home today? Man, I didn't think he was getting out of here,' and that gives you some hope, that gives you something to want to fight. But if you don't have outside support and god on your side, then ain't none of that going to happen. I have that but still in some way I just be getting that doubt, and I know I shouldn't have it, but it happens around here. Throughout the day it's the same old thing every day, same old thing. A life sentence in Louisiana, it means that until otherwise."},{"speaker":"Monte","time":"00:23:51-8","content":"I needed, I needed to do some time. I can honestly say I needed to be off the streets for a while. But not this long. I'm thankful for the twenty years, but I don't know how many more years I have to do before I'm able to be released from here. On the pardon board, I don't have parole as for right now. Cause a life sentence don't carry that. But hopefully something happens for me and not just for me but for others as well who feel like I feel at times."},{"speaker":"Marcus","time":"00:25:46-4","content":"Do you see people just give up hope?"},{"speaker":"Monte","time":"00:25:50-6","content":"Yes sir. I see a lot of that."},{"speaker":"Marcus","time":"00:25:54-1","content":"What does it look like?"},{"speaker":"Monte","time":"00:25:55-9","content":"It's hurting. When I see guys like that some of them I try to talk to, some of them you can talk to some of them you just can't. Because once a man makes his mind up, it's like a animal, you don't know right from wrong. How to just do one thing. Like the animals around here, animals have been created to be one way. It takes man or someone to come along and train them how to do other things, other than what they've been created to do."},{"speaker":"Monte","time":"00:25:55-9","content":"And when that man get his mind made up, it's made up. Some of them I can talk to and help change they mind and give them hope again, some of them don't, they've lost all hope.' Look I don't want to talk to you man I'm doing this time, I've come here to die here."},{"speaker":"Monte","time":"00:25:55-9","content":"I don't go visit like you, you fortunate,' sometimes I don't want to hear that but I tell them, 'that could be you too, put yourself in position, learn how to be friendly and talk to people, get a loan,' some guys just bitter. Family died on them since they've been here, women are keeping their kids away from them since they've been here because they feel like their father has shamed the family so they don't want the child to be a part of him. Guys going through that mentally."},{"speaker":"Monte","time":"00:25:55-9","content":"So the one's that lost that hope, if I can't talk to them, I get away from them, because I don't need that rubbing off on me."},{"speaker":"Marcus","time":"00:27:20-6","content":"Can you tell me a little about the organizations that you're a part of? The groups...tell me the opportunities you've taken advantage of since you've come here."},{"speaker":"Monte","time":"00:27:30-3","content":"Yes sir. I got into a lot of self-help programs. I got a culinary arts degree, for culinary arts. Cooking and baking which like I said, which I love. I got anger and stress management under my belt. I got, AA new hope, which is a sober group, dealing with alcoholics anonymous, drugs, I got self-awareness, I got parenting."},{"speaker":"Monte","time":"00:27:30-3","content":"I even joined a victim awareness class, got a certificate in that, learning how people feel, learning different money management, learning how to make money the right way and how to manage that money instead of spending it, just flaunting it around. I've got church,"},{"speaker":"Monte","time":"00:27:30-3","content":"I've been going to church since I was just a little baby. Sometime I got away from it, but I go back and forth to church because I don't forget, its only god that kept me here this long. I'm still in programs right now today, I've been getting in programs since I've been here. When I got here November of '98 I started getting in programs '99 and I've been doing it all up until this time here."},{"speaker":"Marcus","time":"00:28:56-8","content":"So you must spend some time envisioning what your life would be like should you go before a pardon board and, you get released. And you have a strong family support. How do you envision your life?"},{"speaker":"Monte","time":"00:29:14-8","content":"I envision my life starting a group out there with parents first that have kids that's locked up. Then going around to different schools talking to kids, doing public speaking, at different functions or wherever I'm able to be invited. I just want to get out of here and help people. I envision myself going home, making money with my cooking and baking offshore if I can go offshore, if that doesn't work I got to carpenter trade, I know how to build furniture."},{"speaker":"Monte","time":"00:29:14-8","content":"I can go home and do that. Just to say that don't work, I know how to keep knocking on someone's door, a business's door, to make someone get tired of me to where they say, 'I see you're really looking for a job, I'm going to hire you, you come here every day,', 'you just ain't going to stop till I hire you,' and I'm going to say, 'yes sir, yes ma'am' and I'm going to show them how bad I want that. Cause I want to come back and be able to help people."},{"speaker":"Monte","time":"00:29:14-8","content":"I'm going to go home and enjoy life, help raise my grandson which I'm very proud of. And I want to come back and I want to help somebody in here. So I envision my life being beautiful once I go home. Whenever that time comes. And it ain't just about me, it's about what I can do for others. That's what my main objective is."},{"speaker":"Marcus","time":"00:30:40-4","content":"This may seem like an odd question because you're in prison, its prison. What's the worst part of being in prison for you now?"},{"speaker":"Monte","time":"00:30:56-1","content":"The worst part? Man, going to sleep around men every day and not going to sleep with a woman. Showering with guys all in the shower. This not no football camp where we're all in the same locker room or the, no. Where were sleeping, we're using the restroom on the side of one another."},{"speaker":"Monte","time":"00:30:56-1","content":"Everything's just so together and you're dealing with guys with all these different attitudes. Some want to do right, some don't want to do right, some don't have no care in the world. That's the worst part of being in prison, watching people go down the same old path that led them here and don't want to change."},{"speaker":"Marcus","time":"00:31:44-3","content":"What about the best part? The best thing Angola has to offer."},{"speaker":"Monte","time":"00:31:49-0","content":"The education. The will to do what you want to do. Even though the security, the prison has its rules and policies to abide by. You abide by that you can still do what you want to do. You can go in the hobby shop. Ain't nobody over you 24/7 telling you to do this and do that? Even though in prison we still have a free will to do what we want."},{"speaker":"Monte","time":"00:31:49-0","content":"All these classes and different things is available to us, it's on us if we want to take that or not. That's the best thing Angola could have offered me. A chance to be who I want to be. Who I really need to be in life, and that's to be a better person, to be an example to somebody instead of, letting people down all the time."},{"speaker":"Marcus","time":"00:32:37-2","content":"Is there a question that I should've asked you that I didn't? Something you would've wanted people on the outside, who don't know what's going on here really, to know? Or something I didn't give you an opportunity to talk about."},{"speaker":"Monte","time":"00:32:49-6","content":"Well what I could say to people on the outside, it ain't always good to judge a book by its cover. And a lot of people in prison, everyone is not bad. People do make mistakes, and mistakes that caused me is the way I was living on the outside. It caused me to come down this road of being incarcerated. God see fit for me to come to prison instead of going to a grave at an early age. And it's always good to know a person before you can say he or she is like that or like this. Get to know a person first before you point a finger and say yeah he's wrong or she's wrong. But anything you want to ask me Mr. Marcus, feel free."},{"speaker":"Marcus","time":"00:33:40-6","content":"I think I asked you all the questions that I had. I'm very grateful, so thank you."},{"speaker":"Monte","time":"00:33:49-6","content":"Glad to be of some help, Mr. Marcus. You're welcome sir."}]}