{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Myron Smith_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:10",
      "content": "So could we start just to set the record by stating your name, the crime of conviction, how old you were at the time and how much time you've served now?"
    },
    {
      "speaker": "Myron",
      "time": "00:00:10",
      "upperBoundTime": "00:00:26",
      "content": "My name is Myron Smith. I been convicted of murder, first degree murder, and the night of this month, November, makes 24 years I been incarcerated."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:26",
      "upperBoundTime": "00:00:28",
      "content": "Okay, and how old were you at the time?"
    },
    {
      "speaker": "Myron",
      "time": "00:00:28",
      "upperBoundTime": "00:00:30",
      "content": "I was 21 when I first got incarcerated."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:30",
      "upperBoundTime": "00:00:46",
      "content": "So as I said earlier, the purpose of this is to learn about you and your life. So I'm going to start with some questions about your life before this happened. Can you tell me a little bit about the folks who raised you, your family?"
    },
    {
      "speaker": "Myron",
      "time": "00:00:46",
      "upperBoundTime": "00:01:32",
      "content": "Oh man, my family. I'm going to say they was pretty cool people. They were- they were they type of people that they would embrace you if you came to them. They weren't the type that would just go out and get you what I'm saying? You would have to come to them. It was more like you would have to reveal your problem to be embraced or taken care of. More like that."
    },
    {
      "speaker": "Myron",
      "time": "00:00:46",
      "upperBoundTime": "00:01:32",
      "content": "They were, kind of country. What I'm saying, what I say, that's why I embrace the country life. That's what I grew up to. What I mean by that is, my family they grew up around chickens, pigs, cows you name it. And that's what I'm."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:32",
      "upperBoundTime": "00:01:37",
      "content": "So did you, you grew up in a rural area of Louisiana?"
    },
    {
      "speaker": "Myron",
      "time": "00:01:37",
      "upperBoundTime": "00:01:40",
      "content": "Yeah. It was like in the country boy, my family."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:40",
      "upperBoundTime": "00:01:42",
      "content": "Just outside of Shreveport?"
    },
    {
      "speaker": "Myron",
      "time": "00:01:42",
      "upperBoundTime": "00:01:53",
      "content": "Well, it's in Shreveport but it's was deep in the Coupalo area, in the wooded area."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:53",
      "upperBoundTime": "00:01:58",
      "content": "Okay, yeah I've become familiar with that. So what about siblings? Do you have brothers and sisters?"
    },
    {
      "speaker": "Myron",
      "time": "00:01:58",
      "upperBoundTime": "00:02:03",
      "content": "Yes I have 2 sisters. One by my mother and one by my father."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:03",
      "upperBoundTime": "00:02:07",
      "content": "Okay, alright and do you still stay in touch with them? Do you still have a good relationship with them?"
    },
    {
      "speaker": "Myron",
      "time": "00:02:07",
      "upperBoundTime": "00:02:09",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:09",
      "upperBoundTime": "00:02:13",
      "content": "Okay, so who visits you up here?"
    },
    {
      "speaker": "Myron",
      "time": "00:02:13",
      "upperBoundTime": "00:02:18",
      "content": "Well, my girlfriend comes see me and my kids by spell. My sisters, they come."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:18",
      "upperBoundTime": "00:02:22",
      "content": "Okay, well tell me about your children."
    },
    {
      "speaker": "Myron",
      "time": "00:02:22",
      "upperBoundTime": "00:02:52",
      "content": "Oh man, they some ballsy image of the, that's my backbone, they make a lot of, changes in my life. In fact, my oldest daughter just made 25 on the 9th the same day I was incarcerated will be 23 years here. They know I'm proud of them. They don't have any bad history. They pretty good, know what I'm saying? Proud of them."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:52",
      "upperBoundTime": "00:03:02",
      "content": "Yeah, that's great. So was there what was the relationship like between your mom and dad?"
    },
    {
      "speaker": "Myron",
      "time": "00:03:02",
      "upperBoundTime": "00:03:20",
      "content": "My mom and dad didn't live under the same roof. The relation, it was more friend, and it wasn't that I saw, it wasn't kind of passion or intimacy there. They was just a \"Hi\" And \"Bye bye bye.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:03:20",
      "upperBoundTime": "00:03:26",
      "content": "So what about the relationship between your mother and the men that came into her life?"
    },
    {
      "speaker": "Myron",
      "time": "00:03:26",
      "upperBoundTime": "00:03:34",
      "content": "Well, my mom, she's only dealt with one other man which was my step-father, he helped raise me. That relationship was pretty good?"
    },
    {
      "speaker": "Marcus",
      "time": "00:03:34",
      "upperBoundTime": "00:03:36",
      "content": "Was there much fighting in the house?"
    },
    {
      "speaker": "Myron",
      "time": "00:03:36",
      "upperBoundTime": "00:03:40",
      "content": "Not at all. I mean a little disagreeing here and there but, no fighting."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:40",
      "upperBoundTime": "00:03:55",
      "content": "So is it safe for me to assume that for the most part you came up knowing that there were adults who cared for you and loved you and looked after you or did you feel that you had to make it on your own?"
    },
    {
      "speaker": "Myron",
      "time": "00:03:55",
      "upperBoundTime": "00:04:36",
      "content": "It was a turning point in my life coming up as a child. I knew that my family loved me because they supported me and made sure I had all the things I needed what I'm saying, to succeed and do good in school and things of that nature, but once I got to high school, it's kind of it began to change because my mom, she was unemployed at the time and it was things that I wanted that I couldn't have and I was beginning to feel neglected because I hadn't just understand that being unemployed, you don't have the income to get those things so it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:36",
      "upperBoundTime": "00:04:39",
      "content": "Sure, what was the highest year of school that you finished?"
    },
    {
      "speaker": "Myron",
      "time": "00:04:39",
      "upperBoundTime": "00:04:43",
      "content": "I graduated. Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:43",
      "upperBoundTime": "00:04:45",
      "content": "Then, how were you supporting yourself?"
    },
    {
      "speaker": "Myron",
      "time": "00:04:45",
      "upperBoundTime": "00:04:56",
      "content": "Here and there, I would maybe cut a few yards here and there, do a few chores, wash cars, here and there. A little street activity too."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:56",
      "upperBoundTime": "00:05:08",
      "content": "Did you get involved, I know that at that time, that area, there was quite a lot of gang activity? Were involved in any of that? You managed to stay clear of that?"
    },
    {
      "speaker": "Myron",
      "time": "00:05:08",
      "upperBoundTime": "00:05:24",
      "content": "No. I didn't. I actually got involved in the gang activity. That actually was another major turning point in my life. For positive to negative. It felt positive at the time, but it was negative now that I know."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:24",
      "upperBoundTime": "00:05:29",
      "content": "Sure, so tell me a little bit about how that- how you got into that?"
    },
    {
      "speaker": "Myron",
      "time": "00:05:29",
      "upperBoundTime": "00:06:06",
      "content": "It was just a thing of the friends that I was hanging with, it's a split between these group of guys and that group of guys. But, the guys that I went to school with, weren't they guys that I hung with. And it wasn't that my intention was to be affiliated in the gang, but I was being noticed and saw by these guys by the guys I went to school with and that's what the conclusion they came with and I was being accused of so much to which I just embraced it and became a part of it."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:06",
      "upperBoundTime": "00:06:12",
      "content": "Okay, and so what was that what did that entail? When you say I was part of a gang. What does that mean?"
    },
    {
      "speaker": "Myron",
      "time": "00:06:12",
      "upperBoundTime": "00:06:34",
      "content": "An organization it's really, I wouldn't even say an organization, the part I was in. It was just like a color gang, what I'm saying? Represent specific group of people, what I'm saying. To, I guess, show loyalty to this group and not this group. It's crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:34",
      "upperBoundTime": "00:06:46",
      "content": "Yeah, I understand. I'm sure that you look back on it now and think of it very differently. So, what about school? You graduated from school. Did you like school?"
    },
    {
      "speaker": "Myron",
      "time": "00:06:46",
      "upperBoundTime": "00:06:56",
      "content": "Yeah, school was cool. The thing I didn't like about school was waking up. You have to get up, but once I got up and got there, it was good."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:56",
      "upperBoundTime": "00:06:57",
      "content": "I get it. Did you play sports in school?"
    },
    {
      "speaker": "Myron",
      "time": "00:06:57",
      "upperBoundTime": "00:06:59",
      "content": "Yeah, I played football."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:59",
      "upperBoundTime": "00:07:03",
      "content": "Okay, and did you end up actually playing football here at Angola when you came?"
    },
    {
      "speaker": "Myron",
      "time": "00:07:03",
      "upperBoundTime": "00:07:07",
      "content": "Yes. Lots of football."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:07",
      "upperBoundTime": "00:07:09",
      "content": "Yeah, they still do that right?"
    },
    {
      "speaker": "Myron",
      "time": "00:07:09",
      "upperBoundTime": "00:07:23",
      "content": "Well they only play flag football now. They stopped the contact in 2012. Yeah. You have a lot of the- the caliber people that come in now, they're not ready in tuned with the physical type of sports."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:23",
      "upperBoundTime": "00:07:32",
      "content": "Okay, so, you said there's not much fighting going on in your house. What about in your neighborhood and among your friends?"
    },
    {
      "speaker": "Myron",
      "time": "00:07:32",
      "upperBoundTime": "00:07:47",
      "content": "Oh yeah. Here and there, weekly you're going to get some kind of altercation or physical, contact just being in the neighborhood, what I'm saying? Mainly through robbery gang activities, what I'm saying?"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:47",
      "upperBoundTime": "00:07:55",
      "content": "I see. And did you feel the need to carry a firearm?"
    },
    {
      "speaker": "Myron",
      "time": "00:07:55",
      "upperBoundTime": "00:07:57",
      "content": "Yes. I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:57",
      "upperBoundTime": "00:08:01",
      "content": "Okay, I think, I mean most of the people you knew probably had this. Is that a correct assumption?"
    },
    {
      "speaker": "Myron",
      "time": "00:08:01",
      "upperBoundTime": "00:08:03",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:03",
      "upperBoundTime": "00:08:07",
      "content": "Okay, did you ever get kicked out of school before you graduated?"
    },
    {
      "speaker": "Myron",
      "time": "00:08:07",
      "upperBoundTime": "00:08:08",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:08",
      "upperBoundTime": "00:08:19",
      "content": "Okay, alright. So, can you tell me a little bit about what led to this situation that you're in here now for? What do you think that got you down that road?"
    },
    {
      "speaker": "Myron",
      "time": "00:08:19",
      "upperBoundTime": "00:08:51",
      "content": "Oh man definitely, the gang activity. I mean, just trying to be accepted and to be a part of something. Because, I mean, coming up as a kid, a lot of kids, speaking of myself. Your when you feel neglected, it's kind of easy to be influenced when you, when somebody else opens their arms up to you. Kind of make you want to be a part of something where you're accepted."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:51",
      "upperBoundTime": "00:09:03",
      "content": "Alright, no, that makes sense to me. What about intimate relationships? I know you have children and you mentioned a girlfriend. Is this a girlfriend from before you came here? Or somebody who you met since?"
    },
    {
      "speaker": "Myron",
      "time": "00:09:03",
      "upperBoundTime": "00:09:12",
      "content": "Yes, it's a girlfriend since before I came here. I been knowing her since I was like 12."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:12",
      "upperBoundTime": "00:09:14",
      "content": "Well, tell me about her. What's her name?"
    },
    {
      "speaker": "Myron",
      "time": "00:09:14",
      "upperBoundTime": "00:09:24",
      "content": "Her name is Shamonica. She's straight. She's fun, loving, caring. She really got my back. She supports me, we laugh. It's awesome. It's cool."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:24",
      "upperBoundTime": "00:09:26",
      "content": "Okay, and we're a long way from Shreveport. Is she still in Shreveport?"
    },
    {
      "speaker": "Myron",
      "time": "00:09:26",
      "upperBoundTime": "00:09:28",
      "content": "Yes, she's still in Shreveport."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:28",
      "upperBoundTime": "00:09:34",
      "content": "Is she able to make that trip very often? It's like a long, long, trip."
    },
    {
      "speaker": "Myron",
      "time": "00:09:34",
      "upperBoundTime": "00:09:48",
      "content": "Yes she does. She can make it. She makes that trip, so I'm just grateful for that. And she makes it."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:48",
      "upperBoundTime": "00:09:51",
      "content": "Yeah. Tell me about maintaining that kind of relationship from in here. What are the challenges for you?"
    },
    {
      "speaker": "Myron",
      "time": "00:09:51",
      "upperBoundTime": "00:10:34",
      "content": "Oh man, you can say the Devil works he going to do his thing but you have to remain positive first and you have to put God first before yourself, anything. And I mean, we have trials we go through things. We even argue a little bit, not a lot. We agreed we're not going to do that. But, overall, maintaining a good connection is really just accepting each other's faults and flaws just opening up to a personal level how I feel."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:34",
      "upperBoundTime": "00:10:44",
      "content": "Sure. And you been with her for a long time and she's probably seen you go through quite a few of changes too."
    },
    {
      "speaker": "Myron",
      "time": "00:10:44",
      "upperBoundTime": "00:10:56",
      "content": "No, actually. She was just my friend we were kids, 12. We've only just recently been in a relationship this year in January we began a relationship. In February we reconnected in January but began a relationship in February."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:56",
      "upperBoundTime": "00:11:07",
      "content": "I see, okay, so that's not that's a different situation. So are you still in touch with the mother of your children or mothers of your children?"
    },
    {
      "speaker": "Myron",
      "time": "00:11:07",
      "upperBoundTime": "00:11:14",
      "content": "Yes, I have a nice friendship with all of my kid's mothers. I mean I communicate with them here and there."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:14",
      "upperBoundTime": "00:11:23",
      "content": "Okay, so do you, was this the first time you got arrested?"
    },
    {
      "speaker": "Myron",
      "time": "00:11:23",
      "upperBoundTime": "00:11:26",
      "content": "Yes. No."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:26",
      "upperBoundTime": "00:11:28",
      "content": "Okay, so tell me a little bit about some of those other contacts with the law."
    },
    {
      "speaker": "Myron",
      "time": "00:11:28",
      "upperBoundTime": "00:11:45",
      "content": "Well, I've been arrested a time before. It was, in fact, in high school, when I was 18, I was in a stolen car. So, I was convicted of unauthorized use of a vehicle."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:45",
      "upperBoundTime": "00:11:46",
      "content": "Okay, alright. That's it?"
    },
    {
      "speaker": "Myron",
      "time": "00:11:46",
      "upperBoundTime": "00:11:53",
      "content": "Community service, yeah. That's it."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:53",
      "upperBoundTime": "00:11:55",
      "content": "If you only had one prior arrest, yeah, okay. So, what about drugs and alcohol. Were drugs and alcohol a part of your life?"
    },
    {
      "speaker": "Myron",
      "time": "00:11:55",
      "upperBoundTime": "00:12:13",
      "content": "I would say that, no to drugs, because I didn't do any drugs. But, alcohol, I drunk occasionally. I wouldn't say that it was a necessity because I didn't just wake up \"I got to have it\" Or sloppy to where I couldn't."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:13",
      "upperBoundTime": "00:12:32",
      "content": "Sure. So let me ask you this. I'm sure you've thought about this quite a lot. Let's say this particular incident, and I don't know very much about the specifics of it, but let's say this specific incident that brought you here didn't happen. How do you think the rest of your life would have continued on?"
    },
    {
      "speaker": "Myron",
      "time": "00:12:32",
      "upperBoundTime": "00:13:08",
      "content": "Oh man well, I have two answers for that. I know for sure that I would have been dead dealing with the gang related activity and the lifestyle that I was living. I would have been dead. But, the other side of it, if I wouldn't have become a part of that gang life. Man, and stayed straight after I graduated and went to college, y'all would have saw me on TV NFL. It's some real stuff, I was really good man. I'm telling you."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:08",
      "upperBoundTime": "00:13:10",
      "content": "What position did you play?"
    },
    {
      "speaker": "Myron",
      "time": "00:13:10",
      "upperBoundTime": "00:13:17",
      "content": "I played running back, cornerback, safety carpet turner different positions."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:17",
      "upperBoundTime": "00:13:19",
      "content": "So it would have been football."
    },
    {
      "speaker": "Myron",
      "time": "00:13:19",
      "upperBoundTime": "00:13:25",
      "content": "Right. Yeah, that was my calling."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:25",
      "upperBoundTime": "00:13:29",
      "content": "And did you look into the possibility of playing ball in college?"
    },
    {
      "speaker": "Myron",
      "time": "00:13:29",
      "upperBoundTime": "00:13:40",
      "content": "Yes I did. I was going to enroll. I was going to go to Grahmlyn, but things just flip-sided and I got side tracked."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:40",
      "upperBoundTime": "00:13:51",
      "content": "Yeah, it happens. So, can you go back and describe the 21 year old you?"
    },
    {
      "speaker": "Myron",
      "time": "00:13:51",
      "upperBoundTime": "00:14:35",
      "content": "Oh man, I was really a mess. Not messy to the degree of looking for trouble, but I was actually really kind of misunderstood. What I mean by that is that the way I would cry for help it was hard to detect because I wasn't very sociable. I didn't just talk to a lot of people. I didn't talk a lot. I was kind of in my shell at that time, but I think for most part, I had a good heart throughout it all I just, and I made a lot of bad decisions a lot of them"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:35",
      "upperBoundTime": "00:15:07",
      "content": "Yeah part of this project is to try to look at people beyond that decision? So I wanted to move on to talking a little bit about your life since coming to Angola. Let's but is there something else about your childhood about your time, your first 21 years that you think is really critical in terms of shaping who you are now? That we didn't talk about or some other childhood experience or experience as a teenager that's really critical to who you are now?"
    },
    {
      "speaker": "Myron",
      "time": "00:15:07",
      "upperBoundTime": "00:15:36",
      "content": "Well, I mean, at that time of coming up, I never had a role model type. While, I would say, I never tried to find a role model type. Because I was so into my shell, I wasn't reaching out to anything so or anyone. I mean, I was more let me say I don't know, just messed up mentally. I would say that."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:36",
      "upperBoundTime": "00:15:53",
      "content": "Sure, you mentioned putting God first a little while ago. I'm assuming that at some point in your life, religion became an important part of who you are. When did that happen?"
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "Well, it actually happened when I came to Angola. It was an incident took place. And I'm going to tell you of this incident. I came in in 98'. I was in working cell block. I come out of the working cell block. And I was in population. It was a guy of an affiliated guy in the same type of gang I was in."
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "We would hang out daily, we on all this and that this and that this and that. So, another guy stepped to me and he was telling me that my friend was involved in some homosexual activity what I'm saying. And I'm like, no man, not him blah blah blah. So when I did tell my friend we was in the kitchen, eating, and I brought it to his attention."
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "I was like \"Man, what's going on with you? You know what I'm saying? I hear that you was involved in some nasty homosexual stuff.\" He denied it \"No\" I tell him \"Man you don't have to be that way\" So, I'm at football practice. The next day, I'm at football practice. So he come running out there and he telling me that he had hit the dude \"I hit him, I hit him, and I hit him.\""
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "So I'm like \"You hit him? What you talking about?\" He talking about the guy that was, what I'm saying, trying to persuade him to be that way. And so I said, \"Well come on then, well let's go get him, let's go get him.\" So I leave football practice, we going to find the guy. But just so happened the guy wasn't around. He went on the call out and man, lo and behold. When the guy came back from call out, they was in the same dorm and he got in a fight, got locked up."
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "The guy came back, but my friend went to an out camp. So, the guy what I'm saying, got worried that I was looking for him to do some physical contact to him. So he said to me, and he called me out, he said \"Man, look\" He said \"Bruh, I don't know you, but I don't I don't want to do no harm to you. You doing onto me.\""
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "And he explained to me, he said \"Your friend is like that. He is like that.\" I got word from that camp my friend was in and it's true that he was like that. Over and at that point right there I said I have to slow down and find another method along with my grandmother and my mom, they talking to me all the time. Hey, you need to find your way, you need to find God."
    },
    {
      "speaker": "Myron",
      "time": "00:15:53",
      "upperBoundTime": "00:19:01",
      "content": "You need to do something better with your life. I know you're locked up but it's not the end. And that's what they drilled to me, drilled to me. So, I dabbled I try to go to church and go to church, listen. But it just wasn't registering that I have to put God first before I can progress on anything positive. So, after a little while, I just got fed up man, and I just accepted God. And everything been going good since."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:01",
      "upperBoundTime": "00:19:03",
      "content": "Okay. How old were you when that happened, that change?"
    },
    {
      "speaker": "Myron",
      "time": "00:19:03",
      "upperBoundTime": "00:19:05",
      "content": "I was 23."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:05",
      "upperBoundTime": "00:19:07",
      "content": "Okay, so very early, very early."
    },
    {
      "speaker": "Myron",
      "time": "00:19:07",
      "upperBoundTime": "00:19:12",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:12",
      "upperBoundTime": "00:19:32",
      "content": "And when you look at the way people change, it's usually a function of age as well so they tend to be a little bit older and in your case, it seems that you found some kind of a different path a couple years after you were here. Granted, actually, very shortly after you were here. How long did you spend in the Parish before you came here?"
    },
    {
      "speaker": "Myron",
      "time": "00:19:32",
      "upperBoundTime": "00:19:38",
      "content": "About 2 years I think, about 2 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:38",
      "upperBoundTime": "00:19:40",
      "content": "So you were about 23 when you came to the- okay, alright."
    },
    {
      "speaker": "Myron",
      "time": "00:19:40",
      "upperBoundTime": "00:19:48",
      "content": "Right, exactly."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:48",
      "upperBoundTime": "00:19:51",
      "content": "So, tell me a little bit about your first few months here. Did you go into the field?"
    },
    {
      "speaker": "Myron",
      "time": "00:19:51",
      "upperBoundTime": "00:19:54",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:54",
      "upperBoundTime": "00:19:56",
      "content": "Okay, what was that like?"
    },
    {
      "speaker": "Myron",
      "time": "00:19:56",
      "upperBoundTime": "00:20:48",
      "content": "It was definitely different. I worked on the street. I worked construction so hard work wasn't really nothing I was afraid of. But, it was a different type of work and when I got here it was like in June. Man, it was hot. So, with me being out there in the heat like that it was it was crazy, working those tubes man, blistering my hands, and I remember not knowing how to work tubes up to the caliber they have here."
    },
    {
      "speaker": "Myron",
      "time": "00:19:56",
      "upperBoundTime": "00:20:48",
      "content": "Picking okra and stuff, having your arm itching, I didn't know that you should wear sweaters or long sleeve shirts. I mean, yeah. It was crazy. Looking at field foremen on horses with guns over you. I just said man, I don't like this here."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:48",
      "upperBoundTime": "00:20:53",
      "content": "Yeah. How long did you spend in the field before you got out?"
    },
    {
      "speaker": "Myron",
      "time": "00:20:53",
      "upperBoundTime": "00:21:01",
      "content": "I got my first job maybe two years after I was here. I was a yard orderly."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:01",
      "upperBoundTime": "00:21:07",
      "content": "Okay alright. So you spent two years, five days a week working out."
    },
    {
      "speaker": "Myron",
      "time": "00:21:07",
      "upperBoundTime": "00:21:22",
      "content": "Yes. Not to mention they used to have this thing they called 'extra duty'. That's when you get wrote up disciplinary well, yeah, weekend work. I had to do a little of that, not much, but I did have the experience of extra duty."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:22",
      "upperBoundTime": "00:21:28",
      "content": "Did you have some disciplinary problems when you first came here? Almost everybody does."
    },
    {
      "speaker": "Myron",
      "time": "00:21:28",
      "upperBoundTime": "00:22:12",
      "content": "Well, at first, giving to security and things of that nature, I didn't have that problem. But, I had this huge chip on my shoulder because, I wasn't the biggest guy that came here in fact, I was relatively small, and I was already nervous about the fact of coming to a prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:12",
      "upperBoundTime": "00:22:15",
      "content": "You had a chip on your shoulder, something to prove, is that what you were saying? So that just getting into it with other guys."
    },
    {
      "speaker": "Myron",
      "time": "00:22:15",
      "upperBoundTime": "00:22:28",
      "content": "Oh yes, no matter who because, one thing's for sure on my mind, I'm not going to be for nobody. That was law."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:28",
      "upperBoundTime": "00:22:41",
      "content": "Right, sure, I understand that. If you could go back to your 21 year old self, given all that you've learned about life since then, what advice would you give that person?"
    },
    {
      "speaker": "Myron",
      "time": "00:22:41",
      "upperBoundTime": "00:22:56",
      "content": "Man, I would tell his self that he need to get involved with some church definitely. And he would need to get involved with positive people, mature people, and find somebody that he could look up to."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:56",
      "upperBoundTime": "00:22:59",
      "content": "Right. Have you found that person, or those people?"
    },
    {
      "speaker": "Myron",
      "time": "00:22:59",
      "upperBoundTime": "00:23:20",
      "content": "Well, yes, I have. I'm actually involved in the Cowboys for Christ Ministry. Pastor Rich and them, they come out and they worship and they preach with us. They make you feel like people. They don't treat you bad or they give you same that you give them so it's a good atmosphere and they try."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:20",
      "upperBoundTime": "00:23:28",
      "content": "Sure, and do you find yourself now trying to mentor the younger guys or do you not really get into that?"
    },
    {
      "speaker": "Myron",
      "time": "00:23:28",
      "upperBoundTime": "00:23:45",
      "content": "I do. I try to talk to them here and there to a few, not all, because some is just far of than others, but here and there about I could kind of pull them in they have some pretty stable young guys here too."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:45",
      "upperBoundTime": "00:23:52",
      "content": "What's your typical day like now? What's your routine when you wake up to when you go to bed?"
    },
    {
      "speaker": "Myron",
      "time": "00:23:52",
      "upperBoundTime": "00:24:00",
      "content": "Well, I get up, definitely take care of my personal hygiene, and Monday through Friday, I go to work."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:00",
      "upperBoundTime": "00:24:03",
      "content": "Okay, what's your job?"
    },
    {
      "speaker": "Myron",
      "time": "00:24:03",
      "upperBoundTime": "00:24:15",
      "content": "I work on the compound do things, keeping the compound clean, keeping it up, the grounds like weeding, cutting grass, picking up paper or moving trash or anything helps paint a building anything of that nature."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:15",
      "upperBoundTime": "00:24:17",
      "content": "And does that keep you busy every day?"
    },
    {
      "speaker": "Myron",
      "time": "00:24:17",
      "upperBoundTime": "00:24:20",
      "content": "Yes. It does."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:20",
      "upperBoundTime": "00:24:29",
      "content": "Okay. And so, how long do you do that for?"
    },
    {
      "speaker": "Myron",
      "time": "00:24:29",
      "upperBoundTime": "00:24:33",
      "content": "I've had that job since May, but you do it, you work about 8 hours a day."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:33",
      "upperBoundTime": "00:24:36",
      "content": "8 hours, okay, and after that, what's your routine?"
    },
    {
      "speaker": "Myron",
      "time": "00:24:36",
      "upperBoundTime": "00:24:52",
      "content": "I'll come in and call my girlfriend or, call my kids or my moms. Maybe watch a little TV, may do a little reading."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:52",
      "upperBoundTime": "00:25:00",
      "content": "Okay, alright. You mentioned, Cowboys for Christ. Are there some other organizations that you've been a part of since you've been here over the last 20 years or so?"
    },
    {
      "speaker": "Myron",
      "time": "00:25:00",
      "upperBoundTime": "00:25:10",
      "content": "I've been a part of the Drama Club. We did this huge event they call Life of Jesus Christ. It's a big play that we do on the Rodeo Ground. It was cool too."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:10",
      "upperBoundTime": "00:25:14",
      "content": "Yeah! I've heard all about it. Did you have a role in it?"
    },
    {
      "speaker": "Myron",
      "time": "00:25:14",
      "upperBoundTime": "00:25:22",
      "content": "Yeah, I was a Roman Soldier. Now, don't be mad, but I beat Jesus."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:22",
      "upperBoundTime": "00:25:33",
      "content": "I spoke to a couple of guys who've been in there, in the play, who really saw it as a central part of what they've been doing lately. Did it have a real big impact on you?"
    },
    {
      "speaker": "Myron",
      "time": "00:25:33",
      "upperBoundTime": "00:25:43",
      "content": "Yes, it did. It actually helped me understand the Bible a lot more too. Of things that happened from back then in the past. Biblical aspects."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:43",
      "upperBoundTime": "00:25:45",
      "content": "Yeah, tell me a bit more about that."
    },
    {
      "speaker": "Myron",
      "time": "00:25:45",
      "upperBoundTime": "00:26:01",
      "content": "You could read the Bible, and things of that nature and still not have a lot of understanding, but if you could visual of being part of what took place, it helps you understand it a lot clearer? So it was a learning experience for me."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:01",
      "upperBoundTime": "00:26:04",
      "content": "Yeah. Sure, do you like acting?"
    },
    {
      "speaker": "Myron",
      "time": "00:26:04",
      "upperBoundTime": "00:26:07",
      "content": "I guess yeah. I guess."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:07",
      "upperBoundTime": "00:26:13",
      "content": "So does the Drama Program, do they have plans to do any other plays?"
    },
    {
      "speaker": "Myron",
      "time": "00:26:13",
      "upperBoundTime": "00:26:46",
      "content": "They used to do things like little skits for banquets and things like that but I didn't take part in those because I had got my trustee status at that time and I was housed back at Camp F? Working for the range crew? And out there, that's where I learned to shoo horses, reign horses, and drive tractors and do things of that nature, which it was something I enjoyed because, like I said, I come up in the country type element so I fell right in and caught on."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:46",
      "upperBoundTime": "00:26:50",
      "content": "Sure. Do you take part in the Rodeo?"
    },
    {
      "speaker": "Myron",
      "time": "00:26:50",
      "upperBoundTime": "00:26:52",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:52",
      "upperBoundTime": "00:26:56",
      "content": "What do you do for the- I mean, when you say Cowboys for Christ I assume you're somehow involved in the Rodeo."
    },
    {
      "speaker": "Myron",
      "time": "00:26:56",
      "upperBoundTime": "00:27:28",
      "content": "I be killing it out there bro. I do it all. I mean, not bragging, but it is what it is and I does something. I mean, I ride bulls, bare back, I mean, in fact, this is one of my buckles here, buckle. But, man, you name it I do it, I even get to chip off the bull. Man, so far I've gotten it 14 times so. Yeah, you might, I mean, I don't know if y'all have noticed, but I wear this big sombrero hat out there."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:28",
      "upperBoundTime": "00:27:30",
      "content": "Oh for the, for the poker?"
    },
    {
      "speaker": "Myron",
      "time": "00:27:30",
      "upperBoundTime": "00:27:58",
      "content": "No, for the whole even for everything. That's my trademark because the incident happened before I used to wear this little green Oakland athletic hat, but it was like four guys out there that had the same type of hat and I won an event, but they give it to another guy that had the same identical hat so I said, well, I got to come up with something unique and something that will separate me from the rest. And since 2008, I been wearing that hat. That's my trademark."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:58",
      "upperBoundTime": "00:28:00",
      "content": "Okay and do you do the poker?"
    },
    {
      "speaker": "Myron",
      "time": "00:28:00",
      "upperBoundTime": "00:28:07",
      "content": "Yes, if you look, I just got scarred up messing with that poker."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:07",
      "upperBoundTime": "00:28:10",
      "content": "Okay, alright. Are you going to continue to do that?"
    },
    {
      "speaker": "Myron",
      "time": "00:28:10",
      "upperBoundTime": "00:28:25",
      "content": "Oh, yes indeed because, with that, my purpose for it is not just the fact that I enjoy doing it, but the money I get I sent it home. I share it with my kids because now, they having kids and I have to do something."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:25",
      "upperBoundTime": "00:28:31",
      "content": "Well, getting a chip off the bull, 14 times. I don't think anybody can say that."
    },
    {
      "speaker": "Myron",
      "time": "00:28:31",
      "upperBoundTime": "00:28:47",
      "content": "Yeah, they have, I have a good friend of mine here, Marlin, he done got it 28. They have another guy, he don't participate no more but he gotten it 18. So my goal is really to get past the 18."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:47",
      "upperBoundTime": "00:28:50",
      "content": "Okay, Jerry Brown, is a guy, he also."
    },
    {
      "speaker": "Myron",
      "time": "00:28:50",
      "upperBoundTime": "00:29:01",
      "content": "Jerry is pretty good I feel. Jerry, that's before my time. When I came he was falling."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:01",
      "upperBoundTime": "00:29:10",
      "content": "He's doing more coaching and boxing and stuff like that. Okay, interesting, so you like the Rodeo. I mean, some people hate it."
    },
    {
      "speaker": "Myron",
      "time": "00:29:10",
      "upperBoundTime": "00:29:51",
      "content": "It's cool. I love the adrenaline that it gives me- especially say a bareback or a bull ride. It's- Ima say that's my worry free treatment because you're on this animal and the goal is to stay on it for 8 seconds. And within those 8 seconds you don't have no worries. Everything that may have been bothering you or, you're worried about, stressing, it's gone. It's clear it's just you and nature. It's cool, a cool atmosphere."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:51",
      "upperBoundTime": "00:30:17",
      "content": "Yeah, I believe it. It's cool. So I want to ask you a couple of difficult questions, right? So when you look back now, 23 years, after the fact of what happened and you think of the victim, the victim's family, what do you it's been so long, what are your thoughts about it now?"
    },
    {
      "speaker": "Myron",
      "time": "00:30:17",
      "upperBoundTime": "00:31:20",
      "content": "Man, it's not a day that passed that I don't, I mean, I understand that that family is devastated from actions that I've done. And I ask for forgiveness from that family. I mean It's hard because I know, I could have did better I'm sorry."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:20",
      "upperBoundTime": "00:31:46",
      "content": "Well, the other family that's obviously, been seriously impacted by it is your own. Can you tell me a little bit about the impact that it's had on your family? I'm sorry to bring you down this path, but it's important to talk about this too."
    },
    {
      "speaker": "Myron",
      "time": "00:31:46",
      "upperBoundTime": "00:32:09",
      "content": "Well, it's I know my family went through a lot of shame and the fact that I let them down because I wasn't that person that they raised it's a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:09",
      "upperBoundTime": "00:32:18",
      "content": "Who in your family do you think it's been the hardest on over the years?"
    },
    {
      "speaker": "Myron",
      "time": "00:32:18",
      "upperBoundTime": "00:32:37",
      "content": "Oh man, my grandparents. I lost my grandfather 20 years ago. My mom for sure. My sisters, they just they cry every time they come down."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:37",
      "upperBoundTime": "00:32:41",
      "content": "I think people forget that those folks?"
    },
    {
      "speaker": "Myron",
      "time": "00:32:41",
      "upperBoundTime": "00:32:50",
      "content": "Yeah, it's rough. It's rough, man. It's rough."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:50",
      "upperBoundTime": "00:32:57",
      "content": "And watching your family go through this, do you then make the connection between that and what the victim's family goes through?"
    },
    {
      "speaker": "Myron",
      "time": "00:32:57",
      "upperBoundTime": "00:33:16",
      "content": "I mean, I understand that they both going through hurt, but the victim's family I know is more traumatized and devastated because they don't have their loved one?"
    },
    {
      "speaker": "Marcus",
      "time": "00:33:16",
      "upperBoundTime": "00:33:28",
      "content": "If you do get a chance to go before the pardon board, what would you want them to know about you? Because they'll ask you why should we give you another chance?"
    },
    {
      "speaker": "Myron",
      "time": "00:33:28",
      "upperBoundTime": "00:34:14",
      "content": "Oh man, because I have so much to give in society, I have obtained and learned so much. And I know there's somebody out there, not even say a family member that I can bring out of darkness. There's something that I can do to help somebody, if it's just one person and I definitely would be more than honored to show the pardon board in front of the world that that rehabilitation does exist. Through me I can prove that. And I just also want them to know that they won't ever be making a mistake by giving a second chance."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:14",
      "upperBoundTime": "00:34:23",
      "content": "How have you coped over the years with the idea that you may not get out?"
    },
    {
      "speaker": "Myron",
      "time": "00:34:23",
      "upperBoundTime": "00:34:30",
      "content": "Man, I just keep God first and I believe in my heart that I will have the opportunity to be released from here. I am better than in heart, in my mind, in my spirit."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:30",
      "upperBoundTime": "00:35:08",
      "content": "Sure, I spoke with somebody, one of the Pastors here about this whole process and he referred to it. He said it's cruel, because he said its false hope that when you're given a life sentence, the only thing you can do is cling to the, it's almost like being in denial about it you cling on to some kind of false hope. And even then, he's still hopeful. This sort of, he was talking about some of the tricks you convince yourself in order just to get through. Do you struggle with these things?"
    },
    {
      "speaker": "Myron",
      "time": "00:35:08",
      "upperBoundTime": "00:35:29",
      "content": "From time to time. I do. I sometime let it get the best of me, but fortunately I have very strong support of people that's backing me that kind of, \"Hey, no. Stay with me\" So, kind of helps keep me on track."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:29",
      "upperBoundTime": "00:35:39",
      "content": "Folks in here?"
    },
    {
      "speaker": "Myron",
      "time": "00:35:39",
      "upperBoundTime": "00:35:42",
      "content": "Yes, folks in here and out there as well."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:42",
      "upperBoundTime": "00:35:49",
      "content": "Right sure. So what did this may be a strange question to ask you but, what do you find now, at this stage in your life, to be the hardest part of being here?"
    },
    {
      "speaker": "Myron",
      "time": "00:35:49",
      "upperBoundTime": "00:36:56",
      "content": "Waking up, not being able to just embrace life to its fullest. Not being able to just walk your kids to a park or something or not being able to fix a car. Just the small things you really never paid mind to. It's hard and like here, you wake up dealing with so many different personalities and attitudes and I have to keep pulling myself, hey, you have to understand everybody here is not evil."
    },
    {
      "speaker": "Myron",
      "time": "00:35:49",
      "upperBoundTime": "00:36:56",
      "content": "But, they do have some here very evil they have some real evil hearts. It's just a daily what I'm saying, struggle. You have to maneuver yourself through the obstacles and make it. Make it and I keep telling myself every day. Every day I wake up is another day closer till I get to be home just got to keep waking up."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:56",
      "upperBoundTime": "00:37:04",
      "content": "If there is such a thing, what's been the best part of the experience for you? If there is such a thing."
    },
    {
      "speaker": "Myron",
      "time": "00:37:04",
      "upperBoundTime": "00:37:35",
      "content": "Actually, getting to know people from different walks. When they can come together and actually be in harmony and serendipity. To show well, everybody that makes a mistake doesn't make them a bad person. Knowing that is inspiring to just really get to know other people. So it helps me stay out of the shell that I was in."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:35",
      "upperBoundTime": "00:37:56",
      "content": "Oh yeah. So, Angola is one of these unusual places in they offer so many opportunities for training, vocational training and all kinds of things I think even, seminary. What kinds of things in that realm have you made use of or plan to?"
    },
    {
      "speaker": "Myron",
      "time": "00:37:56",
      "upperBoundTime": "00:38:26",
      "content": "I've taken part, I've gotten in the class. I graduated from that. Inside out, that class. As far as trades, I have job skills, for the prison enterprise, the range crew. Like I said, I can operate machinery. I train animals. And these things that I know can beneficial to help me when I'm in society."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:26",
      "upperBoundTime": "00:38:35",
      "content": "So let's talk about that for a minute. What how do you envision that specifically? What are you doing for this next chapter of your life what are you doing?"
    },
    {
      "speaker": "Myron",
      "time": "00:38:35",
      "upperBoundTime": "00:39:28",
      "content": "Well, for sure, I will be working. I would definitely involve myself in positive atmosphere. I always said, even when I was younger after being here a little while, I said \"man, when I get out, I'm just going to hang with old people\" Stuff like that, people that are more mature in the mind and have a better outlook on life and could give me better understanding on things."
    },
    {
      "speaker": "Myron",
      "time": "00:38:35",
      "upperBoundTime": "00:39:28",
      "content": "I don't know, but through life having a solid relationship whether I'm saying it's a girlfriend, or just family, or friends what I'm saying, I understand that that's very important. Because it doesn't matter how successful you are, everybody's going to need somebody to for something."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:28",
      "upperBoundTime": "00:39:33",
      "content": "Would you see yourself going back to Shreveport?"
    },
    {
      "speaker": "Myron",
      "time": "00:39:33",
      "upperBoundTime": "00:39:43",
      "content": "I plan on not staying in Shreveport to just away from just everything the past of that, and just try and start over. A clean sweep, a clean slate man."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:43",
      "upperBoundTime": "00:39:47",
      "content": "Sure. Louisiana? Would you have a desire to leave the state?"
    },
    {
      "speaker": "Myron",
      "time": "00:39:47",
      "upperBoundTime": "00:40:03",
      "content": "Yes. I would love to leave the state. In my mind, I just think somewhere outside of the state is a better start for me. Yeah, not saying I wouldn't come back because I have family here but not live. I'd like to live somewhere else."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:03",
      "upperBoundTime": "00:40:33",
      "content": "So, can you explain a little too certainly, there's so many people I think who would see that life without parole is really not a humane way to treat most people, but they never see it. They don't think about prison. They just go on about their lives. What would you want that person to know about what it is for you, what the reality of living a life sentence is?"
    },
    {
      "speaker": "Myron",
      "time": "00:40:33",
      "upperBoundTime": "00:40:52",
      "content": "It's not a good one. I mean living with the possibility of knowing that there's a chance that I may not ever get home or be able to live a citizen's type life it's scary."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:52",
      "upperBoundTime": "00:41:00",
      "content": "Do you think it's just?"
    },
    {
      "speaker": "Myron",
      "time": "00:41:00",
      "upperBoundTime": "00:41:32",
      "content": "No. I don't, because Ima say this. A lot of times, going through the system, a lot of people will convict you without even knowing you. So, I'm like. If you could just throw a person away without knowing that person what makes you any better than the crime that is being convicted by that person. I just I look at it like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:32",
      "upperBoundTime": "00:41:55",
      "content": "Sure. Is there something else? I feel like I've learned a fair bit about you, of course over the course of an hour, there's only so much you can do, but is there something else that I should have asked you that we didn't get a chance to talk about that you think is important in your story as to who you are?"
    },
    {
      "speaker": "Myron",
      "time": "00:41:55",
      "upperBoundTime": "00:43:03",
      "content": "Well, I mean, I can revert back to the turning point in my life, which, started to me coming to prison, but led to the incident. It was this is before I even owned or carried a fire arm, it was with occasions that I had incidents with individuals and I was shot. I've been shot like 3 times on 4 incidents of 4 incidents. And it kind of put me in the mindset of I have to have some kind of protection."
    },
    {
      "speaker": "Myron",
      "time": "00:41:55",
      "upperBoundTime": "00:43:03",
      "content": "Because I'm getting shot and at the time, I wasn't in tune with God, but by the grace of God I'm still here, able to do everything another normal person could do, but that was just something that happened that made me feel that I had to have some kind of protection to protect myself and, it's just it's wrong path, that's all."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:03",
      "content": "Yeah. Okay, alright, well I think that's a good place to end. Thank you very much for doing this. I appreciate it."
    }
  ]
}
