{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Nadaedrick Campbell_Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:00:00",
      "upperBoundTime": "00:00:21",
      "content": "My name is Nadaedrick Campbell. My charge is first degree murder of a police officer and I was twenty years old at the time that I got this charge and I've been sentenced to life imprisonment without the benefit of parole or reduction of sentence."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:21",
      "upperBoundTime": "00:00:25",
      "content": "And how much time have you served now?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:00:25",
      "upperBoundTime": "00:00:31",
      "content": "So far I've been incarcerated since December 23rd, 1992 which is going on twenty-six years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:31",
      "upperBoundTime": "00:00:54",
      "content": "So I would like to learn about you and your experiences both before this and after that. So here and most of which has been in Angola. But I want to start by asking you some questions about your childhood and the first place to start with that would be with your family. So can you tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:00:54",
      "upperBoundTime": "00:01:51",
      "content": "Well my mother and father my earliest memories are with my mother and my father. I remember my mother, she was a college student and she also worked. My dad he kind of had jobs here and there. He was kind of mostly an out and about type of guy. He did certain hustles and he was cool in the neighborhood and I was his little son but my I was an only child for sixteen years."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:00:54",
      "upperBoundTime": "00:01:51",
      "content": "I'm still my father's only child. My mother has two other sons and one I think is like thirty and the baby boy is about twenty-eight. So I pretty much grew up an only child. My mother and my father they treated me well. They took care of me. I didn't get a lot of spankings because I was pretty much spoiled. We lived in pretty decent areas of town."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:51",
      "upperBoundTime": "00:01:51",
      "content": "Where did you grow up?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:01:51",
      "upperBoundTime": "00:02:32",
      "content": "I grew up a lot of different places. I've never had any real stability and so between Abbeville Louisiana which is extreme south and Shreveport Louisiana which is extreme north between those places I just grew up in different parts of town and in different areas of the state. So I've never really and I was never really situated or stable and even that much while it came out that people were amazed that I was as successful as I was in graduating high school and some of the things that I did. We kind of moved around a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:32",
      "upperBoundTime": "00:02:35",
      "content": "And did that mean that you also moved from school to school?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:02:35",
      "upperBoundTime": "00:02:46",
      "content": "Lots of schools I think like over twenty schools so I was I never had a chance to I was never planted anywhere."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:46",
      "upperBoundTime": "00:02:50",
      "content": "And why were you moving so much?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:02:50",
      "upperBoundTime": "00:04:08",
      "content": "My mother and my father I can't say that the relationship was necessarily abusive physically but it was psychologically tumultuous I think for my mother because my father was unfaithful and he liked to stay on the go a whole lot and my mother really wanted to do better than he did. My father had drug problems. He was addicted to cocaine. As a child I grew up witnessing my father actually use drugs in my presence and so that's kind of the environment I came up in. I saw a lot of a lot of drug use from relatives, older uncles, and cousins who I looked up to."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:02:50",
      "upperBoundTime": "00:04:08",
      "content": "They were involved in a lot of drug activity. So my mother she kind of wanted to get me out of that environment. So we would move a lot and how women are. They would they like go back to a man that they know may not be may not have their best interest at heart. And so her and my dad would kind of periodically get back together and that just caused me to get caught up in a whole lot a lot of moves."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:08",
      "upperBoundTime": "00:04:22",
      "content": "Okay. All right. So let's talk a little bit about the school. I anticipate that there are some additional challenges in terms of just getting in with a peer group when you're constantly moving from one peer group to the next."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:04:22",
      "upperBoundTime": "00:04:24",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:24",
      "upperBoundTime": "00:04:32",
      "content": "So tell me a little bit about school. You said you graduated from high school. Did school come very easily to you? Did you like school?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:04:32",
      "upperBoundTime": "00:05:57",
      "content": "I can't say that I necessarily liked school academically. Academically, I could do it. It wasn't nothing that I couldn't do. As a matter of fact I could excel. I could do as well as I chose to do. I really wasn't inspired because I never was able to get somewhere and actually appreciate my environment. I would get there and I would figure, \"Well I'm going to be here for a few months probably not even a year or maybe a year. And so it really doesn't pay me to involve myself emotionally with the people who are around me,\" So I never became attached."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:04:32",
      "upperBoundTime": "00:05:57",
      "content": "I learned how to detach myself and I did that to protect myself because I just got tired of really being hurt from the moves. Academically though I've struggled maybe to get at my mother. Maybe I would make bad grades because I knew that it would affect her emotionally but I didn't like school enough to say I'm going to fail because I knew if I failed I'd have to repeat a grade. So I may drop my grades down kind of bad for a while but I knew when I pick them up so that I could move on to the next grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:57",
      "upperBoundTime": "00:06:02",
      "content": "So you knew that if you performed badly in school it would get your mother's attention?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:06:02",
      "upperBoundTime": "00:06:04",
      "content": "Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:04",
      "upperBoundTime": "00:06:11",
      "content": "Why do you think you were trying to get her attention that way?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:06:11",
      "upperBoundTime": "00:06:58",
      "content": "It was times when I would be dissatisfied maybe with my home life maybe with her boyfriend at that particular time during a separation period between her and my father. Maybe it was because I didn't want to live where we were living or maybe this was the third time we had packed up in the middle of a school year and I was starting a new school for like the third time in one particular year."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:06:11",
      "upperBoundTime": "00:06:58",
      "content": "So that was my way of exacting revenge toward her and I knew it would frustrate her and cause her to act out. And so at the time I didn't really consciously I wasn't able to consciously understand what I was doing but now I understand that's the reason why I acted out."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:58",
      "upperBoundTime": "00:07:12",
      "content": "Yeah. And so you raise another thing that I wanted to ask you about. Can you tell me a little bit about the men who came into your mother's life aside from your father and whether or not that caused some comfort between you and these men?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:07:12",
      "upperBoundTime": "00:08:47",
      "content": "Well my mother pretty much protected me. She sheltered me and I can honestly say that aside from guys may have been unfaithful to her, they were never abusive toward her nor were they abusive toward me. My father always had a reputation. He was a street guy. And so people, the guys who dated my mother, it doesn't matter where they were from when they met him or when they came to our hometown and they heard about my father they pretty much got the idea. One thing that they cannot do you can't put your hands on him or you can't really even treat his mother too bad."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:07:12",
      "upperBoundTime": "00:08:47",
      "content": "Because if this guy gets on your trail he knows is going to be a price to pay. So for the most part they treated me well or they just distanced themselves from me and my mom didn't really do a lot of dating she didn't have a lot of men in particular she had a boyfriend. They were together for a while before her and my father got back together. Got married when I was thirteen. Divorced when I was about thirteen. And then she connected with the guy who I could say he would have been a stepfather to me. And so they were together for some years and we got along quite well."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:47",
      "upperBoundTime": "00:08:57",
      "content": "So moving from place to place to place, did you find yourself getting in fights?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:08:57",
      "upperBoundTime": "00:11:10",
      "content": "I did. This is this is kind of hard to talk about but it's the truth. It's not my fault. I didn't cause it but where I came from I grew up fighting and I tell people a lot. I didn't have the pet dog the pit bull or whatever and I could say we didn't have pets because but how I came up my older cousins they used to take me out to fight other little kids in the neighborhood. My dad would take me to fight other kids. That was like it was the culture. And so I often make a joke and I tell guys I say, \"Man, look."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:08:57",
      "upperBoundTime": "00:11:10",
      "content": "We did it we didn't have a pitbull. I was the dog. I was the pitbull.\" My father took me out and he fought me. They may bet money on us. And at the time we're just kids and so that's pretty much how I came up. My father's a very dark skinned man. My mother she's fair complexion like I am. And so I had blond hair. It may be hard for you to imagine but the hair that this gentleman has on his hair that color hair."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:08:57",
      "upperBoundTime": "00:11:10",
      "content": "My hair, it was real blond so people thought I was people they didn't really know what I was but they kind of teased me like they thought I was half white, half black men both of my parents are black. My mother has a lot of white blood in her and so that caused a lot of fights because I was a little pretty curly hair blond headed kid. So people looked at me as being weak and they may try to force themselves upon me or pick on me and that kind of caused me to overreact sometimes."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:08:57",
      "upperBoundTime": "00:11:10",
      "content": "And so even in schools that kind of led to me getting into physical altercations because I had to prove myself and I didn't look like a lot of my peers. I was a black kid who they didn't know was black. So I really had to over exert my boyhood and even growing into my masculinity I had to over exert myself"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:10",
      "upperBoundTime": "00:11:23",
      "content": "Sure. So I'm going to make an assumption based on what you said that you would not consider yourself to have been physically or sexually abused as a child."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:11:23",
      "upperBoundTime": "00:11:26",
      "content": "No sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:26",
      "upperBoundTime": "00:11:34",
      "content": "That there were adults in your life perhaps your mother and some significant men who were in her life who took an interest in you such that you knew you were cared for."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:11:34",
      "upperBoundTime": "00:11:38",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:38",
      "upperBoundTime": "00:11:47",
      "content": "And that school was relatively easy to you. But you were moving around so much that it never really became a significant part of your life."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:11:47",
      "upperBoundTime": "00:11:49",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:49",
      "upperBoundTime": "00:11:51",
      "content": "Were you ever kicked out of school?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:11:51",
      "upperBoundTime": "00:12:11",
      "content": "I was never really suspended or I was never kicked out of school. I may have had an incident or two when my mother was called to the school and maybe some counseling sessions, maybe some in school detention but nothing serious, no."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:11",
      "upperBoundTime": "00:12:13",
      "content": "Fighting?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:12:13",
      "upperBoundTime": "00:12:40",
      "content": "Let me think. Possibly, maybe when I was younger I had some fights in school. But I was never it wasn't anything seriously like where I was suspended from school. So at one time I did have a fight. The first time I was twelve I broke this hand and actually broke my hand in a fight at school. It I don't think I didn't get kicked out. I was dealt with but it wasn't nothing serious because it was just boyhood kind of."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:40",
      "upperBoundTime": "00:12:57",
      "content": "Sure. So of all of the adults who are in your life, is there one person who stands out beyond others as the person who knew you best, who you could confide in, who took the greatest interest in you who would that be?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:12:57",
      "upperBoundTime": "00:13:00",
      "content": "My mother. Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:00",
      "upperBoundTime": "00:13:04",
      "content": "And what's your relationship like with your mother now?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:13:04",
      "upperBoundTime": "00:13:58",
      "content": "It's very beautiful because my mother is a very beautiful human being and I mean she's like the best mother that anyone could just dream of having. I understand now that as a human being she had her weaknesses and she was trying to live her life and experience the pleasures and the joys of life as best she could while taking care of both of our needs."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:13:04",
      "upperBoundTime": "00:13:58",
      "content": "Fortunately she's never used drugs excuse me. She's never used drugs. I've never witnessed my mother using drugs. If she's ever drank alcohol it had to have been moderately but she was just a well-grounded Christian woman hardworking lady for the most part and she knows me very well."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:58",
      "upperBoundTime": "00:14:02",
      "content": "And who visits you up here?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:14:02",
      "upperBoundTime": "00:14:36",
      "content": "My mother. She visits me as often as she can and I have a first cousin, my mother's sister's daughter. And so I'm actually five years older than she is but she's like my sister. And so she brings her nine year old twin boys and she's got a fourteen year old I think he's fourteen or fifteen and they've been coming since they were babies so they know me. Those are my regular visits."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:36",
      "upperBoundTime": "00:14:40",
      "content": "What about your dad? Is your dad still in your life?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:14:40",
      "upperBoundTime": "00:14:56",
      "content": "Okay my father. He doesn't visit regularly. But him and my mother, my biological father, him and my mother they remained friends. And so he's on my visiting list and periodically they'll ride together. And we have a rodeo."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:56",
      "upperBoundTime": "00:14:59",
      "content": "Yes."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:14:59",
      "upperBoundTime": "00:15:27",
      "content": "We have a rodeo and so him and my family, on that side, they'll all get together and they'll come up and they'll visit me for the rodeo and like I said my mom and my dad periodically they get together because they're still great friends and she still insist to this very day. He's remarried. But that she knows that he is her soul mate even though they'll never be together again she's doing just fine with that but they still have a mutual love and respect for one another."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:27",
      "upperBoundTime": "00:15:29",
      "content": "How old are they now?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:15:29",
      "upperBoundTime": "00:15:47",
      "content": "My mother is sixty-seven. She made is sixty-seven January 21st. She was born in 1951. My father was born August 27, 1950 which means he's going to be sixty-eight in August."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:47",
      "upperBoundTime": "00:15:51",
      "content": "What about intimate relationships girlfriends before this happened?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:15:51",
      "upperBoundTime": "00:17:01",
      "content": "I had one. I had one very significant relationship and as a matter of fact this whole situation ironically no one is to blame for the pain that I've caused other people through the actions of that I committed to get into this trouble but actually my fiancée because we were going to be married was involved in an incident that kind of sparked this whole situation and it led to individuals being hurt who really didn't have anything to do with this."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:15:51",
      "upperBoundTime": "00:17:01",
      "content": "I was involved and so I was in love with her. I was very much in love with her. She's the first female that I can say I really loved to that degree. And we pretty much stayed together every day. She was a young schoolgirl going to college. She was working."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:01",
      "upperBoundTime": "00:17:04",
      "content": "What's her name?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:17:04",
      "upperBoundTime": "00:17:29",
      "content": "Her name is Chelle, and she's on my visiting list all of these years later we remain friends and periodically yeah we remain friends. And so I have been in love once. No I don't have any kids though. I was in the military at the time and I caught my charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:29",
      "upperBoundTime": "00:17:31",
      "content": "What branch?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:17:31",
      "upperBoundTime": "00:18:07",
      "content": "The Louisiana Army National Guard and I did get accepted to LSU. I sent my ACT scores off and I did get accepted to LSU. And to my shame I attended LSUS in Shreveport for maybe a half a semester. And my life just got totally sidetracked and she came in along the side track part of my life. And so I fell in love with her. So I have been in love once I believe she is my soulmate and I'm still in love with her. Probably always will be."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:07",
      "upperBoundTime": "00:18:13",
      "content": "What's her story? What is she, what does she do? What has she gone on to do all these years?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:18:13",
      "upperBoundTime": "00:18:53",
      "content": "She's lived a fairly successful life. This occurrence with me it deeply affected her. She believes that because I left her out there it kind of altered the course of her life however she's had some very good jobs. And even right now she has a very good job. She's employed with the city. She's an upstanding citizen in her community. But her life has been very turbulent."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:53",
      "upperBoundTime": "00:18:57",
      "content": "Is she going to have a family of her own?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:18:57",
      "upperBoundTime": "00:19:14",
      "content": "Yes she has...she's had four kids and she was married. She's divorced now and she's been divorced for a little over a year or so."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:14",
      "upperBoundTime": "00:19:17",
      "content": "Was that difficult for you to watch that from here?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:19:17",
      "upperBoundTime": "00:21:01",
      "content": "I actually withdrew. We didn't have a relationship for about nineteen years, eighteen years because I realized when I got in trouble immediately when I sobered up because at the time I got into this trouble. It was like the twenty-third of December and so I was at a party and I had been drinking all day."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:19:17",
      "upperBoundTime": "00:21:01",
      "content": "I wasn't a regular drinker but in the in the spirit of Christmas I had been drinking. So according to medical documentation I was pathologically intoxicated. I didn't realize I was pathologically intoxicated. I was we was just out party and drinking. And so when I sobered up and realized the magnitude of my actions and what they were telling me what I did and what I remembered doing. I was like \"That's it. That's it."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:19:17",
      "upperBoundTime": "00:21:01",
      "content": "I blew this thing. I'm going to be alive maybe for a couple more years. I'm going to get the death penalty,\" I said so I had to accept the responsibility of I mean this thing on my own. Now I'm not going to carry anyone through this. I was real hurt. I was disappointed. I was sorry about what I did but I let her go immediately and she didn't want to go so she rode it out with me for a while and we just kind of end up. But I stayed in contact with her mother."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:19:17",
      "upperBoundTime": "00:21:01",
      "content": "All of these years but I would never ask her mother to relay any messages because I just didn't want to I didn't want her to have to bear the burden of this situation."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:01",
      "upperBoundTime": "00:21:09",
      "content": "Sure it makes sense. Were there any brushes with law prior to this charge?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:21:09",
      "upperBoundTime": "00:21:11",
      "content": "Any brushes with the...?"
    },
    {
      "speaker": "Marcus",
      "time": "00:21:11",
      "upperBoundTime": "00:21:14",
      "content": "Any arrests?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:21:14",
      "upperBoundTime": "00:21:46",
      "content": "I've never been formally arrested or charged. I have been pulled over in traffic stops. I have been questioned about other people's behavior like I may have gotten a burnt tail light on my motorcycle I remember that and I went to the police station and so they questioned me about some neighborhood activities that other guards were involved in but I'd never been arrested or charged or fingerprinted or this is my first time in a police car."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:46",
      "upperBoundTime": "00:21:51",
      "content": "What kind of bike were you riding?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:21:51",
      "upperBoundTime": "00:22:35",
      "content": "It was really just it was a Yamaha YSR50. It was when they came out with the little miniature ninjas and they were like two thousand dollars I think and they were just so cool. Yeah we just wanted it because you could ride them like you can put them on a trail like bring them to the beach and they would just like real cool miniature adventures. And so somehow or another this one was brand new and I hit a bump and it knocked the tail light. It got a short in it. And so they gave me that they gave me a ticket for it."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:35",
      "upperBoundTime": "00:22:38",
      "content": "So I want to ask you a little bit about what happened that night. Did you have access to a firearm?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:22:38",
      "upperBoundTime": "00:22:43",
      "content": "I did access a firearm."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:43",
      "upperBoundTime": "00:22:45",
      "content": "Why did you feel the need to have a firearm?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:22:45",
      "upperBoundTime": "00:24:37",
      "content": "I spoke earlier about an incident that my fiancée was involved in with one of her exes. And so he had previously shot a brand new car that her mother bought her to go to college in because they had broken up prior to me and her getting together and so she was about to start a new relationship with this with another guy. And so her ex, he discovered that they were at an apartment complex and so he went there with the firearm. And I mean in the neighborhood we all know who we know who has a reputation for what."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:22:45",
      "upperBoundTime": "00:24:37",
      "content": "So when he pulled the firearm, they ran into the apartment. And so he got upset and he shot her car. And totally lost it. It was a brand new like a 1991 Ford Probe. And so he was arrested for that and he was going to have to pay the insurance company or whatever restitution. So somehow or another they passed words. It was in December. And so me and him we kind of got at odds about this."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:22:45",
      "upperBoundTime": "00:24:37",
      "content": "So I knew he always had a gun. And I ended up at a party and a lot of my friends, I'm in the neighborhood, guys have guns and as me and her were discussing the issue that she was having with this guy it led to an altercation between me and some other guys who didn't have anything to do with any of this and so guy went to his car and saw him with some friends of mine, to follow him and that's where the first altercation kind of took place. No one got shot or hurt. But my actions were very bad and very out of out of character and that's how this."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:37",
      "upperBoundTime": "00:24:41",
      "content": "Can you give me very briefly because that was really the point of this..."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:24:41",
      "upperBoundTime": "00:24:43",
      "content": "Is what?"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:43",
      "upperBoundTime": "00:25:02",
      "content": "Is not so much to delve into the specifics of your actions? I'm much more interested in you as a person before and after this but it would be strange for me to be talking to you serving a life sentence without any reference to what got you here. So can you just briefly give me the summary of what happened that night to bring you here a move on?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:25:02",
      "upperBoundTime": "00:25:39",
      "content": "I've got you. And so from that particular incident I ended up in a car with someone the firearm that I acquired I had it on my person because we all just kind of dispersed very quickly and I ended up in a car with a guy. And so he was speeding and a police officer got behind us. And so we ended up in a high speed chase until we arrived at his mother's house. And so because of my erratic behavior it led to a confrontation between me and the police officer. And all said and done I fired a shot at striking the officer and he died."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:39",
      "upperBoundTime": "00:25:41",
      "content": "Outside of the car?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:25:41",
      "upperBoundTime": "00:25:46",
      "content": "Outside of the car, yes sir. It was during the arrest part of the procedure."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:46",
      "upperBoundTime": "00:25:48",
      "content": "A white police officer?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:25:48",
      "upperBoundTime": "00:25:50",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:50",
      "upperBoundTime": "00:25:59",
      "content": "So this happens. You hadn't been in any kind of major arrest you didn't have any major arrests before. This one night then changes the whole trajectory of your life."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:25:59",
      "upperBoundTime": "00:26:02",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:02",
      "upperBoundTime": "00:26:04",
      "content": "You get thrown into the parish prison while you're going through the trial."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:26:04",
      "upperBoundTime": "00:27:46",
      "content": "It's amazing at how much and how much mercy God showed me because looking back at it now I was treated more than fairly. I was a young black kid in the parish jail for taking the life of the chief of police's brother in the line of duty and all of his brothers were police officers and even one is a sheriff he was a sheriff's deputy in our parish. And it's just incredibly amazing at how much mercy and how much control even he displayed toward me. I was not abused in the parish."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:26:04",
      "upperBoundTime": "00:27:46",
      "content": "I wasn't mistreated as a matter of fact they bent over backwards to accommodate some of the discrepancies that I was getting into in the parish maybe a right up here right up there. And it was just an amazingly blessed situation. They treated me like everyone else. And so it was just really a God thing is just incredible."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:26:04",
      "upperBoundTime": "00:27:46",
      "content": "It's been an incredible experience. I would like to say this that they did look into who I was before all of this happened and like I stated I was accepted into LSUS I did go my major was going to be physical therapy. I did three years in the Louisiana Army National Guard as a combat medic. And so I think people I think they realized well this guy wasn't just out here live in an animalistic life. We don't quite know what happened what."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:46",
      "upperBoundTime": "00:27:49",
      "content": "It's confusing."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:27:49",
      "upperBoundTime": "00:27:53",
      "content": "What caused this? And so they showed me mercy."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:53",
      "upperBoundTime": "00:28:16",
      "content": "Wow. So in that case if you could identify one reason that this happened? I mean maybe it's not possible to do that but in your case--sometimes someone's just going down the wrong path and if it's not this it's going to be tomorrow or the next day. But what is going on here?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:28:16",
      "upperBoundTime": "00:31:12",
      "content": "I think I can give you the reason. I think they gave me the answers at trial. If I can see this. The district attorney in Baton Rouge Louisiana. His name is Mr. Hiller Seymour III. He was my defense attorney. Mr. Anthony J. Marabella. He's a judge in Baton Rouge. They were partners at the time. These gentlemen, they were my defense attorneys."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:28:16",
      "upperBoundTime": "00:31:12",
      "content": "And so they cared deeply about saving my life. And at the time I told them that I did not commit this crime because I did not want to face this life sentence or this on the death penalty. And so I told them that I did not commit this crime. And so everyone was convinced, pretty much convinced, \"You committed the crime."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:28:16",
      "upperBoundTime": "00:31:12",
      "content": "Let's find out why you did this.\" And so I was interviewed. They did the EEG's electroencephalograms. And they said that there was an organic brain issue going on with the frontal lobe of my brain. And so they did the tests and the experts came in and they presented the information and they got the witnesses who sold me alcohol that night. And the amount of that the officer said that reeked of alcohol at the time of the arrest because I had been drinking all day."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:28:16",
      "upperBoundTime": "00:31:12",
      "content": "And so I wasn't a regular drinker but I just I drank on weekends like everybody else when you go out to party. I just really overdid it and didn't realize it. And so it came out in my trial. That coupled with this particular organic brain issue that I had and this alcohol that I just wasn't able to make rationalized decisions, everything was just over exaggerated to me. And during the course of all of this excitement I just made a bad decision. I misjudged the situation. The way that I was acting caused the policeman to act the way he did."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:28:16",
      "upperBoundTime": "00:31:12",
      "content": "And even if he wasn't a threat to me isn't I couldn't really perceive him not being a threat because of the incident that had just occurred earlier that night. So the only way I have really been able to rationalize this is that my personality was just changed, my entire personality was changed I guess by my drinking, by the emotions that I was experiencing, the threat that I felt towards my girlfriend, my fiancée, and all the alcohol, and I guess this organic brain issue cause I have it in black and white. And they said it and it shocked me. But I was like it's no other way I can--I just can't explain it sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:12",
      "upperBoundTime": "00:31:26",
      "content": "Sure. I understand. So let me do it then 'what if.?' with you so I'm sure you've spent a lot of time it's amazing this is one event then completely changes the trajectory of your life."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:26",
      "upperBoundTime": "00:31:28",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:28",
      "upperBoundTime": "00:31:36",
      "content": "Which was it at the time military service, LSU physical therapy, that's your future? No major"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:36",
      "upperBoundTime": "00:31:38",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:38",
      "upperBoundTime": "00:31:49",
      "content": "So how do you think your life would have proceeded had this night not happened, had you just not gotten out of bed that day? If this didn't happen what do you envision? Of course nobody knows, but what do you envision would have happened?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:49",
      "upperBoundTime": "00:33:26",
      "content": "Well I had just spoken to an Army recruiter in Lafayette, Louisiana. And I was going to re-up for four years so he just told me look do you have any pending charges or whatever and I'm like, \"No I don't have any charges pending on me,\" like trouble charges with the police."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:49",
      "upperBoundTime": "00:33:26",
      "content": "And I said, \"No sir.\" He said, \"Well what do you want to come back?\" I said, \"Well really I want to go active duty. I want to go back to San Antonio and get another MOS for x-ray tech and I'm going to go on to college and be in the medical field and I'm going to get married. I'm going to take Chelle with me."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:49",
      "upperBoundTime": "00:33:26",
      "content": "And so our plan was pretty much to stay in Abbeville until after the Christmas and New Year's holidays. And my mother invited us. She said, \"Look I know you love Rochelle a whole lot. You've been kind of wasting your time off for these past 18 months. Just take bring her up here. Y'all live with me. And when you go off to San Antonio.\" I was going to marry her and bring her with me."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:31:49",
      "upperBoundTime": "00:33:26",
      "content": "So I guess I don't know how long I would have done in the military but my plans were to actually allow her the opportunity to finish college because she went to ULL now but it used to be USL. So she had gone to USL for like a semester or so and my plans well we were going to be married. I was going to take her with me I would go back to college while I'm in the military while she would be able to go to college and we just would've that was my plans. I needed about another month maybe and I was back on the road."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:26",
      "upperBoundTime": "00:34:01",
      "content": "Yeah. Goodness. So I want to shift gears and talk about your experience with incarceration. It is now actually and more than you're incarcerated life in terms of time. But let me pause for a second and ask you this is there something about your experiences prior to this that I didn't ask you about there that you think is important that we should talk about before we move on. If not I'll just move on."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:01",
      "upperBoundTime": "00:34:03",
      "content": "Just offhand I can't really I can."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:03",
      "upperBoundTime": "00:34:07",
      "content": "Sure. So you remember that bus ride coming down to..."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:07",
      "upperBoundTime": "00:34:09",
      "content": "Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:09",
      "upperBoundTime": "00:34:11",
      "content": "Angola?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:11",
      "upperBoundTime": "00:34:13",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:13",
      "upperBoundTime": "00:34:16",
      "content": "What's going on through your head there?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:16",
      "upperBoundTime": "00:34:19",
      "content": "Survival."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:19",
      "upperBoundTime": "00:34:21",
      "content": "Yeah."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:21",
      "upperBoundTime": "00:36:31",
      "content": "How am I going to survive this? Who am I going to be? What character am I going to create to be able to deal with the guys I'm going to encounter here? How am I going to act towards security? How is security going to act towards me, because when I made it to Hunt's before I got on the Angola bus? I was taken to the back of a building by two white security officers, department correction officers and they pretty much interrogated me and kind of like threatened me because I was just convicted of first degree murder of a police officer. And so there was a black officer who came to my rescue and he said, \"I need him.\" He brought me in the back and he said, \"Listen let me tell you something."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:21",
      "upperBoundTime": "00:36:31",
      "content": "Don't talk about to charge,\" He said, \"You got to try to survive. Just getting through here,\" He said, \"Because these people they will kill you.\" And so that started to and so he just took me away from those gentlemen ,got me through the process, hurried up and got me to the back and I kind of faded into the background I didn't talk about my charge. I let it go and so on the bus ride here I was like, \"Who am I going to be? What character am I going to be? Am I going to be a nice guy?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:34:21",
      "upperBoundTime": "00:36:31",
      "content": "Am I going to be an animal?\" Because I'm going I'm entering a dog eat dog world. I knew that. And so that was my mindset. It was just pure survival. I was about one hundred and thirty five pounds. I had a real pretty little curly hair. I was a nice looking little kid and I was 23 but I was one of the people I didn't my body didn't mature for a long time. So I looked like just a little kid for a long time. So I knew I had to deal with that."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:31",
      "upperBoundTime": "00:36:35",
      "content": "So tell me about your first few months here. How were they?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:36:35",
      "upperBoundTime": "00:38:34",
      "content": "So because of the nature of my charge when I arrived at the front gate they wanted to send me to Camp J just because of the nature of my charge. And Camp J is the most horrible place that you can live in Angola especially at that time. Guys are going to throw feces on you it's just going to happen. If you go on a call out, guys could come out of their handcuffs, they could stab you, they could rape you. I mean they could be in their handcuffs, take their handcuffs off, and they could cut the back of your jumpsuit and they could rape you. It was just a real bad place."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:36:35",
      "upperBoundTime": "00:38:34",
      "content": "So there was a major who worked here and he wanted to sentence me to Camp J because of the nature of my charge but a classification man, he said, \"Well listen,\" They reviewed my records first, my educational background and my military background and they were like, \"Would you be interested in a tutor job working somewhere positively in the prison?\" So I was like yes. But then when they got to my charge all bets were off because they were like, \"No. This is the guy right here.\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:36:35",
      "upperBoundTime": "00:38:34",
      "content": "And so the classification officer said, \"Well look we're not going to send him to Camp J. Let's just put him in an extended lockdown,\" Which is similar to Camp J. And a lieutenant at that time. He came and he got me and he said, \"Man you're just a little kid.\" And I'm like, \"I'm 23 years old.\" So he said, \"Look this is what I'm going to do. If you don't give us no problems back here,\" He said, \"I'm going to make sure and help you get out of these cells.\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:36:35",
      "upperBoundTime": "00:38:34",
      "content": "And he kept his word. He helped me. He kept his word and so I did some time there, some bad habits rubbed off on me. I got out of the cells but mentally I was totally damaged. I didn't realize that I was I was being damaged. And so I went to the working cell blocks and I started going through this environment but..."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:34",
      "upperBoundTime": "00:38:44",
      "content": "Tell me a little bit about that. You said that some bad habits rubbed off on you and you felt in hindsight you can see that it took a toll on you. In what way?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:38:44",
      "upperBoundTime": "00:40:07",
      "content": "Because I had to take on a character who really wasn't me. I had to display violence. I had to I couldn't speak proper English. I couldn't enunciate my words like how I really want to speak. I had to talk like hard and use real street, hood, thug mentality type language because I had to relate to the lions who were in the jungle. I had to emulate that behavior. And so I didn't realize that that actually began I did it so much until I became it. And so I did it I just did it until I became it. So I was dysfunctional when they let me out the cells."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:38:44",
      "upperBoundTime": "00:40:07",
      "content": "By the time I made it out the cells, I couldn't live in population around the rest of the regular guys. I couldn't function. I was damaged. Now don't get me wrong. This has been over a three year period of time because I was in the parish prison for almost three years. And getting here I did another three years. And so from 20 to 24, those are some crucial developmental years. I didn't realize it then but it totally, it totally ruined me."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:07",
      "upperBoundTime": "00:40:25",
      "content": "Sure. I get that. Yeah makes sense. It's amazing how hindsight has the ability to kind of contextualize all that, make sense of it, but at the time you're just reacting."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:40:25",
      "upperBoundTime": "00:40:27",
      "content": "I'm in a whirlwind."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:27",
      "upperBoundTime": "00:40:38",
      "content": "Yes, in a whirlwind. Can you describe what your typical day was like? Once you get out of the blocks and you're in in general population, what was your routine? What was your job?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:40:38",
      "upperBoundTime": "00:43:00",
      "content": "Well I started in the field because when I made it to the working cell blocks we would go to the field and guys picked cotton up here. You picked watermelon, you barreled hay, and you used tools literally. I worked with tools in the field literally until my hands bust open like they were bleeding. So the labor was real hard. The sick that the freemen, that field Foreman's on the horse, they were very brutal and they were very abusive and it was just real, it was just real hard work. And so you're surrounded by sexual predators."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:40:38",
      "upperBoundTime": "00:43:00",
      "content": "So that was something totally new for me because you have guys who are always trying to turn other guys into homosexuals or sex slaves. It's a difference if a guy chooses to be a homosexual. The difference in prison is you're a sex slave once you get pulled into that particular life. So one of my main focuses and I'm not really going to say it was a concern of mine but I guess it was a concern of mine is that I'm not going to be I'm not going to be a sex slave. That's just not going to happen."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:40:38",
      "upperBoundTime": "00:43:00",
      "content": "So I had to fight and kind of push back in those particular areas because even homosexuals they were attracted to me and I'm sure that they had some strong guys they probably wanted to turn them into to their sex slave. So the work was hard and the mental gymnastics were just unbelievably challenging."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:40:38",
      "upperBoundTime": "00:43:00",
      "content": "But I adapted until it just became I guess normal but it takes a toll on your psyche no matter how normal it becomes. And so I bounce back and forth from population to the cell blocks because sometimes I just couldn't cope. And I would just lock myself away in a cell and I figured if I'm going to die in prison anyway. So I'm just given I'll give up and I'll maybe go stand out cells for eight months or 10 months or."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:00",
      "upperBoundTime": "00:43:04",
      "content": "Let me ask you something and sort of let me just take a little tangent for a minute."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:43:04",
      "upperBoundTime": "00:43:05",
      "content": "Sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:05",
      "upperBoundTime": "00:43:16",
      "content": "A lot of the guys talk about that. I mean it's a common theme. This, \"I'm not going to be turned out. It's not going to happen to me.\" And yet it happens to it has to happen to some folks."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:43:16",
      "upperBoundTime": "00:43:18",
      "content": "Lots and lots of people."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:18",
      "upperBoundTime": "00:43:20",
      "content": "Lots and lots of people."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:43:20",
      "upperBoundTime": "00:43:24",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:24",
      "upperBoundTime": "00:43:24",
      "content": "Is it something that people, after a long period of time, do they just remain in denial about it? I mean everybody knows. Do they I mean to what extent after 20 years, do people feel comfortable saying, \"Yeah I was terrible and that's what happened to me,\" Or will they not talk about it?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:43:24",
      "upperBoundTime": "00:43:40",
      "content": "I think some people will talk about it. Some people won't talk about it. I think as a person gets older and they realize, \"Wow this happened to me when I was this particular age. I was basically defenseless.\" To give you an example, if that had occurred to me had I been sexually molested or had I chosen to live that type of life well I'm 46 years old now I practice Christianity I can honestly tell you that that was my experience. For me to tell you that that was my experience I would I would be lying to you because I know it because it didn't happen to me."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:43:24",
      "upperBoundTime": "00:43:40",
      "content": "But as it pertains to guys who it has happened to I believe that a lot of them can admit it but there is still a lot of shame and embarrassment because it's hard for me to say this because it just is what it is. It's hard for us who it didn't happen to ever really just embrace them back into the fullness of their manhood because that did happen to them. It's just hard for us to embrace them. It's like, \"Once a convict, always a convict.\" And so we have to fight the way we feel toward them and so by them knowing that it's hard for a guy to talk about that and to admit it. And for the most part it wasn't their fault."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:40",
      "upperBoundTime": "00:45:27",
      "content": ""
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:45:27",
      "upperBoundTime": "00:45:37",
      "content": "Absolutely yeah. There are no secrets in prison. We all know who we are. So you can't hide. And you're going to be treated accordingly."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:37",
      "upperBoundTime": "00:45:40",
      "content": "Even if it was 20 years ago?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:45:40",
      "upperBoundTime": "00:46:18",
      "content": "It doesn't matter if it was two thousand years ago. You are going to lose some form of maybe respect. But what I like about what I appreciate about the Christian community is a guy may struggle in that particular area but they don't discriminate with showing everyone love. It doesn't matter who you are or what you've been through. Once you are, embraced in the fold, you have full fellowship rights. Everyone is going to be treated."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:18",
      "upperBoundTime": "00:46:25",
      "content": "Sure. And having said that there's always that distinction though in the background, right?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:25",
      "upperBoundTime": "00:46:27",
      "content": "All right. There is always."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:27",
      "upperBoundTime": "00:46:28",
      "content": "Okay, alright."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:28",
      "upperBoundTime": "00:46:31",
      "content": "I'm sorry. But the truth is the truth. I have to fight those prejudices."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:31",
      "upperBoundTime": "00:46:33",
      "content": "Sure."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:33",
      "upperBoundTime": "00:46:36",
      "content": "I have to fight those prejudices."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:36",
      "upperBoundTime": "00:46:38",
      "content": "Sure. Yeah. Well I appreciate you educating me about that."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:38",
      "upperBoundTime": "00:46:45",
      "content": "I mean when I say I have to fight those prejudices I mean I have to fight not viewing people in that."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:45",
      "upperBoundTime": "00:46:50",
      "content": "I understand."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:50",
      "upperBoundTime": "00:46:52",
      "content": "Who I know have lived that particular lifestyle."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:52",
      "upperBoundTime": "00:46:52",
      "content": "I understand. Can you describe your typical day here now? What's your routine when you get up in the morning all the way through the day?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:46:52",
      "upperBoundTime": "00:46:58",
      "content": "My typical day back then was hopelessness."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:58",
      "upperBoundTime": "00:47:01",
      "content": "Right."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:47:01",
      "upperBoundTime": "00:48:03",
      "content": "Hopelessness. I didn't care. My typical day now is up and back then it was unproductive, I was just living an unproductive life. Whereas now my typical day is filled with productive activities. If I had to sum it up in one word it would have to be productivity. And the reason why is because I'm a deejay at the radio station KLSP. I'm a social mentor with the reentry program. I'm an inmate Minister."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:47:01",
      "upperBoundTime": "00:48:03",
      "content": "I graduated from the New Orleans Baptist Theological Seminary here at Angola. I've finished with the 365 average. Could have done better but slacked on some classes and I'm the secretary of Malachi Dads which is a prison fatherhood ministry where we help to mentor just the general population. So just those four job titles that I named."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:03",
      "upperBoundTime": "00:48:05",
      "content": "It's a lot."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:48:05",
      "upperBoundTime": "00:48:54",
      "content": "You could imagine how I'm being pulled in all different directions all throughout the day. But the good thing about it is it's all productive. I'm doing something for someone. A guy may need an application for school. A guy may need me to escort him to the warden's office or this guy may need to go in a compound to check on getting his trade certifications."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:48:05",
      "upperBoundTime": "00:48:54",
      "content": "Well this guy may have gotten some bad news about his mother passing and so now I got to wear the cap of an inmate minister and go counsel him so with my ID card just in the capacity of an inmate Minister I pretty much have access to all the living areas in the main prison. So my days is full now of mentoring, tutoring, teaching so it's productivity."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:54",
      "upperBoundTime": "00:48:56",
      "content": "I know. It sounds like it."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:48:56",
      "upperBoundTime": "00:48:58",
      "content": "It's nonstop."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:58",
      "upperBoundTime": "00:49:01",
      "content": "Yeah. And very meaningful."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:01",
      "upperBoundTime": "00:49:03",
      "content": "Absolutely."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:03",
      "upperBoundTime": "00:49:09",
      "content": "Yeah. I think one of the things I also want to shed light on is that it's possible to live an extremely meaningful life."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:09",
      "upperBoundTime": "00:49:12",
      "content": "Sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:12",
      "upperBoundTime": "00:49:13",
      "content": "In prison which you embody actually."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:13",
      "upperBoundTime": "00:49:15",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:15",
      "upperBoundTime": "00:49:17",
      "content": "So. Okay. Switching gears a little bit again."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:17",
      "upperBoundTime": "00:50:22",
      "content": "Can I just comment on that please? Because you said you can live a meaningful life and I would like to say that I was sentenced to die in Angola. They sent me here and they said, \"Look you're never getting out. You're going to die Angola.\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:17",
      "upperBoundTime": "00:50:22",
      "content": "And so I was listening to a guy who mentored me and I learned something from him and that is when it pertains to meaningfulness in the life that we live here, I was sentenced to die here but I realized that for every young man or older man that I can impart a piece of positivity something that comes from me that will benefit them upon their release from this prison I'm actually not going to die here."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:49:17",
      "upperBoundTime": "00:50:22",
      "content": "That's my way of sending little bits and pieces of me back on the other side of that gate for the betterment of society even though I've been sentenced to die in this prison. So physically I may die here but a good piece of me is going to go back out there and at least try to help and do some good."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:22",
      "upperBoundTime": "00:50:44",
      "content": "So when you look back on the crime and your crime is a little unusual because it involves a police officer, right. But still when you look back on the crime and the victim and all of this time that's passed, how do you make sense of it all? How do you feel about that now?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:50:44",
      "upperBoundTime": "00:51:22",
      "content": "I feel horrible. I'm never going to stop feeling terrible about my actions and the way I really hurt a lot a lot of lives because I believe in the power of God I'm not going to say that my actions destroy lives. God has not confirmed that to me. However I know that I altered the course of many people's lives out there. I was wrong. I do forgive myself. She just called count."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:22",
      "upperBoundTime": "00:51:24",
      "content": "Yeah. Do you need to respond to that?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:51:24",
      "upperBoundTime": "00:51:24",
      "content": "I have to."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:24",
      "upperBoundTime": "00:51:33",
      "content": "No problem we can pause everything."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:51:33",
      "upperBoundTime": "00:51:33",
      "content": "So as it pertains to remorse I think it's desirable I think. I think for some people it's desirable that a person who is serving a life sentence who is actually guilty. I think some people desire for us to live in a state of perpetual remorse. I think they desire that. I think they would like that. Maybe they expect that but it's unreasonable because and am I still in a state of remorse? Absolutely because I committed a terrible act that I can never justify."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:51:33",
      "upperBoundTime": "00:51:33",
      "content": "I took a life that I could never give back. If I did something that I wish I could sacrifice a limb, I wish I could give my life to give this life back that God created. And yet I can't do it. However I can only live in a state of remorse for so long before I burn out. If I stay in that state of remorse then it's going to lead to another sense of inhumanity. I'm going to begin to lose a piece of my humanity I'm going to become cold hearted and stone. I know because I've experienced it."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:51:33",
      "upperBoundTime": "00:51:33",
      "content": "And so I've had to learn even how to come out of such a deep state of remorse because it will consume you to the point of destruction and either it will destroy you or it will cause you to actually start to hurt other people. And so we have to heal. I've had to heal so do I experience remorse? Absolutely. I'm never going to be if you walk me to the front gate right now and told me I was free for the rest of my life I'm never going to be able to get over the hurt and pain that I've caused these people, what I've taken and how I've offended God."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:51:33",
      "upperBoundTime": "00:51:33",
      "content": "So I'll always be remorseful but I have to be able to live beyond my remorse. And so it's summing that answer up, I think that people desire for us to live in a state of perpetual remorse. But it just can't be done because if we did that we could not function in the capacity of growing and fruitful human beings and helping to create a culture of environment that we are. I hope I answered that okay."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:33",
      "upperBoundTime": "00:54:31",
      "content": "Perfectly. Yeah. Yes because one of the things that the system is set up to do whether you come before a parole board or a pardon board or if you're just about is how you present yourself to people on the outside. The expectation is nothing short of perpetual remorse."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:31",
      "upperBoundTime": "00:54:32",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:32",
      "upperBoundTime": "00:54:46",
      "content": "There's another set of victims though and those are and I know that you I'm not suggesting that you're undermining the pain and suffering of the victims' families and so forth but there's also your family."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:46",
      "upperBoundTime": "00:54:48",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:48",
      "upperBoundTime": "00:54:55",
      "content": "How has it affected your family having to watch you come here?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:55",
      "upperBoundTime": "00:57:33",
      "content": "They experienced hurt. They experienced confusion and they have experienced an unimaginable or unimaginable levels of shame and embarrassment because I do have some well-to-do relatives, people who are upstanding citizens in the community and they just never expected not my charge is the first time that this has ever happened to my knowledge in the history of Vermilion Parish. This fell upon my family also."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:55",
      "upperBoundTime": "00:57:33",
      "content": "And so through me this shame and humiliation and hurt and confusion was brought upon them because my mother's brother my mother's oldest brother well he was an Abbeville police officer at the time that I got this charge my mother's first cousin was the first policeman to arrive on the scene at the time I committed this act. An ex-girlfriend, a childhood girlfriend of mine, her mother was one of the maybe second or third police officers to arrive on the scene and this changed the trajectory of her life."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:55",
      "upperBoundTime": "00:57:33",
      "content": "So it is just my family, friends of my family, it just it just totally wreaked a level of havoc upon them that's just it's just unimaginable. I can't even fully comprehend it twenty-six years later. I still can't wrap my mind around the hurt and pain and so what are some of the effects?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:54:55",
      "upperBoundTime": "00:57:33",
      "content": "Some of the effects are that they've isolated me. Most of my, a lot of my family have shunned me, have turned away from me and I can understand I have to understand it because I guess maybe acknowledging me or coming to visit me maybe it reopens those old wounds and is just I'm sorry for the pain that I caused them but I realize that I also caused them a great pain."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:33",
      "upperBoundTime": "00:57:45",
      "content": "Sure. Who do you think in your family has taken it the hardest?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:57:45",
      "upperBoundTime": "00:57:58",
      "content": "My mother, I would have to say, I would have to say my mother has taken it the hardest from day one."
    },
    {
      "speaker": "Marcus",
      "time": "00:57:58",
      "upperBoundTime": "00:58:09",
      "content": "Sure. I spoke with somebody who told me that if your family loves you they do day for day with you in here."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:58:09",
      "upperBoundTime": "00:58:11",
      "content": "That's right."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:11",
      "upperBoundTime": "00:58:28",
      "content": "And so in addition to having to deal with that with the hardship of your, the immediate punishment that is prison you're also dealing with the guilt of bringing all of that into your loved one's lives."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:58:28",
      "upperBoundTime": "00:58:30",
      "content": "It's a blanket."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:30",
      "upperBoundTime": "00:58:33",
      "content": "So I think that also gets forgotten."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:58:33",
      "upperBoundTime": "00:58:50",
      "content": "That's right. It's a blanket. I've blanketed each one of my relatives with the shadow of this bad decision that I made for the rest of their lives here just as well as I've done to the victim's family."
    },
    {
      "speaker": "Marcus",
      "time": "00:58:50",
      "upperBoundTime": "00:59:28",
      "content": "Sure. Sometimes people can identify a particular cause some event or a person or mentor, a minister, who comes into their lives and kind of turns them around. From your narrative you were kind of butting your head against the wall when you first got here. You were trying to protect yourself. You were in and out of the cell blocks as you say. You were not productive as you say."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:28",
      "upperBoundTime": "00:59:30",
      "content": "At all."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:30",
      "upperBoundTime": "00:59:39",
      "content": "What turned it around for you? What was the reason you changed?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "I think it was not I think. I know it was various encounters with different individuals along the way. Guys would tell me my nickname is Dayday. My real name is Nadaedrick but these guys know me as Dayday. They would be like, \"Dayday man, we realize you in the cells but you really not quite like us. There's something different about you.\" They're like, \"Man we're street guys for real. Man you're really intelligent. You can get out in population and you could really be someone. You could you need to get out.\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "And so those little tidbits they would kind of fall in and I would hear but then when I would make it to population some of the positive guys the inmate ministers, the pastors, they would maybe talk to me for a while. And even though I was talking about the wrong things they realized, \"Wow this guy. He can speak well. His thought process,\" or \"he could articulate his words. He can get this guy. We could probably use him.\" And so they tried to minister to me and guys tried to help me."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "And so the defining moment for me came in 2010 I was in Cyprus 4. And I just have to say this how it is. I was not really a believer in God. I was really like--I didn't really care for Christians. I didn't like Muslims. I just really wasn't with the God thing. OK. There may be a God that may not be. I'm cool with that. But I was impressed in my spirit that my next job was going to be the Bible College. And this impression upon me was so strong I could swear someone else spoke these words in my mind and I was like, \"Where did that come from?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "I'm not going to Bible College with Christian dudes. I don't want to be a Christian guys. And for whatever reason it piqued my curiosity and I'm like, \"Okay hold up let me reconsider this. Bible College? Air conditioning? You get so much money a week to go or whatever.\" And so I'm like, \"I'm going to check this out.\" It's not going to happen because they're going to look at my disciplinary record and my instability which followed me from my childhood to prison."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "I'm all over the place and sure enough I had an interview and guys said, \"Look don't be disappointed because this is my fourth interview,\" Or \"This is my fifth interview,\" and these are decent guys. \"You're not going to get accepted the first time.\" I went in Doc Robson's office and we started talking and he told his clerk, \"Look, go get this guy some books right now. We start him immediately.\" And his clerk was Richard at the time and Richard was like, \"We can't start him because they don't have\" \"Go get some books."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "I want him in school right now.\" And I did a perfect cycle and under Doc Robson's teachings I was I became a Christian I accepted Jesus Christ as my lord and savior. And it's just so ironic because here this older white man like 65 years old, this older white man, God used him to just totally change me, totally changed my life. And so then I begin to meet these other guys who were tutors and mentors and so they started pointing to my life what had been poured into their lives. And so it started to take root."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "So I didn't realize what was going on at that particular time."
    },
    {
      "speaker": "Nadaedrick",
      "time": "00:59:39",
      "upperBoundTime": "01:04:12",
      "content": "But this is what was happening. The system was working. Not only had God touched my life, but he put me in an environment where as Warden Cain was ordained to start this seminary here we had some rehabilitative program and there were guys who were able to reach me. And so the process when I engaged it, it worked. And so the moral rehabilitation came from my spiritual life but my social rehabilitation came from me being in contact with these good decent human beings who began to help more than shape me."
    },
    {
      "speaker": "Marcus",
      "time": "01:04:12",
      "upperBoundTime": "01:04:24",
      "content": "Should you come before a pardon board, what are you going to make sure that you communicate to them about who you are and why they should give you a second chance?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:04:24",
      "upperBoundTime": "01:05:01",
      "content": "I would communicate to them that the man who is sitting before them that particular day is not the young kid who committed this terrible act so many years ago. And if they were to ask me why I should be released I would express my remorse. This has been we've kind of skipped up a process because I'm so used to the remorse part so I'm going to get to where you just asked me."
    },
    {
      "speaker": "Marcus",
      "time": "01:05:01",
      "upperBoundTime": "01:05:04",
      "content": "Sure."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:05:04",
      "upperBoundTime": "01:06:27",
      "content": "I believe that if the pardon board or the people who have designed this system, if they actually believe in this system, then it would be more beneficial for this individual to be leading this type of life on the other side of these gates than it would be to have me and other individuals like me just wasting away in prison because now you're getting no return on your investment and they're investing in helping out they're investing in us to help us to change the lives of other people."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:05:04",
      "upperBoundTime": "01:06:27",
      "content": "So that's what we're doing in here. If you believe in this system then it would be in the best interest of society to have some of us to go back into our communities to help build them up and to take the burden off of this state whereas in a few more years you're going to have to have me in hospice maybe pen a million dollars a year for me to take these cancer treatments. So it just seems logical to benefit from what has been invested in a lot of the guys here in Angola."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:27",
      "upperBoundTime": "01:06:51",
      "content": "Sure. I think at different times I'm learning that depending when you first come here there's certain things that are the worst parts of Angola. And then you become you learn your way around them and then time and I think that the hardest parts of this experience change over time. What's the worst part of this experience for you? And again I mean."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:06:51",
      "upperBoundTime": "01:06:54",
      "content": "The worst part of this experience right now."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:54",
      "upperBoundTime": "01:07:00",
      "content": "Of living a life without parole as a man in his forties."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "There are worst parts. I would have to say the worst part is knowing that the land out there are the people in the land out there I would just have a broader landscape to help change lives, people's lives. Meaning when you come here with a life sentence, sure I can help you to stop living in a cell blocks."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "I can help you get a GED but you're still going to be in Angola. You're still going to die here. The hardest part now is knowing that I'm sitting on the bench in the fourth quarter and I'm fouled out. And my team is playing for the championship and if I just didn't have that foul I could be out there helping us to win this championship."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "If I could get out of this prison I could help so many people not to come to prison but that's not the big thing. Not coming to prison is not the big thing; it's what it took you to come to prison. Could I prevent someone from committing suicide? Could I prevent someone from committing that next armed robbery which is going to lead to a murder? So it's hard for me to know I'm sitting in here and I could be helping. So many people out there not taking the path that I have taken and leaving all of leaving that long trail of damaged lives along the way."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "That's very painful that's very painful because I know that a lot of guys here we can be very effective in helping to change I like that word you used the trajectory of people's lives for the betterment of society. Now another hard part is the inhumanity that I still continue to experience. I'm still a number. Every day I'm going to be humiliated. When I step out of my dorm when I wake up, I just have to prepare myself for the level of inhumanity that's going to be displayed toward me. The level of humiliation that I'm going to have to experience every single day."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "I just don't know the level to which I'm going to be humiliated. I could be pulled over in a booth by a sergeant on the walk and say, \"Ok look. Take off all your clothes. Strip search.\" We have people walking by. People are watching me. We have 18, 19 year old little girls who are working the dormitories, who are working on a walk. I'm old enough to be their fathers now. I'm getting strip searched."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:07:00",
      "upperBoundTime": "01:10:19",
      "content": "We have showers that everyone passes by. You can look in the windows and see a guy in the shower or using the toilet. Little children. When I see little children, an 18 or 19 year old girl, can see back there. So the humiliation and the inhumanity, the dehumanization of it all continues to just it seems like it gets worse as you grow older in here. The dehumanization of it all."
    },
    {
      "speaker": "Marcus",
      "time": "01:10:19",
      "upperBoundTime": "01:10:24",
      "content": "Yeah. Sure."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:10:24",
      "upperBoundTime": "01:11:05",
      "content": "I would like to add this. And really you'd never get to experience a true sense of redemption because as long as you're in prison it's like you'd never, you're never really redeemed and never reconciled. I'm not from Angola. This is abnormal to me. This is never going to be normal because I came from the world in which you're going to return to once this interview is over with and so I'm never going to be able to fully experience that redemption. That's hard."
    },
    {
      "speaker": "Marcus",
      "time": "01:11:05",
      "upperBoundTime": "01:12:08",
      "content": "Yeah. So can you just explain to me how you have managed to make sense or come to terms with the idea that it is in fact possible especially given the seriousness of your charge that you may in fact die here? I don't think that I think it's important for us to talk about that head on. What are the coping mechanisms? Because I've heard Pastor Hicks use the term said it's false hope and however were you looking at it to come up with some kind of a way to think that, \"It's going to happen. I'm going to get out of here somehow\" Even though all of the evidence is suggesting that there's always a glimmer of hope."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:12:08",
      "upperBoundTime": "01:12:10",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "01:12:10",
      "upperBoundTime": "01:12:21",
      "content": "I think a lot of people, and I could see myself in the same position, just clinging on to that possibility. How do you cope with it?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:12:21",
      "upperBoundTime": "01:13:50",
      "content": "At first I coped with it through negative behavior like the bad grades that I made when my mother had me living somewhere I didn't want to live. It was through my behavior. So at first I coped with it by staying into a lot of negativity. That kept the action going. I kept the time passing. And so now how to cope with it? I cope with it by being productive. Productivity, how much can I do? How much, how can I serve someone today? If I'm just sit around idle and, what can I do? How can I help to make someone else's day better? What type of positive work I can get into?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:12:21",
      "upperBoundTime": "01:13:50",
      "content": "And that helps to pass the time and so that also helps me to feel like, \"You know what? I'm useful. I'm valuable, I'm valued. I'm appreciated.\" And so investing my time into this community and into the lives of other individuals that helps me to cope. That allows me to feel like I have a reason to be here. God didn't make a mistake. Sure he didn't go across the street to the grocery store to buy a gallon of milk and he came out the store and said, \"Oh wow. How did this happen to Nadaedrick?! I just\" He's still in control."
    },
    {
      "speaker": "Marcus",
      "time": "01:13:50",
      "upperBoundTime": "01:14:04",
      "content": "Tell me. You've accomplished a lot here by any standard. Of all the things that you've accomplished over the past 25, 26 years, what are you most proud of?"
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:14:04",
      "upperBoundTime": "01:14:54",
      "content": "I would have to say. I would have to say seminary. I would have to see graduating seminary because it allowed me to acquire the necessary tools to help effect a positive change in the lives of other people whether it be male, female adults or children. Seminary actually gave me the tools that I needed to help people make better choices and to help me make better choices whether they are believers in God or whether they are unbelievers. It has equipped me to be a more effective minister."
    },
    {
      "speaker": "Marcus",
      "time": "01:14:54",
      "upperBoundTime": "01:15:17",
      "content": "Sure absolutely. I am very grateful for this interview. I feel like you've it's been a very rich experience. Thank you. Is there something that you might have wanted to talk about that I didn't ask you over? I know I asked you that question about the time before you came here, but is there something else that you'd feel like you \"Why didn't he ask me this?\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:15:17",
      "upperBoundTime": "01:17:48",
      "content": "There is something that I would like to express that I would like for people to know that we are real people, that this process it is really working and they don't have to be afraid of this process this experience. It has changed my life. Fortunately for me it has changed my life for the better because we have security in place now and we have staff in place now who is helping this process along and when I say the process I mean the bettering of the individuals who are in this system. They are really pouring into our lives and we're pouring into the lives of other men and we are becoming better."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:15:17",
      "upperBoundTime": "01:17:48",
      "content": "So with that being said I want to share with you that we are remorseful for what we did and we really do care about. \"Wow. We care about the people we hurt.\" We made bad decisions and so many of us it's unfortunate that we don't have the opportunity to be able to apologize. The one thing that really hurts me, I don't think you asked me this question, \"What really hurts what is there a real source of pain?\""
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:15:17",
      "upperBoundTime": "01:17:48",
      "content": "You may have but one thing that really hurts me is I've never had an opportunity or I've never taken advantage of the opportunity when I was going through the legal process to apologize to the family of this of this man I hurt. I owe them an apology because I was wrong. I owe them an apology because they didn't deserve this. I owe them an apology because they were merciful toward me."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:15:17",
      "upperBoundTime": "01:17:48",
      "content": "They never got on the stand and ask that my life be taken. I owe them an apology because they are good decent human beings and I'm extremely sorry for the pain that I caused them and now I'm caught up in a system to where it is illegal, it is against the law, even the rules of this institution, for me to send an apology to the very people I owe it to the most."
    },
    {
      "speaker": "Marcus",
      "time": "01:17:48",
      "upperBoundTime": "01:17:49",
      "content": "Sure."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:17:49",
      "upperBoundTime": "01:18:44",
      "content": "That's very hard. And so I would like to finish with this. Whether you play this part or not that's totally up to you. If people are comfortable with us dying in prison sending us here at 16, 17, 18, 19, 20 or whatever until we die, then I want to let them know that they have a very good system in place that is perfect. This is the perfect system."
    },
    {
      "speaker": "Nadaedrick",
      "time": "01:17:49",
      "upperBoundTime": "01:18:44",
      "content": "But if people believe that a human being is more valuable or he is, or he or she, is worth more than one mistake that they've made in their lives and that people can change then I believe that they should really look into changing the system. And so with that I appreciate you. I thank you for this opportunity to express my feelings and thoughts."
    },
    {
      "speaker": "Marcus",
      "time": "01:18:44",
      "content": "It's a good place to stop."
    }
  ]
}
