{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Neal Spencer Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:17",
      "content": "You're going to state your name. The crime that you were convicted of. How old you were and how much time you've served. And then I'm going to ask about your childhood and the time here. Go ahead."
    },
    {
      "speaker": "Neal",
      "time": "00:00:17",
      "upperBoundTime": "00:00:32",
      "content": "My name is Neal Spencer. I was 20 years old when I caught my charge. I've been incarcerated in Angola for 27, almost 28 years now."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:32",
      "upperBoundTime": "00:00:34",
      "content": "What was the conviction?"
    },
    {
      "speaker": "Neal",
      "time": "00:00:34",
      "upperBoundTime": "00:00:38",
      "content": "Second degree murder."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:38",
      "upperBoundTime": "00:00:51",
      "content": "Okay, so I'm going to start with, the point is just for me to learn about who you are as a person, about your life, so let's just start with your childhood. So, maybe you can tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Neal",
      "time": "00:00:51",
      "upperBoundTime": "00:02:58",
      "content": "My mom and dad, they were basically good parents. They was separated when I was young. I had two brothers and a sister. We all lived in the same household. And my mom pretty much raised us by ourselves. My dad came around every now and then when he was able to. He had a lot of he did odd jobs."
    },
    {
      "speaker": "Neal",
      "time": "00:00:51",
      "upperBoundTime": "00:02:58",
      "content": "I remember, a lot of times we'd sit down and talk, as I was older, he explained to me how when they were divorced, he began to change a whole lot about his life pattern and he was mostly into clubs and things like that. I don't know the reason why they separated and why they got divorced but I do know that it changed his life because he began to go back into school."
    },
    {
      "speaker": "Neal",
      "time": "00:00:51",
      "upperBoundTime": "00:02:58",
      "content": "I think he took electrical wiring as a trade. He got into church, eventually became a church minister and he tried to be more involved in our life a little later on. But I became of age where it was like, \"Hey, you really what wasn't there too much for the beginning. So I kind of got other things I'm doing now.\" So I kind of pushed him off, I held it against him for a long time."
    },
    {
      "speaker": "Neal",
      "time": "00:00:51",
      "upperBoundTime": "00:02:58",
      "content": "But I always kept in contact with him, I always call every now and then. Sometimes, we would go spend a night at the weekend at his house. Or we'd go to his dad's house which is my grandfather's and he would probably come over here every now and then when my grandfather would call him and tell him that we're over there."
    },
    {
      "speaker": "Neal",
      "time": "00:00:51",
      "upperBoundTime": "00:02:58",
      "content": "He would come over and see us. He kind of struggled through his whole life, from job to job, making sure that his bills or stuff was paid. So, I know he tried to do the best he could in providing money for us. But the bread winner of us coming up at a young age was my mother."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:58",
      "upperBoundTime": "00:02:56",
      "content": "What did she do for a living?"
    },
    {
      "speaker": "Neal",
      "time": "00:02:56",
      "upperBoundTime": "00:03:06",
      "content": "My mother was a healthcare nurse. But I remember little odd jobs, like working at a Dunkin Donuts things like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:06",
      "upperBoundTime": "00:03:07",
      "content": "To make ends meet."
    },
    {
      "speaker": "Neal",
      "time": "00:03:07",
      "upperBoundTime": "00:03:11",
      "content": "To make ends meet. She did what she had to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:11",
      "upperBoundTime": "00:03:14",
      "content": "This is all in Texas you said earlier on?"
    },
    {
      "speaker": "Neal",
      "time": "00:03:14",
      "upperBoundTime": "00:03:16",
      "content": "Yes in Beaumont, Texas?"
    },
    {
      "speaker": "Marcus",
      "time": "00:03:16",
      "upperBoundTime": "00:03:19",
      "content": "Beaumont, Texas. And how old were you when your parents separated?"
    },
    {
      "speaker": "Neal",
      "time": "00:03:19",
      "upperBoundTime": "00:03:19",
      "content": "I'm not sure, I was really young, maybe about maybe 9 or 10 years old at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:19",
      "upperBoundTime": "00:03:35",
      "content": "All right. And so were there then men who came into your mother's life who also?"
    },
    {
      "speaker": "Neal",
      "time": "00:03:35",
      "upperBoundTime": "00:04:01",
      "content": "She had eventually got remarried. But our stepfather was more, he didn't really tell us nothing about what to do, or anything like that. He left that responsibility up to my mother. It was more like, \"That's your kids. I'm not chastising them or nothing.\" He would tell my mother like, \"This weekend, if you don't mind tell the kids to go out and cut the grass,\" or stuff like that. She would relay the message to us like, \"Y'all need to go out there and cut the grass.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:04:01",
      "upperBoundTime": "00:04:07",
      "content": "But he respected those lines?"
    },
    {
      "speaker": "Neal",
      "time": "00:04:07",
      "upperBoundTime": "00:04:32",
      "content": "Yeah, he respected the lines. And if anything happened where he felt like we had to be punished for it or chastised, he would tell my mom to get it in contact with my dad. So my dad would probably come over. He would tell us what we're doing wrong and get on us, tell us that we need to start straightening up and listening and things like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:35",
      "content": "Right. Tell me about your siblings."
    },
    {
      "speaker": "Neal",
      "time": "00:04:35",
      "upperBoundTime": "00:05:09",
      "content": "I have two brothers. Troy and Derrick and I have my sister, April. We pretty much grew up together. I was the oldest of the family and I pretty much had like say so, what was going on. When I got of age my mom always let them know. \"Whatever you brother told y'all to do it as long as it's not in a harmful way.\" Or and I had when my dad remarried, he had two boys, a set of twins. They were real younger."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:09",
      "upperBoundTime": "00:05:16",
      "content": "So you're at least ten years older."
    },
    {
      "speaker": "Neal",
      "time": "00:05:16",
      "upperBoundTime": "00:05:35",
      "content": "And I very seldom got a chance to see them every now and then. We didn't really spend a lot of time together. It was mostly like when my dad would see us they would see us. We would talk a little while, I'd play with them a little bit, and then go on about my business."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:35",
      "upperBoundTime": "00:05:40",
      "content": "Sure. So in terms of your siblings that you're close to that would be your sister and two brothers."
    },
    {
      "speaker": "Neal",
      "time": "00:05:40",
      "upperBoundTime": "00:05:43",
      "content": "My sister. My two brothers. Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:43",
      "upperBoundTime": "00:05:49",
      "content": "Okay. And what's your relationship like with all of these folks now?"
    },
    {
      "speaker": "Neal",
      "time": "00:05:49",
      "upperBoundTime": "00:06:51",
      "content": "I have a good relationship with my sister and my brother Troy right behind me. Derrick passed away with leukemia. It was in 2000, 2001. So he passed away awhile back. Me and my brother we have a good relationship. I talk to him pretty often."
    },
    {
      "speaker": "Neal",
      "time": "00:05:49",
      "upperBoundTime": "00:06:51",
      "content": "Me and my sister have we're the closest, me and my sister. And she was the youngest. My sister was the youngest than us that grew up together right there. I guess by her being more close to my mom and seeing how my mom would handle the situation with me, accept my calls and visit, and make sure that everything was straight on my part. She just adopted the same character as my mom."
    },
    {
      "speaker": "Neal",
      "time": "00:05:49",
      "upperBoundTime": "00:06:51",
      "content": "She just made sure I was straight made sure I had money, made sure she let me know, kept in contact, left the phone make sure the phone bill was paid so she could accept the calls and everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:51",
      "upperBoundTime": "00:07:01",
      "content": "Yeah so if there was one person that you could identify as being the closest to you and influenced you the most, who would that be?"
    },
    {
      "speaker": "Neal",
      "time": "00:07:01",
      "upperBoundTime": "00:07:05",
      "content": "It probably would be my sister."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:05",
      "upperBoundTime": "00:07:14",
      "content": "And so what values from your childhood from your siblings and your sister do you think you've carried through in your own life?"
    },
    {
      "speaker": "Neal",
      "time": "00:07:14",
      "upperBoundTime": "00:07:57",
      "content": "I'm not really sure. I think there's a lot of values so much as paying more attention to the family and being more respectful towards them and understanding that that they're not the reason that I'm here. So I can't try to force them to understand what it is that I go through, because they have their own lives and stuff out there. So I try to be more mindful and respectful toward that and likewise."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:57",
      "upperBoundTime": "00:08:14",
      "content": "Okay. Sure. So do you think it's accurate to say that even though your father left the house that you grew up with an understanding that there are adults who cared for you, and you were in a loving home, with nurturing folks around you, or did you feel that you kind of had to make it on your own?"
    },
    {
      "speaker": "Neal",
      "time": "00:08:14",
      "upperBoundTime": "00:08:28",
      "content": "Kind of in both ways. When I was younger I knew I had family members that loved me. They did the best they could to support me. And as I grew older I felt like I had reached a certain age where I was going to have to start taking care of myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:28",
      "upperBoundTime": "00:08:32",
      "content": "How old was that?"
    },
    {
      "speaker": "Neal",
      "time": "00:08:32",
      "upperBoundTime": "00:08:35",
      "content": "I think I was about 14. Yeah about 14."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:35",
      "upperBoundTime": "00:08:40",
      "content": "What about grandparents? Any special relationships with a grandparent?"
    },
    {
      "speaker": "Neal",
      "time": "00:08:40",
      "upperBoundTime": "00:09:21",
      "content": "My grandfather on my daddy's side, we had a real good relationship. I could always go over there and talk with him about anything. I constantly was back and forth over there seeing how he was doing. One while he had moved to California with one of my aunties and so he stayed out there for a few years so we didn't get a chance to talk as much. But he ended up moving back to Texas."
    },
    {
      "speaker": "Neal",
      "time": "00:08:40",
      "upperBoundTime": "00:09:21",
      "content": "So I've been able to spend more time with him and see how he was doing. He'd gotten a little older. So I wanted to see how he was and made sure that he was straight and go and talk with him. After he'd gotten a lot older one of my uncles moved in with him then and begin to take care of him and make sure he was a pretty good and taken care of."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:21",
      "upperBoundTime": "00:09:40",
      "content": "So I'm not familiar with Beaumont. We were talking earlier about the flooding there. But I haven't been there. Can you paint a picture for me of your neighborhood? Like if the two of us were sitting side by side and you didn't you have a front porch?"
    },
    {
      "speaker": "Neal",
      "time": "00:09:40",
      "upperBoundTime": "00:09:39",
      "content": "Front pouch, yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:39",
      "upperBoundTime": "00:09:49",
      "content": "If the two of us were sitting there, can you paint a picture? What would I be looking at and seeing and smelling and hearing?"
    },
    {
      "speaker": "Neal",
      "time": "00:09:49",
      "upperBoundTime": "00:10:31",
      "content": "Okay my neighborhood was a predominantly black neighborhood. The houses were they were in pretty good shape. It wasn't raggedy ramshackle houses. They had a few of them around in the area. They had empty lots. They had it was a right across the street from us. They had a bar down the street. There was another bar. We had like little neighborhood stores. You saw a lot, you saw a lot of people hanging around. There was a lot of, you had a few homeless people that stayed at empty houses."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:31",
      "upperBoundTime": "00:10:34",
      "content": "So were they tightly packed houses or more of a kind of a spread out?"
    },
    {
      "speaker": "Neal",
      "time": "00:10:34",
      "upperBoundTime": "00:10:45",
      "content": "It was kind of like in between. It wasn't that type but it had houses everywhere. You saw people at pretty much every day. It was crowded."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:45",
      "upperBoundTime": "00:10:48",
      "content": "So if we were sitting on the pouch I would be seeing people out in the street?"
    },
    {
      "speaker": "Neal",
      "time": "00:10:48",
      "upperBoundTime": "00:10:52",
      "content": "Yeah. Walking around the street, kids running around."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:52",
      "upperBoundTime": "00:10:56",
      "content": "Did you feel safe? Was it a safe neighborhood or was there always trouble going on?"
    },
    {
      "speaker": "Neal",
      "time": "00:10:56",
      "upperBoundTime": "00:11:10",
      "content": "I felt safe because I grew up there. So I pretty much knew everybody that was in there and anybody that wasn't in there, that wasn't in the neighborhood you could pretty much spot them. So you're like, \"Hey! Where you come from?\" Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:10",
      "upperBoundTime": "00:11:16",
      "content": "Yeah sure I get that. What about school? Do you have some specific memories of school? Did you like school?"
    },
    {
      "speaker": "Neal",
      "time": "00:11:16",
      "upperBoundTime": "00:11:42",
      "content": "School was okay. I already didn't like, I didn't really care for school too much. I went when I was supposed to go. And when I was made to go I was always in trouble. And fighting and everything in school, getting expelled from school just doing."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:42",
      "upperBoundTime": "00:11:45",
      "content": "So what happened when you got expelled? How old were you when you got expelled?"
    },
    {
      "speaker": "Neal",
      "time": "00:11:45",
      "upperBoundTime": "00:12:03",
      "content": "Well I got expelled a few times man. It was, I don't remember the exact specific times. I know I had a few fights in school, maybe cussed a teacher out or something like that. She brought me to the office and told the principal she didn't want me in the class no more or something like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:03",
      "upperBoundTime": "00:12:07",
      "content": "So did you find yourself hopping around from different schools?"
    },
    {
      "speaker": "Neal",
      "time": "00:12:07",
      "upperBoundTime": "00:12:11",
      "content": "Yeah I was going to different schools. I was never expelled from any school."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:11",
      "upperBoundTime": "00:12:13",
      "content": "Oh you were suspended."
    },
    {
      "speaker": "Neal",
      "time": "00:12:13",
      "upperBoundTime": "00:12:18",
      "content": "Yeah. I was suspended from school for like three days, a week."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:18",
      "upperBoundTime": "00:12:21",
      "content": "Yeah okay but they take you back so you could."
    },
    {
      "speaker": "Neal",
      "time": "00:12:21",
      "upperBoundTime": "00:12:39",
      "content": "Yeah I always came back. A lot of times they had to call my mom to come and see about me come and talk with the principal. They would send notes. I would just trust try to scribble my momma's name in order to send them back so she can't come. She ain't got no time. She's working."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:39",
      "upperBoundTime": "00:12:48",
      "content": "What do you think was behind all that? Like sort of being just sort defiant just being, just getting into fights with folks around you? What was going on?"
    },
    {
      "speaker": "Neal",
      "time": "00:12:48",
      "upperBoundTime": "00:13:03",
      "content": "Yeah I found myself being more drawn to the streets than I was school. I felt I wasn't really learning nothing in school and I felt I was just wanted to run the streets and hang out."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:03",
      "upperBoundTime": "00:13:09",
      "content": "So paint a picture for me then. How old are we talking about when you wanted to run in the streets?"
    },
    {
      "speaker": "Neal",
      "time": "00:13:09",
      "upperBoundTime": "00:13:33",
      "content": "Man when I was like in elementary school we used to walk back and forth to school here so I always had we always was like had free rein to kind of move around in the streets and everything. So I would say maybe eight, nine, ten years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:33",
      "upperBoundTime": "00:13:41",
      "content": "So was there a lot of fighting outside of school as well in the neighborhood?"
    },
    {
      "speaker": "Neal",
      "time": "00:13:41",
      "upperBoundTime": "00:14:09",
      "content": "Yeah fighting outside of school, in school, on the school buses. We just fought. It was just playing. From growing up and seeing everybody, you didn't let nobody talk to you crazy. You don't let nobody do anything. You had to fight with them and the next day you were pretty cool. The same person you were fighting with you was straight with the next day. You all would make up and hang out again."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:09",
      "upperBoundTime": "00:14:19",
      "content": "Sure. So I'm just I'm assuming this but I'm just going to double check with you. Was there any kind of physical abuse in the home?"
    },
    {
      "speaker": "Neal",
      "time": "00:14:19",
      "upperBoundTime": "00:14:26",
      "content": "No we didn't have no physical abuse other than whippings. We had a few whippings."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:26",
      "upperBoundTime": "00:14:27",
      "content": "Tell me about that."
    },
    {
      "speaker": "Neal",
      "time": "00:14:27",
      "upperBoundTime": "00:14:34",
      "content": "When we would do something crazy or something mom would whip us, spank us, with a belt or something like that. But other than that it wasn't no."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:34",
      "upperBoundTime": "00:14:36",
      "content": "You never felt it was mean spirited or anything like that?"
    },
    {
      "speaker": "Neal",
      "time": "00:14:36",
      "upperBoundTime": "00:14:38",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:38",
      "upperBoundTime": "00:14:42",
      "content": "And any sexual abuse at all in your upbringing?"
    },
    {
      "speaker": "Neal",
      "time": "00:14:42",
      "upperBoundTime": "00:14:44",
      "content": "No never had sexual abuse."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:44",
      "upperBoundTime": "00:14:49",
      "content": "Okay great. So what was your highest grade of school before you?"
    },
    {
      "speaker": "Neal",
      "time": "00:14:49",
      "upperBoundTime": "00:14:50",
      "content": "I quit in ninth grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:50",
      "upperBoundTime": "00:14:54",
      "content": "Okay. All right. And so tell me about that. So now you quit school and now what are you doing with your days?"
    },
    {
      "speaker": "Neal",
      "time": "00:14:54",
      "upperBoundTime": "00:15:15",
      "content": "I quit school. I'm just hanging around a house. My mom telling me about I've got to get a job. I'm not really paying her no attention because I kind of like was selling weed and kept a little pocket change and stuff like that. Hung out. I was just in the streets drinking, doing drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:15",
      "upperBoundTime": "00:15:17",
      "content": "Weed?"
    },
    {
      "speaker": "Neal",
      "time": "00:15:17",
      "upperBoundTime": "00:15:31",
      "content": "Weed, yeah. Just running around doing anything. My mom not really too much paying attention. She don't really care but she want me to get a job to help out around the house and everything. But I really was just thinking about it in there."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:31",
      "upperBoundTime": "00:15:36",
      "content": "Yeah. Did you ever have a job?"
    },
    {
      "speaker": "Neal",
      "time": "00:15:36",
      "upperBoundTime": "00:15:49",
      "content": "I had a couple of jobs. But it was like not really no long jobs. I did it. I just went and got jobs just to keep up her quiet. And then after like maybe a week or two I'd quit. I'd come back and say I got fired."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:49",
      "upperBoundTime": "00:15:53",
      "content": "Okay. All right. What was the last job you had?"
    },
    {
      "speaker": "Neal",
      "time": "00:15:53",
      "upperBoundTime": "00:16:22",
      "content": "Oh my goodness. I worked at a like a steel factory. I worked at a place I think was called Sampson's Steels. I worked in I can't remember man. I can't remember all the."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:22",
      "upperBoundTime": "00:16:19",
      "content": "Okay. Odd jobs here and there."
    },
    {
      "speaker": "Neal",
      "time": "00:16:19",
      "upperBoundTime": "00:16:23",
      "content": "Yeah a little odd jobs here and there."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:23",
      "upperBoundTime": "00:16:27",
      "content": "All right. So you're doing that. Are you still living in a home up until this charge?"
    },
    {
      "speaker": "Neal",
      "time": "00:16:27",
      "upperBoundTime": "00:16:29",
      "content": "Still live at home."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:29",
      "upperBoundTime": "00:16:39",
      "content": "Okay. So why don't you walk me down that road. What about intimate relationships? You had some."
    },
    {
      "speaker": "Neal",
      "time": "00:16:39",
      "upperBoundTime": "00:16:43",
      "content": "I had a few girlfriends. It wasn't nothing like a real serious."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:43",
      "upperBoundTime": "00:16:44",
      "content": "Any children?"
    },
    {
      "speaker": "Neal",
      "time": "00:16:44",
      "upperBoundTime": "00:16:47",
      "content": "No children."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:47",
      "upperBoundTime": "00:16:52",
      "content": "No children. Okay. So do you remember the first time you got arrested?"
    },
    {
      "speaker": "Neal",
      "time": "00:16:52",
      "upperBoundTime": "00:17:28",
      "content": "I had a juvenile charge stealing something out of Walmart I end up getting probation for that and I got picked at one time for a joint. But it was in a friend of mine's car. And he took the charge for it which was it was he is but I just got arrested. My mom, I called my mom she came and bailed me out. I went to court they dismissed the charge. They gave me my bail money back. Yeah, that was it until this charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:28",
      "upperBoundTime": "00:17:30",
      "content": "So you're really a first time offender."
    },
    {
      "speaker": "Neal",
      "time": "00:17:30",
      "upperBoundTime": "00:17:33",
      "content": "I'm the first offender."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:33",
      "upperBoundTime": "00:17:39",
      "content": "First offender. Okay well would you mind telling me a little bit about that? How did you find your way to Louisiana? What happened?"
    },
    {
      "speaker": "Neal",
      "time": "00:17:39",
      "upperBoundTime": "00:17:39",
      "content": "We have friends and stuff. My mom had friends that she grew up with. So I always end up calling my cousins in the 80s. And I was always back and forth, back and forth and I just started coming back and forth bringing drugs, weed."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:39",
      "upperBoundTime": "00:17:59",
      "content": "Back and forth from Beaumont to?"
    },
    {
      "speaker": "Neal",
      "time": "00:17:59",
      "upperBoundTime": "00:18:08",
      "content": "From Beaumont to, Louisiana. And it was just something that I did. I just kept coming back and forth."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:08",
      "upperBoundTime": "00:18:10",
      "content": "Because you had family here."
    },
    {
      "speaker": "Neal",
      "time": "00:18:10",
      "upperBoundTime": "00:18:13",
      "content": "Yeah. It's not really family but we grew up calling each other family."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:13",
      "upperBoundTime": "00:18:14",
      "content": "I got it."
    },
    {
      "speaker": "Neal",
      "time": "00:18:14",
      "upperBoundTime": "00:18:33",
      "content": "So I would just come out and hang out with them for a weekend and when I got my first car I came out and hung out with them and we'd party and stuff. We'd go to different clubs and everything and then I'd go back to Beaumont stay over there. I might stay about a month or two."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:33",
      "upperBoundTime": "00:18:35",
      "content": "At your mom's house?"
    },
    {
      "speaker": "Neal",
      "time": "00:18:35",
      "upperBoundTime": "00:18:41",
      "content": "Yeah. At my mom's house. Then I'd end up going back to Louisiana. Stay over there a weekend."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:41",
      "upperBoundTime": "00:18:41",
      "content": "So supporting yourself with a little weed?"
    },
    {
      "speaker": "Neal",
      "time": "00:18:41",
      "upperBoundTime": "00:18:43",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:43",
      "upperBoundTime": "00:18:48",
      "content": "Okay. What kind of car did you have?"
    },
    {
      "speaker": "Neal",
      "time": "00:18:48",
      "upperBoundTime": "00:19:11",
      "content": "I had my first car was an 87 escort GT. And when I first got out I was real excited. I asked my mom to get it for me. I ain't never had nothing in my name. But I asked my mom to get it for me and I'd give her the money for it, she'd put it in her name, and I wanted to go out in Louisiana and have a good time. Yeah just have fun so."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:11",
      "upperBoundTime": "00:19:15",
      "content": "So you're 20 when this happens. What happened?"
    },
    {
      "speaker": "Neal",
      "time": "00:19:15",
      "upperBoundTime": "00:19:58",
      "content": "Actually a friend of mine, was getting drugs from me and I would just give it to him and then, \"Hey, whenever you get straight, just give me the money.\" He just kept getting drugs, getting drugs. We got into a confrontation because it was like, \"Hey man, it's time for you to start paying me my money.\" And he never got, he never gave it back to me."
    },
    {
      "speaker": "Neal",
      "time": "00:19:15",
      "upperBoundTime": "00:19:58",
      "content": "So we got into a big old argument behind it. I told him, I said, \"I'll get you later on.\" So I went to his house that night and we talked and everything. We got into a big argument and I had a knife in my pocket and I just stabbed him. I plead guilty to the charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:58",
      "upperBoundTime": "00:20:01",
      "content": "So, you didn't appeal your case?"
    },
    {
      "speaker": "Neal",
      "time": "00:20:01",
      "upperBoundTime": "00:20:06",
      "content": "No, I didn't appeal."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:06",
      "upperBoundTime": "00:20:36",
      "content": "Okay, if you had to identify, very often when we think back on these things with the time that we have to put it in perspective, if you think back on a cause, Why this happened is there something is there one specific thing that you think about or was it a whole host of things? Was it all behind drugs? What was going on? Now, you've had more than twenty five years to think about it. How do you make sense of it now?"
    },
    {
      "speaker": "Neal",
      "time": "00:20:36",
      "upperBoundTime": "00:21:16",
      "content": "I think it was a few different things. I think it was mostly like drugs. From growing up, feeling a certain way, the way that you had to handle things and the way you normally see in street life of people handling things. You grew up not telling on nobody. You didn't let nobody disrespect, you didn't let nobody take anything from you. So these are things that I grew up coming up in the streets, so I automatically felt like I had to honor those things that I learned from off the street."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:16",
      "upperBoundTime": "00:21:34",
      "content": "So let me ask you something else. But the, what if question. Let's say this didn't happen. How do you imagine the rest of your life would have trotted out? Like, what would the next few months or years been like? I think there's no way to tell for sure, but what if this didn't happen?"
    },
    {
      "speaker": "Neal",
      "time": "00:21:34",
      "upperBoundTime": "00:21:57",
      "content": "I probably would have been either doing the same thing. I might've ended up catching a charge later on. I might've gotten killed. I could have gotten in any kind of trouble."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:57",
      "upperBoundTime": "00:21:57",
      "content": "So, it wasn't going well."
    },
    {
      "speaker": "Neal",
      "time": "00:21:57",
      "upperBoundTime": "00:22:00",
      "content": "No, it wasn't going well."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:00",
      "upperBoundTime": "00:22:26",
      "content": "So, I wanted to move on to talking about, your time after the charge but before I move on, is there anything about you or your coming up that is kind of important that I didn't ask you about? Whether it's about your family or any kind of pivotal experience that you may have had as a kid that sticks with you."
    },
    {
      "speaker": "Neal",
      "time": "00:22:26",
      "upperBoundTime": "00:22:30",
      "content": "Not really."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:30",
      "upperBoundTime": "00:22:52",
      "content": "Yeah that's fine, I think we covered quite a lot. All right. So, you're in Louisiana. And I assume you get arrested very shortly after this incident. Because you said you plead. So, you spent a few months in the parish. Do you remember the bus ride coming down here to Angola?"
    },
    {
      "speaker": "Neal",
      "time": "00:22:52",
      "upperBoundTime": "00:22:54",
      "content": "Yes, I do remember."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:54",
      "upperBoundTime": "00:23:31",
      "content": "Tell me about what's going on in your mind."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:54",
      "upperBoundTime": "00:23:31",
      "content": "Neal #00:22:57-3#:First I want to say this my lawyer was telling me that the best thing to do by me pleading guilty was getting a speedy trial. So within the next few months, we didn't actually have a trial. I just stood before the judge and plead guilty. All right, so after that, I guess they did the paperwork, so I could be transferred to prison, but I went to Hunts first which is like I don't know maybe it's like an administration? You coming into the prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:31",
      "upperBoundTime": "00:23:34",
      "content": "Classification process."
    },
    {
      "speaker": "Neal",
      "time": "00:23:34",
      "upperBoundTime": "00:23:51",
      "content": "Yeah, so we actually came to the car and I was by myself. It was me and the person that was driving and they had two other police, I think they were like detectives or something that was on both sides."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:51",
      "upperBoundTime": "00:23:54",
      "content": "They brought you here?"
    },
    {
      "speaker": "Neal",
      "time": "00:23:54",
      "upperBoundTime": "00:24:00",
      "content": "They brought me here. Yeah, I was in the car. I was like the only one in that parish that was transferred that time. And I went to Hunts."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:00",
      "upperBoundTime": "00:24:03",
      "content": "What about Angola? Do you remember that ride?"
    },
    {
      "speaker": "Neal",
      "time": "00:24:03",
      "upperBoundTime": "00:24:30",
      "content": "Yeah, I remember that ride. Lord that was like man I was twenty one years old. And I'm like, \"God, I know I'm not going know nobody over here.\" I'm like, I'll probably be like the only person that don't know nobody. Everybody else pretty much grew up around these certain areas out here and they would know somebody. And I was like man, when I get down here, I don't know what's going to happen."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:30",
      "upperBoundTime": "00:24:35",
      "content": "You'd heard stories about Angola?"
    },
    {
      "speaker": "Neal",
      "time": "00:24:35",
      "upperBoundTime": "00:24:56",
      "content": "Yeah I did. Guys in the parish and stuff that, they'd not actually gone to Angola but they'd heard stories about Angola that they'd share with me and they were like, \"Man when you get there, don't take nothing from nobody, man. Set examples when you get there. Anybody say anything stupid you don't understand, go off, man.\" I was like okay, alright."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:56",
      "upperBoundTime": "00:24:59",
      "content": "Is that what you had to do?"
    },
    {
      "speaker": "Neal",
      "time": "00:24:59",
      "upperBoundTime": "00:25:36",
      "content": "No, actually, man, when I came down the walk, somebody called my name. Somebody knew me. Yeah, a guy on, when I came I was going to the A block and I was going to a block and was already out on the yard and this was evening time. And I'm walking, they call my name, and they're like, \"Hey man! You remember me?\" And he's a guy actually that I knew from off the street in Louisiana. By me traveling around up in Louisiana and stuff, yeah. I knew the guy."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:36",
      "upperBoundTime": "00:25:45",
      "content": "Yeah sure. Okay. So some of the stories you'd heard about Angola didn't turn out to be as bad as them."
    },
    {
      "speaker": "Neal",
      "time": "00:25:45",
      "upperBoundTime": "00:26:00",
      "content": "No it wasn't as bad as they were saying it was. You have times where people get into fights or stabbings or stuff like that. But it's not like every day. It's every blue it really is every blue moon now. You barely hear anything about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:00",
      "upperBoundTime": "00:26:03",
      "content": "Sure. Yeah I know it's changed a lot."
    },
    {
      "speaker": "Neal",
      "time": "00:26:03",
      "upperBoundTime": "00:26:06",
      "content": "Yeah a whole lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:06",
      "upperBoundTime": "00:26:12",
      "content": "So when you look back on that 21 year old Neal, how would you describe that person?"
    },
    {
      "speaker": "Neal",
      "time": "00:26:12",
      "upperBoundTime": "00:26:45",
      "content": "Oh man confused, scared. I felt a lot like I was led wrong in a lot of areas in my life. From taking advice from people from off the street."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:45",
      "upperBoundTime": "00:26:53",
      "content": "Did the reality of a life sentence, did that sink in at that point? Where life means life? Were you aware of that?"
    },
    {
      "speaker": "Neal",
      "time": "00:26:53",
      "upperBoundTime": "00:27:07",
      "content": "Yes. It's sunk in. Hit hard. It was like I'm going to be here so. I'm going to do what I got to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:07",
      "upperBoundTime": "00:27:22",
      "content": "Yeah sure. One of the reasons that we're talking with people like yourself is that there's a long time that's passed and people change. How are you different from that 21 year old now?"
    },
    {
      "speaker": "Neal",
      "time": "00:27:22",
      "upperBoundTime": "00:29:59",
      "content": "Well I'm a lot different because I don't feel hopeless no more. And I also started looking more positive instead of negative. While I'm here when I first come here when I was like, \"Man I'm not doing nothing. I don't care about nothing. I'm here. I'm going to do what I got to do.\" And later on it just like it hit me like, \"Man you're here. You might as well make the best out of the situation. Stop thinking negative about everything. You start thinking more positive.\""
    },
    {
      "speaker": "Neal",
      "time": "00:27:22",
      "upperBoundTime": "00:29:59",
      "content": "And I got back in school. Got my GED and at first they didn't want to put me in school because I was a lifer. And it just so happened they had just started a Prep program and this was kind of something like reentry, which is the president no, which is the warden over education. She had I talked with her about getting in school. And she wasn't a warden."
    },
    {
      "speaker": "Neal",
      "time": "00:27:22",
      "upperBoundTime": "00:29:59",
      "content": "She was over the prep program. I talked with her about getting into school. She said, she asked me did I have a life sentence and I said, \"Yes ma'am.\" She said, \"Well we're not supposed to put you in school. We've got to focus on the ones who don't have a life sentence.\" So I said, \"Okay but look I just I need to get in school so just think about it.\" And she said, \"Well look go and talk with Miss.\" Oh I forgot her name. There's another lady that used to assist her. She said, \"Talk with her and she what she say. If she approve it, she'll let you in if not you just got to wait.\""
    },
    {
      "speaker": "Neal",
      "time": "00:27:22",
      "upperBoundTime": "00:29:59",
      "content": "So I talked with Miss. So I talked with her and she explained to me, she didn't want to she said she would but she didn't want to put me in school because a lot of lifers would get in there and they were lollygagging, just hang out in there and try to use it as a means to get out of the field from working. I told her I said, \"Well look I just want to get in there and brush up on a few things and learn the things I need to and take my GED test and I'm out of there.\""
    },
    {
      "speaker": "Neal",
      "time": "00:27:22",
      "upperBoundTime": "00:29:59",
      "content": "And she said, \"Well how long do you think that will take you?\" I said, \"It ain't going to take me no more than a year.\" She said, \"Okay I'll give you a year. If you don't do it by then, you're out of there.\" I said, \"Okay.\" So actually I went in and took a like a pre-test to find out where I was and I scored pretty high. So it was actually a few little things dealing with math that I had to take care of and took the tests in about three months. Passed it. Got my GED."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:59",
      "upperBoundTime": "00:30:02",
      "content": "You skipped right up over tenth, eleventh, and twelfth grade."
    },
    {
      "speaker": "Neal",
      "time": "00:30:02",
      "upperBoundTime": "00:30:30",
      "content": "As a matter of fact me and George took the GED the same time and we were both told the same time that we had passed. It was three of us. They said, \"One of y'all I got good news. One of y'all didn't make it. Actually I got good news. Two of y'all made it. The bad news is one of you didn't.\" So she told the guy that didn't make it, told him so, \"You didn't make it but you can go back and redo it.\" Yeah she said, \"You enjoy. Y'all made it.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:30:30",
      "upperBoundTime": "00:30:34",
      "content": "How far is going into your time here was that?"
    },
    {
      "speaker": "Neal",
      "time": "00:30:34",
      "upperBoundTime": "00:30:53",
      "content": "This was in, and I just looked at a certificate just a couple of days ago, I think it was in 2004."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:53",
      "upperBoundTime": "00:30:56",
      "content": "Okay. So about twelve years into your sentence?"
    },
    {
      "speaker": "Neal",
      "time": "00:30:56",
      "upperBoundTime": "00:31:00",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:00",
      "upperBoundTime": "00:31:11",
      "content": "And then once you get your GED which is a pretty big deal, did you then start getting into other programs here at Angola?"
    },
    {
      "speaker": "Neal",
      "time": "00:31:11",
      "upperBoundTime": "00:31:34",
      "content": "I started doing other programs. Getting into sober group and anger management classes like and signing up for them. It'll take you a little while to get in some of them. I started just getting into different programs. Just trying to improve both myself and improve my records."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:34",
      "upperBoundTime": "00:31:38",
      "content": "What was the goal in your mind? What was the motivation for doing that?"
    },
    {
      "speaker": "Neal",
      "time": "00:31:38",
      "upperBoundTime": "00:31:49",
      "content": "The motivation was I had hope in my heart one day that things would change. That I would receive a chance to get paroled."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:49",
      "upperBoundTime": "00:31:53",
      "content": "Okay. And what? You wanted to be ready?"
    },
    {
      "speaker": "Neal",
      "time": "00:31:53",
      "upperBoundTime": "00:32:10",
      "content": "I wanted to be ready. I want to make sure that if I ever got the opportunity to present myself to a board or talk to anyone that they couldn't look back and say, \"Well you've been here all these years. You ain't did nothing?\" I accomplished a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:10",
      "upperBoundTime": "00:32:10",
      "content": "Tell me about those things. Tell me about them."
    },
    {
      "speaker": "Neal",
      "time": "00:32:10",
      "upperBoundTime": "00:32:38",
      "content": "Oh well after I got through with school, I started getting a lot of certificates, taking a lot of classes. I also enrolled in NOBTS. I'm graduated. I have my associates and what's the other one I forgot? Bachelor's? My associates and my bachelor's in Christian Ministry."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:38",
      "upperBoundTime": "00:32:40",
      "content": "When did you get that?"
    },
    {
      "speaker": "Neal",
      "time": "00:32:40",
      "upperBoundTime": "00:32:43",
      "content": "Oh I'm actually going to walk in December."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:43",
      "upperBoundTime": "00:32:51",
      "content": "Oh my goodness. Well congratulations!"
    },
    {
      "speaker": "Neal",
      "time": "00:32:51",
      "upperBoundTime": "00:33:27",
      "content": "Thank you. So I am a minister an inmate Minister. I get a chance to talk with a lot of the guys in here. I also work in the re-entry shack which is a place they bill money, we cook food and everything for a lot of the population and security and the money that's received what we do is we help a lot of the guys in reentry that's fixing to go home, that have jobs in certain areas like mechanics, HVAC, welding, we help them buy their uniforms. We help them buy the tools that they need to start a life when you get back out."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:27",
      "upperBoundTime": "00:33:31",
      "content": "Wow. Tell me about ministry. What do you find what's the most challenging part of ministering to other inmates here?"
    },
    {
      "speaker": "Neal",
      "time": "00:33:31",
      "upperBoundTime": "00:34:05",
      "content": "It's not so much as challenging and dealing with other inmates. It's more challenging with security allowing you to do what you have to do. Like if you put go to the blocks it's kind of hard sometimes getting in the blocks. And somebody may say you were like, somebody need to see you in the blocks and when you go over there and try to talk with him the security is like, \"Hey we ain't letting nobody here right now,\" Or \"We starting the showers right now,\" Or \"We fixing to let the yard out right now,\" Or \"We busy right now. We ain't got time right now.\" So it's more challenging in that aspect."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:05",
      "upperBoundTime": "00:34:07",
      "content": "Get access."
    },
    {
      "speaker": "Neal",
      "time": "00:34:07",
      "upperBoundTime": "00:34:31",
      "content": "Just to get access to them. But so far as the guys that's in the yard and the yards around us we can always talk with them. On the West Yard out on the side to the West Yard, I go over there on Sundays. We go every other Sunday now. And it's easy. It's simple man because I've been here a long time. So a lot of people already know me."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:31",
      "upperBoundTime": "00:34:36",
      "content": "Right. What do they want to talk about for the most part do you find?"
    },
    {
      "speaker": "Neal",
      "time": "00:34:36",
      "upperBoundTime": "00:35:17",
      "content": "Their life in general. They feel like there's no hope for them. The reason why the drugs and everything that the things that they're doing, they always try to come up with a good reason to have phones, cell phones, and stuff like that and they end up getting in trouble."
    },
    {
      "speaker": "Neal",
      "time": "00:34:36",
      "upperBoundTime": "00:35:17",
      "content": "I try to tell him. \"It's not, I understand how you want to get in contact with your family or I understand you want to get high to escape the prison scene, and everything. But once you come back down you still here. So why not use your time wisely. Put all that to the side right now and just straighten up for a while.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:35:17",
      "upperBoundTime": "00:35:24",
      "content": "Sure. Most of the folks that you minister to, are they also serving a life sentence?"
    },
    {
      "speaker": "Neal",
      "time": "00:35:24",
      "upperBoundTime": "00:35:26",
      "content": "A lot of them are. The majority of people here are serving a lot of time."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:26",
      "upperBoundTime": "00:35:33",
      "content": "Yeah they are."
    },
    {
      "speaker": "Neal",
      "time": "00:35:33",
      "upperBoundTime": "00:35:39",
      "content": "Anybody with I think maybe less than 50 years, they try to send him to another prison. A satellite prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:39",
      "upperBoundTime": "00:35:59",
      "content": "Yeah. Most of the folks here are serving very long sentences. Well so if you're trying to do that you must have thought about how you've dealt with your own hopelessness, right? So at some point I expect that maybe somebody ministered to you?"
    },
    {
      "speaker": "Neal",
      "time": "00:35:59",
      "upperBoundTime": "00:36:03",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:03",
      "upperBoundTime": "00:36:32",
      "content": "But when you think about I know that you're getting ready for a clemency hearing and things are moving in the right direction with some of that but you're also seeing a lot of people who end up in Point Lookout, on kind of a monthly basis. Do you think about the prospect of not getting out and when you do how do you cope with it?"
    },
    {
      "speaker": "Neal",
      "time": "00:36:32",
      "upperBoundTime": "00:37:28",
      "content": "I do think about it. I look at the reality that everybody's not getting out of prison. You still will have people that will die here. They may be buried at Point Lookout. You have people that die here with family members coming and get their bodies. It's a reality."
    },
    {
      "speaker": "Neal",
      "time": "00:36:32",
      "upperBoundTime": "00:37:28",
      "content": "You just have to understand it. I understand it. What I do know that regardless of whatever happened that I do have peace with myself. And there's a saying that they say around here, \"It is what it is.\" I mean I know God has forgiven me for my sins. I try to keep on a good relationship with God and I try to live the best day I can every day."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:28",
      "upperBoundTime": "00:37:32",
      "content": "Yeah. Well what else can you do?"
    },
    {
      "speaker": "Neal",
      "time": "00:37:32",
      "upperBoundTime": "00:37:33",
      "content": "What else can you do?"
    },
    {
      "speaker": "Marcus",
      "time": "00:37:33",
      "upperBoundTime": "00:37:36",
      "content": "Yeah sure it is what it is as you say."
    },
    {
      "speaker": "Neal",
      "time": "00:37:36",
      "upperBoundTime": "00:37:50",
      "content": "I may walk out of here in a few minutes and have a heart attack. So it may not be just the board that turned me down for being here. It may be my health or something. Anything."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:50",
      "upperBoundTime": "00:38:27",
      "content": "Sure I understand. It sounds to me like you have made the best of all the opportunities that Angola has to offer while you're here. Another thing that I do hear people say is that, \"Well there's some things I can't control, but I can control the way I live here.\" And this is a community and you're ministering to that community."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:50",
      "upperBoundTime": "00:38:27",
      "content": "So I mean it's a sense I guess I just want you to think that I'm saying anything you would do here is meaningless. The only thing you can do is to get out and have a meaningful life. But I think I see a lot of people living a very meaningful life here."
    },
    {
      "speaker": "Neal",
      "time": "00:38:27",
      "upperBoundTime": "00:38:29",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:29",
      "upperBoundTime": "00:38:42",
      "content": "What about you there's two families that get impacted when these things happen and yours is the other one. How has this affected your family?"
    },
    {
      "speaker": "Neal",
      "time": "00:38:42",
      "upperBoundTime": "00:40:02",
      "content": "My family they pretty much understand what it was I went through. I know and by me keeping in more contact with my sister I know it's like a lot of things that she go through that she would wish that I would be there where she would be able to freely talk to me. Because when she'd go through some certain things and I may not call for a week, she may not be feeling that way at that time. What I'm saying so it is kind of strenuous on that end."
    },
    {
      "speaker": "Neal",
      "time": "00:38:42",
      "upperBoundTime": "00:40:02",
      "content": "It affects her in a lot of ways like when my mom passed away. She needed, she would tell me all the time, \"Man I wish you would be here to help out.\" And the only thing I could do was encourage her but I don't want to be wanting to call her every day because of the phone bills. We pay little higher than normal people would pay who are free. So I would try to call her maybe once a week. At that time when I know she was going through some certain things I tried to call her once a week right."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:02",
      "upperBoundTime": "00:40:06",
      "content": "How did your mother handle you being incarcerated for this long?"
    },
    {
      "speaker": "Neal",
      "time": "00:40:06",
      "upperBoundTime": "00:40:22",
      "content": "Well I don't think no mother wants to see their kids in prison. She always kept up a good front but I think deep down she didn't want to see her kid locked up."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:22",
      "upperBoundTime": "00:40:31",
      "content": "Of course not. Do you remember was she able to come here and visit you? Do you remember the last time you saw her? Your last interaction with her?"
    },
    {
      "speaker": "Neal",
      "time": "00:40:31",
      "upperBoundTime": "00:41:20",
      "content": "Yes. It's been a while. She passed away in 2010. 2010. She passed away. So maybe about a year before that in 2009 was the last time I saw her. And kind of took a seat and she had caught a stroke. So it was kind of hard for her to talk. She had lost her talking ability. Apparently she got paralyzed on one side. So if I would call and talk to my sister she would put the phone to her ear and I would just tell her I love her. Things like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:20",
      "upperBoundTime": "00:41:28",
      "content": "Yeah the thing about visiting, it's kind of a double edged sword because it's obviously joyful to see loved ones but then you've got to see them go."
    },
    {
      "speaker": "Neal",
      "time": "00:41:28",
      "upperBoundTime": "00:41:45",
      "content": "Yeah. My niece and nephew they do that now when they come, they have so much fun because I play with them and rough them up a little bit. When it's time to go it's like, \"We don't want to go! We don't want to go!\" I say to them, \"Oh I'll be back!\""
    },
    {
      "speaker": "Marcus",
      "time": "00:41:45",
      "upperBoundTime": "00:42:12",
      "content": "So this may seem like an odd question because you're here in prison, but I think that the challenges of prison probably change over time like when you're first here there are different things that are challenging and over time you get used to something. What's the worst part of the prison experience for you now?"
    },
    {
      "speaker": "Neal",
      "time": "00:42:12",
      "upperBoundTime": "00:43:12",
      "content": "Oh I think it would be mostly not being able to see family members that you don't have contact with. I think it would be sex. I'm going to throw that down there. Not being able to have sex. Let's see. I think that would be, because I'm at an age where I want to stay in contact with all my family members."
    },
    {
      "speaker": "Neal",
      "time": "00:42:12",
      "upperBoundTime": "00:43:12",
      "content": "And there's some that it's kind of hard to get in contact with. You can't make them write to you, you can't make them e-mail you on the machine, you can't make them accept your calls, you can't make them do anything. All I can do is kind of like go through my sister or my brother or my father and tell them I said, \"Hey, if they want to get in contact with me.\" And give them the information on how to do that. That's about the hardest part right there."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:12",
      "upperBoundTime": "00:43:18",
      "content": "Do you like the rodeo?"
    },
    {
      "speaker": "Neal",
      "time": "00:43:18",
      "upperBoundTime": "00:43:40",
      "content": "It's okay. It's an opportunity to get away from down here. And you kind of go out there kind of sit down and talk with everybody. A lot of free world people. Kind of escape the prison life, and the conversations about prison. You get tired of that."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:40",
      "upperBoundTime": "00:43:45",
      "content": "Yeah I get it. Do you work in the hobby shop and sell things there or not?"
    },
    {
      "speaker": "Neal",
      "time": "00:43:45",
      "upperBoundTime": "00:43:50",
      "content": "I'm in the hobby shop. I don't sell anything anymore. I kind of gave it up I used to make chairs, do woodworker stuff."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:50",
      "upperBoundTime": "00:43:51",
      "content": "Not anymore?"
    },
    {
      "speaker": "Neal",
      "time": "00:43:51",
      "upperBoundTime": "00:43:55",
      "content": "Not Anymore."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:55",
      "upperBoundTime": "00:44:04",
      "content": "What are you most proud of the various things you've accomplished over the years? What stands out as the thing you're most proud of?"
    },
    {
      "speaker": "Neal",
      "time": "00:44:04",
      "upperBoundTime": "00:45:37",
      "content": "I'm proud of myself for getting my education. I'm proud of being more wise. I'm proud of myself for being more positive. I'm proud of myself for staying out of trouble. I'm proud of myself for doing the best that I can in dealing with my family and my friends."
    },
    {
      "speaker": "Neal",
      "time": "00:44:04",
      "upperBoundTime": "00:45:37",
      "content": "I'm proud of myself that I'm not selfish. I'm able to help when I can. I'm proud of myself for not just doing my time for me but for doing my time for others as well. What I mean by trying to talk with them and help them out. Just by being an ear sometimes and trying to put myself in the right position. And being the right character. So they could come and talk to them when they want that because sometimes you have people that say they want to be available to you."
    },
    {
      "speaker": "Neal",
      "time": "00:44:04",
      "upperBoundTime": "00:45:37",
      "content": "But every time you come up it's like, \"I don't want to talk to you. I ain't got time right now.\" Or your face may say, \"I don't want to be here. I don't want to hear this.\" So I try to be in right character at all times to make myself available for anybody that needs to talk with me Yeah so I'm proud of that."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:37",
      "upperBoundTime": "00:45:47",
      "content": "Yeah. And going through Bible College is a pretty big deal. Not everybody gets to do that."
    },
    {
      "speaker": "Neal",
      "time": "00:45:47",
      "upperBoundTime": "00:45:50",
      "content": "Yeah I was thankful for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:50",
      "upperBoundTime": "00:45:47",
      "content": "What's your mother's name?"
    },
    {
      "speaker": "Neal",
      "time": "00:45:47",
      "upperBoundTime": "00:45:53",
      "content": "Judy."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:53",
      "upperBoundTime": "00:45:54",
      "content": "And your sister's name?"
    },
    {
      "speaker": "Neal",
      "time": "00:45:54",
      "upperBoundTime": "00:45:55",
      "content": "April."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:55",
      "upperBoundTime": "00:45:56",
      "content": "Who's Jessica?"
    },
    {
      "speaker": "Neal",
      "time": "00:45:56",
      "upperBoundTime": "00:45:58",
      "content": "That Is my ex-wife."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:58",
      "upperBoundTime": "00:46:05",
      "content": "Okay. All right. We didn't get a chance to talk about that. I didn't know that you were married. Is this somebody you met after you were incarcerated?"
    },
    {
      "speaker": "Neal",
      "time": "00:46:05",
      "upperBoundTime": "00:46:11",
      "content": "After I was incarcerated, yes. We had a good relationship. We got married."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:11",
      "upperBoundTime": "00:46:11",
      "content": "How'd you meet?"
    },
    {
      "speaker": "Neal",
      "time": "00:46:11",
      "upperBoundTime": "00:47:29",
      "content": "Actually she worked here. She was a nurse. And she worked for a while and she end up quitting, resigning. And she got back in contact with me. At that time it was all right for people that worked here to get on your visiting list. Now it's like you have to have approval from the warden or something like that. But she contacted me, I put her on my visitor list and she end up coming to visit."
    },
    {
      "speaker": "Neal",
      "time": "00:46:11",
      "upperBoundTime": "00:47:29",
      "content": "So we had a good time. We always talked and everything. I asked her if she wanted to marry me. She said yeah. And I told her, \"Hey, it's not easy.\" My situation is not easy. She said she wasn't worried about that. But we end up getting divorced some years down the line. It was mostly dealing with my family, when my mama took sick and her and my sister begin to fight and get into a lot of physical fights, and verbal. Because all of them still all live together. My mom, my sister, and my wife."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:29",
      "upperBoundTime": "00:47:30",
      "content": "Oh in Beaumont."
    },
    {
      "speaker": "Neal",
      "time": "00:47:30",
      "upperBoundTime": "00:47:51",
      "content": "Oh no actually my mom had moved to Natchitoches, Louisiana when she began to get real sick because she had, what would you call it? Some kind of medical plan with."
    },
    {
      "speaker": "Marcus",
      "time": "00:47:51",
      "upperBoundTime": "00:47:57",
      "content": "I'm not sure. Why don't you go ahead make sure? It's Neal Spencer."
    },
    {
      "speaker": "Neal",
      "time": "00:47:57",
      "upperBoundTime": "00:48:04",
      "content": "Cypress Four. I didn't know it was that late."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:04",
      "upperBoundTime": "00:48:06",
      "content": "Thank you. So she moved Natchitoches?"
    },
    {
      "speaker": "Neal",
      "time": "00:48:06",
      "upperBoundTime": "00:48:10",
      "content": "She moved to Negreet."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:10",
      "upperBoundTime": "00:48:13",
      "content": "And why? You said she got sick. Did she have some support?"
    },
    {
      "speaker": "Neal",
      "time": "00:48:13",
      "upperBoundTime": "00:48:14",
      "content": "When my mom got sick she really moved in with my mom to kind of help out with my mom."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:14",
      "upperBoundTime": "00:48:19",
      "content": "Okay so your sister was in Natchitoches?"
    },
    {
      "speaker": "Neal",
      "time": "00:48:19",
      "upperBoundTime": "00:48:41",
      "content": "No my sister was living in Dallas, Texas at the time. And she ended up moving back to help out with my mom also. So my sister telling me that she's not helping out and my ex-wife is telling me that my sister is not helping out. So it's all kind of confusion."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:41",
      "upperBoundTime": "00:48:53",
      "content": "Did Jessica live in Natchitoches? I'm trying to figure out what the Natchitoches connection was."
    },
    {
      "speaker": "Neal",
      "time": "00:48:53",
      "upperBoundTime": "00:48:55",
      "content": "No my mom moved to Natchitoches so she could be a little more closer to me. After my sister graduated school and everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:55",
      "upperBoundTime": "00:49:32",
      "content": "I got it. All right so tell me a bit about your vision for the future. Let's say you're preparing for the clemency hearing. Let's say you get a favorable clemency hearing. You've done a fair amount of time and let's say they give you fixed, commute your sentence to a fixed term and say your parole eligible after X years and that time comes and you get out. I'm sure you've spent a lot of time thinking about that. Can you paint a picture for me? What are you going to do? What's your vision for the rest of your life? Your post Angola life?"
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "Okay. I would like to go out and work, save some money, get myself situated. Right now I have two options. I can go back to my dad's house and help out with him because he's getting older. Him and my step mom they getting older. I can go out and help out with them."
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "Or I can end up going to Houston with my sister and just staying with her and her husband and kids. She's got two kids and until I'm able to get myself situated where I can buy my own apartment or home or whatever and save money and everything."
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "I would really like to try to open up my own business. Maybe doing barbecue. Barbecuing. I love to cook. So, my vision really is to have an established, a nice--not a restaurant but maybe a barbecue stand. And I also have like on the outside a big topper outside with concrete slab with picnic tables where the families could go out and eat and have like churches, church choirs would come out and worship maybe preach a little bit. Have a donation pot where you could make a donation for the church."
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "So I wouldn't be like, I was hiring them to come out and do anything but it would be like if you want to raise revenue or funds for your church you have y'all could come out, do what y'all do here. And the donation that y'all receive is for the church. Things like. Help out in the community. Help out with your school uniform and stuff for the kids."
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "Have a job opening, have job openings for the teenagers and stuff that's coming up where they could save money to help them buy their school clothes or whatever help mom pay for bills or whatever they need. Try to spend time with them and teach them some morals and some principles about themselves."
    },
    {
      "speaker": "Neal",
      "time": "00:49:32",
      "upperBoundTime": "00:52:18",
      "content": "Responsibility, maybe be something like that to a lot of the neighborhood families help out maybe get kids to help out, cut grass and stuff for the older people homes and stuff. They can't go out and do that. Things like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:18",
      "upperBoundTime": "00:52:36",
      "content": "So I've learned a lot about you in this interview and I'm grateful that you sat with me to do this. Is there something that I should have asked you in general that I didn't? Some things about your life that we didn't get to that you think are important. It's okay if there isn't. I just want to give you that chance."
    },
    {
      "speaker": "Neal",
      "time": "00:52:36",
      "upperBoundTime": "00:52:40",
      "content": "Not that I know. I mean we've pretty much covered a lot of stuff."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:40",
      "upperBoundTime": "00:52:45",
      "content": "We did. Well thank you very much. I appreciate it Neal. I really wish you all the best."
    },
    {
      "speaker": "Neal",
      "time": "00:52:45",
      "content": "Anytime, oh thank you."
    }
  ]
}
