{"name":"","transcript":[{"content":"Norman Dozier Transcription REDACTIONS FINAL"},{"speaker":"Norman","time":"00:00:00-0","content":"My name is Norman Dozier. I was convicted of second degree murder. I have been incarcerated for 22 years and I am 46 years old."},{"speaker":"Marcus","time":"00:00:16-5","content":"Norman, I'd like to talk with you about the work that you do in hospice here. I know that's a major part of your life here, and some of the changes that you've gone through since you've been here in Angola. But I want to go back a little earlier first and start with your childhood."},{"speaker":"Norman","time":"00:00:34-1","content":"Okay."},{"speaker":"Marcus","time":"00:00:36-9","content":"So, can you tell me, where were you raised?"},{"speaker":"Norman","time":"00:00:38-7","content":"I was raised in Alexandria, Louisiana."},{"speaker":"Marcus","time":"00:00:40-5","content":"Okay, tell me a little bit about the folks who raised you."},{"speaker":"Norman","time":"00:00:43-3","content":"I had awesome parents. My case might be different from the rest of the guys you might've interviewed. My mom was an assistant principle and my dad was the first black firefighter of Alexandria."},{"speaker":"Marcus","time":"00:00:56-7","content":"Wow."},{"speaker":"Norman","time":"00:00:58-7","content":"Great parents."},{"speaker":"Marcus","time":"00:00:58-7","content":"Did you have siblings?"},{"speaker":"Norman","time":"00:01:01-5","content":""},{"speaker":"Marcus","time":"00:01:05-4","content":"Okay, and did your parents get along?"},{"speaker":"Norman","time":"00:01:07-0","content":"Great."},{"speaker":"Marcus","time":"00:01:09-4","content":"So, is it fair to say you were raised in a loving, nurturing home with people that you knew cared about you?"},{"speaker":"Norman","time":"00:01:15-5","content":"Best home you can get."},{"speaker":"Marcus","time":"00:01:17-9","content":"Okay."},{"speaker":"Norman","time":"00:01:19-8","content":"Yeah."},{"speaker":"Marcus","time":"00:01:21-4","content":"Now, what about grandparents. Were you close to your grandparents?"},{"speaker":"Norman","time":"00:01:24-9","content":"I and my grandparents had an awesome relationship. Actually, my grandmother was my best friend."},{"speaker":"Marcus","time":"00:01:28-4","content":"Okay, is she still alive?"},{"speaker":"Norman","time":"00:01:30-3","content":"She passed a couple of years ago."},{"speaker":"Marcus","time":"00:01:33-6","content":"Okay can you tell me about your last memory of interacting with her?"},{"speaker":"Norman","time":"00:01:35-2","content":"My last memory, it was on the telephone. And we would always talk. And one of her favorite scriptures that she'd always say was, \"In my father's house, there are many mansions.\" And I can remember her saying that with joy."},{"speaker":"Marcus","time":"00:01:56-6","content":"Did she require hospice care?"},{"speaker":"Norman","time":"00:01:59-0","content":"Yes, she did. She required hospice care, and she was in a nursing home up until the time that she passed, and she went."},{"speaker":"Marcus","time":"00:02:10-0","content":"Okay. Did she know about the work that you do here?"},{"speaker":"Norman","time":"00:02:12-9","content":"Oh yes, she did, I constantly shared God's work with her, to comfort her as much as I could through telephone and through letters."},{"speaker":"Marcus","time":"00:02:20-5","content":"Sure. Were there others who were particularly close to you? Like a best friend? Something like that you had coming up."},{"speaker":"Norman","time":"00:02:32-0","content":"Well."},{"speaker":"Marcus","time":"00:02:35-1","content":"Someone who stands apart from your other friends."},{"speaker":"Norman","time":"00:02:39-1","content":"Well, I had several friends. I guess probably one of my best friends, outside of family, I guess probably maybe Larry. Larry was a high school friend."},{"speaker":"Marcus","time":"00:02:54-3","content":"You still in touch with him?"},{"speaker":"Norman","time":"00:02:57-4","content":"No, I haven't talked to him since I've been incarcerated"},{"speaker":"Marcus","time":"00:02:59-5","content":"Okay so who visits you up here?"},{"speaker":"Norman","time":"00:03:04-8","content":"Well, I have a fiancé that sees me, Alice Hearts. And my mother, she comes regularly. And my son he comes, and my sisters, they come."},{"speaker":"Marcus","time":"00:03:10-6","content":"Okay, did you meet your fiancé after you were incarcerated?"},{"speaker":"Norman","time":"00:03:16-6","content":"Yes, I met her about 6 years ago at the rodeo."},{"speaker":"Marcus","time":"00:03:23-4","content":"Okay. I'm somewhat familiar with Alexandria, but can you get me a sense on what your neighborhood looked like? What, if you were sitting on your front poach, what would you be seeing?"},{"speaker":"Norman","time":"00:03:34-1","content":"Well, what you would be seeing was, would be fairly middle-class community. You'd see all the kids playing, and you might see a dog walking across the street or some cars passing by. Wasn't a lot of crime where I was raised."},{"speaker":"Marcus","time":"00:03:55-1","content":"What was school like for you? Did you like it?"},{"speaker":"Norman","time":"00:04:01-3","content":"School for me was, it was kind of fun and it was challenging. I never was very academically, I didn't do well academically. I was always like a C-average, I was never the A and B average. Normally C-average. But it was fun interacting with the kids and all."},{"speaker":"Marcus","time":"00:04:32-8","content":"Did you finish high school?"},{"speaker":"Norman","time":"00:04:34-9","content":"Yes sir, I finished high school. Pee Body Magnet High School. In 1990."},{"speaker":"Marcus","time":"00:04:39-8","content":"Did you go to college at all?"},{"speaker":"Norman","time":"00:04:42-9","content":"I did a little bit at LSUA. I didn't finish there."},{"speaker":"Marcus","time":"00:04:46-7","content":"Okay, can you remind me how old you were when you were arrested? 23?"},{"speaker":"Norman","time":"00:04:54-1","content":"I was 24 years old."},{"speaker":"Marcus","time":"00:04:56-6","content":"24. Okay."},{"speaker":"Norman","time":"00:05:00-7","content":"Yes."},{"speaker":"Marcus","time":"00:05:03-8","content":"Do you remember the first time you were arrested for anything?"},{"speaker":"Norman","time":"00:05:07-9","content":"Well, the first time I got arrested, I had to be about 21, maybe. For disturbing the peace."},{"speaker":"Marcus","time":"00:05:14-8","content":"Okay. What was going on?"},{"speaker":"Norman","time":"00:05:16-9","content":"It was at a night club and it was just a lot of, just night club stuff going on."},{"speaker":"Marcus","time":"00:05:24-4","content":"Sure. That's fine. Is it fair to say if we put this current charge aside, would it be fair to say that your life had taken a turn down the wrong road?"},{"speaker":"Norman","time":"00:05:37-1","content":"Yeah, it would be safe to say that."},{"speaker":"Marcus","time":"00:05:39-3","content":"Okay, so what would you think lead to that?"},{"speaker":"Norman","time":"00:05:43-4","content":"Well, I would have to say, from having awesome parents. I would have to say, when I came back from the military. I went to the military because it, at 18, I went to the military to the National Guard. To get the GI Bill to help me through, help pay for college. They helped my parents because with they had two other kids, I had two siblings."},{"speaker":"Norman","time":"00:05:43-4","content":"And when I went to basic training and that's when I begin to go astray, when I begin to see a different lifestyle. I begin to see the drug dealers. I begin to see how they were living and what happened was that it swayed me and pulled me into that way they were living."},{"speaker":"Marcus","time":"00:06:34-4","content":"Are the guys in boot camp? Or guys just were."},{"speaker":"Norman","time":"00:06:38-5","content":"It was a mixture of those guys and then, we would go out, and just see, as teenagers, we would see how these guys were living. I mean with Mercedes-Benz and BMWs. And they, they weren't working, and they had all the females and all the fame and fortune. We were in military doing a job and they had us. So, it kind of, kind of nudged me into that lifestyle."},{"speaker":"Marcus","time":"00:07:08-9","content":"And so, when do you get into that lifestyle? Right away?"},{"speaker":"Norman","time":"00:07:15-1","content":"Soon as I finished my AIT.I did basic training in South Carolina and then I went to Virginia, Fort Lee and did my AIT."},{"speaker":"Marcus","time":"00:07:24-7","content":"Okay."},{"speaker":"Norman","time":"00:07:28-0","content":"And it was some seeds planted in me, how guys were living at my age. And when I came back, other best friend of mine, by the name of Jeffery Black, I come back and he was like, a neighborhood superstar. And from there on it was history. And from there I actually learned the game. The drug game. And I became a big-time drug dealer from that."},{"speaker":"Marcus","time":"00:07:54-2","content":"Right. And did you hide that from your parents?"},{"speaker":"Norman","time":"00:07:56-5","content":"Yes, I did. I did."},{"speaker":"Marcus","time":"00:07:59-6","content":"What did they think you were doing?"},{"speaker":"Norman","time":"00:08:04-3","content":"I actually told them that I was doing construction work for my son's mom's dad."},{"speaker":"Marcus","time":"00:08:10-0","content":"Okay, alright. Actually, lets back up a bit, tell me about the women you had in your life? The girlfriend? The mom of your kid?"},{"speaker":"Norman","time":"00:08:24-3","content":"Before my drug dealing or after?"},{"speaker":"Marcus","time":"00:08:26-3","content":"Yeah, before."},{"speaker":"Norman","time":"00:08:28-2","content":"Before, okay. Well I didn't, when I met my son's mom, it was."},{"speaker":"Marcus","time":"00:08:34-0","content":"Oh okay."},{"speaker":"Norman","time":"00:08:36-1","content":"Yeah it was during my drug dealing."},{"speaker":"Marcus","time":"00:08:38-7","content":"Okay, let's talk about her."},{"speaker":"Norman","time":"00:08:42-0","content":"Okay, wonderful girl."},{"speaker":"Marcus","time":"00:08:43-7","content":"Okay, are you still in touch?"},{"speaker":"Norman","time":"00:08:46-1","content":"Not really. Were still, every now and then, we might, I might see her or something. I saw her at the rodeo a couple of seasons ago. But were still in good spirits because of our son. She's a great person."},{"speaker":"Marcus","time":"00:09:02-2","content":"Okay, tell me about your son."},{"speaker":"Norman","time":"00:09:07-3","content":"Great guy. Actually, I have two."},{"speaker":"Marcus","time":"00:09:09-9","content":"Okay. Tell me about them."},{"speaker":"Norman","time":"00:09:11-8","content":"Well, I have one that's, my oldest, he's 24. He's my namesake. Looks just like me. He's doing very well. He's a business man out there. And he's working. I mean he's made his dad tremendously proud. And his younger brother, he's playing football for UL, and he's on the honor roll and he's doing great."},{"speaker":"Marcus","time":"00:09:34-9","content":"That is great."},{"speaker":"Norman","time":"00:09:38-2","content":"They're definitely success stories."},{"speaker":"Marcus","time":"00:09:40-2","content":"Yeah. Have you been able to shape that over the years from here?"},{"speaker":"Norman","time":"00:09:43-5","content":"Oh yeah, most definitely. Most definitely. They can tell you, it's through my ministry, ministry to them that they are the men that they are now. A lot of molding and shaping and praying for them and counts of them and raising them from in here."},{"speaker":"Marcus","time":"00:10:01-7","content":"Right. What are the challenges of doing that from here? What's the biggest challenge to raise them? Aside from the physical separation."},{"speaker":"Norman","time":"00:10:12-0","content":"That's the biggest challenge is the physical separation. The biggest challenge for me is not being there with them. But it's through God's grace that I am able to connect with them. I can identify with them because I know what they are going through because I was once a young man in the same situation."},{"speaker":"Marcus","time":"00:10:31-4","content":"And do they manage to come up here and see you?"},{"speaker":"Norman","time":"00:10:36-8","content":"Yes, I see them quite often. They actually come to the rodeo from time to time. And I try to call them at least once a week. To encourage them and give them a word from God. And to inspire them. To let them know I'm proud of them and keep going in the direction that they're going."},{"speaker":"Marcus","time":"00:10:54-9","content":"That's good. So, let's pick up with, now you're, you're having some success with dealing drugs. Would you say that that was primarily what lead you down the path to this current charge?"},{"speaker":"Norman","time":"00:11:14-3","content":"I would definitely have to say that, probably because, like I said I was raised, with some great parents. But when I got into that drug life, selling drugs, it steered me, from being on the right track and lead me down the wrong road. And I definitely got blindsided and lost focus so to speak."},{"speaker":"Marcus","time":"00:11:46-7","content":"Okay, well, one of the reasons that we wanted to talk with you and folks like you is that by any objective measure you are considered a trusted rehabilitated model trusted member of the community."},{"speaker":"Norman","time":"00:12:04-4","content":"Amen."},{"speaker":"Marcus","time":"00:12:07-3","content":"Who has turned your life around?"},{"speaker":"Norman","time":"00:12:09-2","content":"Amen."},{"speaker":"Marcus","time":"00:12:12-0","content":"So, I want to talk mainly about that, but I do also want to start with the Norman that came here."},{"speaker":"Norman","time":"00:12:21-1","content":"Okay."},{"speaker":"Marcus","time":"00:12:23-5","content":"So, the Norman that was brought in through the Angola gates. Can you describe that young man?"},{"speaker":"Norman","time":"00:12:30-0","content":"Well, that young man was lost and confused. And it was at that time that I was incarcerated, I begin to see that my money couldn't save me, and that my parents, my influence couldn't save me, and it was that time that I knew that all I had was God. And it was when I came into a knowing that all I had was God that I came to the realization that was all I needed, that He was all I needed. And from then, I begin to make a transformation."},{"speaker":"Marcus","time":"00:13:17-0","content":"How long did that take? When did you come to that realization?"},{"speaker":"Norman","time":"00:13:20-5","content":"Immediately. I'd have to say immediately. When I was incarcerated, even though I had and when I come to that realization that he's all, I had I come to the realization that he's all that I needed. And it's been a process ever since. And I'm still in that process."},{"speaker":"Marcus","time":"00:13:41-5","content":"Sure, so can you take a minute to describe, what your typical days were like when you first came here?"},{"speaker":"Norman","time":"00:13:49-9","content":"When I first came through the gates of Angola, it was a lot of field work. Because I've never been incarcerated before in my life. I'm a first offender, they put in the cell blocks, Camp D Raven, which is a cell block and being in the cell with one other guy and it was completely foreign to me."},{"speaker":"Norman","time":"00:13:49-9","content":"I'm a young man, early 20s, coming into this environment it was, was life-changing, mind-blowing. To be in a cell for 23 hours a day with another man and you going out in the field every day, twice a day and you're doing some serious, excruciating work and in 98, we were actually doing a lot of work. In that sun cutting grass or whatever."},{"speaker":"Norman","time":"00:13:49-9","content":"And you have a lot personalities you got to deal with. You had guys that were into all kinds of games, a lot of trickery. A lot of stuff going on back then. And God saved me through it all."},{"speaker":"Marcus","time":"00:15:14-9","content":"Yeah, what were the main challenges to you then?"},{"speaker":"Norman","time":"00:15:22-0","content":"I would have to say the main challenge for me was being away from my family."},{"speaker":"Marcus","time":"00:15:30-6","content":"Yeah. Sure. If you could go back and give that person, that young man, advice. It's been 20 years, you've learned a lot. There's a lot things you learn in 20 years. A new perspective you gain."},{"speaker":"Norman","time":"00:15:44-7","content":"Yeah, almost 22."},{"speaker":"Marcus","time":"00:15:47-9","content":"Yes. So, what would you tell that man now? You probably see young men coming in like that all the time."},{"speaker":"Norman","time":"00:15:53-4","content":"I do. That's why I'm a mentor and in doing that, it's my, basically it's my first job up here because I'm in the dorm with them. And I mentor guys all day, from morning to night. Noon and night. And one of the things that I teach them is knowing who they are. Their identity. Because one of the things that lead me astray was I didn't know who I was."},{"speaker":"Norman","time":"00:15:53-4","content":"So, I let the culture mold me and shape me into this drug dealer, this player. But one of the things I teach young men, or one of the things that I would tell myself back then would be direct me to my identity, my purpose and plan for God in my life."},{"speaker":"Marcus","time":"00:16:43-4","content":"Right. How are you a different person now?"},{"speaker":"Norman","time":"00:16:58-5","content":"Aw man, I could, go on, I'm different as night-time is from day-time is. It's totally different. People see me that knew me from back then and they don't even know who I am. I hear God say that I don't look the same, my voice, it's not even the same. I mean, it's totally different. It's like that old man is completely dead. And one of the words that I can say I'm completely different is my mindset has done changed. I have to say I'm a new creature in Christ."},{"speaker":"Marcus","time":"00:17:34-6","content":"Can you describe what a typical day in your life is now?"},{"speaker":"Norman","time":"00:17:37-8","content":"A typical day, I would normally wake up in the morning. I'm going to have some mentees come to the bed. They're going to want to talk, and some would want to complain about not being home, most of those guys they have two years to go home. And I'm going to have to encourage them. Then, we go to a morning motivational meeting at 7 o'clock in the morning."},{"speaker":"Norman","time":"00:17:37-8","content":"And, we do that and after that morning motivational meeting, I come upstairs for a little while, I freshen up in the Word. Then I go in the hospital wards and I go minister to some of the guys in the hospice wards and minister to their needs, whether its physical, spiritual or mental."},{"speaker":"Marcus","time":"00:18:22-6","content":"Can you tell me about the hospice work that you do here?"},{"speaker":"Norman","time":"00:18:25-9","content":"Yes, it's something that I've been doing probably about a little over 10 years. And God blessed me to be a club president, and the name of the club that has God blessed me with is the Man-Prison Concept Club. And what our job is to take care of the guys on the ward, the hospice patients, or anybody that's on the ward that needs any hygiene or needs any type of food, or just need encouraging and comfort spiritually, mentally, and physically."},{"speaker":"Norman","time":"00:18:25-9","content":"And we'd go sit over there and pray with the guys, go comfort them, go console them, and then, well over a decade of going there, I've seen countless of guys die was there with them as they crossed over. And some guys, I've seen healed. That came off the war, I've experienced a lot over there with these guys"},{"speaker":"Marcus","time":"00:19:38-6","content":"What kind of characteristics do you have to have to be an effective hospice worker?"},{"speaker":"Norman","time":"00:19:45-2","content":"Well, one of the things you have to have is compassion because I've talked to several guys and for one guy to shave another guy's face or to clean a guy's backside it takes a lot of compassion. It takes a lot of love to be able to help the next man in those types of way. It's trying but it's worth it in the end. It's rewarding."},{"speaker":"Marcus","time":"00:20:22-7","content":"I'm going to ask a difficult question, does it, you're facing a sentence of life without parole."},{"speaker":"Norman","time":"00:20:31-8","content":"Yes sir."},{"speaker":"Marcus","time":"00:20:35-3","content":"You are confronted by the fact that you might not leave here unless we have some meaningful reform which is also what there hope is for. But of all of the folks who are dealing with a life sentence, you are the one that it constantly reminded of the fact that so many people are dying here."},{"speaker":"Norman","time":"00:20:54-7","content":"Right."},{"speaker":"Marcus","time":"00:20:56-7","content":"More than anybody."},{"speaker":"Norman","time":"00:20:58-7","content":"Right."},{"speaker":"Marcus","time":"00:21:01-8","content":"Does that weigh in on the way you do your work over there? Does it obviously there's an emotional toll it takes on you to just to comfort someone who is dying."},{"speaker":"Norman","time":"00:21:13-1","content":"Yes, it does."},{"speaker":"Marcus","time":"00:21:15-4","content":"But there is another aspect that it's reminding you that that could be you."},{"speaker":"Norman","time":"00:21:19-2","content":"Actually, it doesn't take a toll. Actually, it's almost like wings, the wings beneath an eagle. It actually propels me because if the worse was to happen, I would want someone to take care of me. And when I see these guys have compassion for them, I see them, I see their, most of them are hurting, they alone and scared, most of them, their families have forsaken them."},{"speaker":"Norman","time":"00:21:19-2","content":"A lot of it, they don't have anybody and when we go over there, it's like they light up. It's like we are their families. It's not just to hold their hand and just comfort them. I used to tell them that we love them and if they need anything, to eat a snack or to just to talk with them. It's a blessing. It's rewarding not only to me, but I can see that it's a blessing to them."},{"speaker":"Marcus","time":"00:22:25-5","content":"How do you deal with the prospect of never leaving prison?"},{"speaker":"Norman","time":"00:22:34-4","content":"The prospect of never leaving prison, this is how I deal with it. I am a faith guy. I believe in the promises of God. And I have to stand on those promises and even in the natural, which the judge says I'll never leave this place, but I have to believe what God's words says about me. I have to walk by faith and not by sight, so if the world is saying I'll, I'll never leave I have to stand on Gods promises and the Word, which says who the son sets free is free indeed, so I'm not walking by, by sight really. Rather, I'm walking by faith."},{"speaker":"Marcus","time":"00:23:28-4","content":"So, do you think that there is a faith that is strong enough to kind of knock down these walls?"},{"speaker":"Norman","time":"00:23:36-3","content":"Its mountain moving faith."},{"speaker":"Marcus","time":"00:23:41-3","content":"So, I'm just trying to understand. I did talk with somebody who said that it doesn't really matter, because they're also very religious and they're like if it's God's will for me to get out, that's great. If not, I'm fine because I found, He is in my heart. Is that more or less what you're telling me?"},{"speaker":"Norman","time":"00:24:13-3","content":"More or less, but I'm one of the guys that's not so much as religious, I have a relationship with the father. And I have a knowing, a knowing inside me that I will be delivered according to His time and plan."},{"speaker":"Marcus","time":"00:24:33-2","content":"So yeah. The transformation for you happened the first day you got here, I guess."},{"speaker":"Norman","time":"00:24:42-7","content":"Well, not so much the first day."},{"speaker":"Marcus","time":"00:24:45-5","content":"Well, let's say -"},{"speaker":"Norman","time":"00:24:48-5","content":"It's been a process because there was some things that I went through. I had some confrontations, some growing pains. I had some scuffs, and some scrapes, along the way. So I didn't get off the bus."},{"speaker":"Marcus","time":"00:25:05-8","content":"Right."},{"speaker":"Norman","time":"00:25:09-4","content":"Was a faith guy. I had, I had to process rather."},{"speaker":"Marcus","time":"00:25:13-8","content":"Right, well how long do you think that process took you?"},{"speaker":"Norman","time":"00:25:20-2","content":"To mature?"},{"speaker":"Marcus","time":"00:25:22-4","content":"Yeah, to come to the realization that you really needed to do something else, to find something else."},{"speaker":"Norman","time":"00:25:34-0","content":"I would have to say, if we was to go back to the parish jail, because I stayed two years in the parish jail. I guess, weeks or months. Till I came to the realization that this is all I have."},{"speaker":"Marcus","time":"00:25:57-0","content":"Was being in the parish harder than coming to Angola?"},{"speaker":"Norman","time":"00:26:00-5","content":"Yes, it was. It was because in the parish, when you visit, you're behind a cage and on the telephone. The visits here they're contact. It's a big difference, night and day, from the parish. There's a lot of freedom and you can do what you need to do. There's the law library. There's church, morning, noon, and night up here. There's exercise."},{"speaker":"Marcus","time":"00:26:36-2","content":"Sure, I don't really want to get into the details of the crime that you were convicted of, but when you think back on that and you think back on the victim, victim's family, and so forth. It's been so long."},{"speaker":"Norman","time":"00:26:51-3","content":"Yes."},{"speaker":"Marcus","time":"00:26:53-0","content":"And you've been punished every day for it. With, with all that distance away from it now, how do you feel?"},{"speaker":"Norman","time":"00:27:01-6","content":"I would have to say that I feel great empathy for the family and very, very sorry for anything, any hurt that they might have went through, or anyone else that may went through."},{"speaker":"Marcus","time":"00:27:21-7","content":"If a parole board were to, if you were to come before a parole board, they would expand edibility to young guys such as yourself and you had a chance. They are going to have your crime of conviction, your disciplinary record, they'll have some things that you will present them, but you'll have a short window of opportunity to let them know who Norman Dozier is today and what would you say?"},{"speaker":"Norman","time":"00:27:56-3","content":"Well that short window, I would have to say that I once was a seller of dope. But God has transformed me into a giver of hope. I would let them know that I am a minister, a pastor. I author, I've authorized 8 books. Self-help books, Christian books. And physical fitness, and spiritual, mental, and physical. And that I have a nonprofit organization called Mountain Moving Ministries that's helping people everywhere."},{"speaker":"Norman","time":"00:27:56-3","content":"That I'm president of a club here called the Man Prison Concept Club. That we take here people that are on the hospice wards. I'm a social mentor here and I, I'm in charge of getting, helping guys here rehabilitated as they exit this place and live productive lives. And I'm completely changed and it's not by word, but it's also in deed."},{"speaker":"Marcus","time":"00:29:04-8","content":"Okay, that, that's great. And what you have done does speak volumes."},{"speaker":"Norman","time":"00:29:08-5","content":"Amen"},{"speaker":"Marcus","time":"00:29:13-9","content":"Is there something prison administrators could do, and security in general, could do to help guys make the kinds of changes that you have made. Because not everybody is changing."},{"speaker":"Norman","time":"00:29:25-2","content":"No, everybody is not. As a whole, I believe administration with some of them could have more compassion in areas."},{"speaker":"Marcus","time":"00:29:43-6","content":"What is the worst thing that you deal with here at Angola? What is the worst thing about being in prison?"},{"speaker":"Norman","time":"00:29:47-4","content":"The worst thing is being away from my family and having to watch my sons grow up on pictures. That's the worst thing by far."},{"speaker":"Marcus","time":"00:30:00-0","content":"Yeah."},{"speaker":"Norman","time":"00:30:02-1","content":"Yes, it is."},{"speaker":"Marcus","time":"00:30:05-7","content":"What about the good stuff? What's the best thing?"},{"speaker":"Norman","time":"00:30:10-4","content":"The best thing I can say is being a blessing to people. To import my experiences to testify in the change in my life, to be able to allow them to see Christ in me. That that change might manifest in their lives. And I would have to say that being a blessing to those guys in hospice wards, being a blessing to the mentees going out there every day to that they can go out there and make a real and eternal impact in their lives. I would have to say that that's a rewarding thing to me"},{"speaker":"Marcus","time":"00:30:51-9","content":"Do you think it's likely that had you not been arrested, that you would've just kept going down that road and you could very well have not been alive today?"},{"speaker":"Norman","time":"00:31:09-0","content":"I know for a certainty that I would have been dead. Yeah, for sure, no doubt about it. Yeah, I been shot up twice with then, with, I think it was nine bullet holes left in my body and it was just God's grace on me then. But, I just couldn't see it. My mom and dad would cry out morning, noon, and night but I was blinded by the world and darkness."},{"speaker":"Marcus","time":"00:31:52-9","content":"When you're mentoring, as a social mentor, some of these guys in reentry, for example."},{"speaker":"Norman","time":"00:31:57-5","content":"Yes."},{"speaker":"Marcus","time":"00:32:04-3","content":"Do you see your former self?"},{"speaker":"Norman","time":"00:32:06-6","content":"All the time. I tell them that all the time. The first thing I tell them is some of them try to pull some slick things off and I, I let them know that I was you. So, before you even think about doing it, I've already done it. And they can sense, sense that I was a person that lived the life they were living. So, they really respect me. So, they take heed to my counsel."},{"speaker":"Marcus","time":"00:32:39-2","content":"You've done a lot of things that most anybody outside of prison would have been proud to become accomplished."},{"speaker":"Norman","time":"00:32:50-8","content":"Amen."},{"speaker":"Marcus","time":"00:32:53-3","content":"What are you most proud of?"},{"speaker":"Norman","time":"00:32:55-4","content":"I would have to say, I'm most proud of my books. My books. In one of the books that I, a lot of people, this book has blessed a lot, this book I wrote called Kingdom Shaping and it's a book concerning physical, spiritual, and mental fitness. And I'm in to fitness, I'm into working out, I'm into eating healthy, and one of the things that brought me to that was my father passed at 58."},{"speaker":"Norman","time":"00:32:55-4","content":"He was basically a young man due to obesity-related problems and that's one of the things I have shared with the people here about eating right and exercising. I was able to put this in a book, I actually have it right here. I put it in a book. I blessed, I mean tons of guys. People in it. I can't really keep enough of them because people have been blessed. So that's one of the things that really inspired me"},{"speaker":"Marcus","time":"00:34:04-5","content":"I'm sure you spend some time thinking about what your life would be like if they were to release you."},{"speaker":"Norman","time":"00:34:11-9","content":"Yes."},{"speaker":"Marcus","time":"00:34:15-4","content":"Do you have a very specific vision?"},{"speaker":"Norman","time":"00:34:19-2","content":"Yes, the vision that I have when I'm released is ministry. And going and being a blessing to other prisons in different, or different prisons, prison ministry. Being a blessing to prisons. Prisons indifferent. Prisons. And talking to a lot of youths and, possibly a church somewhere, and align God to allow my testimony to help and impact others that they won't make the same mistakes that I made when I was a young man."},{"speaker":"Marcus","time":"00:34:58-1","content":"How would you support yourself?"},{"speaker":"Norman","time":"00:35:02-5","content":"Number one, my mother, she's into real estate, and that will be one of my strongholds right there. My foundations in real estate."},{"speaker":"Marcus","time":"00:35:20-3","content":"Are there any vocational skills that you could get here that you think might be useful when you get out?"},{"speaker":"Norman","time":"00:35:29-3","content":"Well, one of the vocational skills that God has blessed me with is writing and I was for a few years, and I said earlier, that are they books. I really enjoy that. Writing and being a blessing to people. Inspiration."},{"speaker":"Marcus","time":"00:35:58-8","content":"So, I've really been looking forward to interview you ever since I've seen you featured in the hospice documentary."},{"speaker":"Norman","time":"00:36:07-7","content":"Okay."},{"speaker":"Marcus","time":"00:36:13-2","content":"And its, my good fortune that you popped up on the list."},{"speaker":"Norman","time":"00:36:15-6","content":"Its God's grace."},{"speaker":"Marcus","time":"00:36:18-9","content":"But is there a question I didn't ask you that I should have asked you. Something that you would have liked the opportunity to talk about that you think is important to share?"},{"speaker":"Norman","time":"00:36:28-0","content":"I think you probably covered everything."},{"speaker":"Marcus","time":"00:36:31-4","content":"Okay, well then, I'll end with one question."},{"speaker":"Norman","time":"00:36:32-8","content":"Okay."},{"speaker":"Marcus","time":"00:36:35-2","content":"What do you want the legislature to know about the reality of what it is to serve life without parole for so many folks that have rehabilitated?"},{"speaker":"Norman","time":"00:36:45-7","content":"I would like them to know that change is, is real. And that the person that we were when we were incarcerated is not the person that we are now. And I would like them to know and would hear it is to understand forgiveness and learn to forgive. And to look into and see that change and allow a second chance to be implemented"},{"speaker":"Marcus","time":"00:37:28-2","content":"That's a good place to stop."},{"speaker":"Norman","time":"00:37:30-9","content":"That's good."}]}