{"name":"","transcript":[{"content":"Patrick Lucien Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Go ahead and state your name the crime of conviction how old you were and how much time you've served."},{"speaker":"Patrick","time":"00:00:06-7","content":"My names Patrick Lucien I'm the youngest I mean the third oldest of 7 kids I've been locked up 27 years for second degree murder."},{"speaker":"Marcus","time":"00:00:19-9","content":"Okay and how old were you when you were arrested."},{"speaker":"Patrick","time":"00:00:22-5","content":"20. I was 20 years old I think I got arrested what December 21st 1991."},{"speaker":"Marcus","time":"00:00:30-5","content":"Okay, so I'm going to ask you a few questions about your childhood and kind of learn just about who you are as a person and then we'll work our way up to 1991 and then I'm going to talk about ask you to talk about life at Angola. So why don't we start by maybe tell me a little bit about the folks who raised you."},{"speaker":"Patrick","time":"00:00:55-7","content":"Well my mom and dad raised me my dad and my mom they always worked all the time my dad was a welder he used to work for U-Haul right there off Tulane across from that be where used to be at excuse me my mom."},{"speaker":"Marcus","time":"00:01:12-7","content":"So you're from New Orleans."},{"speaker":"Patrick","time":"00:01:13-8","content":"Yes."},{"speaker":"Marcus","time":"00:01:14-2","content":"Yeah."},{"speaker":"Patrick","time":"00:01:15-3","content":"My mom she worked over there in Metairie for New Orleans healthcare. So they took care of me I went through trials tribulations like everybody else me my older brother he was in he was here and the well before he came here we always was close all of us and my mom and dad they did the best they could do with what they knew and I'm thankful for that."},{"speaker":"Patrick","time":"00:01:15-3","content":"Because I had friends as I was coming up who didn't have a mother or a father some people didn't know who they father or they mother was and I used to be like I didn't look at the blessing in it that I had both parents whereas not saying there's anything wrong with my single parent but it made me feel different not that I was no better than anyone else but I was like wow how this guy functioning."},{"speaker":"Marcus","time":"00:02:16-7","content":"Well was your home a loving place a nurturing place or was there a lot of fighting in the house?"},{"speaker":"Patrick","time":"00:02:23-8","content":"Well like I said we our family had problems just like everybody else and it was a loving family it's just that I think my dad he didn't know how to love like he wasn't abusive or anything toward my mother or nothing like that but he had his issues as a man sometimes and I know this now at 47 that and I look back at that time that some time we don't learn how to express ourselves."},{"speaker":"Patrick","time":"00:02:23-8","content":"We don't learn how to love other people the way that we think it should be we try to give it the way that we got it and I think that's what the problem was for my father I'm thankful he's still around our relationship a little bit better it's not what it should be but I'm thankful I'm still around."},{"speaker":"Marcus","time":"00:03:14-6","content":"Right. How old were you when your brother came up here your older brother."},{"speaker":"Patrick","time":"00:03:20-3","content":"What Christopher was charged when I was 9 years old when he caught the charge and probably 10 or 11 when he came here?"},{"speaker":"Marcus","time":"00:03:31-4","content":"Ok and was he here when you came here."},{"speaker":"Patrick","time":"00:03:35-4","content":"As a matter of fact he was when I came here in 1993 he was on his way home."},{"speaker":"Marcus","time":"00:03:41-4","content":"Ok."},{"speaker":"Patrick","time":"00:03:43-2","content":"I never saw him before he went home but I knew he was here."},{"speaker":"Marcus","time":"00:03:48-3","content":"Ok and do you what's your relationship now with your siblings and your parents?"},{"speaker":"Patrick","time":"00:03:54-2","content":"Well it's kind of hard to say because me and my parents we talk me and my aunt who lives over in I see her more than anybody and I communicate with them through her or my sister in law Sheila and me and my brother me and my youngest brother we talk here and there it's not all that it should be but I thank God I still have a way to communicate with them."},{"speaker":"Marcus","time":"00:04:25-7","content":"Sure so your aunt she visits you I imagine up here."},{"speaker":"Patrick","time":"00:04:29-3","content":"Yeah she has a son here and I get when he visit his mom I get a chance to see her sometime."},{"speaker":"Marcus","time":"00:04:39-0","content":"Okay, anybody else visit you here."},{"speaker":"Patrick","time":"00:04:42-5","content":"I have a friend come see me recently that I been seeing for a couple years she come see me from time to time."},{"speaker":"Marcus","time":"00:04:52-1","content":"Do they also come up for the rodeo anybody?"},{"speaker":"Patrick","time":"00:04:57-0","content":"Believe or not my first visit with my mom and dad was at the rodeo."},{"speaker":"Marcus","time":"00:05:02-1","content":"Okay."},{"speaker":"Patrick","time":"00:05:03-3","content":"I didn't know they was coming but when they came I was happy to see them it had been like 26 years since I see them in person."},{"speaker":"Marcus","time":"00:05:12-9","content":"Oh wow."},{"speaker":"Patrick","time":"00:05:14-8","content":"It really kind of blew me away but it humbled me I know one thing god was in control because I had been praying for that time seeing them and when I see them I was thankful."},{"speaker":"Marcus","time":"00:05:27-4","content":"Sure so the last time you saw them in person was 26 years ago is that what you said."},{"speaker":"Patrick","time":"00:05:33-5","content":"Okay."},{"speaker":"Marcus","time":"00:05:34-0","content":"And then you still chat with them on the phone once in a while or through your aunt."},{"speaker":"Patrick","time":"00:05:39-5","content":"Through my aunt mostly because she she's the person that kind of sees everybody."},{"speaker":"Marcus","time":"00:05:44-1","content":"Ok got it got it so did you feel that growing up that there were adults that were genuinely interested and caring about you or did you feel that you kind of had to make it on your own."},{"speaker":"Patrick","time":"00:05:59-5","content":"I felt like there were some people that cared about me like I said my father he didn't really he didn't really know how to love but I know he cared about me because as I was growing up I was into my getting out of my teenage years I was about to make 20 or whatever he and I started talking a little more than what we used to and it really kind of caught me by surprise."},{"speaker":"Patrick","time":"00:05:59-5","content":"Because and we'd talk even if it was just for a few minutes I was just happy for that and he started it was to the point where he I actually felt like he was kind of proud of me because I was able to do for myself because some time I see him he just look he had a little smirk on his face but I knew I was I was getting there."},{"speaker":"Marcus","time":"00:06:51-5","content":"Right what about school how was school for you."},{"speaker":"Patrick","time":"00:06:57-7","content":"We moved a lot and I went to a lot of different schools between Orleans parish and Jefferson parish east Jefferson parish west Jefferson parish and some schools I went to I mean the elementary school experience it was cool but it was hard you moving all the time."},{"speaker":"Marcus","time":"00:07:18-1","content":"Which schools were you in?"},{"speaker":"Patrick","time":"00:07:19-5","content":"I went I mean ever since I can remember I went to Meyer from like 1st grade to probably about 4th grade and we moved over to over there in the Metairie area I still think we lived up there about a year or so after my grandmother died and then we came back on the west bank and I went to George cox for a minute and then after that wound up going to Marrero middle and from Marrero middle to L W Higgins."},{"speaker":"Marcus","time":"00:07:53-0","content":"Okay, and did you graduate from high school"},{"speaker":"Patrick","time":"00:07:56-1","content":"They just said I got a certificate of completion because I was considered a special ed student and they didn't give you didn't get a GED or nothing and that kind of irked me a little bit because I'm like as got I think in like 11th grade or so and I started realizing I got to make some changes here I want my mom and dad to be proud of me."},{"speaker":"Patrick","time":"00:07:56-1","content":"But I want them to know I'm trying to do the right thing when all my friends getting in trouble going to bars this that and the other and it hit me like was and there was this girl from a class previous and I asked her about it and I said we can graduate she said you not gone graduate they gone give you the certificate of achievement you not gone get a GED long as you in here and I'm like well you mean to tell me I'm doing all of this for nothing."},{"speaker":"Patrick","time":"00:07:56-1","content":"So I said well I'm full grown I want to do my little and she was right we they let us walk across the stage but we didn't get the didn't ostracize us or nothing but they didn't let us in I think it was lakefront arena where they held the graduation at I didn't go."},{"speaker":"Marcus","time":"00:09:13-8","content":"Okay."},{"speaker":"Patrick","time":"00:09:14-5","content":"I didn't go because I was ashamed. I was ashamed because I felt like what I'm going to school for and I remember my dad and my mom used to stay on me about staying in school and its because part of the reason was because my father was illiterate and by him being illiterate and he telling me go to school and I look at it later on it paid off."},{"speaker":"Patrick","time":"00:09:14-5","content":"Because before I even came here it was a lot of people walking around that was illiterate and I was like wow they had people that actually died for us to have a right to do this and here it is you not using it. So I that I was kind of discouraged but I still they put me in what's called work study program when I was at LW Higgins and they helped me get my first real job with benefits."},{"speaker":"Marcus","time":"00:10:11-9","content":"What was that?"},{"speaker":"Patrick","time":"00:10:13-8","content":"I was working for Jefferson parish water report right off of belle terrier west bank expressway and at first I didn't take it seriously I should have but they was teaching me a lot of things real fast. And I wasn't that fast at learning."},{"speaker":"Marcus","time":"00:10:30-9","content":"Is that where you were working when you caught this charge?"},{"speaker":"Patrick","time":"00:10:34-1","content":"As a matter of fact I was working I was working there and I had just lost a job and I had was supposed to reapply because I had a couple problems I didn't have a car I had to catch a bus to go to work and I talked to one of the supervisors and he told me he said just reapply."},{"speaker":"Patrick","time":"00:10:34-1","content":"So you can work just reapply say you just need the time off where you can get yourself together and decide how serious you gone take the job and I said thank you and then this happened."},{"speaker":"Marcus","time":"00:11:07-9","content":"Okay alright, and we're going to get to that were there other adults that were special in your life grandparents?"},{"speaker":"Patrick","time":"00:11:17-1","content":"Oh my grandmother for sure."},{"speaker":"Marcus","time":"00:11:19-5","content":"Okay, if you had to pick one adult would that be the one? Most special in your life?"},{"speaker":"Patrick","time":"00:11:27-0","content":"It would be hard for me to say I'm not lying it be hard because I love my mom I love all of my aunts they always treated me good and I kind of I guess you could say I kind of took them for granted because I didn't pay attention to everything they was telling me because if I was I wouldn't be here."},{"speaker":"Marcus","time":"00:11:50-1","content":"Sure I understand, what was your, do you remember your last interaction with your grandmother."},{"speaker":"Patrick","time":"00:11:59-0","content":"Yeah as a matter of fact my best friend at the time his name was Alan I wanted him to meet my grandmother and I told him I said man you meet my grandmother man she's something else and I know your grandmother so it'll be nice meet mine going to see my grandmother this weekend. So if you want come with us so you can get a chance to meet her and that's one of the last time I remember seeing her."},{"speaker":"Marcus","time":"00:12:23-9","content":"What did your friend think about your grandmother?"},{"speaker":"Patrick","time":"00:12:26-5","content":"He just thought she was funny because she was always doing something god bless her soul but my grandmother was something else."},{"speaker":"Marcus","time":"00:12:35-1","content":"Okay I assume she passed away."},{"speaker":"Patrick","time":"00:12:37-7","content":"Yes."},{"speaker":"Marcus","time":"00:12:38-1","content":"Ok what about your mother what was the last interaction that you had with her."},{"speaker":"Patrick","time":"00:12:45-0","content":"Let me see right the night when this here happened she told me she said man you don't need to go out you need to stay here those boys looking for you and what they said and you need to stay home you don't really need to go out I said oh ma well I'm going they ain't gone be there that's what I thought and that's the last time I actually talked to my mom."},{"speaker":"Patrick","time":"00:12:45-0","content":"She was getting ready to go to work that night and I remember that night and I replay that event every day because I remember my mom told me that and when I look at the things I pay more attention now than I did then and as I said I took for granted a lot of things she was telling me you don't think your parents have that foresight."},{"speaker":"Marcus","time":"00:13:46-3","content":"Right yeah so for all intents and purposes you would be a first time offender for anything serious other than shoplifting."},{"speaker":"Patrick","time":"00:13:53-9","content":"Yeah."},{"speaker":"Marcus","time":"00:13:57-1","content":"You mentioned a girlfriend earlier on that really in some ways was the path that got you into this mess I'm not suggesting she's responsible."},{"speaker":"Patrick","time":"00:14:08-3","content":"I would just say I would call her a girlfriend she was just somebody I was sleeping with."},{"speaker":"Marcus","time":"00:14:13-0","content":"Okay alright."},{"speaker":"Patrick","time":"00:14:15-5","content":"She understood I did have a girlfriend but I mean."},{"speaker":"Marcus","time":"00:14:21-0","content":"Tell me a little bit about intimate relationships that you may have had before this charge."},{"speaker":"Patrick","time":"00:14:26-5","content":"As far as intimate relationships I would say I had a few some I took more serious than others some I just we were just playing with each other and because you don't ever you never know what you don't know you think you doing an adult thing and you're not sleeping together is just a small part of it there's other responsibilities that entails that and you have to grow up to find those things out and unfortunately when I did grow up I was still a boy trying to act like a man."},{"speaker":"Marcus","time":"00:15:12-8","content":"Do you have any children?"},{"speaker":"Patrick","time":"00:15:14-3","content":"Not that I know of I was going around."},{"speaker":"Marcus","time":"00:15:18-7","content":"Sure so did you find it pretty easy to get access to a firearm?"},{"speaker":"Patrick","time":"00:15:28-1","content":"At that time? It was a lot easier then because matter of fact the firearm I had I had to put it together I had never know I was going to need it but I found a cylinder one of it and I found another part and the dude said well you got to put a there's this thing that screws in the middle. It was a revolver he said you got to get this thing that screws in the middle and it might work other than that it's a piece of junk."},{"speaker":"Patrick","time":"00:15:28-1","content":"So I kept this piece of junk all this time and I found the piece that go into it this. Like probably a year or two away before this stupid stuff happened so I had it but I never carried it around none of that stuff I didn't know I wasn't ever going to need it."},{"speaker":"Marcus","time":"00:16:18-5","content":"Right were drugs and alcohol a major part of your life coming up."},{"speaker":"Patrick","time":"00:16:23-6","content":"No I don't do any drugs."},{"speaker":"Marcus","time":"00:16:24-6","content":"Okay."},{"speaker":"Patrick","time":"00:16:26-2","content":"I watched a family member of mine go up and down first it start with the drink then they started with weed then they started with the rocks everybody was going crazy with that stuff and that kind of kept me."},{"speaker":"Marcus","time":"00:16:43-7","content":"Sure."},{"speaker":"Patrick","time":"00:16:44-3","content":"It kept me away from that stuff and I'm watching people that I used to respect now I don't respect them no more because now they stealing from hey own people and I know they stealing from me and I'm looking at this and I'm like wow the world is changing I was changing as well but that's the thing that's kept me away from drugs."},{"speaker":"Marcus","time":"00:17:07-7","content":"Sure."},{"speaker":"Patrick","time":"00:17:09-1","content":"I'd have a drink on the weekend sometimes but nothing serious."},{"speaker":"Marcus","time":"00:17:13-6","content":"So let me ask you something Patrick if you hadn't caught this charge or let's say when you went to try to make peace you were successful how do you imagine the rest of your life would have unfolded for you the next few months and years."},{"speaker":"Patrick","time":"00:17:34-6","content":"I don't know I probably would have been probably married or something like that might have had a house full of kids maybe I always think about maybe what would have happened if that I think about that as well and I always say well maybe it could have been this or that and some people that I grew up with I look at them today and they having success."},{"speaker":"Patrick","time":"00:17:34-6","content":"I'm looking at my younger brother and I'm looking at when I left they was kids now they adults and they have families for they own I'm like and I tell my younger brother every time I see him I say I'm proud of you because you stepped up and at a time when my parents they aging and their health is not as what I think it should be but he's he stepped up and he's taking care of them him and his wife."},{"speaker":"Patrick","time":"00:17:34-6","content":"And I told him is said bro I commend you because you did what no one else would and you blessed. Because you have somebody to help you because most of the time especially in today climate in laws don't get along too good and when you got somebody that will help you carry that burden man. You're blessed because nobody want to help nobody else when they have a problem people so self-centered this day and time that all they care about is what's happening with them thinking about they going to get old one day as well."},{"speaker":"Marcus","time":"00:19:04-2","content":"Sure when was the last time you talked to your little brother?"},{"speaker":"Patrick","time":"00:19:08-2","content":"Been a few months now."},{"speaker":"Marcus","time":"00:19:09-3","content":"Okay."},{"speaker":"Patrick","time":"00:19:11-1","content":"Every now and then I might write him on the kiosk they have a jpeg thing here and every now and then I might write him see where he might say something here or there but for the most part for him he always on the go somewhere."},{"speaker":"Marcus","time":"00:19:27-0","content":"Ok do you expect to see anybody that come visit you here for the next month next four Sundays of the rodeo?"},{"speaker":"Patrick","time":"00:19:38-0","content":"I'm almost certain of its I'm almost certain of its the thing about that is some of the people they're not on my visiting list that I probably wouldn't ever see otherwise it gives an opportunity for me to talk to them and I let them see the person who I am today times the person that they knew and some of the stuff."},{"speaker":"Patrick","time":"00:19:38-0","content":"Like this one person I this guy he's a couple years younger than I he said I thought you would be mad man because at the time we needed a lot of people a lot of people backed out I said what I'm going to hold that against you for I want these people to let me go so I got to learn how to forgive."},{"speaker":"Marcus","time":"00:20:19-8","content":"Yeah."},{"speaker":"Patrick","time":"00:20:21-5","content":"I said yeah I was upset because I felt like I did a lot of good to somebody but I never felt like nobody owed me nothing."},{"speaker":"Marcus","time":"00:20:29-7","content":"Let's talk a little bit about that so can you describe if you look back on the person the 20 year old Patrick what kind of a person was that how would you describe that young man?"},{"speaker":"Patrick","time":"00:20:45-5","content":"Well that person there I would say as I said before I was a boy trying to be a man trying pretending to be a man that is I didn't know all that other stuff. I didn't really care about the other stuff like when you do something you hurt the people that love you the most I didn't know nothing about none of that I was I was self-centered at the time. I was like most of the people on their day I was self-centered I wasn't thinking about nobody else."},{"speaker":"Patrick","time":"00:20:45-5","content":"I wasn't thinking about I was kind of selfish and I learned from not having anything after everybody forsake me just how to start really sometimes you got to share with other people and you got to understand that you got to do the things you want god to do for you. If you want god to help you got to help other people and that's the thing I had to learn. I learned that from guys in here there's a lot of bad things can happen to you here it's a bad place but even in the midst of the bad stuff there's still some good."},{"speaker":"Patrick","time":"00:20:45-5","content":"I talked to a few guys that was here way before me some of them have passed on say man if you ever push yourself on the side you start seeing other people the way you want them want god to see you that's when things start changing for you and it helped me it helped me it has helped me a whole lot I mean I ain't perfect I mistakes like everybody else but that's one of the few things I've held onto since I've been here."},{"speaker":"Marcus","time":"00:22:32-4","content":"Yeah sure and I wanted to talk about that too so do you remember the bus ride to Angola"},{"speaker":"Patrick","time":"00:22:42-5","content":"Yeah"},{"speaker":"Marcus","time":"00:22:42-8","content":"What was going through your mind?"},{"speaker":"Patrick","time":"00:22:45-1","content":"Well it was a lot of crazy stuff I said what I heard about this place I been up here a few times to visit my brother. So I know it's not a good place it was a different kind of like the administration that they have now and the previous administration when I came here warden Whitley was the warden here and when I was coming through on that bus ride. I remember this if I ever if I don't forget if I don't remember anything I remember the day I got here from the time we left form hunts to the time we got here and I'm looking they got some guys they putting on these blue jean outfits and stuff prison state apparel."},{"speaker":"Patrick","time":"00:22:45-1","content":"But everybody was going to Angola was getting white jumpsuits I was one of them I was looking at them and I said man what is this for said well and the guy that had been here like 2 or 3 times he had told me he said that he said man you going to the big house he said this is what they give you I said wow and all kind of all the old crazy stories running through my head."},{"speaker":"Patrick","time":"00:22:45-1","content":"But I was thinking about my brother who ain't nothing like 5'6\" or 5'7\" I said shoot if he made it here I'm the I could make it as well and I said I didn't have some fears because I didn't know what to expect he had these horrible stories and stuff you hear all that stuff and some of that stuff was true and when I got here and they had me up they used to take me up on the hill up there they there was a couple people that had been here."},{"speaker":"Patrick","time":"00:22:45-1","content":"When I told them my name they was standing around in a circle and they said that's Christopher Lucien's little brother they said you gone give us some trouble like your brother? If you are we got something for you and I'm like my brother he's his own man I'm my own man what that got to do with anything I've never been in prison or nothing before. So yeah so the first thing they did when you a young guy and I was what 22, 23 year old they take and seen you to the worst places in the prison it's kind of like throwing you to the wolves."},{"speaker":"Patrick","time":"00:22:45-1","content":"They send me around probably the craziest place and they don't have it I don't think they have line 36 no more but that's where they used to send a lot of young guys and they figure if you make it through that you'll probably."},{"speaker":"Marcus","time":"00:25:37-5","content":"Well tell me about that what was that place like?"},{"speaker":"Patrick","time":"00:25:41-0","content":"It was the working cell block matter of fact you passed it up on the way coming down. It's not like it was it's not like it was but it was a lot of crazy stuff I mean like I seen like my first probably aggravated fight and I was like probably the first time I went on the yard and I was like man these guys crazy man I would be fighting to get out of here instead of just sitting around beating up on each other."},{"speaker":"Patrick","time":"00:25:41-0","content":"I said man I ain't never going to let nobody do me that ain't going to happen and like I said I had my fears and you got to try to put your extra little mantra on because you don't want nobody to think you weak."},{"speaker":"Patrick","time":"00:25:41-0","content":"So this at that time the way this place was you had to almost be somebody else other than yourself I like being myself but I never let them never let nobody and there was a couple guys I knew that just came through and they was telling me what all they expect some of them told me the wrong thing some of them told me the right stuff like one guy told me said man you got to take the time and realize either you want to what you want to do to get yourself out of here."},{"speaker":"Patrick","time":"00:25:41-0","content":"He said you can do that through one of two ways he said you can die you'll get out of here for sure then or you can take the time use whatever opportunity that's afforded to you this guy told me this and he had been here like 2 or 3 times. So I said man you crazy you don't know what the hell I'm going through because all kind of things goes running through your mind and you go to thinking I might not live to get out of here."},{"speaker":"Patrick","time":"00:25:41-0","content":"As some time went on I had another relative who was here he told me well he told me that you didn't come here to stay man he said you not like us and you not like your brother my brothers now my brother went home at this time it's like 1996 around January 18 and January 16 or 18 I think and he said I'm he said he gone get you a pass I'm going to take you somewhere and I'm going to show you some people that's sincere they could help you, help yourself."},{"speaker":"Patrick","time":"00:25:41-0","content":"He brought me to this church group matter of fact its church god and Christ I used to be a member there and I was there he said this is this is the place where you'll find out everything you need every answer you need every question you have that need an answer he said that's where you'll find it at he said these guys here they not playing they not playing the kill nobody game or trying to rape somebody he said these guys are trying to help somebody."},{"speaker":"Marcus","time":"00:28:47-6","content":"Was he right?"},{"speaker":"Patrick","time":"00:28:48-6","content":"He was right he was right because I learned I participated with the church and I was a member there from like 1996 to probably 2009 and I joined."},{"speaker":"Marcus","time":"00:29:03-4","content":"Who were who were some of the main folks some of the pastors there?"},{"speaker":"Patrick","time":"00:29:06-9","content":"Pastor Wilfred Caine he passed away he was one of the people he always nobody could tell nobody just come people like to spread rumors and stuff nobody could tell him nothing about you but you he had this look he always I used to want to sit in the back because I didn't want nobody to see me and they had a couple young guys not that many and he always just say man he said are you kingdom living today?"},{"speaker":"Patrick","time":"00:29:06-9","content":"I say yeah I'm trying he said don't try you got to do it he said he said man look I could see that you probably a good person you might have made a wrong choice I don't know I'm not trying to judge you or nothing he said but he said no matter where you at he said you gone need god."},{"speaker":"Patrick","time":"00:29:06-9","content":"I don't care where you go you still gone need god you leave here you still going to need god I said yeah I know I'll try overdo it come on man go about your business and he always stopped me to talk about me I don't care where he see me at he always asked me a question and when he asked me the question I feel like man you now it's time before he passed away he did something I didn't think he would do he didn't ask me a question this time he just called me."},{"speaker":"Patrick","time":"00:29:06-9","content":"He said come here he said how long you been under this charge and I told him I forgot how long it was he said we need to start he said we got a whole young Christian in this place he said we need to start utilizing these guys because he said we not gone always be here so we need to give these guys something to do. And as time went on as he passed away."},{"speaker":"Patrick","time":"00:29:06-9","content":"Another pastor came in and they was having the discussion about how can they get young guys active they didn't have reentry and all of that stuff then and I said whatever you want if you really want my opinion the reason why a lot of young guys come in here they come in here they come they trying to find the answer they don't know what to do I said I know."},{"speaker":"Patrick","time":"00:29:06-9","content":"Because I was one of them they said but it's one thing if you get saved it's another thing you got to know who you are before you can say whose you are and I said you all got to give these guys something to do they don't want to be benchwarmers I don't think God called nobody to be the benchwarmer if that's the case Jesus didn't have to get crucified or whatever not to make this a church thing but he said matter of fact what you gone do matter of fact he said that's what we should do so I went to talk to the guy I wasn't trying to minister to him or nothing."},{"speaker":"Patrick","time":"00:29:06-9","content":"I said hey man if you want to do something man this is the church you can do something in if it ain't no more than just serving the coffee let the dude do something. If he get up and speak on youth night or whatever so it be. If he make a mistake and that worked for a while and as time went on me and former pastor we just had differences and I just got to the point."},{"speaker":"Patrick","time":"00:29:06-9","content":"I just I didn't want nothing to do with not with him not with him I didn't have nothing against the brothers in the church or that organization because I'm still friends with some of those guys to this day and I wound up joining another fellowship and I'm still."},{"speaker":"Marcus","time":"00:32:53-9","content":"In those first few years that you were here that you were talking about earlier. Did it sink in that you were serving a life without parole sentence?"},{"speaker":"Patrick","time":"00:33:06-8","content":"Yeah."},{"speaker":"Marcus","time":"00:33:08-4","content":"Now I want to ask you talk about some of the old guys and former pastor passed away while he was here when you see that part of you must also recon with the possibility that you could end up dying here."},{"speaker":"Patrick","time":"00:33:25-3","content":"Yes."},{"speaker":"Marcus","time":"00:33:26-1","content":"How do you cope with that over the years?"},{"speaker":"Patrick","time":"00:33:29-8","content":"Well. One of the things when I first came here the first couple years I thought of about it I said man I don't want to die here and I'm going to do what I can do to get out of here. I didn't know much about the law. I didn't know I didn't even understand the law I still don't to this day I don't understand much about it but I know I don't want to be here."},{"speaker":"Patrick","time":"00:33:29-8","content":"So and one of the reasons one of things I did was I had given myself the mentality of the possibility of dying here to it's a possibility I could leave here so I start blocking that out and I started I went I went to try to go the tech school or something and they would never let me go because I didn't have a GED and I said well I went to school for 12 years."},{"speaker":"Patrick","time":"00:33:29-8","content":"They said yeah but that doesn't mean anything if you don't have a GED I said well I went to school for 12 years I got a certificate of achievement now remember that conversation I was telling you before that what the girl told me it doesn't mean anything it's just a piece of paper so now I go to VO tech I can't go do this now I got to go to GED school. I really feel ashamed but I found out that a lot of things that I thought I knew I had to go back and relearn those things and how to do them better."},{"speaker":"Patrick","time":"00:33:29-8","content":"So I think part of the reason why a lot of places like this exist because they don't make education a priority like it should be because I realized that if you got people going to school and getting educated and they going to college and stuff like that they come back and they have the ability to create a job for themselves and job in the community when you don't have no education you limit yourself and I found out how limited I was."},{"speaker":"Patrick","time":"00:33:29-8","content":"Because if I lost the job working at the welding farm like I did. I couldn't probably go work nowhere else. Because that piece of paper didn't mean nothing. It was 1991. So I just think about it as to this time if I had still been out there had I lost that job I couldn't go get nowhere else I would have had to go to school anyway."},{"speaker":"Marcus","time":"00:35:56-0","content":"Sure."},{"speaker":"Patrick","time":"00:35:56-7","content":"So I found a way and I went to school and I got frustrated because I felt like I was ready and I wasn't I kept saying man I'm ready to take the GED man I ain't dumb and one of the tutors they told me said well we know you ain't dumb but you got to prove that to yourself. I said well I'm ready and I the lady got mad at me and she put me out of school and I got back in school."},{"speaker":"Patrick","time":"00:35:56-7","content":"I apologize to her and I did what I was supposed to do I got my GED and I went from there I went to carpentry school graduated carpentry school I work at the as an orderly at the a plant helper at the tag plant over there where they make the license plates. It just I went to the seminary for about two years that didn't work out well."},{"speaker":"Marcus","time":"00:36:55-8","content":"Okay, why didn't that work out?"},{"speaker":"Patrick","time":"00:36:59-7","content":"I had to deal with the reality that my parents might pass away while I was here and I would never get a chance to even tell them how I felt or nothing and then they had people stealing from them and stuff and like I was telling you my brother when he stepped in and to help my parents it kind of like was a burden off my shoulders and my mom she had Alzheimer's."},{"speaker":"Patrick","time":"00:36:59-7","content":"So she was always the person that take cares if there's business to be taken care of she would take care of it and when she was diagnosed with Alzheimer's I mean it hit me like a low blow then not to mention that I was out of court and I'm trying to tell them man I need help man I go to get the hell out of here because I could be more of an asset than a liability know and I know some stuff and I know I grown now and I know I hurt some people by the making the wrong choices."},{"speaker":"Patrick","time":"00:36:59-7","content":"One of the reasons why is because I was ignorant I didn't have no education I feel like they was dangling a carrot in front of my face that I wasn't never going to get. So I failed while I'm in the seminary I'm going through all this stuff and nobody understood me nobody understood I couldn't tell nobody at the time I could talk about it now because it's something I lived through it and but when I was going to seminary I felt like there was nobody I could tell what I was going through I couldn't ask my dad or nothing."},{"speaker":"Patrick","time":"00:36:59-7","content":"I called its some when I made this call my dad told me he said man they stealing from me and I'm like well who you talking about and it was some family members and I said and I'm thinking as I'm holding the phone all of the years my dad me and him we had our differences but all the years I never knew this man because he was crying and he was complaining to me."},{"speaker":"Patrick","time":"00:36:59-7","content":"He's my father and I'm like and the only thing I could tell him I said man its gone be alright I'm gone get somebody to handle it I don't know who but I'm going to talk to somebody I got a few phone numbers I don't know who I'm going to call I said I'm going to get somebody in the family that's gone take care of that problem so don't worry he said I further I want to say what you telling me this for? But sometimes you got to let people talk."},{"speaker":"Patrick","time":"00:36:59-7","content":"And when he did that I told him I said you don't even have to worry I'm afraid somebody and I'm going to look for my brothers my youngest brother Jeff I want to try to look him up and I talked to my aunt the one I told you about Rita and I told her and she said well somebody going to help him and she my cousin Bernard he stepped in and he took care of that so my brother got situated so he could help himself."},{"speaker":"Marcus","time":"00:40:21-7","content":"Right. And so I'm just trying to make sure I understand so one of the reasons that you stopped the seminary after two years is that you were just dealing with a lot of personal problems knowing that your parents are getting older and sick and you didn't have anybody to process that with."},{"speaker":"Patrick","time":"00:40:40-8","content":"You never know I learned through that experience you never know some people think of its school and I'm trying to tell the dudes I say man I'm going to seminary trying to learn to be a minister or whatever and I had some people some family members that's proud of me because I was there and I told them I don't know if I can finish this because I got too much stuff going on."},{"speaker":"Patrick","time":"00:40:40-8","content":"I explained it to them as sometime afterward but it was nobody until that and they said well that problem will take care of itself you need to take and get your little bachelor or social or whatever and I said man you all don't understand what's going through my head right now."},{"speaker":"Marcus","time":"00:41:30-2","content":"Sure when was this?"},{"speaker":"Patrick","time":"00:41:31-6","content":"This was I want to say 2016."},{"speaker":"Marcus","time":"00:41:39-2","content":"Okay so pretty recent."},{"speaker":"Patrick","time":"00:41:44-4","content":"Let me see yeah about 2016 somewhere around April."},{"speaker":"Marcus","time":"00:41:49-4","content":"Okay."},{"speaker":"Patrick","time":"00:41:52-4","content":"I had been there about 2 years and that experience it taught me a lot of things because I had even when I was going through that I was still studying in stuff and it made me pray a lot more. Because I didn't know what to I didn't have no other way to even deal with it."},{"speaker":"Patrick","time":"00:41:52-4","content":"Other than that even though I was talking to my aunt talking to my cousin this that and the other I ain't gone ever gone get through that and I start thinking about it wouldn't have been like that if I had been out there none of this would have ever happened and even when I when I quit the seminary."},{"speaker":"Patrick","time":"00:41:52-4","content":"I was parole you have to write a letter of resignation and you have to get a deposition about why explain to them what I just explained to you and they understood and I appreciated that so I found another way to do other things with my time I still was trying to achieve stuff like I said well I put myself in situations where I can challenge myself to do something else."},{"speaker":"Patrick","time":"00:41:52-4","content":"That's what I did because I wound up becoming a CPR instructor and I matter of fact I think I got that like last year or beginning of this year and I got certified."},{"speaker":"Marcus","time":"00:43:22-9","content":"Yeah I saw that in your folder."},{"speaker":"Patrick","time":"00:43:24-5","content":"Yeah I went through some stuff to get it and I got it and I figured maybe I could probably I do that that's my pastime I like teaching guys to do this stuff. Because a lot of time if you there's a lot of people here and sometimes the medical staff just ain't gone be able to get to them. So instead of waiting around if this person if you care about somebody if it's the person you want to help that's this guy in need so I teach them."},{"speaker":"Marcus","time":"00:44:01-2","content":"So earlier when I asked you about coping with life without parole you basically had said that you just decided to become just active learn things get in school get your GED get vocational trades and so forth and then that led you all the way to the seminary which then you stopped after having some just going through some personal things how do you how do you see the future now how do you make sense of life without parole at this point in your life."},{"speaker":"Patrick","time":"00:44:34-4","content":"Like I said I don't really think about the part about not being able to get parole I think about the part the possibility that I could get it because I even though my situation from a paper standpoint and things like that may not be all that appealing I know one thing that when it's all said and done."},{"speaker":"Patrick","time":"00:44:34-4","content":"God is in control because I don't believe he would open my eyes to my faults and show me all the stuff I got wrong and then show me the way to make a solution of those situations and not have an intended purpose for me outside these gates."},{"speaker":"Marcus","time":"00:45:21-5","content":"Sure I understand that let me ask you a little bit about the victim a lot of times people will say well the victim didn't get a second chance what about the victim. When you look back 27 years that you've been punished daily for this what are your how do you make sense of things what are your feelings now about the victim the victim's family all that happened."},{"speaker":"Patrick","time":"00:45:50-0","content":"Well me if I was to have a chance I would apologize to them and I would explain to them that I wasn't trying to really hurt nobody I was really scared I'm being honest with you I was scared I mean these people were known for shooting stuff up and selling drugs and doing all this stuff."},{"speaker":"Patrick","time":"00:45:50-0","content":"It wasn't like I didn't hear haven't heard of them and then they telling the police what they gone do to me and I understand that the family hurting and maybe they might they might want revenge or some sort of way or whatever."},{"speaker":"Patrick","time":"00:45:50-0","content":"What I'm speaking of when I say revenge they might want me to stay in prison all I'm asking for is give me a chance to get out of the prison and I would ask them that and I know their family hurting from talking to the brother the guys older brother I talked to him and me and him we friends and when I talked to him. I said man I never knew your brother and from what he the things he told me his brother was a great guy."},{"speaker":"Patrick","time":"00:45:50-0","content":"He was just out of town one night having some fun and he caught a stray bullet and I know that hurt his family because this guy they say he worked for Avondale shipyards and this that and the other."},{"speaker":"Patrick","time":"00:45:50-0","content":"So he had 7 kids and I look at it and I wish things was different I wish I wouldn't have never even decided to go out that night because if I hadn't went out that night they still have their father and that lady would still have her husband I didn't want to hurt nobody."},{"speaker":"Marcus","time":"00:47:49-6","content":"Right now I understand. There's also your family right whenever something like this happens there's not winners."},{"speaker":"Patrick","time":"00:47:58-8","content":"Right."},{"speaker":"Marcus","time":"00:48:01-6","content":"Their family also had to go through watching their second son."},{"speaker":"Patrick","time":"00:48:06-1","content":"Third."},{"speaker":"Marcus","time":"00:48:07-1","content":"Third son come to prison. I mean after Chris."},{"speaker":"Patrick","time":"00:48:11-9","content":"Yeah."},{"speaker":"Marcus","time":"00:48:14-7","content":"Another one of their children go to prison for life who in your family it has been the hardest for."},{"speaker":"Patrick","time":"00:48:23-4","content":"I probably would say it might be my brother Kim my second older brother he live in Illinois right now because he's one of the guys he's one of the kind of guys he's real quiet and he's what you would call I guess you would say introvert and if you was annoying him you tell by his mood the way that he move around that he was hurting and I think it probably hurt him more than anyone because even though man."},{"speaker":"Patrick","time":"00:48:23-4","content":"We were typical brother's stuff going on. But I only talked to him out of the whole time I been here probably about 3 times the whole time I been here. I been keeping up with him and he's been going he was going through some stuff the whole time I was in here even more when I came here and through those times when I talked with m y mother other family members I can tell he was hurting I can tell I can tell."},{"speaker":"Patrick","time":"00:48:23-4","content":"Because he wasn't one of those people that just outwardly expressed himself like that and by me talking to him those few times even to this day I ask about him I care about him I love my brothers I love them my sister included however I knew I hurt him I know that hurt him more than anybody."},{"speaker":"Marcus","time":"00:50:05-7","content":"This may seem like an odd question because its prison and you were saying it's a bad place but good things also happen in this place what is the worst part of this experience for you at this point in your life."},{"speaker":"Patrick","time":"00:50:22-0","content":"The worst part? The worst part is and I don't want to I don't want to come off the wrong way the worst part is and I pray to god I'm not wrong but the worst part is you run across somebody and they're having a bad day and the whether it be a person that's employed here or a person that's locked up here and they just going off and they talking to you like you just like you not even human at some point and you sitting there saying to yourself man."},{"speaker":"Patrick","time":"00:50:22-0","content":"I don't deserve this that's the time when that's the worst part for me and I just sit back and I say to myself they having a bad day it hurts my feelings at that time but I've learned how to deal with that that's the purpose of me praying. So I can get through that part because at this point some days like you said it's bad and good so you gone have good days and bad days as well."},{"speaker":"Marcus","time":"00:51:43-0","content":"Sure if you have a chance to go before a pardon board have you thought about filling out paperwork to apply for a pardon hearing?"},{"speaker":"Patrick","time":"00:51:53-3","content":"Of course I have I thought about actually I have I filled one out I just haven't turned it in yet and I'm all I can do is I can try."},{"speaker":"Marcus","time":"00:52:09-4","content":"Sure."},{"speaker":"Patrick","time":"00:52:11-2","content":"I pray that they give me the chance I'm going to make the most of it."},{"speaker":"Marcus","time":"00:52:17-2","content":"Sure so let's say you do submit your paperwork and they give you a hearing you'll have a little bit of time to tell them who you are they'll have your jacket and see all of the various certificates and so forth but what would you want to tell them a lot of times they'll say why should we give you a second chance how would you answer that question?"},{"speaker":"Patrick","time":"00:52:42-7","content":"If I was to answer that question if they asked me why should we give you a second chance I would tell them that I realize I made a mistake and at the time when this happened I was a scared person and I know now that I hurt somebody I hurt they family but this is what you get I mean I'm asking for mercy because I made a mistake I failed."},{"speaker":"Patrick","time":"00:52:42-7","content":"Not because I was trying to be brake not because I was trying to prove nothing to nobody but I made a mistake and that's all I could ask for is that they let me get a chance not just prove to them who I am let me prove it to myself let me be somebody and be an asset to the people out in society instead of a liability."},{"speaker":"Marcus","time":"00:53:49-4","content":"Let's talk about that so let's say that they let's say you do get your sentence commuted to a fixed amount of time and you become eligible for parole and you get parole how do you envision the next chapter of your life what would you be doing."},{"speaker":"Patrick","time":"00:54:07-2","content":"I want I'm going to do a little bit of construction work and I'm going to try to get it where I can teach people some of the things I learned here like CPR my brother my younger brother he does carpentry work already and I would like to teach him that as well I would like to teach his kids maybe me and him could work together."},{"speaker":"Patrick","time":"00:54:07-2","content":"We could create a little network where we could take a program that's to let these kids run around a lot of people I know when I was coming up I don't know about now they telling you to hit the books or you play sports and you have to hit the books a little bit well you go join the military and sometimes that's an option that's but there's other options as well."},{"speaker":"Patrick","time":"00:54:07-2","content":"If you teach somebody a viable trade where they can go help somebody they can live for the rest of their life if you give a man a fish he can eat for a day you teach a man to fish he eat for the rest of his life so the problem that we have with these kids and stuff I like to work with them and I'd like to teach some of the stuff I know."},{"speaker":"Marcus","time":"00:55:19-9","content":"Yeah sounds good"},{"speaker":"Patrick","time":"00:55:21-6","content":"Because that you got to give them a chance instead of they say idle minds is the devil's workshop. So if they sitting around they learn it from the friends you got a lot of single mothers and stuff and sometime you got to take the person that bearing the most unlikely of the circumstances to show someone that there's a possibility that you don't have to come this way. You can make better choices you can be better than the person that's teaching you."},{"speaker":"Marcus","time":"00:55:51-2","content":"Yeah sure of all the things that you've accomplished over the years what are you the most proud of."},{"speaker":"Patrick","time":"00:56:03-8","content":"Well one of them would be getting my GED because even when I went to school I was trying to get it and they was saying that well you a special Ed student you ain't gone be able to get this you ain't gone be able to get this and that girl was right and I said to myself well then if people look down on people because they're in special education. That doesn't mean that you're dumb it just means you learn different."},{"speaker":"Patrick","time":"00:56:03-8","content":"So I had to find the way that I knew how to learn because for the most part I was self-educated when I was in those cells going back and forth to the dungeon all this crazy stuff I always tried making my business I tried to learn something. So right now I'm using some of the stuff I learned here I'm using my carpentry skills matter of fact y'all came through the building right?"},{"speaker":"Patrick","time":"00:56:03-8","content":"You notice that sign in the front? I'm working on that project with a bunch of other guys that I went to school with as well there's a guy that's working with us he's teaching me a few things I don't know like his names Paul Thompson that's one of the guys that's older and he's teaching me some stuff I didn't know."},{"speaker":"Marcus","time":"00:57:18-8","content":"What's he teaching you that you didn't know?"},{"speaker":"Patrick","time":"00:57:21-9","content":"One of the things is how to take one of them old buildings like that that building probably been here since before it was born and we renovate it without having to destroy the whole building and he'd change the plans here and there but the progress when you doing the construction work it's a process."},{"speaker":"Patrick","time":"00:57:21-9","content":"I'd be looking at the stuff I be like and I was telling this to my family and my friend who comes visit me I said I'm actually I'm using the stuff that I learned I'm getting the hands on experience and I know it's going to be beneficial to me because I'm looking to my tomorrow to be outside of this place."},{"speaker":"Marcus","time":"00:58:03-4","content":"Sure so I've really enjoyed learning about you is there something that's important about you that we didn't get a chance to talk about something that I should have asked you?"},{"speaker":"Patrick","time":"00:58:16-5","content":"Well only thing I can say is if I was to say anything important about me I want to help other people I really do I want I want they have guys here some guys they was saying like the worst person in the whole world that I've learned things from and I'm even and I'm like dudes that man a person may say well what can you learn from him he's worthless nobody's worthless it's just sometimes you have to have those kind of people to help other people."},{"speaker":"Patrick","time":"00:58:16-5","content":"One some of the guys that I learned from was saying wow you did this this and this like I used to go to the dungeon a lot and I used to get into a lot of crazy stuff because I never got used to being in a place like this we had one guy his names Kevin brown he went home used to and he told me he said man. If you ever push yourself on the side you'd be the person god wanted you to be."},{"speaker":"Patrick","time":"00:58:16-5","content":"You're not who they say you are you have to be who he created you to be he said all that you can't fight it from the cell you can't do this from the cell you have to get to the point where you was to help someone else he said you take what I teach you and you will go far. At that time I didn't see it I really didn't I was like man I'm going back to the dungeon I don't that stuff."},{"speaker":"Marcus","time":"00:59:58-4","content":"What were you going to the dungeon for?"},{"speaker":"Patrick","time":"01:00:00-4","content":"At that time was work offense."},{"speaker":"Marcus","time":"01:00:01-9","content":"Work offense."},{"speaker":"Patrick","time":"01:00:03-0","content":"I didn't, I mean it was picking cotton and stuff and I was like man doggone Kunta Kinte nothing like that I didn't come up in that time and I understand I'm in prison and I understand you all sending me to hard labor. But this part I can't conceive I just couldn't get it through my head and they started saying oh they had gone break. They are going to break you. They're going to gmake you like an uncle tom or something I said not me buddy might be somebody else won't be me."},{"speaker":"Patrick","time":"01:00:03-0","content":"And I meant that. I feel like this I'm a little of a human being no matter where I'm at I just I made one mistake and I'm not my worst mistake which my worst mistake was the thing that led me here. And I tell myself that every day."},{"speaker":"Marcus","time":"01:01:02-0","content":"So when you refused to go pick cotton they put you in lockdown."},{"speaker":"Patrick","time":"01:01:07-8","content":"Yeah they put you in lockdown and you go to DB court and they tell you what they gone do to you at that time I think they gave me ten day isolation sometimes lockdown depending on how many times whatever it is that happened."},{"speaker":"Marcus","time":"01:01:24-0","content":"I see ok I think that's a good place to stop."}]}