{"name":"","transcript":[{"content":"Paul Mayho REDACTIONS FINAL"},{"speaker":"Paul","time":"00:00:18-8","content":"Good morning my name is Paul Mayho I am 51 years old. I committed second-degree murder in 1989 I was convicted of that crime in 1991. And I've been in Louisiana State Penitentiary for 27 years."},{"speaker":"Marcus","time":"00:00:39-9","content":"How old were you when you were arrested?"},{"speaker":"Paul","time":"00:00:42-0","content":"I was 22 years old."},{"speaker":"Marcus","time":"00:00:45-6","content":"Mr. Mayho I was going to start by asking you a few questions about your childhood before then and then also of course were interested in some of the changes that have happened in your life since you were convicted. But let me start by asking a little bit about the folks who raised you and tell me about them."},{"speaker":"Paul","time":"00:01:08-8","content":"My grandparents primarily raised me from 3 days old. They came and got me out the hospital and I stayed with them. My mother and father were 17, and I guess they just didn't have the time to raise me. Even though they stayed like downstairs. My grandparents stayed upstairs, in a fourplex and it was a good home. I had everything. I didn't have lack."},{"speaker":"Paul","time":"00:01:08-8","content":"My grandfather had a company, a lawn service company and yeah it was pretty nice. Growing up I had toys as a child. We had food and he was in a big hunting club, so we kept meat in the freezer and he showed me a lot of things out of work, how to fix my bicycle just things in general, how to prune a tree, how to cut the grass."},{"speaker":"Marcus","time":"00:02:06-2","content":"Who's your father? Was he in your life?"},{"speaker":"Paul","time":"00:02:08-0","content":"Yes sir he was in my life or in the sense of a neighbor. He was the neighbor, because he stayed downstairs with my mother. They were married up until I was 11 years old. He was there but he really didn't have a part in my life. He didn't play a part. He just was there."},{"speaker":"Marcus","time":"00:02:28-8","content":"Do you have siblings?"},{"speaker":"Paul","time":"00:02:30-1","content":"Yes I do. The one that I know of, that's like a next to me, he's 37 right now. Damien. He graduated from Ole Miss, he's doing well. He was living in Alabama. He was raised by his mother, so we weren't raised in the same house. I met him when I was about maybe 14, that's when I met him, and we formed a bond and my daddy told me who he was, And everything, and introduce me to his mom and everything. My mom already kind of like new so it was."},{"speaker":"Marcus","time":"00:03:11-1","content":"It sounds like you were kind of raised sort of like an only child."},{"speaker":"Paul","time":"00:03:14-1","content":"Yes, primarily yes. My grandparents raised me. I was the only child in the house they were like 57 years old when I was born. And they raised me I guess old school style taught me how to cook and fend for myself and do things. We had chickens in the backyard and hunting dogs and it's like it was kind of fun."},{"speaker":"Marcus","time":"00:03:36-9","content":"Was this in New Orleans? New Orleans east?"},{"speaker":"Paul","time":"00:03:38-2","content":"In New Orleans. No uptown."},{"speaker":"Marcus","time":"00:03:41-1","content":"Uptown. Whereabouts?"},{"speaker":"Paul","time":"00:03:42-9","content":"On Saratoga and Washington. Have like a graveyard across the street and incinerator and a bar room. It's the middle of the ghetto."},{"speaker":"Marcus","time":"00:03:56-9","content":"Yeah. What's your last memory of your grandmother?"},{"speaker":"Paul","time":"00:04:00-5","content":"Fun. I mean she was this little woman and she would just be like just fun. She really couldn't deal with the male child so and stuff it was more like she was a friend more than disciplinarian or someone to correct me. I guess you could say she let me get away with a lot of things and stuff because she couldn't keep up with me of course."},{"speaker":"Paul","time":"00:04:00-5","content":"My grandfather was working most of the time and when he wasn't working he was hunting. So I kind of like ran around a lot with the neighborhood kids and everything and just hang out and our backyard was real big, so a lot of the neighborhood kids would really be in my backyard and we would hang out and we had trees and a large yard so a lot of people like to be over there."},{"speaker":"Marcus","time":"00:04:54-8","content":"Sure. What was the last time you spoke with her?"},{"speaker":"Paul","time":"00:04:59-3","content":"She passed away in 2005 around June. So like maybe about a year before that I talked to her she was in the nursing home and then had her like third stroke and I spoke to her again, about a year later she passed. It was like, I expected it. Made me sad it was like matter of fact for some time like years I would actually go to the phone and call her number like she's going to answer but it's just like I guess grieving."},{"speaker":"Marcus","time":"00:05:35-0","content":"What about your grandfather?"},{"speaker":"Paul","time":"00:05:37-1","content":"He was a good part of my life also, like I stated earlier he was The Punisher if I done anything wrong and my grandma told on me he was the one to break the belt out and I would get my mind right. And as a child I guess I hated him for that because I felt like you beating me why? But as I got older and realize he was just trying to love me the best way he knew, now he's passed away also."},{"speaker":"Paul","time":"00:05:37-1","content":"He passed maybe about 3 years so maybe about 2008-9 somewhere in that time he passed in his sleep. He was 95 years old, didn't have any health problems, and just went to sleep. But he was an intricate part of my life from day one. When I came to prison he would come see me if I needed money he would send it to me and everything he supported me and I really appreciate it in my life."},{"speaker":"Marcus","time":"00:06:42-2","content":"So would it be fair to say that you grew up feeling loved and cared for?"},{"speaker":"Paul","time":"00:06:46-2","content":"Definitely by my grandparents. I knew I was loved. I knew I was cared for, I didn't have no doubt with that aspect it was kind of frustrating at times to have my mom and dad live right downstairs and they didn't really interact with me, even with my father, I'll never forget this man he came home and he pulled in the driveway and me and my friends are out on upstairs porch and we out there about maybe five or six of us and he came home and he spoke to everybody else except me. And I'm like wow all right."},{"speaker":"Paul","time":"00:06:46-2","content":"So be it, but he's kind of like a not too sociable, he's like I guess you want to say educated to the point where he is not in touch. He has four college degrees one of them is from Loyola and he's just not in touch. He's not a sociable person even my siblings now I have a little sister that's like 23, 24 another one about 27 and it's the same with them even though he raised them in the house with them it's like strangers."},{"speaker":"Marcus","time":"00:08:07-6","content":"What did he do for a living?"},{"speaker":"Paul","time":"00:08:08-7","content":"My father? He's the first black flight attendant for Delta Airlines. He's still got today and it's like about 46, 47 years. Yeah he's still that today."},{"speaker":"Marcus","time":"00:08:23-5","content":"What does your mom do?"},{"speaker":"Paul","time":"00:08:25-1","content":"She passed away also in 1999, she passed away she used to be a secretary for judge Gerard Hansen in criminal District Court, she was with him for like 15 years and she kind of like went off on the deep end with crack and stuff like this and one thing left to another thing and she had an aneurysm and after that I had to be the one to tell the doctors to pull the plug on her, because there was no coming back."},{"speaker":"Paul","time":"00:08:25-1","content":"She went into a coma from a poisoning and all her skin burn off of her body so she couldn't live like that. So I told them to pull the plug and I believe that was kind of like the turning point in my life because it's like messing me up spiritually because her mother was into the voodoo thing and she died a horrible death. I mean she caught on fire from the inside. Combustible explosion."},{"speaker":"Paul","time":"00:08:25-1","content":"And it happened twice and the second time it actually killed her. And then I'm looking at my mom how she died from a chemical reaction that burnt her up and I'm like, wow, that's too close to hell for me and I kind of like got into the church here and started studying and I went to Islam, I went to Christianity because it scared me. It's like my Grandmamma died like this, my mama died like this I know both of them was like"},{"speaker":"Marcus","time":"00:10:00-0","content":"Was this like a religious ritual? That they were engaged in that burned them?"},{"speaker":"Paul","time":"00:10:05-4","content":"No, my grandmother is just kind of happened. It's just like something that happens, like it's rare, it's rare but it happens when you just catch on fire from the inside just something just explodes. With with my mother when she went into the coma from the aneurysm they gave her penicillin not knowing she was allergic to it and it burnt all the skin off her body. Like I said that scared me."},{"speaker":"Marcus","time":"00:10:37-2","content":"Sure. Do you have a specific person that you think of as a friend you were closest to Growing Up?"},{"speaker":"Paul","time":"00:10:49-0","content":"I would say two. The guy that stayed next door to me, Reginald. We grew up like from baby to maybe about 12 and then he moved away. His family moved away and I became friends with another guy, James. His mom and my mom grew up together and we became good friends up until 18, 19 years old and stuff I went to Florida and he went his way and stuff."},{"speaker":"Marcus","time":"00:11:27-2","content":"What was school like for you?"},{"speaker":"Paul","time":"00:11:30-8","content":"It was always interesting for me because I like to learn. I'm fascinated by learning things I don't know. I like to read a lot. Kindergarten through 4th grade was a little problems. It was a Catholic school because my daddy wanted me to go there and I just didn't fit in, if you want to call it that, because most of the kids were from other neighborhoods."},{"speaker":"Paul","time":"00:11:30-8","content":"And I was from like the hood projects and so I guess I was acting out and then I got kicked out of school, out of that private school and then they put me in public school and things just kind of balanced out for me. I was with the regular, I'm used to being within the neighborhood and everything it and it's like learning came easy to me, so I would actually find myself helping the other kids with homework even understanding what the Blackboard work is and stuff."},{"speaker":"Paul","time":"00:11:30-8","content":"So I matter fact I used to cut my school and go to a magnum school when they have a substitute teacher because I wanted to learn more. It was offering more. I had a little girl friends if you want to call it that and they would go like we got a sub today in this class there I go but school was fun for me."},{"speaker":"Paul","time":"00:11:30-8","content":"I was like popular, I mean I was driving cars, my mom I have her car and stuff, and I don't know whether I could say this on camera now but she was like the biggest Dope dealer in New Orleans at that time. So we had a little money and cars I have nice jewelry and clothes and stuff like this so that kind of like made me popular. I didn't have no problems swallowing it it was just kind of like blew me up but school was fun."},{"speaker":"Marcus","time":"00:13:32-4","content":"Did you finish school?"},{"speaker":"Paul","time":"00:13:33-5","content":"Yes sir I did. I finished 12th grade I walked $$ Then I started going to Cameron College on Canal Street. I wanted to be an architect. I went through a semester of that but then something took a turn with drugs and alcohol and I started paying other people to do my work for me. I'm not just led to just a fall. And after being called into the counselor's office a couple of times, like what I make more money than you I don't need this."},{"speaker":"Paul","time":"00:13:33-5","content":"So I dropped out of there went to USA trade Academy which is a truck driving school in Pensacola Florida. I finished second in the class. I came back to New Orleans. I got a good job by the moving company, driving 18-wheelers and, basically, that's where my love of traveling took off. I'm always moving and going around but at the same time I'm selling drugs and drinking and doing drugs so it's kind of like I was living like a double life if you want to call it that."},{"speaker":"Marcus","time":"00:14:41-1","content":"Did your mom kind of school you into how to be successful with that?"},{"speaker":"Paul","time":"00:14:46-4","content":"Yes, she did. From 12 Years old. That's when she divorced my father, because he's a square and she's the partier, and they just couldn't get it together. She asked for a divorce and everything and she moved around the corner from the house I was raised in. At 12 years old she invited me to a party and they had drugs and alcohol and everything else you want to name, and she introduced me to it, and her friends."},{"speaker":"Paul","time":"00:14:46-4","content":"She told me to always be responsible when I'm getting loaded, doing things like this here. Don't be too flamboyant with it just be normal, that's what inspired me to always get a job, keep a job, not have no Mercedes-Benz, just have a regular Chevrolet. But yeah I would say she contributed to my crime life."},{"speaker":"Marcus","time":"00:15:44-5","content":"Did you ever get kicked out of school?"},{"speaker":"Paul","time":"00:15:46-5","content":"I got kicked out in 4th grade."},{"speaker":"Marcus","time":"00:15:50-2","content":"From the catholic school"},{"speaker":"Paul","time":"00:15:51-2","content":"From the catholic school holy ghost, I got kicked out of there. I got accused of something that I didn't do. I had done it previously, but I didn't do it this time, and I still got accused and the nun hit me on the hand with the ruler. I had to stand there and get the ruler on my hand and stuff and it kind of like picked up a chair and hit her with it and that was the end of that."},{"speaker":"Paul","time":"00:15:51-2","content":"I felt like I was defending myself, because you had wronged me, even though I was guilty previously of, I think it was shooting spitballs, but this particular time? I didn't do it."},{"speaker":"Marcus","time":"00:16:27-1","content":"What about after 4th grade?"},{"speaker":"Paul","time":"00:16:29-0","content":"After that, I mean I would get suspended for fighting, things like, I mean nothing out of the way I mean, I was excelling in school, and I love school. I would occasionally get suspended."},{"speaker":"Marcus","time":"00:16:45-3","content":"So you're driving trucks? So how far would that take you from home?"},{"speaker":"Paul","time":"00:16:52-4","content":"By me being under 24, I could go only go three states away. Right, Louisiana, Mississippi, Texas, this way Arkansas, that away"},{"speaker":"Marcus","time":"00:17:01-9","content":"Okay, but then you also had this, double life, as you said. You're supporting yourself with other means as well. What about girls? Is there somebody who stands out in your memory as being?"},{"speaker":"Paul","time":"00:17:18-7","content":"I taught from my grandfather, my father I mean, I had plenty of them. Now I mean my very first girlfriend Sharon, she was like and I say first in the sense of we had intercourse, I had other girlfriends before her but it wasn't intercourse, so I call her my first. I was 16 and she was 15 and at the same time I had another one which was my second one, and so it's kind of like juggling them, one went to one school, one went to the other school."},{"speaker":"Paul","time":"00:17:18-7","content":"They were like night and day. It was nice I mean I had a good time with them, when I say good time, not just sex. Actual good time. We went to the parks, the fair, the movies, to the mall, just doing fun things that teenagers do"},{"speaker":"Marcus","time":"00:18:13-0","content":"How about in your 20s?"},{"speaker":"Paul","time":"00:18:16-0","content":"Into my twenties will at 17 I'm at what turned out to be my permanent live-in girlfriend June and we got together by 18 we moved in our first apartment together and we was like husband and wife. We bought a new car together, a motorcycle and we rode, she had a love for bikes like me and my father rode bikes"},{"speaker":"Marcus","time":"00:18:43-9","content":"Where would you ride?"},{"speaker":"Paul","time":"00:18:45-4","content":"We would go down to Florida. To the coast what I'm saying, to the beach and Alabama, Mississippi beach."},{"speaker":"Marcus","time":"00:18:51-7","content":"What did you ride?"},{"speaker":"Paul","time":"00:18:53-1","content":"Well I had several bikes I mean my first bike I rode was the 750 Honda that was when I was 12 years old on Dell University front lawn my mom Friends by who let me ride it and I fell in love then based off of the bike that I first bought for myself was a 550 Suzuki and after that I just kept going up?"},{"speaker":"Marcus","time":"00:19:18-8","content":"Sure yeah I like them too so what about kids?"},{"speaker":"Paul","time":"00:19:26-3","content":"Well I have two kids that I don't know. Both of the females were pregnant 5 months when I got locked up. I don't know whether they're girls or boys, never met them, don't know I don't know where they at or nothing."},{"speaker":"Marcus","time":"00:19:43-5","content":"But they exist."},{"speaker":"Paul","time":"00:19:45-8","content":"The females told me that they was mine, so that's all I can go on."},{"speaker":"Marcus","time":"00:19:49-4","content":"One was June's?"},{"speaker":"Paul","time":"00:19:50-8","content":"No, at this time it was other people now, Sonya and dang I lost my mind, oh Sarah."},{"speaker":"Marcus","time":"00:20:08-3","content":"Who visits you here?"},{"speaker":"Paul","time":"00:20:11-0","content":"Now in the last 18 years I call her my wife, she's my fiancé, we're not legally married. Her name is Cynthia Tony; she's a pastor at New Orleans. We've been together since 1999. I met her one time on the street at City Park and she remembered me and she reach out to me when my mom died and I was stressed out and she reached out to me and it turned into what it is now."},{"speaker":"Paul","time":"00:20:11-0","content":"She comes like every 2 weeks to come see me, and everything she's by my side, it's like there's nothing better. She comes to the Banquets that we have and everything and then she visits every two weeks."},{"speaker":"Marcus","time":"00:20:53-8","content":"So do you I know you said you were selling drugs where drugs and alcohol part of your daily life as well at that time?"},{"speaker":"Paul","time":"00:21:07-9","content":"From the time I was 14 until I came to prison at 25 yes. It was a daily part, I mean cocaine, weed, pills, and beer. I wasn't too much on wine. I don't really like sweet drinks or opioids, no, because I'm not a down person, I'm upper and by me doing the truck-driving thing and driving so much trying to juggle home and everything else I wanted to stay woke and I wanted to have energy, so cocaine was the drug of choice and the beer kind of balanced it off so to speak."},{"speaker":"Paul","time":"00:21:07-9","content":"As a matter of fact, the first trustee job I got here in prison 17 years ago was Heavy Equipment. I was driving a drunk truck coming down one of these roads and a car was coming to me and I panicked and I'm like wow and I realized something, I never drove sober before. This is my first time driving sober and it just freaked me out, like it just looks strange for a car coming at me, and I'm like man and it messed me up."},{"speaker":"Marcus","time":"00:22:23-0","content":"Do you remember the first time you got arrested for anything?"},{"speaker":"Paul","time":"00:22:26-2","content":"The first time I got arrested I was 12. My love of bikes at that time from that first ride me and one of my friends were walking out in the street and we seen a 900 Kawasaki. And we stole it. And we didn't know what we was doing and guess where I was on Loyola campus and coming down on freret coming out the driveway on freret the police call was coming in and I didn't know how to stop the bike and ran slapped into it."},{"speaker":"Marcus","time":"00:22:59-4","content":"You were 12."},{"speaker":"Paul","time":"00:23:00-6","content":"I was 12 and I made my 13th birthday in the kiddy Bureau, my mom's boyfriend was a judge, she came and got me out and that was another turning point I think because I was scared to death because my mom she was kind of like vicious when you make her mad and I'm saying oh Lord I know I'm in trouble, and when I went to her house I walked in her bedroom. She was on the phone with my aunt In Chicago and the words I heard shocked me."},{"speaker":"Paul","time":"00:23:00-6","content":"She was saying, my baby he's a man now, he even went to jail, he's not a square like his daddy. Now I'm like, she hung the phone up and she came and she hug me and she said, ain't nobody done you nothing huh? And I said, no, ain't nobody done me nothing. She said you had to fight?"},{"speaker":"Paul","time":"00:23:00-6","content":"I said, no, I didn't have to fight. She said we going shopping, and she took me shopping elaborately. I mean it was like a great reward that she gave me for going to jail. And then she told me this here, she said look when you get in trouble just give him the judge's phone number, he going to get you out. I'm like wow all right. And that's why I started doing."},{"speaker":"Paul","time":"00:23:00-6","content":"Every time the police stop me, call the judge. And it worked. And I mean as long as it wasn't murder, rape and all this stuff, just petty stuff, I mean I was all the way in Nashville, Tennessee and got in a little fight and gave the sheriff, the judge called him and he called him and he let me go. So I guess I kind of put me in at a disadvantage because I didn't have no respect for law then."},{"speaker":"Marcus","time":"00:24:39-4","content":"Yeah, you've just got away with it."},{"speaker":"Paul","time":"00:24:40-6","content":"Yeah right I mean I'm being backed up. Anything I get into as long as they ain't too bad I can get out of it."},{"speaker":"Marcus","time":"00:24:51-0","content":"So if we just set this last charge aside for a minute would it be fair to say that your life was already going down the wrong road and if it wasn't this it would have been something else."},{"speaker":"Paul","time":"00:25:07-5","content":"I'm more than sure. I can't see a murderer as being a real future, if I hadn't committed this one but yes with drugs probably I would have come to prison behind drugs. I got away from the theft thing that just didn't make no sense to me. Stealing somebody hard-earned property just didn't make no sense to me."},{"speaker":"Paul","time":"00:25:07-5","content":"Drugs was lucrative, it was fun, and it was really easy to do. And it took care of all the expenses outside of my normal bills and stuff but yes definitely I probably would have been in prison for something else."},{"speaker":"Marcus","time":"00:25:55-4","content":"Ok. And it's there obviously are complex set of things that lead to that you have a whole life history that leads to that. If you could point your finger at one main cause of you going down that wrong path what would it be?"},{"speaker":"Paul","time":"00:26:12-8","content":"I would say pleasing my mom. She actually wanted a gangster. I made it 14, she took me to the jewelry shop and she put two earrings in my ears. And she said I want you to be a gangster, I don't want you to be a square like your father. And just to please her, because everything came from her, the drugs came from her, alcohol the car I'd like to drive without a license."},{"speaker":"Paul","time":"00:26:12-8","content":"I mean the partying, I mean anything I wanted money-wise, just go to her and she can give it to me and I'd have to go deliver some drugs for her whatever but hey it wasn't but nothing. So just to please her, I would say was the factor"},{"speaker":"Marcus","time":"00:26:54-6","content":"Sure. And your grandparents they couldn't- they knew what was going on?"},{"speaker":"Paul","time":"00:27:01-3","content":"No, if you didn't see me, you didn't know. I mean my neighbors asked me, how is it that you can drive a new car and jewelry and stuff and you just got a regular job? No one knew what I was doing, except my mam, my other sister, my brother and June. No one knew what I was doing."},{"speaker":"Marcus","time":"00:27:24-7","content":"Ok sure. So one of the reasons that we wanted to talk with you is that you are considered rehabilitated, a trusted member of the community, a trustee, somebody who's turned their life around."},{"speaker":"Paul","time":"00:27:40-5","content":"Right."},{"speaker":"Marcus","time":"00:27:46-2","content":"But I just want before we talk about that which is the main thing will get to can you describe for me the young man who was escorted through those gates. In to Angola. What was he like?"},{"speaker":"Paul","time":"00:28:03-1","content":"Arrogant. That young man at 25 years old, well 24, I made 25 like 3 months later after I got here."},{"speaker":"Marcus","time":"00:28:13-5","content":"I'm sorry you spent some time in the parish right?"},{"speaker":"Paul","time":"00:28:17-3","content":"Well yes 3 years passed between the crime and me getting here"},{"speaker":"Marcus","time":"00:28:21-6","content":"Okay yes sorry I didn't mean to interrupt you"},{"speaker":"Paul","time":"00:28:24-7","content":"But yes very arrogant, strong-willed, I was like 300 lb. then, and I grew up fighting. I grew up being stabbed, I had been shot three separate times. I had then overdosed three times. So nothing scared me. I heard all the stories about prison and was like so what? I can handle my business. So I came here I came here, I came here with the understanding that you knock somebody out and just make the showing for myself and everything will be all right."},{"speaker":"Paul","time":"00:28:24-7","content":"I wasn't scared in the sense of life sentence because my mom and the judge promised me I'd be home in 5 years. So I wasn't scared, I was looking at it as a vacation that's what I really was because periodically would make appointments to go to drug rehabs and stuff to get help for myself but I would never check in."},{"speaker":"Paul","time":"00:28:24-7","content":"So I looked at this time as a vacation from the drugs from all the women just wild living. So when I came here, the person that came here, I was confused. I didn't really know what had happened, what I'm saying, because I thought I was going to be rescued. And so it didn't really set in on me what really happened, what I'm saying, so I wasn't no real change when I came here. I still was into drugs. I still was fighting. I still was going to the dungeon."},{"speaker":"Paul","time":"00:28:24-7","content":"I still was disrespecting people what I'm saying and I'm I had a lot of friends, women friends that was coming to visit me like every day of the week, I had plenty of support from the outside and I had money so I guess it was like nothing really changed other than I had to be confined to a certain area. But like after about the 6th year and I realize that wow they told me 5 years and I'm not out yet then I think I started taking things a little more seriously."},{"speaker":"Paul","time":"00:28:24-7","content":"But I still didn't know how to adjust to being controlled so I rebelled I continue fighting gone to the dungeon and all this stuff here and it's really when I got to Camp D in 1998 that's really when it shocked me. I had been here what 7 years then and I'm because the main prison was the first place I came to. So I got to know everybody there and everybody got to know me but when I went to Camp D in 1990 nobody know me. So now it's like alright what now and that's when it really hit me man I'm in prison."},{"speaker":"Paul","time":"00:28:24-7","content":"I got to do something. I got to do try to find a way to get on the positive road because what I was getting into in the Main prison, I was making homemade beer, drinking, smoking weed, doing pills. The free people kicking my door in and going through my locker box and going to the dungeon. All the fighting and stuff and it's like this ain't making no sense at all. I'm just going round and round and round, I mean I got free people telling me I'm watching you, I'm going to catch you."},{"speaker":"Paul","time":"00:28:24-7","content":"I'm just doing things my whole life, the first seven years here was revolved around getting finding a way to beat the free people out, to lie to them, to trick them, to make them think that I'm not doing it but I am doing it and when I got to Camp D it's like man this is just not making any sense no more so Change went to starting in my mind. And it didn't happen overnight. But I was contemplating change, when I realized I was just tired of going around in circles."},{"speaker":"Marcus","time":"00:32:14-8","content":"What was your day like? What were your days like in those first seven years?"},{"speaker":"Paul","time":"00:32:18-9","content":"The days in the first 7 years they was full they was full new environment new people and trying to impress people people trying to impress me. Like I said I was 300 lb so I was very like unhealthy and when I looked at other guys my age all older than me and seeing them pumping iron and running and playing ball and I'm like wow I can't do that. And I purposely asked a friend of mine he pumped iron a lot and I said man look teach me how to get healthy."},{"speaker":"Paul","time":"00:32:18-9","content":"So they started working with me and I started losing weight and pumping iron too, playing basketball and I had a job in the kitchen. I was a cook and so my days was full from like 1:30 in the morning till like 9 at night and that's what it would consist of going to work in the kitchen, cooking, working out, playing basketball, watching the TV and then going to bed. So it was pretty full."},{"speaker":"Marcus","time":"00:33:21-6","content":"What's your typical day like now?"},{"speaker":"Paul","time":"00:33:24-0","content":"Right now my days are still full. Every morning I get up at 4:30 basically I get up I read my Bible I pray. The rest of the guys cannot come into the game room part of the dorm until 5 so I have 30 minutes by myself, so I go in there I pray sometimes. I get a little overwhelmed and some tears come out. I don't want nobody to see that. So I'm happy for the little 30 minutes I get and from there I get to reading and stuff I might do a little writing, jotting some notes down."},{"speaker":"Paul","time":"00:33:24-0","content":"I used to be an assistant pastor and now I'm a minister at another fellowship, so I get my notes together in case I'm going to preach or something like this. I have a teaching I have to do and then at 7, we go to breakfast and then after breakfast around 6:30, back to the dorm at 7 we go to the chapel with the mentees, I'm a mentor and we go with mentees to the chapel and let them have a motivational meeting in the morning."},{"speaker":"Paul","time":"00:33:24-0","content":"And then from there I might go to the compound and go to Mr. Abbott office or do paperwork we have meetings that we have to take care of different guy's business that they need taken care of and then around lunch time I go in the dorm to be counted and then after I get to eatin its kind of like down time I might just chill out and read a book I'm going to do a little studying some like this here and then after that for the 4 o'clock count we counted in the dorm and then normally on Monday, Wednesday, Friday I jog."},{"speaker":"Paul","time":"00:33:24-0","content":"I like to jog a lot I've been jogging since I was about 14 I wasn't fat as a teenager I got fat when I was about to 18. June cook good. I jog on Monday Wednesdays and Fridays no less than 3 miles. That's just to keep me going and that clears my mind when I'm jogging I can pray I can think straight everything is just feeling good. And then when I come back from that shower am I watching TV program and then by no later than 8:30 I'm in bed."},{"speaker":"Marcus","time":"00:35:38-3","content":"So are you part of Malachi dads?"},{"speaker":"Paul","time":"00:35:41-6","content":"No, I'm not even though I have on that t-shirt. No I'm a part of the new Destiny Ministries, that's a church group that's here. I have been a part of different groups, Toastmasters, several different groups I've been apart of over the years. They offer self-help classes that I have, completed, gotten certificates in life skills, things like this and 100 hours, just so much to better yourself, to learn who you are and how you can function better in a society with other the people."},{"speaker":"Marcus","time":"00:36:21-5","content":"I'm going to ask you a little bit about the crime that you were convicted of. When you look back on that 27 years have passed and you've been punished every day for it when you look back on it and the victim victim's families what is it that you feel?"},{"speaker":"Paul","time":"00:36:50-3","content":"I feel disgusted. I feel disgusted. And I think 5 years ago or maybe 5 years ago I got my DA files, it was the first time I seen a picture of this man that I killed and I'm like, wow, and I just sat down on my bed and I just stared at this picture. Like this was a lot of lost lover, I'm like wow, I kill this man, I was like man and then I'm wondering how his child fared out, what happened to him?"},{"speaker":"Paul","time":"00:36:50-3","content":"He had a son I believe and a daughter something like this, but it's like what do I tell these people, what I'm saying? In 2005 his mother tried to contact me through a program they have with DoC where the victims can talk to the perpetrator"},{"speaker":"Marcus","time":"00:37:46-1","content":"What's that called? The victim restoration?"},{"speaker":"Paul","time":"00:37:49-1","content":"Victim reconciliation something like that. In the program is set up where representatives from DOC get with me two times. In the third time, that's when the victim or the victim's family comes and I was instructed just to sit there, if she cussed me out whatever just accept it because I took something from her, and I agreed to it. I signed the papers and everything and I was actually looking forward to just telling Miss Gloria I was sorry but Hurricane Katrina came and I never got to have a visit and about a year later."},{"speaker":"Paul","time":"00:37:49-1","content":"I wrote the office in Baton Rouge asking what was going on with the meeting, was it still going to happen and they said well after Katrina we don't have no contact, we tried to find her we don't know what happened and I'm like wow so about 6 or 8 months later I wrote another letter, because I really wanted to tell this woman I'm sorry. Because to my understanding her and my mom talked and it was an exchange with \"Your son took my son\""},{"speaker":"Paul","time":"00:37:49-1","content":"I'm like, wow, that's deep. I just wanted to tell her I'm sorry I didn't want to make excuses, I didn't want to try to water it down, I'm sorry that's all I wanted to tell her but I didn't get a chance so that's something else I got to live with."},{"speaker":"Marcus","time":"00:39:32-8","content":"I know I've talked to a lot of guys here who talk about you just got to have hope, but from 4:30 to 5 in the morning when you have a little peace, I'm sure that you have moments where you really do have to confront the fact that you may never leave here and it's something that's difficult to think about, how do you cope with that?"},{"speaker":"Paul","time":"00:40:04-6","content":"Well it's not easy. As the trustee for 11 years it was part of my job description to dig the graves for the other inmates who went on. That would mess me up. Because sometimes some of them were made for my friends and just to see them going in that ground and on the tractor truck, or whatever I was driving at the time, when I pass that graveyard, there was one on each side and I would just get despair, and it was like man it would just be to the point where I'm ready to shed tears."},{"speaker":"Paul","time":"00:40:04-6","content":"And when I see myself, it's like I don't see that, I just block that out, I will not see myself dying here, so this is why I try my best to exercise workout and don't even think like that, because I think if I start thinking it, It will take a toll on me, so between praying, Friends, support to talk to, just when I'm a depressed, when I'm just feeling down or whatever the case is, just having that support whether it's from the inmate or the pen pals or my girl."},{"speaker":"Paul","time":"00:40:04-6","content":"I do that and I pray a lot and I'm just trusting God. I mean I have a poured everything in me into the word of God that I believe in and this is this is what keeps me strong. it's nothing else because I see people dying everyday and I see people getting old every day but I'm just staying focused and trying not to see myself like that because I believe if I see it it'll happen."},{"speaker":"Marcus","time":"00:41:51-9","content":"Sure. So just avoid it."},{"speaker":"Paul","time":"00:41:53-9","content":"Right."},{"speaker":"Marcus","time":"00:41:55-2","content":"Okay. Do some people in your experience just give up?"},{"speaker":"Paul","time":"00:42:02-2","content":"Yes, I know a lot of people who have given up."},{"speaker":"Marcus","time":"00:42:05-8","content":"What is that like?"},{"speaker":"Paul","time":"00:42:07-8","content":"I really don't like to be around them. When they express to me Man I ain't never going to get out of here I'm just going to eat all I can get get fat guy. I try not to even be around them no more, I don't like that kind of people. The dorm I was in 11 months ago I was sleeping next to a guy and that's the attitude he has, I mean his family or his wife sends him a lot of money and he just eat, eat, eat, he's like 400 lb And he just eat and he's miserable."},{"speaker":"Paul","time":"00:42:07-8","content":"I ain't getting outta prison, I may as well enjoy myself. All right, fine do you, but I just it was like man I hate sleeping next to this person. What I'm saying, I got depressed just looking at him. Every day all day he just laying in bed just lay there I mean you periodically he get upset up and eat take a shower and come back and get right back into bed now I was like wow it's disgusting to me how can you give up on yourself because I'm not a quitter."},{"speaker":"Paul","time":"00:42:07-8","content":"I mean on the street in 84 a friend of mine committed suicide and I'm like why? Tomorrow is a possibility that tomorrow and I just couldn't fathom me giving up I'm just not a quitter and sometimes that's to my bad that I don't know how to back down but I think it's a survival tool that I use that keeps me going forward."},{"speaker":"Marcus","time":"00:43:38-5","content":"Yeah I understand."},{"speaker":"Paul","time":"00:43:39-0","content":"I'm not going to quit on me."},{"speaker":"Marcus","time":"00:43:43-1","content":"So that's kind of look at the glass half-full and say say that they do expand parole eligibility for folks that committed their offense when they were very young and you go before a parole board, What will you tell them?"},{"speaker":"Paul","time":"00:44:02-1","content":"I would tell them that I came here ignorant of everything. I just I was ignorant all right I was caught up into something that was way over my head. I got into something that I didn't understand what I was doing. It happened but what happened now I made a change because I realized I needed a change as I said earlier in 1998 when I got to Camp D it was like something ain't right here. I'm tired. I would tell them that in 2001 I got stabbed and that was it."},{"speaker":"Paul","time":"00:44:02-1","content":"That was it. I mean I had to change. It was physical change, mental change, spiritual change that's it. I would tell him that today the person I am is not who I was then. I mean because I know that one crime don't pay, it just don't pay it, no matter how much money you make how glamorous it is how many women how many cars it don't pay. Because this is 27 years in my life that's gone and I can never get them back I will let them know that even though I am very remorseful I'm mad."},{"speaker":"Paul","time":"00:44:02-1","content":"I'm mad at myself because I ruined my life. I mean that's what I did in my high school yearbook it was deemed most likely to succeed. For me I didn't succeed. So I let them know that I'm mad at myself but I made myself a promise but I'm going to be better I am better. And that if you give me another chance I'll show everybody on better. One of the reasons why I floor so much a Ministry is because I try to teach others not to be whom I used to be."},{"speaker":"Paul","time":"00:44:02-1","content":"When I see him I gravitate more towards the younger guys and older I still think I'm 26. But at the same time I always try to instill in the man so I get it now don't wait till you're too old get it now the opportunity is here. And I try to help everybody I can because I have changed. And at the same time I have sisters out there and I don't want anybody to kill them, rape them, rob them or put them on drugs."},{"speaker":"Paul","time":"00:44:02-1","content":"So if I can help somebody see that man these are people lives that are being ruined not only just your own but your whole community I would actually show them that if you let me out of here if you let me out of here I'll be an asset to you. I'll be an asset to the whole community."},{"speaker":"Paul","time":"00:44:02-1","content":"Because I don't want nobody to rape, kill or rob my wife. My wife to be. And this would be my plight that I never want to come back to prison again. I don't like this. I don't like being controlled. I don't like being told what to do. When to do and how to do it. I don't like that this is not a way for a man to live. And when I use the word man I'm a human being. This is inhumane."},{"speaker":"Marcus","time":"00:47:03-9","content":"Let me talk about that a little bit. Let me get you to talk about it. There are lots of Deprivations of prison. What's the worst part of it for you what has been the worst part of this experience?"},{"speaker":"Paul","time":"00:47:18-2","content":"I think the worst part of Prison for me is going to the dungeon. That's the worst part. I mean no one can help you. Once that's cell door closed behind you your life is in someone else's hands, you don't know what's going to happen to you, you don't know how long you're going to be in there, you don't know whether you're going to eat, you don't know then whether you're going to shower, if you don't have toilet paper in there with you. I mean you're helpless and that scares me."},{"speaker":"Marcus","time":"00:47:45-8","content":"Is that a single man cell?"},{"speaker":"Paul","time":"00:47:47-1","content":"Yes, single men cell sometimes if it's crowded they have two people in there but normally it's one person to a cell."},{"speaker":"Marcus","time":"00:47:58-3","content":"Is it something to do with the solitary time that you don't like there?"},{"speaker":"Paul","time":"00:48:02-5","content":"I don't like being in solitary. I don't like not knowing. I don't like being out of total control. I just don't like it. This is the part of prison that scares me. I don't like the dungeon. But that's what shaped me into being a better person because I don't want this for myself."},{"speaker":"Marcus","time":"00:48:26-4","content":"Right got it. There is a lot of Good things that happened here also. What's the best part about it?"},{"speaker":"Paul","time":"00:48:31-0","content":"The best part about it is to me is church, to me that's the best thing. I mean it help me, it saved me. In 2000 Pastor Eric and Pastor Steve, Steve gone home, now Eric is right around the corner they caught me. they were from Maine prison and they were the first missionary pastors to come to Camp D after Bible College and they seen me and I was in the middle of doing something crooked and they stopped me and they said it's time to make a decision."},{"speaker":"Paul","time":"00:48:31-0","content":"Do you want to be a part of church, do you want to be a part of the world, what do you want to do? I said wow alright what's happening in church? So they started ministering to me and mentoring me And teaching me how to read the Bible for myself and praying and stuff like that so I would say the best part of prison in my sight is a church."},{"speaker":"Marcus","time":"00:49:20-9","content":"Yeah I can understand that. Is there something that I think that there are a lot of people who want to who are interested in improving the prison experience in making it more meaningful. To create more opportunities for people to living meaningful life in prison. Is there something that prison administrators could do security could do to help people make those changes faster than they are currently making them?"},{"speaker":"Paul","time":"00:49:55-5","content":"I believe in the capacity that security in and with direct contact with the inmates basically is being done. I don't see really nothing one way or the other that could be added or taken away. I mean I've been here 27 years. I've encountered numerous amount of officers, young, old, white black, rank, no rank everybody's different personalities. I think for the most part most of us who really want to change see you need to change, what securities during is working and that's just my opinion. It worked for me."},{"speaker":"Marcus","time":"00:50:38-8","content":"Sure."},{"speaker":"Paul","time":"00:50:41-3","content":"I mean if you don't mind me adding this here. If it wasn't for the hardcore security officers, the ones who write me up for everything, the ones you put me in the dungeon, the ones who threaten me, then that wouldn't inspire me to change. It wouldn't have give me incentive to change."},{"speaker":"Marcus","time":"00:51:02-3","content":"Yeah I understand that. What are you proudest out?"},{"speaker":"Paul","time":"00:51:12-7","content":"I'm proudest that I went its automotive school and got certified in the break section. I was in the AC-section before they pulled me in to be a mentor. I've been messing with cars for a lot of years on the street, mechanic shop was down the street from my house, so I was always over there asking questions I like to know."},{"speaker":"Paul","time":"00:51:12-7","content":"My first car came from them $500. They pointed to 1 and told me what to do and gave me the wrenches there are went. My grandfather showed me little things he knows not the best but he showed me what he knew."},{"speaker":"Paul","time":"00:51:12-7","content":"And then I have a little brother that's younger than me, like one year younger than me and so for whatever reason he learned mechanics. So we would get into stealing cars and taking Parts off of and doing this so I like cars. I like fixing on my first trustee job was Heavy Equipment where I had to learn how to be a diesel mechanic and all the stuff here dealing with trucks and tractors and so forth."},{"speaker":"Paul","time":"00:51:12-7","content":"So when I asked to be put in the school, I went to warden and I said man I've been serving in prison for 21 years. I would like to serve me now can I go to school? And she said man yeah you can go to school and she put me in Automotive and stuff and I went over there and it was like this is me, this is me and stuff and I got certified and everything and they wanted me to stay over there but this was a better offer being a mentor social Mentor so I came here."},{"speaker":"Paul","time":"00:51:12-7","content":"I can so I can go over there I still go over there and visit and I visit and every now and then I can show the student something I know. So it works out."},{"speaker":"Marcus","time":"00:53:04-4","content":"So when you envision your life, away from here, what does that vision?"},{"speaker":"Paul","time":"00:53:14-9","content":"Well, first of all I have to take away all the negativity that I have. From my girl to everybody else. It's hard out here. No it is not hard out there. When I was out there I had three jobs. Jobs are easy to get. You just got to know how to work and you need the want to work. That's all so my main picture of me getting out of here. I'm gone get a job. I'm going back to truck driving school for six weeks."},{"speaker":"Paul","time":"00:53:14-9","content":"I'm gone be the top of the class this time. First time I was the second. This time I'm gone be the first. And I watch the news. I read the paper. And stuff. They're begging for truck drivers. They start you off like $54000 a year. Then I'm coming out of prison making $20 dollars a week. That's a good come up. So I can see myself going through this year. Getting me a good job, and stuff I have planned. My plan is save every cheque. Just save every cheque."},{"speaker":"Paul","time":"00:53:14-9","content":"And once the year is over with then I can go buy my wife a new vehicle. Pay for it. We don't have to get in debt for that. And I'll take care of that. I envision myself having more connection with home. Because that's something I never did when I was out there. Home was take a shower or go to bed and that's it. But now, being in here for sure, I know how to be comfortable which is being, watching TV, being with family."},{"speaker":"Paul","time":"00:53:14-9","content":"So I see myself doing good out there. I mean really I see myself actually, doing good. I mean legally. I was doing good before but not legally."},{"speaker":"Marcus","time":"00:54:52-2","content":"Sure. I really enjoyed what you had to say and talking to you is very valuable. Is there something I should have asked that I didn't ask you? Something that you think people should know? Or something that people, the legislation maybe should know? About what's going on here?"},{"speaker":"Paul","time":"00:55:15-0","content":"I would say not so much focusing on us, the prisoner. The inmate, but focusing on the family that we have. They didn't commit the crime. But they're being punished too. Cynthia has been with me for 18yrs. She wasn't with me when I was free. She knew me then but she chose to be in my life and for the countless of men, that have met ladies and married them or was already married, that have children out there."},{"speaker":"Paul","time":"00:55:15-0","content":"That was young, and then they growing up with their fathers in prison. It's not the families fault. That the person done what they done. So I would say that if the legislator is concerned about the population of Louisiana as the citizens that are not incarcerated, think about the family members of the ones that are incarcerated. They didn't commit a crime. So them being punished for being in love or having love for us. So that all I want to be heard."},{"speaker":"Marcus","time":"00:56:18-8","content":"That's a very good point. Good place to end. Thank you very much Mr. Mayho."},{"speaker":"Paul","time":"00:57:13-8","content":"Thank you."}]}