{"name":"","transcript":[{"content":"Ralph Dawson REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"If you could just start by stating your name, crime of conviction, your age at the time, and how much time you've served."},{"speaker":"Ralph","time":"00:00:09-5","content":"My name is Ralph Dawson. I'm convicted of second-degree murder. I was 20 years old at the time of the crime."},{"speaker":"Marcus","time":"00:00:17-7","content":"How much time did you serve?"},{"speaker":"Ralph","time":"00:00:18-7","content":"I've served 32 years now."},{"speaker":"Marcus","time":"00:00:21-5","content":"The purpose of this is for me just to learn about you and who you are. I've got some questions that I'm going to ask you about your time before this charge and then we're going to shift gears and look at what you've been up to and some of your experiences managing with a life sentence in this prison. Let me start by asking you about your childhood and the folks who raised you. Tell me a little bit about your family."},{"speaker":"Ralph","time":"00:00:52-3","content":"Well, there's my mother I have my father there's a stepfather and then there's who's not really a stepfather then I have a brother and a sister. My brother and my sister are both younger than me. I'm the oldest of three."},{"speaker":"Ralph","time":"00:00:52-3","content":"My sister is a year younger than I am. My brother is five years younger than I am. My mother and father were divorced when I was about five and at that time we went to live with my mother's parents, my grandparents. We stayed there until I was about ten."},{"speaker":"Marcus","time":"00:01:25-7","content":"And where is this?"},{"speaker":"Ralph","time":"00:01:27-7","content":"I was born in Park Ridge, Illinois. Most of this takes place in the suburbs of Chicago. A couple of cities before we went to my grandfather's house and then there's his house and then another city. I call them cities, but they're townships maybe small places. And then following that when I was about 12 or 13 we left that area and went to the Dallas area."},{"speaker":"Ralph","time":"00:01:27-7","content":"We started off in an apartment there maybe when I was when I started going to junior high school was that junior high school? No that would have been somewhere in that timeframe maybe eighth grade we moved to a house and we were renting a house and we stayed in that rental house until I graduated high school until like five years later. I don't have much memory of life at home with my dad and my mom. There are some bits and piece memories."},{"speaker":"Marcus","time":"00:02:38-9","content":"Do you remember them being divorced right after your younger brother was born?"},{"speaker":"Ralph","time":"00:02:42-9","content":"Correct. My dad blames my mom. He's probably right, but it's not for me to judge or speculate, or even be concerned about that."},{"speaker":"Marcus","time":"00:02:58-7","content":"Let me ask you. Are your parents living?"},{"speaker":"Ralph","time":"00:03:01-8","content":"My mom is living. My stepdad is living. I assume my dad is living. I haven't had contact with him probably in 13 years. He disappointed me and offended me. He doesn't even know it. So, I couldn't that's another story. But, I couldn't maintain the relationship knowing what I knew. I was probably wrong for what I did and the way I looked at it though it felt right at the time. And, I'll share that with you at some point. It's just I'm working kind of chronologically here."},{"speaker":"Ralph","time":"00:03:01-8","content":"Like I said, there are memories. There are some good memories of my dad around the house. There are some negative memories. I think my mom's biggest problem is that he wouldn't hold a job. When they fussed and argued, he would hit the road for months and months at a time, but he had issues of his own from when he was growing up. Far worse than mine here. I'm telling you."},{"speaker":"Ralph","time":"00:03:01-8","content":"So, there's some understanding there. So, go from that to living with the grandparents and that as a childhood I would have to actually say was the most peaceful time of my childhood."},{"speaker":"Marcus","time":"00:04:32-2","content":"What's your age at this point?"},{"speaker":"Ralph","time":"00:04:33-9","content":"At that point, let's say 10 to 13. No, no, I'm sorry 5 to 10 years old. I was there until up about the time that I was 10 years old. There were issues with my mother being afraid that my dad was going to try to kidnap us because she wouldn't let him have nothing to do with us. There were some visitations that lasted a little while and my mom was pretty much my best friend. We were tight. Where she was, that's where I'm going to be. Not that I was a mama's boy."},{"speaker":"Ralph","time":"00:04:33-9","content":"What I'm saying. But, that was my partner. We didn't socialize much because they were so afraid they meaning my mother and her parents were so afraid to let us out of their sight. My mother was working two jobs trying to pay off debts from previous to the divorce. But, my grandparents cared for us. Meaning my grandfather had a house that he built himself in the 40's. A nice home. My mother probably sold it in the 90's maybe for $600,000. A nice home on a double lot."},{"speaker":"Ralph","time":"00:04:33-9","content":"In the winter time, he would sometimes take the garden hose out there and he would hose and it gets cold up there around the bird bath this big old yard and create an ice ring, so that we could skate in the yard. In the summer time, I remember my grandfather he would make sure that we had watermelon root beer in the cooler in the basement. When my grandmother knew that we were being abused, she would get choked up. I could see tears."},{"speaker":"Ralph","time":"00:04:33-9","content":"Even now forming in her eyes. Just knowing how her hands were tied and she couldn't do anything about it. The ways I've just shared with you about my grandmother and my grandfather these are the ways that I know that they specifically cared about us. It wasn't that they spoiled us. You understand. My grandfather was very frugal with money."},{"speaker":"Ralph","time":"00:04:33-9","content":"My grandmother didn't work. And even now when I look back I think about my grandfather and the man that he was a very independent man. He was a first-generation German immigrant. I have a great deal of respect for him. A great deal of honor to some extent. There were not always good times. We're kids. My brother and sister and I we had some fun times. We had some peaceful times."},{"speaker":"Marcus","time":"00:07:27-4","content":"And you're associating most of these good memories with your grandparents?"},{"speaker":"Ralph","time":"00:07:31-3","content":"Living in that house. Living in that place."},{"speaker":"Marcus","time":"00:07:34-7","content":"And then, what happens when you're 10 years old?"},{"speaker":"Ralph","time":"00:07:37-3","content":"When I'm 10 years old, my mother meets a man who we're talking about 1976, 1975 when it's just not proper for women to divorce. So, you have a divorced woman with three kids. Not going be too easy to find another man. She really does not want to live at her parents' home. I don't know that. I find out later on."},{"speaker":"Ralph","time":"00:07:37-3","content":"So, she's looking for somebody. She wants to get back out on her own. She wants to get back out on her feet. Try to make something of herself. She has a good job with a decent company, a well-known company. So, she meets the guy. At first, he was ok. Not a spoiling kind of fellow involved with us."},{"speaker":"Ralph","time":"00:07:37-3","content":"You know what I mean, but as it turned out, he was a pretty strict disciplinarian among other things. So, you figure from the time of 75 to 84 when I graduated high school it escalated continually. My brother was what they call a target child. I've talked to people about this stuff and they said that there's always a target child. My brother was the target child."},{"speaker":"Ralph","time":"00:07:37-3","content":"I was the protector in a passive kind of way meaning trying to draw attention from I mean my brother's five. He's not going to withstand much. He used to get beat for talking to himself as he's playing in a bedroom by himself. Anyway, I could tell you so many different things that are just so foul so wrong. If it had happened today, my mother and him would have went to jail without a doubt."},{"speaker":"Ralph","time":"00:07:37-3","content":"He's not a very bright man. I truly believe that he was influenced by an evil force because there was things that he did that he didn't have any. The rule of warfare is divide and conquer and he did that he did that. He separated us from our mother in the dynamic of the household and then he turned us against each other us kids tried to very hard. It wasn't completely successful, but it satisfied."},{"speaker":"Ralph","time":"00:07:37-3","content":"I think his greatest concern was getting us out that household one way or another. So, there was a lot of angst in that home. I don't want to be there. My sister doesn't want to be there. My brother wants the same he's five years younger he wants the same privileges that we have. He doesn't want to be there either."},{"speaker":"Marcus","time":"00:10:58-0","content":"Is your mother picking up on any of this?"},{"speaker":"Ralph","time":"00:11:00-8","content":"Yeah, she knows. It's nothing hidden. There were times whenever it escalated to the point my stepdad we called him pops because he didn't think it was appropriate to call him by his first name, nor did he think it was appropriate to call him by his nickname, nor did he think it was appropriate for us to call him dad, so we called him pops. Pops was a Mexican American and group up on the south side of Chicago during a very violent time. He was involved with gangs."},{"speaker":"Ralph","time":"00:11:00-8","content":"He had some experiences of his own. And I say that to say that we all have a history that creates who we are and who we become. That doesn't justify anything. That doesn't exonerate him of anything, but his treatment of me and my family had a great deal to do with who I became at 20 years old. It had a great deal to do with the broken child within me with the frustration. But, he would try to push my buttons."},{"speaker":"Ralph","time":"00:11:00-8","content":"He would try to make me rare up. I have too much respect for my elders."},{"speaker":"Ralph","time":"00:11:00-8","content":"Anytime it got to the point where mom thought that I was fixing to maybe get physical, then she might intervene. He was verbally I call it verbally abusive."},{"speaker":"Ralph","time":"00:11:00-8","content":"Anytime you holler at somebody or criticize continually criticize somebody about what they should be doing, instead of my mother would tell him about her day or whatever at work this thing that well you should be doing this or you should be doing that with raised voice that's abuse to me."},{"speaker":"Ralph","time":"00:11:00-8","content":"So, that's going on as well. He was pretty much an oppressive individual. He wanted me to be tough. He wanted me to be able to defend myself and he went out of his way to make sure that I knew how to fist fight."},{"speaker":"Marcus","time":"00:13:35-2","content":"How did he do that?"},{"speaker":"Ralph","time":"00:13:36-6","content":"Well, it started off when I came home with a black eye from school first time. Matter of fact that might have been the only time. It was on the bus. It was a new school. I know if was a new school and a guy wanted my seat on the bus another student the dude hit me in the eye. I said take it man, you can have it. So, I got the black eye and he was like no that ain't going to work. So, he sent my mom to the store for two pair of boxing gloves."},{"speaker":"Ralph","time":"00:13:36-6","content":"She came home with the boxing gloves and he stayed up with us all night I said us you'll see in a minute because he made me fight him and learn how to fight, jab, and all that good stuff and then he made me fight my sister a year younger than me and then he made my brother fight with me and then he stayed home from work the next day and walked me to the bus stop and made me point the dude out and made me go beat him up."},{"speaker":"Ralph","time":"00:13:36-6","content":"Then, it got to be and I didn't enjoy any of that till this day, I really don't I'm not too keen on conflict. I'm really not at all. I'm not in to that. I'm not interested in that. But, he would invite kids home from the bus stop to come fight, box, wrestle at the house eat dinner and then they'd go on home. It may be a different one two or three nights a week or whatever."},{"speaker":"Ralph","time":"00:13:36-6","content":"As the years progressed, he would gamble on me with whoever was nearby at the time that would happen. You can't lose. You understand what I'm saying. He did have a code that he stressed and that is you don't bully people. I'm teaching these things, but these are for you to defend yourself and defend your brother and sister."},{"speaker":"Marcus","time":"00:15:33-8","content":"Did he make your brother fight as well?"},{"speaker":"Ralph","time":"00:15:36-2","content":"No, not like that. Not like he did with me."},{"speaker":"Marcus","time":"00:15:41-0","content":"When you say that he was the targeted child everything you're telling me so far leads me to think that you're the targeted child."},{"speaker":"Ralph","time":"00:15:48-9","content":"Well."},{"speaker":"Marcus","time":"00:15:51-8","content":"Do you think maybe both of you were targeted?"},{"speaker":"Ralph","time":"00:15:55-6","content":"I think that my brother was technically what they would classically call a target child, but I think we were both victimized. He dealt with my brother in a very vicious way. Let me tell you about Billy. Billy's my younger brother blonde head, blue eyes, nice guy just a super smart fellow a real piece of work."},{"speaker":"Ralph","time":"00:15:55-6","content":"He wasn't I say he wasn't cause he's not like he used to be. I can't hardly describe. Anyway, talk about a resilient character. Man he just you couldn't crush him I don't care what there would be some crying and there would be some bloodshed, but you couldn't crush him."},{"speaker":"Ralph","time":"00:15:55-6","content":"We lived in a double wide for some time and stepdad had punishments that bordered on torture. A double wide trailer has got a seem down the center and one of his punishments was you had to lean up against that wall with your forehead for hours. My little brother's five and he's been up there for a little while. An hour or whatever and his legs are shaking and he's whimpering or whatever and my stepdad just came out and kicked his feet right from underneath him and he just smack on his face right on that seem and that's vicious."},{"speaker":"Ralph","time":"00:15:55-6","content":"He never did vicious he never treated me with that kind of viciousness. It's those kinds of things that but my brother was kind of mean now don't get me wrong. He had a mean streak in him. I think I may have been targeted in the way that you're referring to because I'm the oldest because I'm my mama's son because I'm the closest. So, in that way, I'm being dealt with for that reason."},{"speaker":"Ralph","time":"00:15:55-6","content":"My brother is the pseudo target child though. Just the one who's going to get the brunt of it? My sister didn't get too much of the brutality primarily because she was a girl I would assume."},{"speaker":"Marcus","time":"00:18:36-8","content":"But, did she witness a lot of violence in the home?"},{"speaker":"Ralph","time":"00:18:38-1","content":"Yes, oh yes."},{"speaker":"Marcus","time":"00:18:40-9","content":"I mean because that by itself is also traumatic."},{"speaker":"Ralph","time":"00:18:43-2","content":"Certainly, it was traumatic for me not to be able to come to their aid. You understand?"},{"speaker":"Marcus","time":"00:18:49-4","content":"Yeah."},{"speaker":"Ralph","time":"00:18:51-0","content":"The first time I went to jail while I'm in jail and I don't find this out till 25 years down the road my brother got a whipping for something. He went to school with bruises across his thighs and he was in football practice and they brought it to the coach's attention and a big thing kicked off. They sent a social worker to the house and everything. Stepdad told her where to get off."},{"speaker":"Ralph","time":"00:18:51-0","content":"But, he said if I can't discipline these children with I'll just do stuff that ain't going to leave marks and I discovered that he went to the convenience store and bought several bags of ice and filled the bathtub up with ice and made my brother get in the bathtub full of ice. My sister comes home from school and finds my brother in the bathtub full of ice turning blue. I'm not there. Actually, it was that particular incident that was the straw that broke her back."},{"speaker":"Ralph","time":"00:18:51-0","content":"She left I'm not staying here for that. But, once I was gone, everything fell apart. My brother so smart he claims that he did it on purpose I'm not really sure, but he found a way to pull off enough juvenile stunts to get sent to a place called Cal Farley's Boy's Ranch. I don't know if you've ever heard of that. It's a private reform school type place. It's pretty much like this they raise cattle they go to school they have 4-H and all that. He's a product of that. He's a success because of that. He got out. He ended up in New York City."},{"speaker":"Ralph","time":"00:18:51-0","content":"So as children you don't know that this is not the norm because you are so isolated from other children. You're isolated from everybody and that's how our family was. We were not allowed to go anywhere outside of school or school activities. Anytime that he felt like we were getting out of his reach he ran us in."},{"speaker":"Ralph","time":"00:18:51-0","content":"You're going to quit that you're going to get a schedule change you're not in that class no more or whatever anytime he felt like he wasn't going to have his way."},{"speaker":"Marcus","time":"00:21:09-9","content":"And this is all happening in Texas?"},{"speaker":"Ralph","time":"00:21:12-1","content":"Primarily. Primarily. We probably lived in that trailer maybe a year or two maybe two years when we moved to Texas yes pretty much most of it happened in Texas. We were children. We misbehaved, but there was no cause for that. I do believe that the neighbors, to some extent, knew. I can't hold them I don't hold them responsible."},{"speaker":"Marcus","time":"00:21:42-7","content":"Let me pry a little bit."},{"speaker":"Ralph","time":"00:21:47-7","content":"Sure."},{"speaker":"Marcus","time":"00:21:49-6","content":"One of the things you said a little bit ago was that some of the frustrations of dealing with all of that led you to the person you were at 20. Can you explain a little bit more about that?"},{"speaker":"Ralph","time":"00:22:09-6","content":"People who were close to me, just prior to the murder of Daniel Mckelvey told me later that they could see me boiling. They could see me about to explode and I can look back and I know exactly what they're talking about. I saw things in hindsight. I'm looking back. I know some other things that happened they don't even know about where I was right there at that edge right there at that brink. I was ill equipped for life truly. I can do the numbers. I'm a mathematical wizard, but I don't know that I have to have a budget."},{"speaker":"Ralph","time":"00:22:09-6","content":"I know how to balance a checkbook, but I don't know I need a budget. So, you have money you buy what you want. Well, no that ain't how it works. So, I'm using that as an example of being ill equipped. When I go for a job interview, I know I can do that. I know that I can handle that, but I don't see what they see. I don't see the long-haired kid with the earring in his ear."},{"speaker":"Ralph","time":"00:22:09-6","content":"So, when you don't get that job that, it creates frustration. You had an expectation. Why they ain't going to hire me? I'm smart. I can handle that. And those are just some things. A lack of experience in life period. Not knowing what to expect out of life. But, somehow down there in Metairie that weekend with there was a dynamic that existed between the people who were all involved in this that left me feeling taken for granted, but it's the same thought or the same feeling that I felt about the employment opportunities."},{"speaker":"Ralph","time":"00:22:09-6","content":"It felt like I was being taken for granted. That involves expectation and frustration. That's why I say about the frustration. The entire incident with the murder boiled down to panic I panicked over the dynamic and the certain circumstances and I just did the first thing that came to my mind. I tried to fix the problem."},{"speaker":"Marcus","time":"00:24:53-6","content":"What was the problem?"},{"speaker":"Ralph","time":"00:24:54-5","content":"The problem was I was stuck in New Orleans without transportation to get back home. All I wanted to do was to get back home."},{"speaker":"Marcus","time":"00:25:01-3","content":"Who were you with?"},{"speaker":"Ralph","time":"00:25:02-3","content":"I was with I have co-defendant who is my best friend. I say my best friend my only friend pretty much and we're only friends because we used to be dependent. He had issues with his home and he had transportation. I had issues with my home and needed transportation. That's how we get hooked up in junior high or high school really and it just kind of we just went on through. I've been to his home with his family with his mom and his dad his brother and his sister."},{"speaker":"Ralph","time":"00:25:02-3","content":"I've been in their house or whatever. So, we all know each other. So, he's with me in New Orleans. He's there because I invited him to come with me. I'm there because my girlfriend invited me to come with her and her friend and that's how we're all there, but it fell apart soon as we got there just the dynamic just fell apart. And then the brakes went out we were in Greg's car."},{"speaker":"Ralph","time":"00:25:02-3","content":"The girls had their car and Greg had his car. The brakes went out on his car. He wrecked the car and he damaged the car and I could have went with the girl, but the dynamics bad with me and the girl. And then, she's just kind of handling me bad. This ain't how she I just don't tolerate that very well being mishandled. Being slighted, but the kind of boy that slights. I wasn't dealing with it very well. We were at the motel waiting for her to come pick us up."},{"speaker":"Ralph","time":"00:25:02-3","content":"She ten minutes away. We were waiting for her and I made up my mind we would take the ride we would ride back with these girls right here, but I ain't got nothing to do with this girl after today. We going to back and I'm packing my stuff and I'm gone man. I'm not messing with this woman no more this girl and they were just taking too long. I said man I got to do something. I'm not going to let her take advantage of me like that. I'm telling you these thoughts. These aren't thoughts that I formed."},{"speaker":"Ralph","time":"00:25:02-3","content":"These were vibes and feelings and just stuff that I wasn't even processing, I was just experiencing. Thinking back on these things are the things you say this is what happened. I don't know anything about stealing a car. I don't know anything about hotwiring a car. I'm trying to formulate some type of a plan and I use that term loosely. There was a guy in the motel room next door."},{"speaker":"Ralph","time":"00:25:02-3","content":"I said to myself we're going to take that guy's car. I told Greg I was trying to tell him what I thought we should do and the man come out and started talking to us. I had to cut the conversation short. I said poor dear because Greg he doesn't know he doesn't really even know what any idea that I might have had other than I'm going to get this guy's car, but he's got a life sentence right here with me. So, I asked the man if I could use his bathroom in his room."},{"speaker":"Ralph","time":"00:25:02-3","content":"Went in the room and the door wasn't even shut with Greg behind me and I just attacked him. I beat him and beat him and beat him until I got tired. At some point, I'm beating him and don't remember beating him. Put it to you like that. There was a distancing. I don't want to call it a black out. I don't know what it was. All I know is that at some point, I came to and I'm coming up from over him and I just couldn't believe the damage that I had done."},{"speaker":"Ralph","time":"00:25:02-3","content":"I was 20. He was 59. I didn't pick him out because he was old. I didn't pick him out. He was there. It could have been a hulk. He was there. At that I was on probation 10 year probation for a theft thing in Texas and the only thing that ran through my mind was that this man could identify what I just did. So initially, at the onset, the idea was not to kill somebody for a car. But and there is no thought process going through."},{"speaker":"Ralph","time":"00:25:02-3","content":"The only thought I had is that this man can identify me and I can't let that happen, so I strangled him. I told Greg to help me. I truly think that Greg was afraid of me in that moment. He had never seen me like that. I had never been like that. I think he did what he did out of fear and he suffers for it. So, he's a victim. His sister and his brother and his mother and his daddy are all victims. That goes back to what I was saying earlier about victims and how many there are."},{"speaker":"Ralph","time":"00:25:02-3","content":"His dad came and saw me in the parish prison. His dad would do joint visits with me here with Greg. His daddy was a very good friend. He treated me well. Maybe that's how he coped with what I had done to his family. A good Christian man. He's passed now a couple of years. And then Greg's sister started coming and spending time. She came to the rodeo. I'm in the rodeo selling and this woman pulls up."},{"speaker":"Ralph","time":"00:25:02-3","content":"She says Ralph and I look up I see her and she's like, Stacy, and I look and I'm like, because I don't recognize her. She goes Greg's sister and the first thing out of my mouth I stood up and I told her how sorry I was. Greg's older. He has his own responsibility, but I still feel responsible. No matter who's talked to me about that trying to talk me out of that I still feel responsible."},{"speaker":"Ralph","time":"00:25:02-3","content":"His mother holds me responsible. When we were arrested, I used the word plan, but a plan is says you have steps and you have a goal. There was no plan. It was an idea. A thought. The difference between a thought and an idea and a plan is the difference between a 20 year old man and a 30 year old man. One has goal-oriented thinking and one doesn't."},{"speaker":"Marcus","time":"00:31:57-9","content":"So, you're arrested and you're in the Jefferson Parish prison and you do some months there while you're going to trail."},{"speaker":"Ralph","time":"00:32:10-1","content":"Almost two years."},{"speaker":"Marcus","time":"00:32:16-2","content":"When you're given a life sentence you're not even from Louisiana. Did you understand the gravity of what that meant?"},{"speaker":"Ralph","time":"00:32:25-8","content":"No. My lawyer told me that he did not feel comfortable taking my life into his hands at a trial. And he strongly counseled, persuaded, and pushed me to plead guilty to second degree murder in 12-15 years. He said you go up there and stay out of trouble and don't hurt nobody up there, you'll be out after 12-15 years. They don't know the law. I came up here and shared that with some other guys that had been up here for 12-15 years already and they laughed at me."},{"speaker":"Marcus","time":"00:33:07-6","content":"Were you and Greg tried separately?"},{"speaker":"Ralph","time":"00:33:09-6","content":"We both plead guilty."},{"speaker":"Marcus","time":"00:33:10-6","content":"So, you both plead."},{"speaker":"Ralph","time":"00:33:11-6","content":"Correct. We thought it was the best thing to do. Part of mine was see, I know my home life had a tremendous impact on that day. I know it did and I wanted to expose that. I hate to use that, but I knew that was it."},{"speaker":"Ralph","time":"00:33:11-6","content":"I didn't have the science that we have now about post-traumatic stress disorder for children. I'm from an abusive home. I did not see that I was going to get the kind of support that I was going to need and in the end, I just decided that I just didn't want to go through putting my family through that."},{"speaker":"Ralph","time":"00:33:11-6","content":"They had just convicted a man for killing the bugle man from the fairground Ralph they had just convicted him and tried to give him the death penalty and his mom was on the stand begging for his life. I couldn't put my mom through that. There was two more that had just got the death penalty out of Jefferson Parish and I'm not even from the state. It don't play well."},{"speaker":"Ralph","time":"00:33:11-6","content":"There were other things that indicated to me that my lawyer was not actually working in my best interest. There were things that should have went our way with some motions where he exposed some things, but he didn't push it like I felt like he should. That had me thinking that might not be such a bad idea to go ahead and take that. I called my mom and she said take the life. I cried. I didn't want to do it."},{"speaker":"Ralph","time":"00:33:11-6","content":"That ain't what I wanted to do. I really didn't want to do that, but that's what I did."},{"speaker":"Marcus","time":"00:35:05-7","content":"Do you remember the bus ride? Did they take you to hunt?"},{"speaker":"Ralph","time":"00:35:10-9","content":"The bus ride wasn't bad."},{"speaker":"Marcus","time":"00:35:14-6","content":"What I'd like you to talk about, if you don't mind, is your first few months here. As the reality of the life sentence is getting."},{"speaker":"Ralph","time":"00:35:26-9","content":"I came here on February 1st, 1998. It was raining when I got here. It rained all day long. It rained all week long. That Friday morning, it snowed. I remember it like it was yesterday. When you come here, they put you in front of a board of people and the supervisor says can you handle yourself? I said we'll find out shortly. They sent me to Camp D. I walked down the walk with my little belongings. They open the door practically push me in slam the door and lock it behind me."},{"speaker":"Ralph","time":"00:35:26-9","content":"Some of the first people I saw were some of the weirdest people I've ever seen. It was the blatant the dynamic of property people being property. The entire aspect of it. I don't think I reflected anything that I was thinking at the time. I pretty much did what I could to mask. My first few months were learning. I was like a sponge. My first morning here, there was a big black white division here."},{"speaker":"Ralph","time":"00:35:26-9","content":"The still had segregated dorms. They had dorms with nothing but blacks in them. Out of four dorms, two of them are going to be all black. Two of them going to be black white, about an even mix. So, the whites pretty much hung together. There was no gangs or anything. They just kind of hang together. So, you go to the dining hall and you're in line coming in the door and all the whites are together. I'm the last guy."},{"speaker":"Ralph","time":"00:35:26-9","content":"They told me the night before counseling me talking about the prison this that and the other this is how it goes man. If you want to hang with us, you don't socialize with them. Okay alright. I'm just trying to get along. So, when you go to the dining hall they sit you. They don't hold you by the hand and say you got to sit here, but it's understood that you fill up this table, then you fill up this table in the order that you're in the line. I'm the last guy of the whites. I'm the odd man out. I got to go to the next table."},{"speaker":"Ralph","time":"00:35:26-9","content":"So, three black guys sit down. I just pick up my tray and move to a table way over here. I don't know. Man you could have heard a pin drop in the kitchen. I mean it"},{"speaker":"Ralph","time":"00:35:26-9","content":"was just everybody oh my God look what the white guy did. The security man over there said man you can't do that. That was probably the quietest meal I've ever had. Then, I had to go back and sit with them guys. So, it was about fitting in."},{"speaker":"Marcus","time":"00:38:30-0","content":"Were there consequences for that?"},{"speaker":"Ralph","time":"00:38:31-6","content":"No, the only consequence was there might be people who would talk about it."},{"speaker":"Ralph","time":"00:38:31-6","content":"Might request to me about that, but I'm continually on the defensive because there's so much games going on. You're a target. So, you have to remember that. I couldn't forget it. That actually creates even more problems for you. Is always thinking that you're the target because they're not always targeting you, you're just thinking they are. It's not like that anymore in terms of the games."},{"speaker":"Ralph","time":"00:38:31-6","content":"In terms of embracing conflict and violence. We actually try to get along more around here now. We try not to fuss. We try not to argue. We try to work through things, but that's more for something. But anyways back then like I said it was a different place man. It was a different place. In your question, you said what advice would I give to that man now? And I thought about that. I thought about that."},{"speaker":"Ralph","time":"00:38:31-6","content":"I thought, there's no advice to give because at that age, you're not listening to advice anyway. I look at these guys down here now young guys there're not doing life they're doing a couple of years and reentry and I've seen them. And you wish they would do this and you wish they would do that. And you wish they would be more considerate and if you try to tell them, they're going to look at you like what language is that?"},{"speaker":"Ralph","time":"00:38:31-6","content":"So, I thought about what advice would I give that young man? There's no advice that I could have gave that man that I didn't already have which was be yourself which was be true to yourself. Stick to your character. And through the years, as my character has become more defined as I've matured more and I've developed more character I've become more confident in character and it's become a stronger character."},{"speaker":"Marcus","time":"00:40:42-5","content":"Tell me a little bit about your routine. What is your day like here?"},{"speaker":"Ralph","time":"00:40:47-7","content":"This morning I got up at 5. I got up a little early, so I could shave. I normally don't shave but once a week. Usually, I'll watch the news from about 5:30 to 6:40 somewhere around there. I'm just burning up a little time waiting on the time to go to work. About 6:30 I'll leave the dorm and head to a staging area to get ready to go to work. I get to work about 7:00 and then it's wide open all day. There's some days when I've got a phone in each hand talking to two different people."},{"speaker":"Marcus","time":"00:41:22-1","content":"This is where I visited you that time?"},{"speaker":"Ralph","time":"00:41:23-2","content":"Yeah, it was quiet that day."},{"speaker":"Marcus","time":"00:41:24-3","content":"It was."},{"speaker":"Ralph","time":"00:41:25-8","content":"I've got a new supervisor now. My work load has probably tripled, since last year. I have more responsibility with keeping track of things, but there's some days when I have a phone in each hand and I'm telling this one what this one brings and I'll tell them to hang on and I'm talking to this one and the other one hears me and I got a guy that's standing here waiting to find something else out from me and"},{"speaker":"Ralph","time":"00:41:25-8","content":"I'm maybe trying to go over here and still do something else. There's days like that, but my days are pretty quick. They go by before you know it they're gone. About 3:00, I'll go in. They'll count just a little bit before 4:00. I'll take a nap until about 5:00and then at 5:00, I'll go down in the hobby shop. I'll spend my time down there until about 11:00. The weekends, it'll be 12:00."},{"speaker":"Ralph","time":"00:41:25-8","content":"I might work I might spend some time just sitting there for a couple of hours defragging from my day just trying to relax a little bit. I like to read. So, I'll spend some time reading maybe and then do some work. The rodeo is coming up right now. I'm starting to work almost continually down there producing."},{"speaker":"Marcus","time":"00:42:38-8","content":"What are you making? I mean I know a little bit but."},{"speaker":"Ralph","time":"00:42:45-9","content":"Right now I have about seven purses started of about 15 that I plan to do. I've got two duffle bags that I plan to do. I got those started. I'll probably do before the month of October is out I'll do 150 wallets. That'll probably be all that I'll actually be able to do for this rodeo. That's a lot though. I assure you."},{"speaker":"Marcus","time":"00:43:15-1","content":"All leather work?"},{"speaker":"Ralph","time":"00:43:16-0","content":"All leather work. You figure that one of those linings takes about 13 hours a piece. That's a lot of work."},{"speaker":"Marcus","time":"00:43:25-8","content":"I've seen what you do and it's nothing short of remarkable. Excellent."},{"speaker":"Ralph","time":"00:43:30-8","content":"Thank you"},{"speaker":"Marcus","time":"00:43:32-5","content":"I can see that being very time consuming."},{"speaker":"Ralph","time":"00:43:35-2","content":"Absolutely."},{"speaker":"Marcus","time":"00:43:36-1","content":"So, that's what you do to occupy your time after work."},{"speaker":"Ralph","time":"00:43:40-9","content":"It's very therapeutic for me. I don't know how it works, but I don't really start anything until I got it figured out in my mind. And then, it's all second nature. And while I'm doing things with my hand, my brain is thinking about other things."},{"speaker":"Marcus","time":"00:44:00-6","content":"Do you have access to as fashions change of the designs that come out for different thing? Do you have access to things like that?"},{"speaker":"Ralph","time":"00:44:11-5","content":"I have access to magazines, but the rodeo is so much different than the real world. You can't predict. All you can do is pay attention. Think about what you've got that's selling. And what I mean pay attention pay attention to what them customers are wearing."},{"speaker":"Ralph","time":"00:44:11-5","content":"Pay attention to how they're spending their money and who's spending the money. Is it the dominant male spending the money or is it the women spending the money? All you can do is take it's a gamble. I'm gambling. I'm going to take a shot. I have the inventory."},{"speaker":"Ralph","time":"00:44:11-5","content":"I've noticed that over the last couple of years, we've had more cowgirl type clothes. My purses weren't selling like they were in the more professional look. So, I made some I changed my leathers up a little bit. Bought some different leathers. I changed the look up a little bit. Made more of a western flare. I changed the hardware up a little bit and I came up with a nice little western looking bag and it sold several of them."},{"speaker":"Ralph","time":"00:44:11-5","content":"So, I'll run that one till the legs fall off of it. And I'll produce some of the nice professional ones two because I don't want to miss out on those, if those are the people that show up."},{"speaker":"Marcus","time":"00:45:36-8","content":"So, that's a pretty full day right there. Are there other organizations that you've been a part of over the years?"},{"speaker":"Ralph","time":"00:45:42-8","content":"There are and there have been."},{"speaker":"Marcus","time":"00:45:48-1","content":"Let me preface it with this. So, earlier we talked about the fact that you're getting yourself prepared to go before the pardon board."},{"speaker":"Ralph","time":"00:45:59-2","content":"Sure."},{"speaker":"Marcus","time":"00:46:00-1","content":"And while you don't have a date, there are certain things that you want to start lining up. One of the things you'll have to account for is how have you spent your time here. What types of opportunities are you taking advantage of? If you come before a parole board, what do you want them to know about you?"},{"speaker":"Ralph","time":"00:46:20-6","content":"What I want them to know is that not everybody can be a club president. Not everybody can be a club vice president. There are some every day average prisoners around here that are rehabilitated. I've never thought that I could earn my way out of prison. Everything that I've done, I've done because that's what I wanted to do. I've got 12 hours of LSU correspondence credit in sociology I'm sorry basic psychology introduction to sociology introduction to management and human resource management."},{"speaker":"Ralph","time":"00:46:20-6","content":"So, I've pursued school. I've pursued faith based education. I created my own tech. I took a hobby devoted myself to it taught myself became skilled at it created a marketable skill that I have now marketed. I have a leather business on the street that will hire me if I was to come see them tomorrow they'll hire me. I got a letter."},{"speaker":"Marcus","time":"00:47:27-7","content":"I believe that."},{"speaker":"Ralph","time":"00:47:29-5","content":"So, not only have I made something marketable, but I marketed it. To me, that's an accomplishment. But the paper work don't show it don't mean it's not there. The bible says that the little foxes spoil the vine. That's a passage of scripture. It means that the small things are what destroy. Well, if it's the small things that destroy, then it's the small things that make everything up. Everything large is made up of small parts. I can't tolerate trash lying around."},{"speaker":"Ralph","time":"00:47:29-5","content":"I can't stand that. It's laziness. It's just somebody's lazy mind to just toss that and I'll pass by and I'll pick it up. I want to set an example for people. When I walk down that walk, I'm single filed. One reason is because that's what they want you to do. Second reason is because it works well that way. If you're out there in the world driving and you decide that you want to drive on the left hand side of the road, it's not going to work out too well."},{"speaker":"Ralph","time":"00:47:29-5","content":"When the warden stops me and starts hollering and screaming at me and pointing a finger at me for something don't know nothing about and I say yes sir and turn around and leave I haven't given him any back talk I haven't those are things that say to me this man is rehabilitated. When I think about everything I'm going to do when I think about the possible results the rippled in the pond when I toss that pebble in."},{"speaker":"Ralph","time":"00:47:29-5","content":"I think about each one of those ripples and what they might or might not do and I weigh out those possibilities and I make sure that nobody's going to be affected in a negative way that's a whole lot of different way of thinking than what I used to think or didn't think. I'm concerned about people being damaged by something that I do."},{"speaker":"Marcus","time":"00:49:33-1","content":"So, let me stay with that for a second. I'd actually like to ask you about how you envision a chapter in your life once you're released from here, but before that 32 years is a whole lifetime to think back and refrain and to come to some kind of clearer understanding about what we did when we were kids."},{"speaker":"Marcus","time":"00:49:33-1","content":"When you look back on the victim and the victim's family as you've said, how do you feel about it now? What is the feeling after 32 years?"},{"speaker":"Ralph","time":"00:50:18-4","content":"Shame. When I had to do my clemency application, they want you to write down every crime that you were convicted of. They wanted every crime that you were convicted of. And there were several thefts. I had to give all the details. I just shook my head. I said man you did that? It's not like I forgot, but sitting and putting it all down on paper owning it."},{"speaker":"Ralph","time":"00:50:18-4","content":"I said man that's shameful. It's not just the murder much a permanent un-irrevocable act that you can never compensate for. I don't care if you do three life sentences. You ain't going to compensate for it. But still these other crimes. That's shameful stuff. I was embarrassed to have to write that down. To face in that way, but it was good for me. It was to do that in so far as to acknowledge the difference in who I am today verses then. The mindset. There was no thought to the things that I did at 18, 19, and 20 years old."},{"speaker":"Ralph","time":"00:50:18-4","content":"The only thought was the here and now. Wouldn't this be funny comical. You go in a seven eleven and you grab 12 pack of beer and a carton of cigarettes and you walk out the door. It's funny as you get in your car and drive off to look in your rear-view mirror and see this guy run out of the store hollering at you. He can't leave the store. See I'm just saying even you're smiling a little bit yourself. That was comical to me. It kind of served two purposes."},{"speaker":"Ralph","time":"00:50:18-4","content":"I was adventurous. So, I did things in an adventurous way. But, like I said having to put those things down on paper I found that I was shameful. I think about my brother has made it a point to tell me how deprived he feels that I can t be there to share his successes and his family with him. That he can't sit down to dinner with me and his family. That he can't share his children with me because I'm here. Although my sister's never told me that, she has tried to develop a relationship between me and her sons."},{"speaker":"Ralph","time":"00:50:18-4","content":"I understand the ripples in the pond that beyond Mr. Mckelvey and his family. Beyond Greg and his family my family my mom anytime my name comes up she tells me about how proud she is of me and how much I've done here and my leather work and what not and she shares that with other people but it's got to be and maybe she's grown used to it over the years, but it's got to be somewhat shameful for her to have to say yeah my son's in prison for a life sentence for murder."},{"speaker":"Marcus","time":"00:54:12-5","content":"In your family, who do you think has taken it the hardest?"},{"speaker":"Ralph","time":"00:54:18-3","content":"My brother."},{"speaker":"Marcus","time":"00:54:20-6","content":"Billy?"},{"speaker":"Ralph","time":"00:54:20-9","content":"Yep. He came down here and saw me I don't know maybe three years ago around Thanksgiving. He was on a sales convention. He was a salesman for a long time and he the opportunity to swing this way. When he came we talked on the phone he had wanted some details of the crime, so I brought with me a copy of the confession and I gave him that and it made him sick physically sick."},{"speaker":"Ralph","time":"00:54:20-9","content":"He relayed it to me later on that his brother had done that there wasn't no getting around it and he had to deal with that. I never thought that would bother him in that way. He's a city councilman small place, but nevertheless. He's very active in the neighborhood. He has a dynamic at his home where it makes it a place where children in the neighborhood can come to he's a coach. He coaches everything. Whatever football you got going on or baseball he doesn't care too much for basketball."},{"speaker":"Ralph","time":"00:54:20-9","content":"All the little league type sports little kids and he's got a tire swing in the backyard and he's got a standing challenge to the neighborhood they've got an ante bucket put your money in the bucket and then you come and take your shot. If you make the shot, you get what's left in the bucket whoever and the money just stays in the bucket. I admire that because he's giving them a place to go because he's giving them a challenge and it's healthy and it's building healthy relationships."},{"speaker":"Ralph","time":"00:54:20-9","content":"One of your review questions and I hate to flip it on you like this but one of your review questions mentioned a cause or factor. And I thought about that a lot. I love solving problems."},{"speaker":"Marcus","time":"00:56:47-7","content":"If you can put your finger on."},{"speaker":"Ralph","time":"00:56:50-4","content":"And it used to be can I put my finger on that place where I should have went left instead of right and I've come close a number of times, but each time I exam it a little deeper no that ain't it either. It goes back a little further. So, I'm going to give you a little history. Keep in mind that I went to fifth grade in one school sixth grade and seventh in another school eighth grade in yet another school and then high school in yet another school."},{"speaker":"Ralph","time":"00:56:50-4","content":"I was always the new guy. I did not have a home life that fosters social relationships the way we were treated the way we were presented you're presented by how the clothes that you're given to wear by how you're required to wear your hair how different you are that none of us children were accepted by our peers so, we were always ostracized. There's nothing at school and there's nothing at home and there's no neighborhood but nevertheless we were compelled to produce our best work possible with our class work."},{"speaker":"Ralph","time":"00:56:50-4","content":"I can't tell you how many times I had to rewrite something because of a scratch out. I got good grades all through school. I had many honors classes in high school. I was an honor roll graduated. I had a presidential academic fitness award. I applied for the appointment to the academy naval academy. I didn't get that, but after I graduated high school and after I'd already been arrested once I received information in the mail that I had received a naval ROTC scholarship at Iowa State, which is one of the tests I took one of the things that I had applied for and what I'm trying to show you is the direction."},{"speaker":"Ralph","time":"00:56:50-4","content":"Prior to receiving that, I was awarded that as an alternate. Someone else had gotten it and decided that they were going to school somewhere else. They didn't want it, but by that time it was basically too late for me. That's one thing that had it been a little bit different that my life could have come out a lot different meaning had that come earlier I might not have could what ended up happening is that I fell in with the wrong crowd."},{"speaker":"Ralph","time":"00:56:50-4","content":"That's what happened to me chased after the wrong thing pursued the wrong things and ended up with the wrong people because I had no social skills to begin with."},{"speaker":"Ralph","time":"00:56:50-4","content":"They say that children are taught right from wrong at home, but it's not only at home, it's also at school with your teachers the administration and it's also amongst your peers."},{"speaker":"Ralph","time":"00:56:50-4","content":"Your peers will teach you what's acceptable within the group. Without that group, all you have to go on is what you got at home or what you have with the teachers and if the teacher's got a problem with you whether it's because of who you are of it's because everybody else has a problem with you or whatever, then you can't depend on you can't trust that what they're reinforcing is actually they're just being mean."},{"speaker":"Ralph","time":"00:56:50-4","content":"So, although we can say it's their fault because I didn't get that scholarship before I don't like doing that. I try to find where the fault rests with me because I can fix me. I can change me. I can do something about me. That's why I don't like mistaking anger mistaking frustration for anger puts the problem somewhere else. It gives something else control and power over you, but if you're frustrated all you got to do is be patient. Learn to have more patience and you'll get past that. Quit having so many expectations."},{"speaker":"Ralph","time":"00:56:50-4","content":"But, back to all what I was saying a minute ago is that if I had I've also thought that what the ROTC would have given me would have been some mentorship. Some strong leadership. Some strong examples and that may have been enough. I might not have gotten kicked out of college. I might not have went to jail from college. I might have actually been accepted somewhere actually fit in somewhere. I might have made it."},{"speaker":"Ralph","time":"00:56:50-4","content":"So, that's one path that could have went that way. Without that somewhere down the line meaning somewhere in that two year time period from high school to 20 had there been a mentor that was alcohol and drugs were a big part of my circle not so much drugs alcohol was the word you used was major. Alcohol was major."},{"speaker":"Ralph","time":"00:56:50-4","content":"Drugs wasn't minor, but it wasn't major. It was give or take. If it's part of the scene, so be it. But, that all brings you with I hate to say it with losers. It really does."},{"speaker":"Ralph","time":"00:56:50-4","content":"Well, ain't you going to win hanging around losers? So, there would have had to been somebody who could draw me out of that."},{"speaker":"Marcus","time":"01:02:45-2","content":"I get that. I understand that."},{"speaker":"Ralph","time":"01:02:48-1","content":"Because I thought about it. It would have taken strong intervention to get me out of that. The right girl could have did it. Without there being a strong male influence is what I'm thinking but it could have been a decent girl could have if she could have got through to me at some point and it's possible it was possible there could have been."},{"speaker":"Marcus","time":"01:03:16-4","content":"And I'm sure you could spend a lot of time with the, what if's."},{"speaker":"Ralph","time":"01:03:20-1","content":"Thank you."},{"speaker":"Marcus","time":"01:03:21-6","content":"So, let's pursue that a little bit more in a bit more grounded way. So, let's say that you're granted clemency or you're given a fixed term and you've served your time and you get out. How do you envision that?"},{"speaker":"Ralph","time":"01:03:41-7","content":"I'm a nuts and bolts man. I'm a builder. It's like I may have mentioned earlier it's about work. It's about not falling behind financially. It's about getting a certain measure of comfort. I'm talking about comfort is having your own transportation. Having your own place to stay. It doesn't have to be nothing but an efficiency apartment. Having some independence. Having a little bit of I mean there's still a limited amount of liberty that you have because you're still constrained by your finances."},{"speaker":"Ralph","time":"01:03:41-7","content":"I see myself as successful. I'm not talking about Donald Trump successful, but successful for me is making it. I've had very little here at times. I know how to do without. That's not a problem. I know how to sacrifice for the things that I need verses the things that I want."},{"speaker":"Marcus","time":"01:04:53-4","content":"Would you stay in this area?"},{"speaker":"Ralph","time":"01:04:55-0","content":"Absolutely not. I love Louisiana. I love the people of Louisiana. I've been here longer than I've been everywhere else and I really would hate to leave, but there are no opportunities for me here. None that I see I have opportunities that I've lined up elsewhere and I have associates that tell me that I'll find even more opportunities once I find myself in that situation out there in the world."},{"speaker":"Ralph","time":"01:04:55-0","content":"That they'll be people that will see my ability to manage see my ability to orchestrate or as a right hand man that will be glad to have somebody like me take care of their business for them. That sounds like a pipe dream. That's not something that I'm dependent on. Great if I find it but I'm going to depend on what I can do and what I know."},{"speaker":"Marcus","time":"01:05:56-3","content":"As you've said, you have developed a pretty amazing skill here. It's marketable and you've marketed it."},{"speaker":"Ralph","time":"01:06:03-6","content":"Right."},{"speaker":"Marcus","time":"01:06:05-5","content":"Ralph, the other thing is that you've survived 32 years of Angola."},{"speaker":"Ralph","time":"01:06:12-2","content":"True."},{"speaker":"Marcus","time":"01:06:15-3","content":"You've done all kinds of things."},{"speaker":"Ralph","time":"01:06:16-5","content":"True."},{"speaker":"Marcus","time":"01:06:16-8","content":"What are you most proud of?"},{"speaker":"Ralph","time":"01:06:18-9","content":"I thought about that when I was reviewing that I don't care for the word proud. Not because it's a bad thing. I just found myself with a sense of accomplishment."},{"speaker":"Marcus","time":"01:06:38-5","content":"And I meant it in that spirit."},{"speaker":"Ralph","time":"01:06:40-3","content":"And I figured you did because the more that I thought about it and the more that I looked at it I thought this is what he's got to mean here. You've seen my work and there is a sense of accomplishment in that, but it's not something that I rest on."},{"speaker":"Ralph","time":"01:06:40-3","content":"There is a sense of accomplishment with my job because there's no I get accolades behind my back with other people that talk about that's the best clerk on the farm. He's more thorough than anybody."},{"speaker":"Ralph","time":"01:06:40-3","content":"He knows more about what's going on with his business than anybody. There's a sense of accomplishment with that as well because these are not things that I try to do. It's just who I am. It's how I'm doing it and there's a difference there. One is one requires effort and the other comes from within. This is a change in character a difference in character. So, a sense of accomplishment. I'm a good friend. A good friend in prison is not easy to come by. To be a friend you have to be able to sacrifice yourself because there's a lot of competition here."},{"speaker":"Ralph","time":"01:06:40-3","content":"We both might want that same bed over there that just became available, but you're my friend. Get that bed. A friend also is somebody who can hear your vented issues things that you don't feel comfortable talking with to anybody else, but you need to talk about them and that's where it stays. People confide people come to my room and the hobby shop and sit and talk and sit and confide in me."},{"speaker":"Ralph","time":"01:06:40-3","content":"And they say man you know why I can come and sit and talk to you because I don't never hear you say nothing about nobody. I've never heard your name come up about somebody told you something. There's value in that. When I came here, they told me that your word matters more than anything and I stuck to that. I've gotten better at it over the years because I've learned not to put my word on something that I couldn't take care of couldn't agree to or that I couldn't so I'm more careful about where I put my word."},{"speaker":"Ralph","time":"01:06:40-3","content":"To me, I don't have to say that's my word. If I say it, that's my word. So, there's a sense of accomplishment. When I go to a club and I say hey man I want to put on this hobby shop Christmas party. We're going to take up $15 a man. We're a little short on time. I want to run this through your club and let you all purchase everything for me. Can you handle that? Sure Ralph how much you need? I need a thousand."},{"speaker":"Ralph","time":"01:06:40-3","content":"Ain't no problem because they know the money's coming. There's a sense of accomplishment there. When I can call a leather vendor and say hey you know I'm a little short. I got this going on right now. I got this rodeo coming up and I need. I had one vendor I had a limit that worked its way up to a thousand because them people knew I'm going to take care of my business."},{"speaker":"Marcus","time":"01:09:57-9","content":"Right"},{"speaker":"Ralph","time":"01:09:59-2","content":"So, what I'm telling you is."},{"speaker":"Marcus","time":"01:10:00-8","content":"Yes, all of those things."},{"speaker":"Ralph","time":"01:10:02-4","content":"It's all about character. So, I feel a sense of accomplishment in having developed into somebody honorable."},{"speaker":"Marcus","time":"01:10:11-7","content":"Yeah."},{"speaker":"Ralph","time":"01:10:13-0","content":"Somebody of value. Even if nobody knows it. Even if nobody acknowledges it. Right I know it."},{"speaker":"Marcus","time":"01:10:26-1","content":"Alright I think actually that's a very good place to stop, but I also want to just ask one last question and that is in my effort to learn about who you are as a person. I feel like I've gotten a pretty good idea...but is there something that I should have asked you that I didn't?"},{"speaker":"Ralph","time":"01:10:55-5","content":"If you didn't ask it, I've already mentioned it. I've squeezed it in here and there."},{"speaker":"Marcus","time":"01:11:00-5","content":"Yeah I know and I got that."},{"speaker":"Ralph","time":"01:11:02-7","content":"It just fits. Where ever it fits, I just fit it in."},{"speaker":"Marcus","time":"01:11:05-7","content":"Sure"}]}