{"name":"","transcript":[{"content":"Randy Thomas Marcus REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Randy can you start by just setting the record for the interview by stating your name, the crime of conviction how old you were and how much time you've served."},{"speaker":"Randy","time":"00:00:11-7","content":"Ok my name is Randy Thomas I was charged with two counts of first degree murder and I pled guilty to first and second degree murder. The crime taken place in 1994 I'm serving two life sentences running concurrent and I've been here since been in Angola since 96 so it's 22 years 24 altogether."},{"speaker":"Marcus","time":"00:00:31-6","content":"Sure. So as I said earlier the purpose of the interview is to learn about your life and your experiences so I want to start with the earlier experiences can you tell me a little bit about the folks who raised you."},{"speaker":"Randy","time":"00:00:46-5","content":"Well I was raised by my grandmother from birth and she died in 85 so I started living with my mom raised up in a single parent household I had a stepfather but still raised in a single parent I have four siblings four sisters. I'm the oldest of five kids and life was pretty good it was pretty good."},{"speaker":"Marcus","time":"00:01:09-9","content":"So you mentioned a stepfather what was your relationship like with him."},{"speaker":"Randy","time":"00:01:13-8","content":"It was real it was hard it was hard because I wasn't his three of his three of my siblings are for him and I was the oldest. So he and I never really just got along."},{"speaker":"Marcus","time":"00:01:29-2","content":"Sure I mean I think that's common so was there a lot of fighting in the house."},{"speaker":"Randy","time":"00:01:35-7","content":"It was it was him."},{"speaker":"Marcus","time":"00:01:37-7","content":"Ok can you tell me a little bit about that?"},{"speaker":"Randy","time":"00:01:39-2","content":"Him and my mom and from me not being his and protecting my mom what one of the things that he would love to do and this became a habit in our household and was the result of many fights it started many fights on Fridays he would get paid and he would want to spend his weekend out partying wouldn't come home until Monday he would stay home Monday through Friday morning soon as he get paid he wouldn't come home."},{"speaker":"Randy","time":"00:01:39-2","content":"So my mom worked he worked but he would prefer to take his check on the weekends and do whatever god knows what and then come back home and expect for everything to be normal. So he and my mom got into a lot of fights and I saw it a lot as a youngster coming up and it stopped I want to say when I turned 16 and he and I got into a fight behind my mom and my sister and so there was a lot of fighting yes."},{"speaker":"Marcus","time":"00:02:45-3","content":"Sure and I can imagine that you felt the need at that point to start of step up to protect your mother."},{"speaker":"Randy","time":"00:02:53-5","content":"I did because she called me a coward one time she called me a coward and told me I need to step up and protect her and that incident that situation that stemmed from again him getting paid on Friday and deciding he wanted to go out and live his life on the weekends and she saw his brother and she confronted his brother and wanted to know where he was."},{"speaker":"Randy","time":"00:02:53-5","content":"So he busted up at her and I was standing there and I'm like this this is my uncle I don't know what to do or my step uncle and as we walked away she was upset that I didn't stand up for her. So from that point forward anybody that came and bristled at my mom I was there because her words when she called me a coward it really struck a chord with me."},{"speaker":"Marcus","time":"00:03:41-1","content":"Yeah also I don't know looking back on it now how you feel about it but that doesn't seem like a very fair thing to put on your 16year old son."},{"speaker":"Randy","time":"00:03:49-3","content":"Yeah and now I understand the reason why she did it I wouldn't say that it was everything after that contributed to my actions but I understand why she did it at that particular point in time. I understand it now but I didn't understand it. Then the word coward it just struck a chord with me because I'm fighting everybody else around my age but when it comes down to an adult its like stayed in my place stayed in my lane until she called me that called me a coward."},{"speaker":"Marcus","time":"00:04:22-7","content":"Yeah no I can understand that so a lot of fighting outside the house?"},{"speaker":"Randy","time":"00:04:27-3","content":"Talking about as far as myself."},{"speaker":"Marcus","time":"00:04:28-6","content":"Yeah."},{"speaker":"Randy","time":"00:04:30-0","content":"Yeah typical teenager stuff basically school fights."},{"speaker":"Marcus","time":"00:04:37-7","content":"Sure where you grew up I didn't ask you that."},{"speaker":"Randy","time":"00:04:40-5","content":"Shreveport Louisiana."},{"speaker":"Marcus","time":"00:04:41-9","content":"Ok alright so tell me a little bit about school."},{"speaker":"Randy","time":"00:04:46-3","content":"School was pretty good to a degree and the reason why I say that is there came a point in my life where I just didn't want to go to school prior to that everything was straight I loved math. I loved social studies and it got to the point where I started loving the street more."},{"speaker":"Marcus","time":"00:05:09-3","content":"Ok."},{"speaker":"Randy","time":"00:05:09-7","content":"So my great grandmother before she passed she told my mom let that boy go out and have friend said you keep him all I was in a house full of women the only male there and so my great grandmother told my mother that because we were staying with my great grandmother at the time my grandmother had passed."},{"speaker":"Randy","time":"00:05:09-7","content":"We were staying with my great grandmother at the time when she told her that and I went out and started hanging out with my friends I loved hanging out with my friends more than I did school because it's like I'm around people my age same gender and so we doing what typical boys do."},{"speaker":"Marcus","time":"00:05:44-6","content":"Yeah and how old were you when that changed."},{"speaker":"Randy","time":"00:05:48-7","content":"I want to say 14 maybe 14 or 15."},{"speaker":"Marcus","time":"00:05:53-7","content":"So after that you stopped going to school."},{"speaker":"Randy","time":"00:05:55-4","content":"I was still going to school but I was getting into fights I joined a gang at age 16 I joined one of the largest Crip gangs out of south central California."},{"speaker":"Marcus","time":"00:06:05-5","content":"Ok that had a had a chapter in Shreveport."},{"speaker":"Randy","time":"00:06:11-0","content":"Yep they had several chapters in Shreveport."},{"speaker":"Marcus","time":"00:06:14-3","content":"So what was that like being in a gang?"},{"speaker":"Randy","time":"00:06:17-2","content":"To me it was fun I joined at the age of 16 and I didn't join because there wasn't any love at home I joined because a lot of my friends that I knew was joining gangs and like I said I had the opportunity to be around people my same age group and gender it was fun because there was this comradely. We looked out for one another and so it was fun it didn't really get dangerous until I started really getting out of my teens and into my 20s and about this time just like it's embedded in my heart."},{"speaker":"Randy","time":"00:06:17-2","content":"So the initial point it was good because all we did was just hung out played with one another fights and so forth and so on and drinking. We get up and go to school and we know that we have one another back we was a unit we was a family and so it was it was pretty good but as like I said as time progressed we grew from out of that adolescent stage and it was like the street just demanded more because it's more like now."},{"speaker":"Marcus","time":"00:07:26-6","content":"So what was the main rival group?"},{"speaker":"Randy","time":"00:07:28-9","content":"Yeah 60 Crips that was the main rival the gang that I ran with was the 5 dudes who were gangster Crips so their main rival was the 60 Crips and Shreveport."},{"speaker":"Marcus","time":"00:07:41-8","content":"Okay and that was about turf geographically."},{"speaker":"Randy","time":"00:07:44-2","content":"It was about turf it was about it was about a lot of things but more so about one gang wanted control this one particular area. This was in the late 80s early 90s and now a lot of things have changed and again I've been incarcerated over 24 years. So we talking about like early 90s."},{"speaker":"Marcus","time":"00:08:08-4","content":"Right sure so school was what the highest year of school that you finished?"},{"speaker":"Randy","time":"00:08:18-9","content":"I dropped out in the 11th grade."},{"speaker":"Marcus","time":"00:08:21-0","content":"Ok so you got close."},{"speaker":"Randy","time":"00:08:22-7","content":"Yes."},{"speaker":"Marcus","time":"00:08:23-9","content":"So you dropped out and then how are you supporting yourself."},{"speaker":"Randy","time":"00:08:27-9","content":"Various jobs construction restaurants that's how I would support myself and when I got tired of the streets I went and got a job and when I got tired of the job I went to the streets."},{"speaker":"Marcus","time":"00:08:41-0","content":"Ok."},{"speaker":"Randy","time":"00:08:41-6","content":"Until I got married in 93 February of 93 I got married and from that point I just started holding a job until this situation transpired."},{"speaker":"Marcus","time":"00:08:41-6","content":"Ok tell me about your wife."},{"speaker":"Randy","time":"00:08:55-2","content":"Well she's my ex-wife beautiful woman only thing I could say I could speak good of her because she was not a violent person she was a good person if I told this woman that I wanted a piece of the moon she was going to find her way to NASA get a rocket and go to the moon and get a piece and bring it back to me that's how good she was."},{"speaker":"Randy","time":"00:08:55-2","content":"But I didn't really know how good she was until I was taken from her I never had anyone to teach me how to actually love a woman the only thing I knew about a woman is the things I learned from the streets so it wasn't until I came here and had was separated from her that I actually saw how good I had it."},{"speaker":"Marcus","time":"00:09:36-8","content":"Yeah."},{"speaker":"Randy","time":"00:09:37-6","content":"The saying goes you never miss a good thing till it's gone or you never miss the water till the well run dry she's gone she's remarried we're still friend. So we talk from time to time so she's real good."},{"speaker":"Marcus","time":"00:09:51-0","content":"Yeah do you have any children?"},{"speaker":"Randy","time":"00:09:52-4","content":"No children."},{"speaker":"Marcus","time":"00:09:52-7","content":"Okay."},{"speaker":"Randy","time":"00:09:54-1","content":"Not yet."},{"speaker":"Marcus","time":"00:09:56-0","content":"Right and I imagine that she has moved on with a family and but you're still amicable is that what you you're still on good terms."},{"speaker":"Randy","time":"00:10:04-0","content":"Yeah we still we talk from time to time her brother and uncle all of us are codefendants."},{"speaker":"Marcus","time":"00:10:12-6","content":"Those codefendants are they here as well."},{"speaker":"Randy","time":"00:10:15-5","content":"Yes sir."},{"speaker":"Marcus","time":"00:10:16-7","content":"Serving a life sentence."},{"speaker":"Randy","time":"00:10:17-4","content":"Yes sir."},{"speaker":"Marcus","time":"00:10:17-7","content":"Okay and how's, what your relationship like with them is."},{"speaker":"Randy","time":"00:10:23-0","content":"We still look at one another as a family her brother which he's the only male amongst three children he's the second oldest we still look at one another as family we see one another just about every other weekend he and I we work in the visitors shed together we work on the concessions well different concessions."},{"speaker":"Randy","time":"00:10:23-0","content":"But same area I'm on the east shore as far as living quarters he's on the west shore and his uncle is on the west shore with him as well and so as a matter of fact he's in school right now at GED school."},{"speaker":"Marcus","time":"00:10:57-9","content":"Great did you I'm going to talk about some of the things you've done since you've been here but I assume you've probably done your GED as well."},{"speaker":"Randy","time":"00:11:05-4","content":"I got my GED here as soon I got it I sent my certificate home to my mom because I was thrilled to finally get a GED and what prompted me to actually get that is that I saw when I come here I saw a lot of guys in key positions and I'm like man how do I get to this particular status in here."},{"speaker":"Randy","time":"00:11:05-4","content":"So everything the application I put in it got denied. So I started questioning guys they said oh if you want to do anything you got to get your GED first. So I was trying to go forward and reaching backwards to get my GED. So I got my GED here but in I want to say a two year time span and from there it opened a lot of doors for me."},{"speaker":"Marcus","time":"00:11:51-7","content":"Yeah so is it fair for me to characterize your upbringing that in the context of your home you grew up knowing that there were adults that cared for you even though there was a lot of conflict and fighting or did you feel that you kind of had to make it on your own."},{"speaker":"Randy","time":"00:12:14-1","content":"No I knew that they loved me but there were times when I felt as though I had to make it on my own because I wanted to be out there with my friends."},{"speaker":"Marcus","time":"00:12:24-5","content":"I get it so what your neighborhood was like."},{"speaker":"Randy","time":"00:12:30-1","content":"Quiet I don't want to say it was poor we didn't live in the middle class but it was real quiet. It was real quiet until the gangs came in and after that it kind of got I don't want to say loud but it was different."},{"speaker":"Marcus","time":"00:12:50-6","content":"Did it was it the kind of place where people felt safe?"},{"speaker":"Randy","time":"00:12:54-7","content":"It was until the gangs moved in."},{"speaker":"Marcus","time":"00:12:56-1","content":"Okay, and when did the gangs move in?"},{"speaker":"Randy","time":"00:12:57-8","content":"The gangs started coming around 86 I want to say 85, 86."},{"speaker":"Marcus","time":"00:13:01-5","content":"Ok alright so while you're a kid living there."},{"speaker":"Randy","time":"00:13:04-7","content":"But it when they started coming in it really wasn't territorial it was more drugs."},{"speaker":"Marcus","time":"00:13:14-7","content":"I get it I'm interested in this so one of the guys I talked to said when you're in here you hold onto old memories to try to go back there what kind of memories do you have that you go back to when you need to focus on something positive or think of a good experience from your childhood?"},{"speaker":"Randy","time":"00:13:47-4","content":"I really don't go back like talking about it I go forward I look for the day of getting out of here and being with my family because a lot of my memories of growing up was hard there's a few good moments but for the most part it was a lot of fighting so forth. So on so what I do is I don't dwell on the past because in the past there's a lot of failures a lot of heartaches so what I do is I focus on the future."},{"speaker":"Marcus","time":"00:14:19-1","content":"Yeah and that makes perfect sense yeah were you yourself targeted physically disciplined physically."},{"speaker":"Randy","time":"00:14:29-7","content":"At my home."},{"speaker":"Marcus","time":"00:14:30-8","content":"Yes."},{"speaker":"Randy","time":"00:14:32-5","content":"I was I was I think the last whooping I got me want to say whipping the last one I got I think I was like 15."},{"speaker":"Marcus","time":"00:14:42-0","content":"Okay."},{"speaker":"Randy","time":"00:14:44-2","content":"I got in trouble in school and so my mom was disciplining me with a board and she saw that I had grown beyond or that I had become immune so she just gave up."},{"speaker":"Marcus","time":"00:14:58-0","content":"Right."},{"speaker":"Randy","time":"00:14:58-6","content":"Right so that was disciplinary action at home from my mom and I understand now why she was doing it."},{"speaker":"Marcus","time":"00:15:11-3","content":"Tell me a little bit more you said you got married did you have any other relationships intimate relationships with girls that stick in your mind to this day or was it just mainly her."},{"speaker":"Randy","time":"00:15:22-2","content":"Since I been here and that was rough but out on the street that was more just like sexual relationships but when I got married we only was married like a year before I come here and so the majority of my good times was with her as far as other women no because again I never really had anybody to teach me how to talk to women or anything of that nature."},{"speaker":"Randy","time":"00:15:22-2","content":"I learned everything from the street and so growing up and you constantly trying to or you dealing with people from that standpoint it gets old and women mature from what I was told faster than boys or men so man it's like I was stuck."},{"speaker":"Marcus","time":"00:16:08-2","content":"Yeah ok do you remember the first time you got arrested for anything?"},{"speaker":"Randy","time":"00:16:17-4","content":"I do and it was gang related I had saw that some rival gang members on the school bus getting out of school and the people on the bus or the kids on the bus knew my face and they told them who I was and at the time I was at school away from school I was kicked out of public school for fighting for gang fighting and so that's the first time I got arrested."},{"speaker":"Marcus","time":"00:16:42-4","content":"Ok and did you end up with convictions prior to this one."},{"speaker":"Randy","time":"00:16:48-7","content":"Convictions no and the reason being it was my godfather was an attorney his name was Carl and so he was there for me and he got me through some tough situations it wasn't like I was going to jail back to back to back it was every now and then."},{"speaker":"Marcus","time":"00:17:08-9","content":"Ok fair so yeah it's good to have a godfather if you're going to be getting in trouble who's a lawyer yeah. So I assume from what you just said that you have ready access to firearms."},{"speaker":"Randy","time":"00:17:23-3","content":"As I got older."},{"speaker":"Marcus","time":"00:17:24-3","content":"Ok."},{"speaker":"Randy","time":"00:17:25-5","content":"When I was younger just joined the gang no because guns wasn't really that prevalent until guys started breaking into people houses they had the dope fiends breaking in people houses and trying to get something of value for their next fix and so guys really started coming a lot and I want to say around about 90, 91 like I said for the most part when the gangs first got here it was really more about drugs than it was about turn."},{"speaker":"Marcus","time":"00:17:57-5","content":"Sure yeah so things are much more complicated than one because for an even but if you could identify the main reason that you ended up going down that path that you did what would it be now that you've had this sort of all these years of wisdom to look back on now."},{"speaker":"Randy","time":"00:18:15-4","content":"I would say wanting to be around people my age I would say that and because we was all involved in the same thing and day in and day out we always hung around one another and so as we got older we just developed that habit and it led me here I would say that would be the contributing factor wanting to be around people my age and not around not being in house full of women."},{"speaker":"Marcus","time":"00:18:46-9","content":"Alright ok drugs and alcohol were they part of your life."},{"speaker":"Randy","time":"00:18:53-0","content":"Drugs for the most part I really then didn't too much care for drinking I drank every now and then I didn't drink the hard stuff my favorite drink was old Milwaukee. I would go and get see old Milwaukee or bud. So those are my two drinks as far as drugs it would be marijuana was my drug of choice at the time nothing hard."},{"speaker":"Marcus","time":"00:19:18-0","content":"Okay, no so let me ask you this when you it's impossible to answer this question with certainty but I'm sure that you've' asked yourself what if this didn't happen what if this particular charge that brought you here didn't happen how do you imagine that your life would have unfolded."},{"speaker":"Randy","time":"00:19:39-2","content":"I more than likely I would have been dead if this charge if this would have never happened because my life had started spiraling down and again as my heart at the time was heavily involved in the street and representing the gang that I was in so I had become known to like three other rival gangs and street and so it was like they wanted me and I wanted them."},{"speaker":"Marcus","time":"00:20:08-0","content":"You were a marked man at that point."},{"speaker":"Randy","time":"00:20:09-1","content":"Yeah."},{"speaker":"Marcus","time":"00:20:11-1","content":"Yeah sure so in a strange way when you look back on being arrested for this crime."},{"speaker":"Randy","time":"00:20:22-0","content":"It saved my life."},{"speaker":"Marcus","time":"00:20:22-9","content":"Ok."},{"speaker":"Randy","time":"00:20:23-7","content":"Truth be told like two weeks I want to say before I was arrested I just had the strange feeling that someone was going to kill me in my front yard or my backyard. Either one because we had an alleyway that leads behind the house and sometime I would come in through the alleyway."},{"speaker":"Randy","time":"00:20:23-7","content":"Sometime I would pull up in the front yard but I had a strange feeling like somebody's either gone kill me in my front yard or in my backyard and so by this situation happening it really saved my life it spared my life."},{"speaker":"Marcus","time":"00:20:58-6","content":"Yeah sure so I want to shift gears and focus on all the things that you've been doing for the last 4 years or so but before I do that in trying to just understand your experience and your life is there something about the first 21 years of your life that I should have asked you about or that you think is important that we skipped over."},{"speaker":"Randy","time":"00:21:23-3","content":"First 21 no more than my godfather he was killed in I want to say 1990."},{"speaker":"Marcus","time":"00:21:31-7","content":"Ok is this the lawyer."},{"speaker":"Randy","time":"00:21:34-2","content":"So that was also a turning point in my life too because he was someone that was real close to me although I was still in the game. We spent a lot of time with me and one of his one of the individuals that he was representing had got out of prison to my understanding went and robbed a store and was caught on camera and was arrested. They appointed my godfather as his public defender and my godfather told them they wanted him to take five years and they had him on film."},{"speaker":"Randy","time":"00:21:34-2","content":"So he didn't want it he said he didn't do it but anyway he wound up pleading guilty to the charge but when he got out he kidnapped my godfather the same day that I was supposed to we had it was more to me. I was supposed to be there the night that my grandfather was kidnapped and murdered and so that was a turning point for me it really was."},{"speaker":"Marcus","time":"00:22:40-2","content":"Wow and how what how far before you getting arrested for this charge did that happen."},{"speaker":"Randy","time":"00:22:50-5","content":"Let me see that was 1990 I was arrested in 94"},{"speaker":"Marcus","time":"00:22:54-3","content":"Ok so it sounds to me that your godfather was a very important figure in your life and maybe perhaps more of a father than anything else is that true."},{"speaker":"Randy","time":"00:23:05-8","content":"He was."},{"speaker":"Marcus","time":"00:23:07-4","content":"Okay, I'm sorry. So I'd like to learn a little bit about your early experiences here so I'd imagine that when you got arrested for this you got put in the parish jail for a while as you're going through the trial and of course now your godfathers not there to help you and you did you said that you pled guilty. Ok and you're 21 I assume that you're in your early 20s then when you get brought to Angola. On that bus ride from hunt to Angola what's going through your mind."},{"speaker":"Randy","time":"00:23:54-3","content":"I was thinking like a bad paradise and the reason why I say is because I had heard horror stories of Angola people getting raped people getting stabbed. So I'm like I don't have nothing to defend myself and I'm going to this new area this little population that's totally different from where I come from. So I was thinking like a bad paradise I was scared to death."},{"speaker":"Marcus","time":"00:24:18-5","content":"What were your first few weeks months here like?"},{"speaker":"Randy","time":"00:24:21-9","content":"Well soon as soon as they got me here and processed me in they sent me to protective custody I went to camp D hall 3 and 4 that was like protective custody and the reason being the day before from what I was told. I don't know if this actually any truth or not but the reason why I was actually sent there but the day before I got there they had a big gang fight in the visitors shed where we do callouts at night time."},{"speaker":"Randy","time":"00:24:21-9","content":"So with me having gang affiliation in my jacket and a lot of those guys from what I was told. They had been sent to standard lockdown and so with me coming here with a fresh life sentence not knowing anything this institution not knowing my mindset. So what they did was I'm assuming all the place they had available at the time was protective custody PC so that's where they put me at."},{"speaker":"Marcus","time":"00:25:15-4","content":"My understanding is that you don't want to stay in protective custody."},{"speaker":"Randy","time":"00:25:20-6","content":"Well back in the 90s it was real good."},{"speaker":"Marcus","time":"00:25:22-6","content":"Oh ok."},{"speaker":"Randy","time":"00:25:22-9","content":"The reason why I say that it was a one man cell. So I come out I came out from for rec like one hour a day and I had the TV there. So I didn't have to worry about sharing the cell with anybody I didn't have to worry about showering with anybody and so it was pretty good."},{"speaker":"Marcus","time":"00:25:39-6","content":"So how long did you stay there?"},{"speaker":"Randy","time":"00:25:41-1","content":"I stayed there. I want to say for like 4 or 5 months until I got in trouble back there."},{"speaker":"Marcus","time":"00:25:46-1","content":"Ok and then what happened."},{"speaker":"Randy","time":"00:25:51-3","content":"I went to extended lockdown and this is what happened I met a guy back there who had been incarcerated for like 20 years already and I was telling him about my legal work or about my legal situation so he and I started talking and he told me said this what you do because I had made the board to go into population. So they was going to send me to the working cell block he said well this is what you do he said."},{"speaker":"Randy","time":"00:25:51-3","content":"You write a letter you tell them that you got a fresh life sentence that you head hurt and that you don't want to go out there and kill nobody or you don't want to get killed. So you prefer to stay back here and so I wrote what he said verbatim in my own handwriting and sent it to the administrators of this institution and lo and behold I was locked up and so I was sent to extended lockdown."},{"speaker":"Marcus","time":"00:26:45-1","content":"So it wasn't very good advice."},{"speaker":"Randy","time":"00:26:46-3","content":"It wasn't very good advice for me being fresh in this institution I only been here for like 4 months 3, 4 months when it happened."},{"speaker":"Marcus","time":"00:26:55-1","content":"Do you think he knew that he was setting you up?"},{"speaker":"Randy","time":"00:26:57-1","content":"I think he knew but I had paid him like a hundred dollars to work on my legal work so he sold a good story the legal work wasn't about anything no case no case facts no anything of that nature so I believe he set me up to get locked up so we wouldn't have to be around one another for a while so that was a learning experience."},{"speaker":"Marcus","time":"00:27:21-9","content":"Sure they say now that when things change that protective custody is a place that you don't really there are some disadvantages from being in there."},{"speaker":"Randy","time":"00:27:32-1","content":"It is in light of everything that's transpiring now with some of the laws that's changing in Louisiana it's there it's a big disadvantage to be on lockdown or in PC because you can't get the education that you need."},{"speaker":"Marcus","time":"00:27:45-9","content":"Ok."},{"speaker":"Randy","time":"00:27:46-5","content":"With the laws changing and people are looking for guys who have been in population for a while who bettered themselves since they been here it's like all those guys have those opportunities. So if you're in the cell block or in PC."},{"speaker":"Marcus","time":"00:28:02-6","content":"You can't."},{"speaker":"Randy","time":"00:28:02-9","content":"You can't and it says a lot and so it's like they gone question everything about your actions being here."},{"speaker":"Marcus","time":"00:28:10-0","content":"Sure that makes a lot of sense. So if you could describe the young person the young randy and compare that to who you are now."},{"speaker":"Randy","time":"00:28:21-0","content":"It's night and day and again when I first come here like I said I was like a bad paradise. So going from form PC to extended lockdown and hearing the various stories or incidents that taking place in this environment I'm logging it all in my mind because I'm like ain't no way in the world I'm going to be a victim to what goes on out here. So when I started coming out into population I saw a lot of the guys I went to school with some of the guys from my hometown. So they was all in different places."},{"speaker":"Randy","time":"00:28:21-0","content":"So they tell me man you got to come out in population got to get out from cell blocks ain't nothing in the cell locks ain't nothing in lockdown for you. So I'm like okay, I'm coming and so when I finally made the board to come out in population I went to a block this was in 96 and so my fall partner the youngest one he was already here and so he was in population when he heard I was in the cell block. He was at population he came to the cell block where I was because I was the first one to come here before them but because of the gang situation and I made my rounds."},{"speaker":"Randy","time":"00:28:21-0","content":"So when I got to the cell block I had someone there that I knew there was other guys from my hometown who had been here for some years prior to me coming here that I didn't know but him I knew. So that mindset I still had from those horror stories. So I'm watching everything I don't trust nobody I'm watching everything. I only trust one individual. So as time progressed and I made my way from the cell blocks to population and this was all this was a shock as well."},{"speaker":"Randy","time":"00:28:21-0","content":"Because when I go into the dorms you have like I want to say like 64 beds you have like 64 people in the dorm and it's open. So there's no privacy you have 4 toilets no 5 toilets I want to 4 urinals and then the shower and I'm like I'm just coming off extended lockdown where I got this privacy to here so I'm really watching everything. So I as time passed and my homebody let me know this is what you don't want to mess with him or this group right here from New Orleans this group from Baton Rouge this group from from home these are the individuals that you hang with."},{"speaker":"Randy","time":"00:28:21-0","content":"So as they started giving me the game the ins and outs of the institution. I started getting comfortable. So as I started getting comfortable I'm starting to see the guys again in leadership positions in here and I want to know you could how could I possibly get into the positions that they were in and do some of the things that they was doing."},{"speaker":"Randy","time":"00:28:21-0","content":"So I started pulling the weight from the guys that I knew from home that was involved in the gang life and I started putting myself in a position because I wanted better for myself and so from when I first got here to who I am now is like night and day."},{"speaker":"Marcus","time":"00:31:33-8","content":"Yeah and I'm going to ask you specifically about some of the things you've been doing the activities and organizations and so forth that. So maybe another way to do that is to maybe have you walk me through your day so like what now compared to what it was like then what does your day look like what's your routine."},{"speaker":"Randy","time":"00:31:52-5","content":"My day now I'm a DJ at the radio station here."},{"speaker":"Marcus","time":"00:31:55-7","content":"Ok."},{"speaker":"Randy","time":"00:31:56-0","content":"So I work on Tuesdays and Wednesdays evenings. Majority of my days is spent in I'm also a graduate of the bible college I'm an inmate minister so the majority of my days are peaceful and quiet I make rounds or I can go to the hobby shop or for the most part go out on the yard and work until the work out on until it's my time to go to work but prior to having all that it was like work hard every day Monday through Friday from like 7 in the morning until like 3in the evening."},{"speaker":"Marcus","time":"00:32:33-8","content":"And what was that job."},{"speaker":"Randy","time":"00:32:35-4","content":"That job I was working in the field."},{"speaker":"Marcus","time":"00:32:36-6","content":"Ok yeah how many years you worked in the field."},{"speaker":"Randy","time":"00:32:40-3","content":"I worked in the field from the time in the cell blocks until population I want to say probably roughly about a year."},{"speaker":"Marcus","time":"00:32:47-6","content":"Okay alright so do you find yourself now in terms of being an inmate minister what does that involve."},{"speaker":"Randy","time":"00:32:58-8","content":"Inmate ministers just basically go around checking on guys being a spiritual advisor making yourself available to the inmate populations for those who might have or might be going through some things and they need someone to talk to they can't bet to the chapel."},{"speaker":"Randy","time":"00:32:58-8","content":"So we are there we available the inmate ministers give death messages we also perform church services which I'm a pastor of our local church as well. So we basically just make yourself available to the inmate populations."},{"speaker":"Marcus","time":"00:33:30-5","content":"Yeah when you look back at that transformation that you've made do you even sort of recognize that young man it seems like now that you're a pastor and you're doing all this just sounds as opposed to being a member of this gang."},{"speaker":"Randy","time":"00:33:52-3","content":"Yeah. I recognize him and even then I wasn't I want to say I wasn't a bad person I still had pretty good morals about myself in this environment I really didn't do anything that really got me out in trouble like starting fights and so forth and so on. Because I was learning the system of how to maneuver in and out but as far as what you see now and plus I had a lot of hair back then."},{"speaker":"Randy","time":"00:33:52-3","content":"So what you see now the smiling face the jubilant voice I didn't have that back then and people used to be afraid to talk to me I had numerous people tell me you need to smile more was like you ready to tie the world up. I was like man it's just the way I look. So now after growing up in this place and being around influential people meeting people such as yourself. It brought about major change and so my past and now it's like again it's like night and day."},{"speaker":"Marcus","time":"00:34:56-5","content":"Yeah I understand that. So I'm going to ask you a couple of difficult question."},{"speaker":"Randy","time":"00:35:03-7","content":"Ok."},{"speaker":"Marcus","time":"00:35:04-4","content":"What are your feelings about the victim the victim's family what happened how you make sense of that in your mind what tell me about how you feel about that now?"},{"speaker":"Randy","time":"00:35:14-0","content":"How I feel about that now it's terrible it actually taken me awhile to get there because for a while I used to block it out of my mind I didn't want to think about it and being here and having and being separated from the distractions out in society because when I was out there in society that's all I did from one place to another and being here to where you're actually place in an environment to where you have nothing."},{"speaker":"Randy","time":"00:35:14-0","content":"But the time to sit down and think and reflect back over your life and you and a lot of things my mom used to tell me I'm starting to see now. So it got to the point to where I started wising up and I started thinking about man from hearing what my mom was telling me how I hurt her how I let her down and the hurt that was in her voice and so I started thinking about how I let my mom down."},{"speaker":"Randy","time":"00:35:14-0","content":"How I hurt her and then it shifted from there to the victim's family and it didn't happen all at once it happened over a course of years because I'm thinking I'm missing birthdays I'm missing my mom's birthday I'm missing my sisters birthday I'm missing out on my nieces and nephews being born and I'm like man I'm missing out on family reunions all these things I'm missing out on and then one day it just struck me said what about the victim's family and it really sat in on me."},{"speaker":"Randy","time":"00:35:14-0","content":"So every year I think about not just my family but the victim's family what they're missing out on. So it's something I hold dear to my heart now because I don't look at it and just push it to the side and say well that's something happened no I think about it because like you said I'm being punished every day for the decision that I made didn't nobody make this decision for me I made this decision and it was and the reason why I did it was like I said earlier when I got tired of working I went to the street when I got tired of the streets."},{"speaker":"Randy","time":"00:35:14-0","content":"I went back to work it's just that this particular situation I wanted to buy a house for my wife and the people who owned this house was moving out of the state and they wanted to sell the house for like 10000 dollars. So I was told about this little convenience store on the outskirts of Shreveport in Louisiana where they had a lot of cash there so my intention was going in robbing get as much as I can and get out without anybody getting hurt but it didn't happen that way."},{"speaker":"Randy","time":"00:35:14-0","content":"So that's why I committed this that's why I'm in here I wanted to buy her that house and I was too lazy to stay on the job and work and save my money up to get her the things that she wanted. So I thought about going out there that was the best way to get it I can get it fast and continue to do what I do."},{"speaker":"Randy","time":"00:35:14-0","content":"So but it's something I hold dear to my heart now because I know that every year they're missing a loved one that loved ones birthday still holds still lives in their minds family reunions the birth of new family members all those things I know still holds true in that."},{"speaker":"Marcus","time":"00:38:28-9","content":"Yeah and it's interesting what you said about making the connection because you can see what your family's going through when you look at the impact it's had on your family who had it been the hardest for."},{"speaker":"Randy","time":"00:38:41-8","content":"It's been hardest on my mom that that I know of my sisters when I left the street they was real young so it's been hardest on my mom because I'm her only son."},{"speaker":"Marcus","time":"00:38:51-4","content":"Okay yeah does she come visit you here still."},{"speaker":"Randy","time":"00:38:54-8","content":"She does as a matter of fact I saw for the first time within two years last Saturday."},{"speaker":"Marcus","time":"00:39:00-1","content":"Wow how was that visit."},{"speaker":"Randy","time":"00:39:02-7","content":"It was a surprise it really was because I had talked to my sister I want to say last Thursday not this past the Thursday before last and they was on the phone talking and said man we was just talking about you I'm like yeah what are you all talking about she said aw nothing we just wondering how you doing I said don't tell me that you all gone pop up to try to surprise me and visit she said no we ain't doing that."},{"speaker":"Randy","time":"00:39:02-7","content":"We gone come see you for the rodeo and lo and behold I'm in the visiting shed working the concession and the lady called me and told me I had a visitor I'm like who me she said yeah you got a visitor I said ain't nobody supposed to be coming to visit me and lo and behold my mom and two of my sisters I hadn't seen and one of my nieces I hadn't seen in like 13 years."},{"speaker":"Randy","time":"00:39:02-7","content":"I had a chance to see my great nephew who was two years old I saw him for the first time and two of my nieces younger nieces I hadn't seen in over 2 to 3 years so it was a surprise."},{"speaker":"Marcus","time":"00:40:04-4","content":"Yeah so I'd like to get your perspective on these visits because you're working in the visitors shed and then you're having these visits of your own and I imagine having not gone through this particular experience but just putting myself in your shoes it would be very difficult emotionally very intense because you'd be very happy to see them you'd hate to see them go it also is a reminder of your separation from them how tell me a little bit about the emotional rollercoaster of these visits."},{"speaker":"Randy","time":"00:40:38-0","content":"After being here for a while it's like you got accustomed to it that this is your permanent living arrangement until something happens whether it court or the parole board so for me it I become accustomed to it that they gone come and they gone leave. So being here and working in the shed and seeing a lot of guys visit and it's the same thing week in and week out because we visit on Friday Saturday and Sunday."},{"speaker":"Randy","time":"00:40:38-0","content":"So you see the same people come in and leave and it's like your mind has been programmed to see these people come and go now when my family come it's an exciting time and it's a taxing time because when they leave you be tired you be emotionally drained because all this you getting all this processing all this information of everything that transpired at home and everybody's talking at the same and everybody's eating and everybody's enjoying themselves."},{"speaker":"Randy","time":"00:40:38-0","content":"Every now and then it's like when they say visiting time is now over you get that sense like man I really want to go home today. So you never really lose that feeling but you come adjusted to this environment so every now and then that feeling of man I got to get out of here it so."},{"speaker":"Marcus","time":"00:41:57-7","content":"Yeah I just imagine that it's difficult for everybody worth it obviously to see your loved ones but not easy."},{"speaker":"Randy","time":"00:42:05-2","content":"Yeah."},{"speaker":"Marcus","time":"00:42:08-3","content":"But like you said people get used to things. So the and this is another difficult question as well and one of the things that I'm trying to do with this project is to really shine a light on how difficult life without parole is as a sentence by talking to guys about coping mechanisms when you think about the possibility of dying here.. How do you cope?"},{"speaker":"Randy","time":"00:42:43-5","content":"To be honest with you I've thought about it and it's like I've turned to religion but I done got from that point of religion to relationship and so again my desire is to get out of here to be the one that I never was to my mom and to be the brother that I never was to my sister because of my actions and my decisions on the street."},{"speaker":"Randy","time":"00:42:43-5","content":"So I'm looking forward to that day but if I so happened to die here because I have a relationship with Jesus Christ I'm fine with it because I understand that I'm the one that made the decision to get myself here."},{"speaker":"Randy","time":"00:42:43-5","content":"So but every day I wake up and I when I'm walking up and down the walk I encourage some of the guys I know man we're one day closer to getting up out this madness. So I'm always looking for that day I'm always looking toward the future but if I just so happen to have to die here then I die I'm at peace with it."},{"speaker":"Marcus","time":"00:43:44-3","content":"I was going to ask you if there was this turning point for you because sometimes it's a sudden thing other time people just age out sometimes people are actually it's not so much a turning point they just sort of gradually come to their sense about things and it sounds to me that the change for you was seeing other guys in leadership positions and figuring how do I get there and then all good things started happening."},{"speaker":"Randy","time":"00:44:08-9","content":"Yeah and one of those that's true and one of those individuals was pastor hicks pastor Ron hicks I used to be a member of his church and I saw him and a lot of other guys in leadership positions I was able to go in and out have liberty in this prison setting \"certain\" liberties. I wanted that and I'm like I don't want to work in the field all day I don't want to be in the kitchen all day so I saw them and started questioning what I need to do so they was more or less of a beacon to where my focus placed on it and I wanted to be where they were be where they are."},{"speaker":"Marcus","time":"00:44:54-8","content":"Yeah in spite of having a relationship with Jesus Christ. For you what is the worst part of this experience?"},{"speaker":"Randy","time":"00:45:10-1","content":"The worst part of this experience man is showering with other men being in a dorm with 84 or 86 other personalities and there is no privacy you don't have that liberty to go as go in and out as someone in society when your loved ones come you can't leave that's the difficult part and not for a lot of guys in here who don't have family support that's rough and to see someone or to know someone and to see someone that you have come here with or met in this environment that is a good person and just got caught up in a bad situation."},{"speaker":"Randy","time":"00:45:10-1","content":"Getting sick and eventually dying in this place that's hard it's real hard because it's a reminder of what awaits each and every one of us if we don't get out of here. So that's the hard part seeing other people suffer through illness and dying to me that's really the hardest part because it's people that in here it's like when you grow up this is your family it's your family away from your family because you're around these people every day and to see someone to get sick or to take sick and just die it's hard."},{"speaker":"Marcus","time":"00:46:33-3","content":"Sure. So let's focus on the possibilities that you will get some relief if you're able to go before a pardon board what would you like to say you'll have a short time to make a statement."},{"speaker":"Randy","time":"00:46:52-8","content":"I done entertained that question several times in my mind and it's always and it always different I wouldn't know what to say but I would say this and I don't know if it's right or wrong but knowing that the death of the victims was not in vain and their death it actually saved my life. So I'm a better person because of it and my mom used to always tell me said a hard head will make a soft tail."},{"speaker":"Randy","time":"00:46:52-8","content":"So I my heart and my mind has been made soft through this experience and the things that I once used to participate in I no longer participate in those things like I done grown out of them. So I would tell them that but I wouldn't know if just making that statement would set right with the victim's family but it's truth for me because I see so many people that come here."},{"speaker":"Randy","time":"00:46:52-8","content":"And I'm not just putting them down but the crimes they committed it's like alright I'm going to continue to go on with my life and so there's no turning point there's no change but for me sitting back looking at all the destruction I done because and like it pains me but through that I can learn."},{"speaker":"Marcus","time":"00:48:07-1","content":"Yeah."},{"speaker":"Randy","time":"00:48:07-6","content":"It made me a better person."},{"speaker":"Marcus","time":"00:48:08-7","content":"Yeah no I think that's a very reasonable thing. So you've accomplished a lot and you now have a bachelor's degree but you had also mentioned a GED and it's specific importance for your mother can you tell me what are you most proud of."},{"speaker":"Randy","time":"00:48:33-5","content":"I really never thought about it I well I can say my seminary degree because I'm the first in my family to actually to go to seminary or college that's the most. So I'm proud of I got my GED I graduated from seminary I also have a Webbers degree level 1 welding so I have that as well but I would say my seminary degree."},{"speaker":"Marcus","time":"00:49:00-3","content":"Yeah I have one last question but before I ask that is there something that I should have asked you but I didn't get to."},{"speaker":"Randy","time":"00:49:12-9","content":"Not that I'm aware of but my life is an open book so whatever you want."},{"speaker":"Marcus","time":"00:49:17-0","content":"So yeah I have one more question because one of the things that I would like to hear your perspective on what would you want that person to know about what the reality is of living a life sentence."},{"speaker":"Randy","time":"00:49:32-9","content":"My mom used to tell me said bought sense is better than told sense she said I can tell you what's right but if you don't want it then you got to go out and get it for yourself so I done spoke to a lot of tours guys that's on parole violation and a lot of at risk youth I done spoken to a lot of them on yours and I let them know man this is not a place that you want to be because one thing about life is progressive it never is there's never a rewind."},{"speaker":"Randy","time":"00:49:32-9","content":"So the things that you have now the liberties that you have enjoy those liberties don abuse those liberties because if you abuse them then it's gone be taken away from you and like I stated before the old saying is you never miss your water until your well run dry. So the things that you enjoyed doing being at home with family picnics family gatherings church on Sundays going to the movies whatever you do that's right that's enjoyable maintain."},{"speaker":"Marcus","time":"00:50:35-3","content":"Yeah and that makes sense to me as something that you would want to tell people like don't do don't come down this path but what I mean is why should somebody who doesn't really care doesn't think about it why what would you want them to know about what it actually is."},{"speaker":"Randy","time":"00:50:53-2","content":"Well this if I'm understanding the question right this place is a means of correction for those who wants to be corrected after coming into this environment and your record will actually show that you've taken positive strides coming in this coming in this place. Another thing is I don't want to say it's a waste of taxpayers' dollars because this is not but for the most part it is because it's holding a lot of good men here some have just got caught up in a bad situation."},{"speaker":"Randy","time":"00:50:53-2","content":"You have some as we done seen throughout the years you have some citizens that have been arrested for crimes they didn't commit. So things like that it needs to be noted taken note of because it can happen to anybody. So for those who have come here and educated themselves or rehabilitated themselves, I would say they deserve a chance and the reason why I say that is for those who don't take heed or take not of what's going on in this environment just as that innocent individual was caught up in a situation you can be very well caught up in the same."},{"speaker":"Randy","time":"00:50:53-2","content":"In a similar situation to where your liberties are taken away from you and so I would tell individuals who don't have any care any concern about prison life that they need to because of those simple facts you can be put in a situation to where you had to make a split moment decision and it could cost you and so you could come here and wind up losing all your liberties and you will find out for yourself I'm not a bad person I just got caught up in a bad situation."},{"speaker":"Marcus","time":"00:52:34-3","content":"Yeah."},{"speaker":"Randy","time":"00:52:34-8","content":"But now I'm here with long nights long nights and don't know when I'm going home and so you need to take heed of a place like this because you're not exempt no one that's living is not exempt from prison."},{"speaker":"Marcus","time":"00:52:46-9","content":"Yeah."},{"speaker":"Randy","time":"00:52:47-6","content":"All it takes is one decision and so I would say to those who are don't have any care or any concern please take please have some type of concern or care."},{"speaker":"Marcus","time":"00:53:03-1","content":"Fair enough I think that's a good place to end randy I really enjoyed learning about you."}]}