{"name":"","transcript":[{"content":"Raymond Flank Transcription REDACTIONS FINAL"},{"speaker":"Raymond","time":"00:00:02-3","content":"My name is Raymond Flank and I was convicted of murder in New Orleans parish, Orleans parish."},{"speaker":"Marcus","time":"00:00:19-0","content":"How old were you?"},{"speaker":"Raymond","time":"00:00:20-7","content":"When I was arrested, I was arrested when I was 20 years old. And I'm 54 now. I've served 34 years in prison."},{"speaker":"Marcus","time":"00:00:38-6","content":"Ok. So I'm going to ask you a few questions about life coming up in New Orleans, before you were 20. And then a little bit about how your life has been since you were arrested. Can you tell me a little bit about growing up, your family, the folks who were close to you, raised you?"},{"speaker":"Raymond","time":"00:01:03-6","content":"Well I was born in 1963. And I am one of my mother and father of ten children, I have nine siblings. I'm the youngest, I'm the baby. In, I was born in Desire Project. That's where I was brought from Flint Goodridge Hospital to the Desire Project. And as far as I can remember as a baby, I went through some things that I can remember vividly clear. I can remember Hurricane Betsy ok. And I was only about 2 years old."},{"speaker":"Marcus","time":"00:01:51-2","content":"'65?"},{"speaker":"Raymond","time":"00:01:52-6","content":"Right, '65. And I can remember my mom and dad brining me upstairs to our neighbors. I can remember looking out the window of the neighbor's apartment. And my dad, Mr. Jimmy, Jimmy Flank, everybody called him James. I can remember he had a Pontiac, a yellow, it was like '57 Pontiac. It was beautiful because my dad did auto-mechanic and body and fender work most of his life. So it was a very clean car and he prided his car. He kept it real clean, smelled nice on the inside. It was yellow with white interior inside."},{"speaker":"Raymond","time":"00:01:52-6","content":"So you can imagine how he felt when Betsy came and that Pontiac being in all that water. I can remember that, I was only 2 years old. And two years, I was about three years old, two or three. About '65 I can remember staying in the project and I could remember a lot of violence as a baby."},{"speaker":"Raymond","time":"00:01:52-6","content":"I can remember hearing gunshots at night. I can smell, even smell the gunpowder. I can remember in the hallways, I can still see the bullet holes in the hallways. So I came up in a time when a lot of violence was going on. And this was our project. I remember, I can remember our elementary school."},{"speaker":"Raymond","time":"00:01:52-6","content":"Moton Elementary School. And I can remember we used to get graham crackers and milk for our little snack. I can remember a few kids that I was surrounded with that lived in. But I can remember Officer Friendly and I can remember Officer Friendly, looking at him, dressed neat, very nice, passing out coloring books. So this image, it stayed in my mind so I always felt close to police officers."},{"speaker":"Raymond","time":"00:01:52-6","content":"Yeah, I always felt a since of protection. And in 1968 we move out of Desire Project and I didn't want to move. I like, once I drop anchor somewhere I don't like to move because of my friends and areas that I'm used to being around. I don't like readjusting."},{"speaker":"Raymond","time":"00:01:52-6","content":"Okay but I didn't have a choice, I was a kid. Mom and Pops, Pops got a raise at his job. He was working in Metairie at a body and fender shop. Mike's body and fender shop, I always remember that because he would take me with him on the weekends sometimes to hang around the shop."},{"speaker":"Raymond","time":"00:01:52-6","content":"And we moved from the 9th ward, we moved in a ward, the 5th ward. It was much more pleasant, much more pleasant. I didn't hear gunshots at night anymore, so that was a big relief. The smell was different. We had a couple of factories a few blocks behind our house."},{"speaker":"Raymond","time":"00:01:52-6","content":"And I used to smell molasses all the time. I don't know if it was kind of like a syrup factory or something like that. We moved in the neighborhood with an avenue right in front of our house. So the cars would pass all the time. And the new school I that enrolled in, it was a little integrated."},{"speaker":"Raymond","time":"00:01:52-6","content":"Down in the 9th ward, Moton, it was all black. So it was something new to me. I was learning more. It was like, I was on a journey. And I enjoyed that neighborhood; I met new friends. We had a park called Easton Park and I would go to park and I got on the baseball team and the football team."},{"speaker":"Raymond","time":"00:01:52-6","content":"And mother and father they were always, father always worked, mother worked every night then. She worked with my aunt Ruth. Aunt Ruth Monroe. And my aunt Ruth Monroe had a restaurant by the river. And all the merchant seamen, they would get off when they boat docked or whatever and they would come eat at the restaurant."},{"speaker":"Raymond","time":"00:01:52-6","content":"And I used to go to the restaurant on the weekends and hang out around and see these guys. So, mother had a little income coming in but Dad was the breadwinner. And he kept me with football equipment, baseball equipment. So I got attached to a little sports thing."},{"speaker":"Marcus","time":"00:07:10-0","content":"Did you have some, some best friends that you still remember? Coming up?"},{"speaker":"Raymond","time":"00:07:16-9","content":"Yes. It was, the most memorable friend I had was a guy named Avery Johnson, AJ. And I guess what made him so memorable because he was the first guy I met that had a leadership potential. He had this leadership potential. We played baseball together, we played basketball together, and we played football together. In each sport, he was like the key man. Baseball, he was the pitcher."},{"speaker":"Raymond","time":"00:07:16-9","content":"So he like calmed everybody down. \"Come on guys, let's get it together, let's get these guys\" In football, he played to quarterback so he was like \"Huddle, look this is what we going to do\""},{"speaker":"Raymond","time":"00:07:16-9","content":"In basketball he was the point guard. So he kind of like the coach always designated him to be the captain and stuff. So I kind of like looked up to Avery. And we became good friends."},{"speaker":"Marcus","time":"00:08:27-2","content":"Have you been in touch with him?"},{"speaker":"Raymond","time":"00:08:30-1","content":"No, I haven't been too much in touch with Avery. As a matter of fact, in 1981 we kind of move out of the neighborhood we was staying in around Avery. And this kind of like caused our communication to kind of like dissipate a little bit. And to top it off really, Avery and I had begun to go different ways because something's that I begin to get involved with, Avery didn't participate in."},{"speaker":"Marcus","time":"00:09:07-5","content":"Like what were you getting involved with?"},{"speaker":"Raymond","time":"00:09:08-7","content":"Well during my junior high school years, some of the friends that we were growing up with, we liked to get dressed up. We liked to go to dances, school dances. And we started drinking. Cheap Boone's Farm wine, Tickled Pink, smoking commercial weed and stuff like that. The little weed and things and Avery didn't do any of this, he didn't do any of this. And this kind of like caused us to depart a little bit as well."},{"speaker":"Raymond","time":"00:09:08-7","content":"And as time went on, it was time that Avery and I just walked past one another and didn't speak. And little did I realize that the path I was going wasn't the right path. And in 1983, I had got into a few things before 1983, that's when I was arrested for this charge. But right before that, I was getting drunk and getting picked up and having to pay a fine for disturbing the peace. Small stuff."},{"speaker":"Raymond","time":"00:09:08-7","content":"And I think this derived from, my mother passed in 1981. And it kind of like, really hit me because I had been around moms all my life and being the baby boy, sometime you really believe you're a baby. Hearing this \"Oh you're my baby boy\" Around guests and stuff all the time. And that really, I mean it pierced my heart. To come home and not smell that good cooked food and not getting my laundry done. These type things kind of like get you in the long run."},{"speaker":"Raymond","time":"00:09:08-7","content":"Not right away, I didn't expect it to hit that hard. But I started drinking more. And it kind of devastated me. And in 1983 is when I was arrested. And that same year, 1983, Avery Johnson went to Southern University. So, throughout my experiences, I'm constantly in my mind."},{"speaker":"Raymond","time":"00:09:08-7","content":"I'm constantly like wow, I should have stood on that path with Avery and I probably would've, probably went that way and been better off. And finding myself in prison was one of the most devastating things I had ever experienced besides the death of my mother."},{"speaker":"Marcus","time":"00:12:08-4","content":"Let me stop just a second. If you look back on your childhood, is it fair to say that you were raised in a loving home with adults who took an interest in you and made sure that you were cared for?"},{"speaker":"Raymond","time":"00:12:21-6","content":"I was raised in a very loving home. My mother and my father was always there. Mother, she made sure that we had a hot cooked meal every day. I didn't have to worry about that."},{"speaker":"Marcus","time":"00:12:39-7","content":"Was there any fighting in the house?"},{"speaker":"Raymond","time":"00:12:42-0","content":"Well, coming up in a house with brothers, it's going to be fighting. I was, I'm the baby boy. My brother over me, right over me, Ralph about a year and a half. And we have a brother that's over Ralph that have Ralph about 2 years. So it's the three, us three was like, the rest of my brothers like moved out of the house. So we three were like, until my third brother, the third of the last, until he got an apartment we were all three living together. And he was an obsessive clean-up freak. He loved everything clean."},{"speaker":"Raymond","time":"00:12:42-0","content":"So, me being the youngest and me being in sports and throwing my cleats against the wall and my shoulder pads and my dirty jersey and helmet and stuff. He didn't agree with that much so I and he got into about a lot of that, cleaning up and keeping the house clean. And when he left, I can do that. But still that left my brother right over me, Ralph. Ralph and I fought a lot about who eating food out of the icebox. Mom just made groceries Friday, I ate a whole bag of oranges and he's like."},{"speaker":"Marcus","time":"00:14:06-7","content":"Typical sibling"},{"speaker":"Raymond","time":"00:14:08-1","content":"Just small stuff nothing serious."},{"speaker":"Marcus","time":"00:14:10-2","content":"Did any of your nine siblings end up getting in trouble?"},{"speaker":"Raymond","time":"00:14:14-5","content":"Yes. My brother, let me see it's my, my mother's 6th child, was arrested for an armed robbery and a murder. I was 13 years of age and my brother that's over me, we were living with my mom and dad and it was about maybe 2:00 in the morning when the FBI came and literally kicked our door in. And I was laying in the bunk bed and I just awakened and the flashlight was in my face like and I was like, I was devastated."},{"speaker":"Raymond","time":"00:14:14-5","content":"My heart was beating I didn't know what to do. I could hear my dad \"You all don't rush in my house like this\" I could hear my mom \"Oh please Jimmy just cool down\" I was like devastated, it was like wow and I got to go to school this morning like wow. And I had found out that my brother was involved in a robbery and a murder with two other guys. And this actually broke my mother's heart."},{"speaker":"Raymond","time":"00:14:14-5","content":"And my dad, it, it just, tore him to pieces as well. And it affected me. It affected me because now I have to face the kids in school. It's all on the news. My neighbors, everybody know about it. Everyone's looking at me strangely."},{"speaker":"Marcus","time":"00:16:23-5","content":"What was his first name?"},{"speaker":"Raymond","time":"00:16:24-6","content":"Oh my brother name. And he's up here now. And he falls in the 73-79 part of your life."},{"speaker":"Marcus","time":"00:16:41-9","content":"I believe I just saw a video of him."},{"speaker":"Raymond","time":"00:16:43-7","content":"Right. And he was one of my favorite brothers. No one never would expect him to have gotten into that. And I wouldn't have. He always was the brother that dressed nice. Matter of fact, as I reflect when I was in the Desire Project, he was the only brother I can remember that bought me my first toy. And we have family photos to show that."},{"speaker":"Raymond","time":"00:16:43-7","content":"And we were way back and he had his first car and I was playing with that toy. I don't know if this is the reason why I grew up just very fond of him, but he never showed me any signs of weakness. He never showed me any signs of dislike for anyone. He loved my mother, he always bought my mother presents and stuff. And this how I wanted to be when I see him because he impressed me with things like that."},{"speaker":"Marcus","time":"00:18:02-6","content":"And you remain close?"},{"speaker":"Raymond","time":"00:18:04-0","content":"Yeah, we're real close. We really close. And if you honestly would ask me if it's anybody in this prison who I would probably give a vital organ to without no hesitation, he would probably be the one. Really, he would probably be the one."},{"speaker":"Marcus","time":"00:18:40-0","content":"Did you get into fights in school?"},{"speaker":"Raymond","time":"00:18:43-7","content":"I got beat up. My future wife, my fiancé, her name Cassandra Delpit, and she just can't seem to stop visiting. I get visits regular, thank God. And she's waiting for me to come home and we have plans."},{"speaker":"Marcus","time":"00:19:06-2","content":"When did you meet her?"},{"speaker":"Raymond","time":"00:19:07-4","content":"I was 15 years old. I was 15 years old and I asked her to come over, to the house and have a little fun and stuff. And she came over, we didn't do anything serious, we just sat around, listened to music. And I bought her some cake and we ate cake and drank soda and we had a good time. And it really didn't hit off real good. But we went out a couple of times and next thing like I said after my mother had passed, that was right during that time."},{"speaker":"Raymond","time":"00:19:07-4","content":"And it didn't work out well then. I was trying to get myself back together. I think I should have allowed her to help me at that time but I couldn't stay still. I was ripping and running alcohol and stuff. I wouldn't consider myself to have been an alcoholic but I drank a lot."},{"speaker":"Marcus","time":"00:20:10-7","content":"Did you have any children?"},{"speaker":"Raymond","time":"00:20:13-9","content":"Well another date occurred okay. And this time, something did transpire. And matter of fact my mother was sick in the next room. And I had a lot on my mind and a friend of mine, Dorothy, she come over and we listened to some music and it just got to that point and we had sex. And maybe a month or two later, mother had passed in between that time so I was once again devastated. And my and my pops we were staying together."},{"speaker":"Raymond","time":"00:20:13-9","content":"My other brother had moved out right over me. And me and my pops we were staying together. And the phone rang, we were in the living room and the phone rings. And my pops gets on the phone and its Dorothy mother on the other end telling my dad that Dorothy's pregnant. So I'm like wow I don't, and my dad tells me look, you did pregnant Dorothy. And I'm like, well I only had sex with her that one time, I mean come on. And I wasn't really knowledgeable of sex thing, I would just have sex."},{"speaker":"Raymond","time":"00:20:13-9","content":"I didn't know, the amount of times you had to have sex to really make a woman pregnant or anything like that. I wasn't trying to do it, it just was a thing that happened. So I was kind of like, nervous, all that's going on. I'm going through these things. So I'm like I don't know if that's mine or not. And I think I really made someone mad when I said that."},{"speaker":"Raymond","time":"00:20:13-9","content":"On the other end of that line because they just hung up and miscommunicated and maybe 2 weeks later, we tried to go out by Dorothy's house, me and my brother. And they didn't want to be bothered, they, get away from their house. So months later, after she had the baby, we tried again and still couldn't get through."},{"speaker":"Raymond","time":"00:20:13-9","content":"So maybe a year later I wind up in trouble, I got out, then next thing I'm in trouble again. Little small charge, aggravated battery, wasn't nothing serious. I just had to pay a fine and I got out. And then I got another littering charge, all these small things start to kick in and just frustrate me. And one thing led to another one and that's when I got the charge that I'm here for."},{"speaker":"Marcus","time":"00:23:10-4","content":"But when you look back on that more troubled person, that younger person who came here, how different are you from that person?"},{"speaker":"Raymond","time":"00:23:25-7","content":"That's easy because since I've been incarcerated, I've learned who I really am. I've learned my capabilities. Doing my initial stays of going through my trial, I can hear mom say 'Just read the bible, you don't really have to understand what you reading, just read it.' Because I wasn't an avid reader, I wasn't good at understanding what I read. And I don't know how I got to the 9th or 10th grade. Maybe my communication skills, hanging with the guys that play sports real good, and me just putting in my little athletic abilities."},{"speaker":"Raymond","time":"00:23:25-7","content":"But listening that Mom in my mind say 'Just read that bible.' I picked up a little Gideon's Bible. The priests used to come on the tier and walk around and pass out books. And I begin to read that Gideon Bible and I begin to pray. And the guys around me had a little bible study, and we really felt something, a force there that was true. And I went on to trial and it was like, when I walked in the court it was like these angels, big with wings, muscles, and big legs. They were like with me and I'm like I don't have a doubt, I'm about to get out of here. And I had a mistrial."},{"speaker":"Raymond","time":"00:23:25-7","content":"So I went back to this tier. And they transferred us, the guys that were on the tier. All we guys got some in court. Some guys got released, I got 5 years, I got mistrial. But they dispersed us and I went on the other side. Now this cell was clean, got a great bible, everyone respect this cell, respect one another. Even the guys who wouldn't read the bible respected the guys who were reading. Guy who was playing cards, 'Keep it, let's keep it down, those guys are in bible study.' Everybody respected one another."},{"speaker":"Marcus","time":"00:26:05-5","content":"At house B?"},{"speaker":"Raymond","time":"00:26:08-4","content":"House of D, The House of D that was the House of Detention back then. They house inmates who were back and forth going to trial back then. I don't know how they doing it now, but 30 something years later. But they transferred me on the other side of the House of D. And when I went on the other side of the House of D, mattresses all over the floor, it was smelly, it was guys was cussing, shirts out. It was like a mess. So I took that Gideon Bible and I hit it under the bed."},{"speaker":"Raymond","time":"00:26:08-4","content":"Because I needed to blend in with these guys, that's what I thought. And I started cursing again, I started to fight again. And I went back to trial and I tried to pretend that those angels were with me, but they wouldn't. I got found guilty and I come to Angola. And when I arrived at Angola, I went to a camp that's abandoned now. The same camp one of the towers they sent to the African American Smithsonian Museum. That's how long I been here so that abandoned building is the building when I first came here."},{"speaker":"Raymond","time":"00:26:08-4","content":"And I walked in this huge door. It was rusted, the hinges was rusted, and when they opened it made a sound. And everybody was in the field and it was dark on the tiers because it was hot in April. And they cut the lights off when it's hot so it cool the place down. So I see one guy name was Innean. He said \"Stand right here the security going to come back in a minute\" But I stood there for about an hour and a half. By this time, the field line was coming in. And they come through the same door and two guys with handkerchiefs on they mouths, they walked toward me."},{"speaker":"Raymond","time":"00:26:08-4","content":"And I braced myself against the wall because I heard a lot of stuff about Angola. So I was prepared for battle. And come to find out that was my brother and a friend of mine who I was on A1 with Calvin Duncan with. His name was Watermelon, Calvin know him. It was my brother and Watermelon and we laughed. So it gave me a sense of hope because I felt as though someone knew where to send me. Someone was sending me somewhere where I can start to try to get myself out of here. And around people that I can communicate with."},{"speaker":"Raymond","time":"00:26:08-4","content":"So I took this for a minute, but it still was something in me that I had to make this impression. So at the time I had a suit filed for my eye and the parish and I had a court order to go to Charity. Now I'm in Angola but I got a court order to go to Charity. That next day I was scheduled to go to work in the field. So I tried to use that court order to say I can't go in the field, I can't use but one eye."},{"speaker":"Raymond","time":"00:26:08-4","content":"You sending me in the field, I can't work. So security, yeah you going in the field. So I caused this big commotion and I walked out with this guard and me. It's where these guys got guns and you can't go beyond that perimeter or you'll get shot. So one of the guys shot in the air-Pow. And the whole line like, 'Man Flank what are you doing? Oh my God.' And I was young, I was 24 years old. And warden cars and trucks and everything start coming, I mean a big commotion."},{"speaker":"Raymond","time":"00:26:08-4","content":"And they got me and they put me in the car and roped me up and sent the social worker to see me. And I explained to her, look I got a court order for my eye, I'm not supposed to be going in the field. So this led to like maybe 10 write-ups when I first got here. And as time went on, I finally went out in the field, did my work, come back. And my brother who him and I wind up in the same cell together. And a guy let me come in this cell and he went in the other cell. Everybody got along convicts. Before you knew it, my brother made it the board."},{"speaker":"Raymond","time":"00:26:08-4","content":"The board is where you go to a better place in the facility, much better. A dormitory instead of a cell, you go in the dormitory, it's much, you at a little bit more liberty inside the prison. He made the board to go in the main prison. And I'm like wow, my brother left me here alone. But I was cool and that's when I start to well I'm going to start staying away write-ups and I'm going to go down walk in the main prison."},{"speaker":"Raymond","time":"00:26:08-4","content":"So I did four months without a write-up and I went to the main prison. And at this time, they wanted the prisoners to make a death bed for guys who would come in and get the lethal injection, it's a bed. And the guys refused, they all bucked. And they say my brother was a representative of one of the groups so he went to Camp J. And now I made it down the walk he's not down here anymore so I'm like wow. So I start getting some of the things down to the main prison."},{"speaker":"Raymond","time":"00:26:08-4","content":"I start to get more focus on, I start the maturing. I got in law class and went to law library and got on the sports team to stay in shape with the football and stuff. And got me what's called a job, I start working culinary in the kitchen. And I start straightening up, staying away from a few write-ups. Before you know it, I got another write-up and wind up at Camp C again. And back then, Camp C I think that the angels that I met when I got that mistrial in the parish, five or maybe eight years before I wind up at C."},{"speaker":"Raymond","time":"00:26:08-4","content":"I start to look for those angels again. I start to pick my bible up again, I start to pray more. A group of guys came in called Cairo's, Christian folk, real humble, nice folk. So I start got with those folks and I start to go to church more often and start doing the right thing. And that's when I really got the idea of what I was supposed to be doing."},{"speaker":"Marcus","time":"00:32:59-1","content":"How old were you?"},{"speaker":"Raymond","time":"00:33:00-2","content":"I was, it was in 1993 so I was right about 30, 31 years of age then. Right, I was about 30 years old then. And that's when I really picked up. I tried to get my GED because Missouri Law School came, the same school Calvin got in. And I tried to get in the Law Missouri School but I couldn't get my GED quick enough. So I got my GED anyway and as soon as I got my GED, the New Orleans Theological Baptist Seminary brought a theological program in the prison. And I can reflect when I was a kid, my father used to go fishing in Chalmette."},{"speaker":"Raymond","time":"00:33:00-2","content":"And he used to go down Gentilly Boulevard and he used to go by this old icehouse. And right across the street was the seminary, so I was always inquiring about the seminary. So that moment of someone really leading and guiding me came up again."},{"speaker":"Raymond","time":"00:33:00-2","content":"So I got involved with the seminary and I was one of the first graduates. 17 of us graduated from the bible college and it really gave me a sense of purpose. I really straightened up then, no write-ups. I mean it was the turning point I think of my life then. I began to minister to other men who probably was going down that road of no hope. It really encouraged me."},{"speaker":"Raymond","time":"00:33:00-2","content":"From there, I got a job at the radio station, KLSP. I was working at the radio station as a result of my meeting Eric Neville and the Neville brothers. And was here at that time, bless his soul, he was a chaplain here. And he seen, he thought that I was the right guy for the job, so they gave me the job at the radio station."},{"speaker":"Raymond","time":"00:33:00-2","content":"So I became a prison celebrity. So I was looked at much more, guys respected me, I tried to help everybody who I could help. And I really start to grow, it really made me feel like somebody. And I've always had someone to file for me."},{"speaker":"Raymond","time":"00:33:00-2","content":"I never knew law real good. I knew, I was familiar with the inmate counselors so I always got somebody help me out in that area. And that was one thing that I really paid attention to keeping something in the courts to try to get out of prison. I never gave up on that. And I always want to help people. And after I got at the radio station, I joined the hospice program. I became a hospice volunteer. So this broadened my support toward others. And it made me really think that I was a humanitarian because I really sowed myself in other people."},{"speaker":"Marcus","time":"00:36:42-2","content":"Taking care of the elderly is difficult, intimate work. And one of the guys I was talking to this morning actually told the story of just right after he left. He was saying that sometimes he gets people asking him \"The guys who are going through the seminary, are they just doing it for the show or are they just doing it?' And he said if you want to see real, look at the hospice guys. You can't fake that. That's what he said."},{"speaker":"Raymond","time":"00:37:14-8","content":"That's right. It's true. It's true and anybody can't get in the program like that. Because you can't fake it, because it's real. And when I first got in the hospice program, it was in a week and there was a guy who had passed. And when someone pass, all the hospice volunteer at the time, you had to come to the hospital."},{"speaker":"Raymond","time":"00:37:14-8","content":"And we had to go in the room with that guy who's laying there dead. And we had to clean his room and we had to put him in a bag. And this is my first time witnessing something like this. And another hospice volunteer who had been doing it for a couple of years, he was drinking a cup of coffee and eating a sandwich in the room. He's like numb to this. And I'm like, I'm about to throw up. So after all this was over, we cleaned him up, put him in the bag, I got the guy, I said how could you do that?"},{"speaker":"Raymond","time":"00:37:14-8","content":"He said when you have done this for a while he said you going to get used to this. He said but in order to get to this point, you got to love it. You got to love doing this. I said how you get to love doing this? He said you got to have a passion for it. When I found myself sitting in the room with terminally ill patients with almost no resuscitation, I mean this like, they're about to go the next minute."},{"speaker":"Raymond","time":"00:37:14-8","content":"And I'm holding their hand. I'm holding this guy hand. And he's here one minute and the next minute he's gone and you don't know. And when you look, he's yielded up the spirit. He's gone. Now this is a guy that you've been bathing and washing and feeding for, for a year. You've been this guy friend, y'all watch the news together, and you all talk about family together."},{"speaker":"Raymond","time":"00:37:14-8","content":"You visit with the family, sit in the room with them and watch movies, and you all laugh. And now he's in your hand dead and you don't even know it. And when you realize it, it's like wow. But you have to work your way up to that."},{"speaker":"Raymond","time":"00:37:14-8","content":"But it's the joy when you can get a patient to accept his position and to be ready to move on to the next level of what would be considered life after death. And there are some guys, they'll tell you \"I can't wait, and I can't wait to talk to Peter. I can't wait to get my bed of clouds\" This is encouraging because if you reflect back on that first day when you like to threw up. But now it's like. And people like Norris Henderson, he was instrumental in that program."},{"speaker":"Raymond","time":"00:37:14-8","content":"He's one of the first, I was in like in the second group and Norris was like one of the first group. And I can remember when Norris he was released. And we would have hospice banquets every year. And the first hospice banquet when Norris was free, Norris came and his wife and it was like wow. Because it was so surreal because I'm used to seeing Norris in prison with me, but I knew that from that point."},{"speaker":"Raymond","time":"00:37:14-8","content":"I said well Norris is going to be a big asset to the men that are still in prison. Because I'm a fine believer that what you do while you're in prison is going to be a reflection of what you do when you're released."},{"speaker":"Marcus","time":"00:41:34-3","content":"Yeah, Calvin is a perfect example. Can you speak a little bit about your thoughts on the appropriateness of the life without parole sentence? For so many different things, from first degree murder to being principal to a second degree murder, and everything in between. Can you tell me your thoughts about life without parole?"},{"speaker":"Raymond","time":"00:42:06-5","content":"I think life without parole for lifers contradicts the Department of Corrections. Because I really think that the Department of Corrections is set up and people are set up in the DOC. You have correctional officers, you have social workers, you have programs that are instituted in the DOC, and you have all sorts of resources and finances that are put in the DOC. You have lifers that are, you have the prison that's predominately lifers. And none of the lifers have parole eligibility."},{"speaker":"Raymond","time":"00:42:06-5","content":"And it's strange to think that all accomplishments some of the lifers have made, putting forth, showing that they have been rehabilitated, that they're changed people. And there's no avenue for parole release. And it just contradicts this whole department. Men that have life that been here that resembles most of your honest citizens in society. For an example, I worked ministry at TU and there was this, they considered him the most rehabilitated lifer in the nation."},{"speaker":"Raymond","time":"00:42:06-5","content":"His name was Eugene Tannehill, Bishop Tannehill. And I was given this ministry job at TU and I would walk the tiers and I would walk to people like Woodfox who was confined to a cell for all those years. I would talk to people like Robert King and Herman Wallis, bless his soul. And these type of high profile prisoners. Little me, I would go over there and I would console them. And you would think that some of these particular people were impenetrable by a little Christian guy coming in their face trying to tell them about Jesus."},{"speaker":"Raymond","time":"00:42:06-5","content":"But these guys have soft parts that society and that people never seen. But because of this image that they're given and they're stigmatized, it makes them look like they're horrific people. Bishop would come over, he came over one day I was a TU. And he said \"how you doing Flank,\" and I'm like hey how you doing Bishop. He said look, the warden say he want me to come over and work with me, just tell me what I got to do and I'll do it. And I said Bishop, you a bishop, you over me, I'm just a little. He say no, he say I want to do what you tell me to do."},{"speaker":"Raymond","time":"00:42:06-5","content":"He humbled himself. Bishop been here years before me. And so I like well ok Bishop let's just go talk to a few guys over here, pray for them. And some of the guys who are so resistant to security, just accepted us. We prayed for them and we did God's work. And to make a long story short, when Bishop was released and went home, I saw a documentary of him walking into a café in New York and no one could have told you that Bishop had ever done a day in prison. And that's the same way he act when he was up here."},{"speaker":"Raymond","time":"00:42:06-5","content":"His character, for them years he was up here, he never change. The humble, nice individual. There are hundreds of bishops here today with life. The same character, the same people that you, that if Louisiana would institute parole eligibility for lifers, the same character men in society, in churches, at jobs, at workplace, in restaurants, you would see and you would never detect that they had ever been to prison a day in their life."},{"speaker":"Raymond","time":"00:42:06-5","content":"Because the DOC, Angola, is doing their job. And people are changing, a change is taking place. Men are changing, men who been here for 15, 20, 25 years. You can't tell them if you look back the first day they arrive here, you would never think that that's that person 20 years after."},{"speaker":"Raymond","time":"00:42:06-5","content":"So, it's just something that I think, I think needs to be, needs a lot of attention. People need that chance and people need to see. And I think personally I have a friend of mine that graduated from the bible college named Leo Jackson, and he's over across the river in Westwego, on the Westwego side."},{"speaker":"Raymond","time":"00:42:06-5","content":"And he's got a program with a church and they generate funds to buy buses and he's the founder of that nonprofit organization. And with the buses, people that go to the church that can't afford to come here to see their family, that's what he's doing. People like that, people like Norris Henderson, people like Calvin Duncan, I think these are the people that are forefronts of people that need to get out of prison."},{"speaker":"Raymond","time":"00:42:06-5","content":"The same type people are still here. And I don't think that those type people, Norris is getting a lot of exposure, Calvin is getting a little exposure, but I think we need some type of media to put them on much more. And that goes for people all over Louisiana and other states as well. Because you have a lot of men that's been in prison 30, 20 years that's got out, that's doing great things in the communities, great things."},{"speaker":"Marcus","time":"00:49:51-6","content":"That's actually a perfect place to stop."}]}