{"name":"","transcript":[{"content":"Ricky Bennett Transcription REDACTIONS FINAL"},{"speaker":"Ricky","time":"00:00:00-0","content":"My name is Ricky Bennett, I'm 49 years old. I was convicted of second degree murder and armed robbery. I was 22 at the time my crime was committed, the crime was committed. I have been at Angola for 18 years. I have been locked up 20 and a half for this charge."},{"speaker":"Marcus","time":"00:00:29-8","content":"So what explains the time gap between, the crime and being arrested?"},{"speaker":"Ricky","time":"00:00:37-0","content":"I had left. I was scared and I fled."},{"speaker":"Marcus","time":"00:00:40-2","content":"Okay."},{"speaker":"Ricky","time":"00:00:40-9","content":"I stayed, what they call on the run, a fugitive, for five years, 8 months."},{"speaker":"Marcus","time":"00:00:46-2","content":"Ok, right. That explains it. So, as I said earlier, that the primary goal of this interview is to learn who you are and about all of your experiences. 18 years at Angola, you've seen an awful lot. And part of this is to try to get into that experience too. But also, the strategies that you have used to deal with the reality of life without parole is something will we'll be talking about. But I'd like to start by learning a little bit more about your childhood. Where did you grow up?"},{"speaker":"Ricky","time":"00:01:27-3","content":"In Baton Rouge."},{"speaker":"Marcus","time":"00:01:28-1","content":"Baton Rouge."},{"speaker":"Ricky","time":"00:01:28-3","content":"South Baton Rouge."},{"speaker":"Marcus","time":"00:01:29-1","content":"So can you tell me a little bit about the folks who raised you? About your family?"},{"speaker":"Ricky","time":"00:01:35-8","content":"Raised in a single mother younger brother, younger sister, so the oldest of the three. Mom did worked. Did men jobs, construction work, to make sure we had food. Make sure we wasn't embarrassed at school by wearing the same type of clothes everybody else wear."},{"speaker":"Ricky","time":"00:01:35-8","content":"So I see her mostly having a rough time. She made sure we ate every day without trying to get on aid and whatnot, which was a blessing. I do now see all that. Me growing up always having to look after my brother, sister, couldn't stay out after street lights. Brought the church every time the church doors open so they said that I had drug problem my drug problem I was drug to church every day. But, now seeing all the things that I did or she did put me in front of with the blessing coming up, my family was closely knitted. We always had each other."},{"speaker":"Ricky","time":"00:01:35-8","content":"As though growing up, being the oldest, it seems like I always had to either defend anybody trying to take advantage of. Since I didn't get to hang out late, most of the guys when they did see me at parties or school, it would always end up in a fight. And I grew up always protecting myself. Not letting me be bullied by anybody. So when you said angry cause my dad wasn't there, I want to say yea, partially. But it still was my choice, my decision. But that was the only way I seemed to make me a place or a mark. If you mess with me, I'm going to show you better."},{"speaker":"Marcus","time":"00:03:25-5","content":"So, were there men in your mother's life who came into your life who created any kind of conflict in the family?"},{"speaker":"Ricky","time":"00:03:37-6","content":"She I remember had a boyfriend, but actually interacting with me, taking me to a ballgame or anything no."},{"speaker":"Marcus","time":"00:03:50-0","content":"And none of them were a source of conflict in the family? Fighting?"},{"speaker":"Ricky","time":"00:03:55-4","content":"No."},{"speaker":"Marcus","time":"00:03:55-7","content":"Okay. So you had these two siblings that you were also trying to look out for. What are their names?"},{"speaker":"Ricky","time":"00:04:03-6","content":"Louis and Musette."},{"speaker":"Marcus","time":"00:04:07-2","content":"And are they still living?"},{"speaker":"Ricky","time":"00:04:09-3","content":"My brother died three years ago"},{"speaker":"Marcus","time":"00:04:11-0","content":"I'm sorry."},{"speaker":"Ricky","time":"00:04:11-9","content":"And my sister's still living."},{"speaker":"Marcus","time":"00:04:14-2","content":"And what about your mother? Is your mother still living?"},{"speaker":"Ricky","time":"00:04:16-9","content":"Yes sir she is."},{"speaker":"Marcus","time":"00:04:18-6","content":"Tell me a little bit about her."},{"speaker":"Ricky","time":"00:04:20-5","content":"Man she's a caregiver. She's an awesome woman. Words really can't express her. Especially the things I put her through. She made sure we had everything. And then not just us. She's the second oldest of nine."},{"speaker":"Marcus","time":"00:04:46-9","content":"Okay."},{"speaker":"Ricky","time":"00:04:48-0","content":"And every time something happened in the family, she's the go to person. She knew how to funerals, problems, uncles going to jail, and whatnot."},{"speaker":"Marcus","time":"00:05:01-6","content":"She's the kind of matriarch."},{"speaker":"Ricky","time":"00:05:03-4","content":"So in the family, they said, you take after or you learn how to. So, I always, she always, protected her brothers and sisters, and I end up taking up on that, coming up, too."},{"speaker":"Marcus","time":"00:05:22-1","content":"Is she still healthy enough to come and visit you here?"},{"speaker":"Ricky","time":"00:05:24-1","content":"Oh yea. To be a little detailed, she was supposed to come last weekend. And on the way of leaving Thursday, my nephew, my brother's son, he started having seizures. So it made it real difficult when she wanted to make sure he was ok. And she's living in Texas. She's not in Louisiana."},{"speaker":"Marcus","time":"00:05:48-7","content":"Where in Texas?"},{"speaker":"Ricky","time":"00:05:49-7","content":"Garland."},{"speaker":"Marcus","time":"00:05:50-7","content":"Garland. So what's her commute to here? It's pretty long isn't it, her commute to Angola?"},{"speaker":"Ricky","time":"00:05:55-8","content":"Yes."},{"speaker":"Marcus","time":"00:05:56-5","content":"How many hours does it take her to get here?"},{"speaker":"Ricky","time":"00:06:00-5","content":"I say a day's drive. She catch the bus. She left Thursday at nine o'clock. She'd a made it to the bus station in Baton Rouge about three in the morning."},{"speaker":"Marcus","time":"00:06:14-4","content":"Wow. And then from there she's going."},{"speaker":"Ricky","time":"00:06:18-2","content":"Motel, car, motel, and then me."},{"speaker":"Marcus","time":"00:06:21-9","content":"Wow. That's kind of a big trip."},{"speaker":"Ricky","time":"00:06:27-0","content":"Yes."},{"speaker":"Marcus","time":"00:06:27-5","content":"And she does that how often?"},{"speaker":"Ricky","time":"00:06:30-8","content":"I kind of keep her to every three months."},{"speaker":"Marcus","time":"00:06:34-2","content":"Ok, sure. Are those visits hard?"},{"speaker":"Ricky","time":"00:06:40-5","content":"For her, knowing that after I had graduated school, I worked. I worked because I didn't want her to have to worry about me. She leaving me here. Yea, I hear that from her. \"I don't like to leave and got to leave you there, that's not for my kids\""},{"speaker":"Marcus","time":"00:07:01-4","content":"Right. I get that. One of the things I'm gathering is that the visits are sort of its kind of bittersweet. It's obviously a very nice thing to see your loved ones but then it's so difficult to leave its hard. Is it fair for me to assume you grew up in a family knowing that you were loved and cared for or did you feel that you kind of had to just make it on your own?"},{"speaker":"Ricky","time":"00:07:40-0","content":"I knew I grew up in a home where I was loved with my mom. With most of my uncles, or people that was around. They did when you was helping them, but when you needed, it wasn't much."},{"speaker":"Marcus","time":"00:08:02-1","content":"So in the immediate family, yes, but then other than that you kind of had to fend for yourself?"},{"speaker":"Ricky","time":"00:08:05-9","content":"Yes."},{"speaker":"Marcus","time":"00:08:06-2","content":"Ok. So what about school? How was school for you?"},{"speaker":"Ricky","time":"00:08:13-3","content":"School was, as they say growing up defending myself. So a lot of fights. By high school, I had, how they say, a reputation. Fights. But it was also the education part. I didn't really like people yelling at me if I was doing the right thing. So I was misunderstood. My mom told me because in high school I started getting in too many disagreements with the teachers, the faculty she said, \"Son, they got they diploma, give me yours.\""},{"speaker":"Ricky","time":"00:08:13-3","content":"I said, \"Well mom if they leave me alone and let me do my work, I have no problem.\" She said, \"They might not understand that, but I do.\" So I did finish high school, I did get my diploma and I got to walk cross stage and present those things to my mother. Which was, what I'd say, great."},{"speaker":"Marcus","time":"00:09:26-5","content":"What school?"},{"speaker":"Ricky","time":"00:09:27-3","content":"Glen Oaks. Glen Oaks High School."},{"speaker":"Marcus","time":"00:09:30-8","content":"And so you've mentioned this a couple of times, you found yourself getting into fights. Earlier you said that your rules were that you had to be in when the lights, the streetlights came on. And did that mean you kind of felt marginalized from what was going on? What was the source of the fighting?"},{"speaker":"Ricky","time":"00:09:49-5","content":"Well, most of the guys, coming up, used to get to stay out late. So they had more of a connection, friendship."},{"speaker":"Marcus","time":"00:09:57-9","content":"Right so you felt a little bit outside?"},{"speaker":"Ricky","time":"00:10:00-3","content":"And because I was, like, the outsider and couldn't do this and couldn't do that, I was the one most likely to be picked on."},{"speaker":"Marcus","time":"00:10:06-9","content":"I got it, I got it, ok. Now you've talked about your mother, and it may be this person. If there's one person that you look back on now with the perspective of sometime, who you were just closest to, who just understood you, would that be your mother?"},{"speaker":"Ricky","time":"00:10:32-0","content":"Yea, definitely."},{"speaker":"Marcus","time":"00:10:40-3","content":"I'm familiar with Baton Rouge a little bit, mostly through driving through it. But I don't know very much about the neighborhood you grew up in. Can you describe it for me? What was it like?"},{"speaker":"Ricky","time":"00:10:54-4","content":"South Baton Rouge. I grew up in South Baton Rouge. I went to Buchanan Elementary School. The area was like, as though I know it, low poverty area. You got to actually get it. And growing up middle school they went with the busing, with the black and white segregation. I went to West dale."},{"speaker":"Ricky","time":"00:10:54-4","content":"So the majority of the school was Caucasian. You had to actually get your work. You was getting on the bus early going way to an area you never seen before to go to school. So then after seeing that everybody's dealing with the same type issue, you tend to adapt."},{"speaker":"Ricky","time":"00:10:54-4","content":"Now from South Baton Rouge to Glen Oaks is a whole different subdivision. In my time you had schools and rivalries. So South Baton Rouge didn't like the people in Glen Oaks, and now I got to go to Glen Oaks where we didn't really get along because of the area, or say, territory. Here I go back again. The guy that's - he ain't go to middle school with me, so we gone pick on him. Here comes the cycle again."},{"speaker":"Marcus","time":"00:12:18-9","content":"Sure."},{"speaker":"Ricky","time":"00:12:22-9","content":"Playing football, because when I got there I played football. Good at what I do. I had a coach named Coach Bush, he used to say, \"You got anger issues and I know how to help you.\" He said, \"I'm going to give you a job to do and you'll like it.\" So he and the other coach Prescott are like \"Yes it's going to be good.\" So it was something I liked to do because I always wanted to try and do something to make my father proud that he would want to be a part of my life."},{"speaker":"Ricky","time":"00:12:22-9","content":"I think I did it all, but my motive was kind of just centered toward him instead of thinking about my education more and succeeding in that goal. I end up messing up my knee, when I had two scouts looking at me in my junior year because I had done five years high school - I messed up a year. And I had to go back to just education."},{"speaker":"Marcus","time":"00:13:23-7","content":"What was the job that your coach wanted to give you?"},{"speaker":"Ricky","time":"00:13:27-7","content":"I was weighing 165 lbs. in high school football. And I was playing nose guard, defensive tackle, and linebacker and all special teams when they had guys weighing 230 plus, to fit those positions. But couldn't do the things I was capable of doing."},{"speaker":"Marcus","time":"00:13:59-1","content":"Ok, so they're trying to channel that anger positively."},{"speaker":"Ricky","time":"00:14:02-2","content":"Yes."},{"speaker":"Marcus","time":"00:14:02-9","content":"So you've mentioned your father and I didn't ask you about him - to what extent was he in your life?"},{"speaker":"Ricky","time":"00:14:11-9","content":"My momma always said regardless of how you feel that's your father. And when I was very young, I said yea. When I think I got about 7, 8, he remarried. He got married, and it kind of separated us from the time that we could. So when I did spend a weekend with him, I was just at his house. I wasn't, I cut the grass, I tried to wash his cars, I tried to smile every time his friends came over, but to me it didn't seem like it was satisfying I guess to get a hug back."},{"speaker":"Marcus","time":"00:14:56-1","content":"And then did he go on to have another family?"},{"speaker":"Ricky","time":"00:14:58-3","content":"Yea."},{"speaker":"Marcus","time":"00:15:00-0","content":"And so you had weekend visits, anything more than that over the years?"},{"speaker":"Ricky","time":"00:15:06-0","content":"Weekend visits."},{"speaker":"Marcus","time":"00:15:06-6","content":"Just okay, alright. And you thought that maybe you could try to impress him with how good at football you were."},{"speaker":"Ricky","time":"00:15:13-0","content":"Yea."},{"speaker":"Marcus","time":"00:15:13-3","content":"Did that work?"},{"speaker":"Ricky","time":"00:15:16-1","content":"No. When I hurt my leg he did realize a lot of things was transpiring and he did try to make sure that I had somewhere to be because my mom had to go to work. I couldn't go to school, so I had to have supervision at all times because of the medication. And then I got homeschooled."},{"speaker":"Marcus","time":"00:15:37-4","content":"You're left leg?"},{"speaker":"Ricky","time":"00:15:38-4","content":"Yes."},{"speaker":"Marcus","time":"00:15:39-0","content":"What happened to it?"},{"speaker":"Ricky","time":"00:15:42-4","content":"Everything was tore except a piece of ligament. And I had."},{"speaker":"Marcus","time":"00:15:48-6","content":"So you couldn't walk?"},{"speaker":"Ricky","time":"00:15:52-4","content":"No. The bottom part was dangling"},{"speaker":"Marcus","time":"00:15:58-7","content":"Do you still have issues with your leg? From that injury?"},{"speaker":"Ricky","time":"00:16:02-1","content":"Yeah, time to time. I think it's a miracle because I was told I'd never walk without crutches. I can run, shoot ball, basically everything I just don't put a strain on it."},{"speaker":"Marcus","time":"00:16:15-7","content":"That is a miracle. So you talked a little bit about some of the fighting that was going on outside of the home. Was there any kind of fighting in the home?"},{"speaker":"Ricky","time":"00:16:34-4","content":"Hands on."},{"speaker":"Marcus","time":"00:16:39-1","content":"So, you know, I mean, any physical abuse at all?"},{"speaker":"Ricky","time":"00:16:46-5","content":"No."},{"speaker":"Marcus","time":"00:16:47-5","content":"Ok. So you graduate from high school and present your mother with the diploma. And then, and then what starts to happen what's the gap between catching this charge and graduating from high school? What were you up to during those years?"},{"speaker":"Ricky","time":"00:17:11-4","content":"After high school I went to trade school, welding. By the time I made nineteen, young black male got a skill, and like I said, everything I did I tried to do it to perfect it. Most of the jobs I went on I hadn't finished trade school, but I know I needed to make more money. I used to work at the Hi Nabor before I graduated. Graduation, trying to make sure car insurance, a lot of things I want, wanted to do, and whatnot."},{"speaker":"Marcus","time":"00:17:46-4","content":"Did you say the Hi Nabor?"},{"speaker":"Ricky","time":"00:17:47-8","content":"Hi Nabor Supermarket."},{"speaker":"Marcus","time":"00:17:47-8","content":"Ok, got it."},{"speaker":"Ricky","time":"00:17:53-8","content":"On Winbourn. And different people wouldn't hire because they say young Black guy, you not gone stay long, troublemaker. I said, \"Man but I can weld.\" Nah, you probably couldn't pass a drug test. I quit, I been quit, what you mean, I quit. So I couldn't mostly get a job because of that, in welding. A man, Mr. Field, was like, I'm going to give you a shot since you said that."},{"speaker":"Ricky","time":"00:17:53-8","content":"Passed it with flying colors. It was, it's Jay Mary now it was UMC. And went on my first job, and say everybody, spectacular, spectacular. They loved my work, they loved my being able to work well with others, different things. It was great."},{"speaker":"Marcus","time":"00:19:04-1","content":"And were you also working at the Hi Nabor at this time?"},{"speaker":"Ricky","time":"00:19:07-0","content":"No, I quit."},{"speaker":"Marcus","time":"00:19:07-8","content":"You quit there and you started welding full time."},{"speaker":"Ricky","time":"00:19:09-3","content":"Yes."},{"speaker":"Marcus","time":"00:19:10-4","content":"And that's a fairly high paying job? Isn't it?"},{"speaker":"Ricky","time":"00:19:13-0","content":"Yes."},{"speaker":"Marcus","time":"00:19:14-7","content":"So you're doing that, and then for how many years are you doing that? So you get that from nineteen to what?"},{"speaker":"Ricky","time":"00:19:22-0","content":"Nineteen to off and on when I made 21."},{"speaker":"Marcus","time":"00:19:28-1","content":"Okay."},{"speaker":"Ricky","time":"00:19:31-1","content":"At 22, I'll go work a couple of welding jobs and I also picked up plastering. And that used to be my mom's trade."},{"speaker":"Marcus","time":"00:19:44-1","content":"You said that she was in construction"},{"speaker":"Ricky","time":"00:19:45-5","content":"Yea. And growing up and finding my place the school teacher said find something you love, and something you hate, and conquer it. I love to weld. I was doing that in high school. I hated my mom putting on steel-toe boots, getting on a scaffold with men that would cuss and belittle her. I hated that."},{"speaker":"Marcus","time":"00:20:10-0","content":"She's in a man's world then."},{"speaker":"Ricky","time":"00:20:13-5","content":"So I learned it, and I conquered it. If you ever look at LSU veterinary science building, the towers, I was part of that. LSU indoor stadium, Smiley Brothers construction, I was a part of that."},{"speaker":"Marcus","time":"00:20:33-8","content":"What about close, intimate relationships? Any stand out to this day?"},{"speaker":"Ricky","time":"00:20:48-8","content":"With a girlfriend I had a girlfriend and I'll use the word but high school sweetheart, she went to Baton Rouge High, low income family. She was way smarter than me. She was my world. But she stayed in an area where they didn't like the guys in my area. So end up going back, same thing. And we went together from my junior year, since I was 16 till I was like 19."},{"speaker":"Marcus","time":"00:21:34-0","content":"What's her name?"},{"speaker":"Ricky","time":"00:21:35-9","content":"Michelle."},{"speaker":"Marcus","time":"00:21:41-7","content":"16 to 19, anybody else 19 on?"},{"speaker":"Ricky","time":"00:21:45-3","content":"Well, off and on, me and my kid's mother we met I was 20. And we met, having a kid she already had 2 had a kid, responsibilities everything's good."},{"speaker":"Marcus","time":"00:22:09-3","content":"Now are you living together?"},{"speaker":"Ricky","time":"00:22:12-5","content":"No. I stayed come time to time. Go to work, come home, go to work, and come home."},{"speaker":"Marcus","time":"00:22:24-6","content":"You living by yourself?"},{"speaker":"Ricky","time":"00:22:26-9","content":"Yea. I always had a room at mom's house."},{"speaker":"Marcus","time":"00:22:32-8","content":"You always had a room at mom's house and then you're living by yourself."},{"speaker":"Ricky","time":"00:22:35-2","content":"Yes"},{"speaker":"Marcus","time":"00:22:35-6","content":"Okay. And then you got your girlfriend, the mother of your child."},{"speaker":"Ricky","time":"00:22:40-2","content":"Yes."},{"speaker":"Marcus","time":"00:22:40-6","content":"Tell me about your children, is it just one child?"},{"speaker":"Ricky","time":"00:22:43-2","content":"No, I have three."},{"speaker":"Marcus","time":"00:22:45-1","content":"Three? Tell me about them."},{"speaker":"Ricky","time":"00:22:47-7","content":"Oldest, Alicia. Alicia's 27. And when she was small when she was born I was on my way to Mississippi, and had to come all the way back. And we had paid to find out what it was going to be. They told me a boy, alright, I got a boy."},{"speaker":"Marcus","time":"00:23:12-6","content":"You get your money back?"},{"speaker":"Ricky","time":"00:23:12-8","content":"=We get to the hospital man to get in the hospital and find, why you got my son in pink. Hold on you got the wrong baby. It was kind of like a little thing, man. That was my world and I guess I was hers because every time that I wasn't working or wasn't gone, I tried to have her with me."},{"speaker":"Marcus","time":"00:23:40-8","content":"Yea, that's great. What's your relationship like with her now?"},{"speaker":"Ricky","time":"00:23:46-8","content":"She has a lot of my, I can make it, I don't really need anybody, I know you love me, when you want something let me know. So I tell her, I always tell her, since I've been here. Because I copped my charge, 22, she was one year two months. So her whole life she was without me till I got back locked up. I explained to her a lot concerning if somebody day no, or say you can't do, make them explain."},{"speaker":"Ricky","time":"00:23:46-8","content":"So when I tell her stupid things that I did growing up, I tell her why. I tell her my decision and why I made that decision, come to find out why it a bad decision at that time, what would be a better. She'd been making a lot of great decisions."},{"speaker":"Marcus","time":"00:24:42-5","content":"So you've been as active a parent as you can be from prison. I mean it's difficult I bet. And that would require that her mother, Alicia's mother, would try to support that relationship by bringing her here for visits - have you been visited by your kids quite a bit over the years?"},{"speaker":"Ricky","time":"00:25:01-9","content":"Yea. My son, in these latter times, no. My son till he was 16. He's 20 he's a year young than Licia, he's 26 now. And, he went to the navy and everything, but he used to come up here every, every 6 months. His mom used to let him come. When I end up leaving, my mom took custody of my daughter, and she kept my son. My son was born two days after this charge."},{"speaker":"Marcus","time":"00:25:38-9","content":"Ok, wow."},{"speaker":"Ricky","time":"00:25:41-7","content":"Yeah."},{"speaker":"Marcus","time":"00:25:42-0","content":"And then there was a third child"},{"speaker":"Ricky","time":"00:25:43-8","content":"Yea, the one I met while I was on the run."},{"speaker":"Marcus","time":"00:25:49-4","content":"Ok, alright, so a different mother?"},{"speaker":"Ricky","time":"00:25:51-8","content":"Yes"},{"speaker":"Marcus","time":"00:25:52-8","content":"And your relationship with that child? Is this a boy or a girl?"},{"speaker":"Ricky","time":"00:25:55-6","content":"Girl Ashley a year and eight months she knows, without a doubt, how I feel and I want to be there. Relationship with her no. It's like television stuff. People come, kick the door in, tell her a different name, charges, and we taking him, fugitive and everything so, it's like, what's actually happening."},{"speaker":"Ricky","time":"00:25:55-6","content":"She finds out that I was under an alias, everything that transpired before. I think more so her family convinced her, do have nothing to do with him. I think the only support I had with her family was her youngest sister that stated without a doubt, he knew that I loved and cared for them and would protect them."},{"speaker":"Marcus","time":"00:27:01-2","content":"Did the mother of your third child, did she know that you - about the history? Did she know that you were on the run?"},{"speaker":"Ricky","time":"00:27:08-3","content":"Not till after."},{"speaker":"Marcus","time":"00:27:10-7","content":"Ok, not until it became apparent, right? Ok, so can you just tell me a little bit about, and when you were on the run, where were you?"},{"speaker":"Ricky","time":"00:27:21-6","content":"In Michigan."},{"speaker":"Marcus","time":"00:27:22-5","content":"In Michigan."},{"speaker":"Ricky","time":"00:27:23-2","content":"Muskegon, Michigan"},{"speaker":"Marcus","time":"00:27:26-8","content":"Tell me a little bit about what led to you going on the run. I'm trying to piece it together, you know, you've got this, you've got a high school degree, you bring that home as promised to your mother, and you go get a trade. You got a well-paid job, welding and then you get this charge. Did you tell your, your mother, your siblings, the mother of your kids? Did they know anything about this before you ran?"},{"speaker":"Ricky","time":"00:27:57-4","content":"No"},{"speaker":"Marcus","time":"00:27:57-7","content":"Ok, so you just didn't even say anything to them, you just go? And why Michigan?"},{"speaker":"Ricky","time":"00:28:09-7","content":"In watching television they say, get out the country. I went to Texas. I needed some more money, I worked at the truck stop, unloading trucks make a little extra money and tried to go to Canada. I made it to Michigan seen some guys doing some plastering work. Man like, if I could lay that wall, would you hire me? As though it race plays part again. Young Black guy. \"You can lay the wall, alright\""},{"speaker":"Ricky","time":"00:28:09-7","content":"As I was showing that I knew how to use the tools, the owner pulled up."},{"speaker":"Ricky","time":"00:28:09-7","content":"The owner pulled up and was like, \"Who are you?\" I said, \"Hoping I could get a job.\" Right then, I had work. In working, a couple of checks, he seen that I knew a little bit more than just laying flat walls. I knew how to do columns, I knew how to do coin joints, whatnot. So he kept me on for a little while. Doing good, end up meeting a girl, had a little job, you know-"},{"speaker":"Marcus","time":"00:28:09-7","content":"Yea that makes sense. And so then, it all comes tumbling down. They catch up with you in Michigan I assume."},{"speaker":"Ricky","time":"00:29:45-3","content":"Yes."},{"speaker":"Marcus","time":"00:29:46-0","content":"And extradite you back to Louisiana and you go through the trial. They put you in Baton Rouge parish jail."},{"speaker":"Ricky","time":"00:29:51-6","content":"Yes"},{"speaker":"Marcus","time":"00:29:52-0","content":"Okay. I'm just assuming, you had a jury trial."},{"speaker":"Ricky","time":"00:29:57-7","content":"Yes."},{"speaker":"Marcus","time":"00:29:58-3","content":"Found you convicted you of second degree murder."},{"speaker":"Ricky","time":"00:30:00-5","content":"Yes."},{"speaker":"Marcus","time":"00:30:02-1","content":"Ok. And of course at this point all of this is tumbling down to your family as well."},{"speaker":"Ricky","time":"00:30:09-3","content":"Yes."},{"speaker":"Marcus","time":"00:30:09-9","content":"Right, everybody is finding out my God this happened nobody knew. Had you been in contact with your mother at all? That must have been difficult?"},{"speaker":"Ricky","time":"00:30:19-8","content":"Well, every how you say, I guess when she have her moments, she express how she felt that I left and didn't say nothing. She knew that something was wrong because I left all the keys to my car and whatnot."},{"speaker":"Marcus","time":"00:30:37-4","content":"And I'm sure people came asking her."},{"speaker":"Ricky","time":"00:30:39-7","content":"Yes."},{"speaker":"Marcus","time":"00:30:40-5","content":"Ok, so she knew something was up."},{"speaker":"Ricky","time":"00:30:42-9","content":"She knew the day after that something was up because the people came to her house."},{"speaker":"Marcus","time":"00:30:49-3","content":"Yea sure, ok. So tell me about your first few months here at Angola. Did you remember the bus ride coming down here?"},{"speaker":"Ricky","time":"00:31:02-5","content":"Yes."},{"speaker":"Marcus","time":"00:31:03-9","content":"What was going through your mind?"},{"speaker":"Ricky","time":"00:31:07-2","content":"It, it was like moving to another school. Here's this cycle again. I have to prove myself again. Don't mess with me. And… figure out how everything that was said to me that was said about me wrongfully in court, I can prove. When I got here, and stories about Angola was like, man you got to do this you got to do that. I was also very spiritual and looking back at a lot of things. A guy at Hunt's told me, he said, \"Man, you got to see Colonel so and so. Colonel Dunn he'll give you an opportunity main prison because that's where the law library is."},{"speaker":"Ricky","time":"00:31:07-2","content":"And I m like, I get here, I don't see nobody's name tag till we get toward the end of the interview of getting here. And I said man, I can't get in trouble, I can't get in trouble, I can't get in trouble. Had a guy on the bus, \"yea cause when I get there because you all don't know, I'm going to make one of you my.\" I'm like, man here we go again. I got to find Major Dunn. Toward the end of the interview when they ask you any diseases any enemies and whatnot, I see a guy Major Dunn thank you lord."},{"speaker":"Ricky","time":"00:31:07-2","content":"And me and one of the guys, white guy, Samuel Gilbert we end up talking a lot, at Hunt's, so we on the bus ride together hit them on the, \"I see Major Dunn.\" \"For real?\" I say, \"That's him over there.\" So when I go over there to see him, we talk and he say \"well we gone put you in the cell block.\" I said \"Major Dunn, I need to be able to get to the law library hopefully I could be placed in main prison.\" The other guy was speaking the other security officer was speaking - he said \"No cell block.\""},{"speaker":"Ricky","time":"00:31:07-2","content":"Major Dunn looked, \"Well he got a good record, he had a look like he can protect himself. I'm looking at his jacket\" \"Yea I think I can sir.\" He said let's put him walnut hickory. \"Thank you Jesus\" Again. Get down there and little do I know I see, time I get there I still have my little bundle fight break out on the wall. Shake my head. Oh lord here we go. But, as I say, my walk through here had a lot of assistance from somebody, I didn't know. I ended up in a dorm with three guys I knew off the street."},{"speaker":"Marcus","time":"00:34:05-9","content":"From way back?"},{"speaker":"Ricky","time":"00:34:06-7","content":"Yea. And what's the pros and cons that I don't disrespect nobody and I stay out of trouble. As though getting locked up, my mom, \"My baby, whatever my baby need.\" And I knew she was still going through extra because of I have to do the right thing, what stuck with me in getting here was, she told me about my graduation in high school, \"They got theirs, I need you to get yours.\" I need to figure out what the lawyer didn't do, to get out. I got to figure out what can I do to get education. Man, I say the people that was placed in my path helped me so greatly."},{"speaker":"Ricky","time":"00:34:06-7","content":"Henry Taylor \"What you want to do son now that you here?\" \"Man I got to go to church and get and education.\" \"Huh?\" \"I got to go to church and get an education.\" He put me on church call outs, as an inmate. So I went to church, every time the doors open. Remembering now, my mom had me with a drug problem, so I didn't have a problem going. The other guys, how to make canteen, where you go to line up for your job, everything. How to get your visiting straight for Angola."},{"speaker":"Ricky","time":"00:34:06-7","content":"And like I say, people that wouldn't know nothing was placed I'm a welder by trade. McKey, he was a colonel walked in the door one day, \"What you do son?\" \"Well I cleaned up this side of the dorm since they didn't take me to the field.\" \"No, what you did on the street?\" \"I'm a welder, sir.\" \"Is that in your jacket?\" \"Yes sir.\" \"Want to weld here?\" That's a job! Three weeks at Angola. They say it's unheard of. I went to metal fab as a helper, but yet and still."},{"speaker":"Marcus","time":"00:36:40-3","content":"Sure, you're not in the field"},{"speaker":"Ricky","time":"00:36:42-6","content":"Amen. So when I say a lot of people had been placed, by reasons that didn't know me from individuals. Ask a guy, \"What you do?\" Favor Metal fab, a couple of years, heard about the bible college. They wouldn't let me in step, prep, illiteracy, because I already had a diploma, whatnot a trade school. Well, what do you want to do?"},{"speaker":"Ricky","time":"00:36:42-6","content":"I said, I'm not sure. Because I was already a welder of the street, I knew how to plaster, and I was going, I was a member local 198, plumbing and pipe fitting."},{"speaker":"Ricky","time":"00:36:42-6","content":"I knew how to read blueprints, so, here it comes again. I can read the blueprints at metal fab to make whatever you need made. I can twist, bend, and cut metal."},{"speaker":"Ricky","time":"00:36:42-6","content":"The guy over, I say foreman, over metal fab didn't want me to go anywhere. So the first two years of Bible College I was trying to get in, I couldn't because he wouldn't sign the release."},{"speaker":"Marcus","time":"00:38:18-8","content":"Was he a staff member, administrative staff member?"},{"speaker":"Ricky","time":"00:38:22-9","content":"Yes. He said \"man, I need him.\" Which was favor. Got the job, was able to do good at the job. He liked my work conduct, everything else. \"Man, I don't want to lose him\" It's not like, I was always getting in trouble, always getting locked up, not being able to fulfill my duties, even being an inmate."},{"speaker":"Ricky","time":"00:38:22-9","content":"So, I filled out again for Bible College, and I say again, everything that transpired was a timing that people, didn't really notice. I didn't submit another application and I was placed on call out. I come in from metal fab, guy say, \"Ricky you got an interview today.\" I say \"No I ain't got no interview today, I'm going back to work.\""},{"speaker":"Ricky","time":"00:38:22-9","content":"He come bough the call out to me and said, \"You on call out.\" I had to go take a shower and everything, and go to my interview. The guy that came out before me said they only had part time left. I say well any time is better than no time, I can get back to reading and getting my writing skills up to par. They said, when I went in my interview and finished."},{"speaker":"Ricky","time":"00:38:22-9","content":"He told me, he said, \"Man that spot for you.\" Dr. John Robinson. I said, \"Excuse me?\" He said, \"That spot for you. I got one full time spot left. That's yours.\""},{"speaker":"Marcus","time":"00:40:03-5","content":"Now how many years into being here at Angola did that happen?"},{"speaker":"Ricky","time":"00:40:07-7","content":"Two."},{"speaker":"Marcus","time":"00:40:08-0","content":"Wow. That's very unusual."},{"speaker":"Ricky","time":"00:40:11-2","content":"Everything was unusual."},{"speaker":"Marcus","time":"00:40:13-9","content":"So you didn't, you managed to avoid all of the usual things that people get into when they first come here, in terms of getting in fights, getting locked out in a cell block, and all that?"},{"speaker":"Ricky","time":"00:40:26-1","content":"I end up getting in one dispute here. And when I say he placed people in my path to make sure. Man, I say, God is awesome. Because now I have to look back on the things I've learned and say where was he in the midst of my life? From hanging out at the parties, messing with other guys' girls, and seeing them in a tangle."},{"speaker":"Ricky","time":"00:40:26-1","content":"Me, I'll fight in a minute. But now it's more like using diplomacy. Why we gone go through all that. Then, you bark at me I bark back and we swing blows. Now it's like, what we going to get out of it? The guys that was placed in my path were men that had been here I would say, already, 15, 20 years"},{"speaker":"Marcus","time":"00:41:35-6","content":"Sure, they could mentor you a little bit too."},{"speaker":"Ricky","time":"00:41:38-5","content":"Yes."},{"speaker":"Marcus","time":"00:41:41-1","content":"Wow, interesting. So I want to keep on going about exploring these experiences that you've had at Angola. But before we completely leave your experiences prior to Angola, is there something that I should have asked you about your time before the charge or the time when you were on the run that's an important part of who you are that we didn't get a chance to talk about? I don't think, I don't know that it necessarily is, but I just wanted to give you an opportunity to."},{"speaker":"Ricky","time":"00:42:14-1","content":"Well, in finding out about being angry a lot. I've only been able to place it in me not having my father to be there. The things I needed to know to grow up as a man or a male I really didn't so I filled in the blanks as they went. If it was a bad decision I had to live with it's just like running. If I'd a stayed, a lot of things probably would have been different. I made a choice."},{"speaker":"Ricky","time":"00:42:14-1","content":"I was scared and I didn't know what heard all the stories. Was I bad by the people I hung out with, got to know, that kind of showed me the same love or care that my mother did, I'll say yes? Did we kind of fit to a yes we all was going through something and most didn't have, they father. So we, learned how to be a man, roaming with each other."},{"speaker":"Marcus","time":"00:43:36-6","content":"Sure. So you, it's a four year degree, so six years into Angola, you have a bachelor's degree? Is that right?"},{"speaker":"Ricky","time":"00:43:49-5","content":"Yes. A B.A. in pastoral counseling."},{"speaker":"Marcus","time":"00:43:54-4","content":"So what's your typical day like now?"},{"speaker":"Ricky","time":"00:43:57-5","content":"My typical day?"},{"speaker":"Marcus","time":"00:43:59-4","content":"Yea, what's your routine?"},{"speaker":"Ricky","time":"00:44:01-8","content":"I get up at 5. Shift change at 5:45. I leave the dorms, sometimes at shift change because I may or may counsel now. And I work cell block TU. People that are considered troubled people or."},{"speaker":"Marcus","time":"00:44:23-8","content":"Is that also people who are dealing with some mental illness?"},{"speaker":"Ricky","time":"00:44:26-4","content":"Yes. That's TU. And I go help them with the legal work. Being a minister, is not, it's not a job, it's a lifestyle. So you actually have to care about those people. And I get up, I case request, so whatever may have to be given to those guys, legal work, I bring. I talk to them about the case, they express certain things and I try and find them, find out about them. Therefore they can have proper legal assistance. And I enjoy doing it, and that's basically the course of my day."},{"speaker":"Marcus","time":"00:45:18-2","content":"So it's a combination of ministry and legal assistance. Right?"},{"speaker":"Ricky","time":"00:45:25-1","content":"Yes"},{"speaker":"Marcus","time":"00:45:26-2","content":"So, have you been able to help yourself. Your own case with those experiences. So for example, have you been able to file any kind of post-conviction. So yes, have you been able to file any kind of post-conviction relief on your own case?"},{"speaker":"Ricky","time":"00:46:18-5","content":"I'll say it again, a lot of things was out in my way. I have a long term relative, friend. Him and my dad, he was up here already. So when I got here I found him and… so as we rid into court when I first got here. The day he got in a fight, and was locked up, put in lockdown, I got legal mail."},{"speaker":"Ricky","time":"00:46:18-5","content":"And, they said no. A denial. In coming to understand God and God's ways, I'm like God you told me that you forgave me. And I'm sitting in the dorm with tears in my eyes because the only person that would, I thought would help me, just got locked up and get shipped to camp J. Tears rolling down my eyes, I guess I'm going to be here the rest of my life. Lord is you really true. A guy walked in and he said, \"What's wrong Ricky?\" \"Man, I don't know what's going on.\""},{"speaker":"Ricky","time":"00:46:18-5","content":"And he said \"what's that?\" So he grabbed the legal paper and he said, \"They denied you?\" I say, \"You cracking jokes it ain't funny.\" He said, \"What you doing with your bible?\" I say\" I'm asking a question, I'm just sitting to myself asking a question.\" He say \"well you keep reading your bible and I'm going to check into this.\" His name Darren Hooks. He said \"Come to the office, shift change tonight. We going to see what's what.\" Who's been helping? I said Herb."},{"speaker":"Ricky","time":"00:46:18-5","content":"He said \"Herb going to Camp J.\" I said \"Yeah, I know.\" He said \"keep doing what you're doing. I got you.\" My court stuff and finally getting back into court, the rest of the things my lawyer didn't do, he helped me in every way possible and made council. I filed convictions to everything, reading everything. He, learning everything, still going to school. Still, they said there's no more nothing else, we want to hear from so it's like dead. What did you believe in the first place?"},{"speaker":"Ricky","time":"00:46:18-5","content":"The spirit of God send you to do things for you to learn from his glory, not mine. And after you take care of his business then he'll take care of yours. And that's the only thing that I found tangible to hold onto."},{"speaker":"Marcus","time":"00:49:22-2","content":"Sure. Let me ask you a little bit more about that. One of the things that we've been exploring as I mentioned before we started the camera was that, looking at the coping mechanisms that people put up as a way of just confronting reality of the possibility of never leaving here. Life with parole in Louisiana is life without parole. How have you come to terms with that? How do you make sense of that? How do you cope?"},{"speaker":"Ricky","time":"00:50:02-2","content":"stupid decisions cost consequences. We have to live with those consequences, but how can I help somebody else not to fall into that same consequence? So, what was given to me since I've been here was trying to offer it to guys that come, those that are, I don't want to use the word stubborn. But, that have accepted life is life. You can still humane. Other guys that has no knowledge of the law like I did when I got here, try to help them in ways that I've learned or that others have helped me."},{"speaker":"Ricky","time":"00:50:02-2","content":"With hope. I may not know their names. I still have letters from guys that I have helped get back in court and go home I when it's my turn, I don't know yet. I am hoping laws change that can give me relief that they would see these 20 years of being incarcerated should be enough. Or showing that I can be productive in society and not treat somebody as a survival of the fittest, a prey."},{"speaker":"Marcus","time":"00:51:50-8","content":"Sure. So, essentially, putting your energy into making the best of the community that you're in and helping the guys with their energy. That makes sense. When you look back on the victim. You know, it's been more than 26 years now. When you look back on it, because that event has totally changed the whole trajectory of your life, what do you think about it?"},{"speaker":"Ricky","time":"00:52:33-4","content":"If I would have stayed at home, I don't think it would have happened. If I wouldn't have been trying to get another girlfriend or a notch on my belt, unfortunately, it wouldn't have happened. It's because of my charge, the incident that transpired that night, man. The things that I was putting in place to do. I wanted to start my own business. I wanted to be more active in the church. I wanted the white picket fence."},{"speaker":"Marcus","time":"00:53:22-9","content":"Do you know about the impact that it might have had on his family?"},{"speaker":"Ricky","time":"00:53:28-7","content":"I found out that his girlfriend was pregnant. Impact: losing a loved one through gunfire, great impact. I've had friends that have been shot, killed. I've had friends that have killed people that I knew also, I knew their families. So, the impact, yeah."},{"speaker":"Marcus","time":"00:54:04-8","content":"You've also put your family through a lot and when you look at the whole situation, who has had the- who in your family has had the hardest time watching you go through what you've been through?"},{"speaker":"Ricky","time":"00:54:23-2","content":"My mom."},{"speaker":"Marcus","time":"00:54:28-2","content":"Was she at your trial."},{"speaker":"Ricky","time":"00:54:29-8","content":"Yes."},{"speaker":"Marcus","time":"00:54:31-2","content":"Do you remember when the verdict came down, do you remember how your mother reacted?"},{"speaker":"Ricky","time":"00:54:39-5","content":"When I look back at her, I seen the tears in her eyes. And I see in each personal event. The lawyer said he wanted more money. So after I was found guilty, the lawyer wanted more money. My mom hadn't been on a scout for some years now. She went back trying to get the money, work and get the money. Caught pneumonia, went to the hospital. They gave her the wrong medicine. They said she stayed gone for 7 minutes. So, when you said, nobody wanted to tell me, I'm in the jail. But, when I said me and my mom was close, when she ache."},{"speaker":"Ricky","time":"00:54:39-5","content":"And I'm calling all over. My momma don't stay out after no 2 o'clock. My momma stay outside till after 10. Nobody wanted to tell me. She's the only one in Louisiana because it's my trial and stuff going on. My brothers and sisters in Texas. So, they came down because my mom's in the hospital, got sick and all when I said a brainstorming event, my mom working trying to kill herself to make sure I'm alright. I didn't go to Bible study that Tuesday because I needed an answer from God. You going to have me go through this by myself?"},{"speaker":"Ricky","time":"00:54:39-5","content":"I don't know how. That was a, you were trying to make sure this when I wanted to hang out with these group of guys. I wanted to do these type of parties. And now I'm in trouble and you trying to fix it. I thought I already took too much from her. And me not learning law or taking serious my education, my writing skills, I thought I cheated her too so that was like one of the eye openers. That was before getting here. I have to get everything right, do everything."},{"speaker":"Marcus","time":"00:57:20-9","content":"So, somebody I talked to said that if your family loves you, the one of the things you have to deal with in these experiences is that they do day for day with you. Has that been the case with your mother?"},{"speaker":"Ricky","time":"00:57:36-4","content":"Yeah. Yes sir."},{"speaker":"Marcus","time":"00:57:40-8","content":"Does she hold out hope that you'll get out?"},{"speaker":"Ricky","time":"00:57:45-0","content":"Yes, because I have a robbery with my charge and she asks me \"I know you shot your gun, did you rob?\" \"No.\" I was bringing home at that time, $850 a week minimum. Not two weeks, not a month, a week. Why would I want to go in and out of, taking drug tests, I drank beer. What's up? Her seeing me being progressive and, one, I'll say, one serious problem I took, I liked the girls. She wouldn't like them, I tried to Stuff I put her through, man, give me one, give me a small picket fence, I'm cool now."},{"speaker":"Marcus","time":"00:58:57-9","content":"Sure, what's the worst thing about your experiences living here now? I know that it changes over the time right? So when you first get here certain things that are real challenging and then as you spend time here, it changes. What is the worst part of it now?"},{"speaker":"Ricky","time":"00:59:17-2","content":"I think losing my mother. I don't I've experienced guys that have, like I said, three years ago, dealing with my brother and I still been pondering about a lot and trying to perfect myself at my jobs and my job skills, me and administration don't always see eye to eye."},{"speaker":"Ricky","time":"00:59:17-2","content":"Do I think they hold grudges? Yeah something happened at my house, called, nobody answered, so I finally get my brother on the phone. I said \"what's going on with my number, cell phone, I know it's on my list but I have to call.\" \"Oh everything all right. I just come from the doctor. I'm in so, this is a Tuesday."},{"speaker":"Ricky","time":"00:59:17-2","content":"I talked to my mom. Everything is alright with my daughter. Everything is alright in the house, yeah. What's wrong with you, you always come up with these ridiculous things?\" I said \"Momma, see when I can't sleep, something going on.\" My brother died Wednesday morning at 9:30. Blood clot to the lung. And no one wanted to tell me. My girlfriend at the time, she's been real supportive these last six years, and she was like \"you talk to your momma?\" \"Nope. Something going on with my family.\" She hang up."},{"speaker":"Ricky","time":"00:59:17-2","content":"What's wrong? Everybody tripping. She wouldn't answer her phone. I know what time she gets off of work so I know what time I can catch her when she'll just answer the phone. Is she leaving me? Is there somebody else? So I know she's walking out from work, she's just going to answer the phone. I call. She answers. \"What's up? If you got somebody else, tell me.\" \"You talk with your momma?\" \"No\" It's Thursday evening about 5:30. \"You need to talk with your momma. You need to talk with your momma.\""},{"speaker":"Ricky","time":"00:59:17-2","content":"I said \"nobody answered the phone.\" \"Well, hold on, I'm getting in my truck. Call your momma.\" She hangs up again. I'm calling my momma. No one's picking up. So I call Mile's phone. She answers. What's up? Ain't nobody answering their phone? And she tells me. I said \"huh, I just heard from him.\" She goes to crying blah, blah, blah. Oh lord. Call me back, call me back. I hang up the phone. I go sit on my bed. My brother passed."},{"speaker":"Ricky","time":"00:59:17-2","content":"First order of business, make sure everybody in the house okay. Nephew, he's 15, your dad just died. After I gained my composure, a couple hours, I called her back. \"What's up?\" She crying to make sure the family's straight. Things that my mother did when her mom passed. I was in high school when my grandma passed. Things she did to make sure everybody was content, safe."},{"speaker":"Marcus","time":"01:02:53-0","content":"Yeah, I spoke with somebody who's one of his jobs is inmate minister. Is to-"},{"speaker":"Marcus","time":"01:02:53-0","content":""},{"speaker":"Ricky","time":"01:03:06-9","content":"To leave a death message, yeah."},{"speaker":"Marcus","time":"01:03:12-6","content":"He was describing it I was just thinking that is a hard job."},{"speaker":"Ricky","time":"01:03:23-8","content":"Being at Angola, here's here and the guy you visit when they visit meet their kids, their family, they become family and when they hurt, you hurt. It's not words you can give to describe, you tell a guy, you got to call such and such because your mom passed, your dad passed."},{"speaker":"Ricky","time":"01:03:23-8","content":"I have a friend right now, he's been trying to kick back, in the midst of losing his grandma, his daughter was shot. Then his son died in a car accident and he's trying to with at the same time. Friend, knowing how to be an ear, you don't have answers. I don't have the answers to someone else's but to be there and listen so that inmate is I have to say, a life style."},{"speaker":"Marcus","time":"01:04:44-5","content":"I mean, I think it's difficult to provide that kind of news to anybody in any context outside of prison but I think there's something particularly painful about it here. So, let me wrap up by asking you a question. What are you most proud of? Of all of the things you have accomplished over the years, what stands out as the thing that you are most proud of?"},{"speaker":"Ricky","time":"01:05:22-5","content":"The thing I can say I'm most proud of is being a leader in this community, I have never become big headed that I am not able to learn. I'm a member of the church of Christ and hopefully the community, expressing to guys that there is hope in God and He will do things in the physical for you, towards your freedom. A member ASCP. Angola Special Civics Project which helps create laws and from chain to change, how you can, even in here, you can become the man you need to be."},{"speaker":"Ricky","time":"01:05:22-5","content":"So, upon your release, you can do the things that you always dreamed you could. Even become a brother JC teaches self-help classes, awareness classes. Human relations, learning how to help others with society and family member and the strategies and the happy moment. I worked at a building visiting shed, conducting processing stuff with people so I had with a lot of people. Giving back what would I say given to me when I got here."},{"speaker":"Ricky","time":"01:05:22-5","content":"If I'd known half of the things on the street that I have learned in here, I could've been there, I probably would have and knowing not only the work force, but the administration work."},{"speaker":"Marcus","time":"01:07:41-0","content":"That's a good place to stop."}]}