{"name":"","transcript":[{"content":"Robert Juarbe Marcus REDACTIONS FINAL"},{"speaker":"Robert","time":"00:00:00-0","content":"My name is Robert Juarbe, I'm currently 44 years old. I was 20 at the time of the crime, I'm convicted of RS14 30.1 which is second degree murder. And I've been incarcerated now for 24 years, going on 25."},{"speaker":"Marcus","time":"00:00:15-6","content":"Okay, alright. So I'm going to start by asking you a little bit about your childhood. Maybe you could start by telling me a little bit about the folks who raised you."},{"speaker":"Robert","time":"00:00:26-4","content":"I was raised by my mother. I have a stepfather that raised me the best he could. I never really knew my father. I had kind of like a weird background. I never met anybody on my father's side, especially anybody with my last name. My mother's Perez, my last name is Juarbe, it's Spanish. And it's almost like an Antwone Fisher story. When I get out hopefully, I want to use ancestry.com, every place I can chose to kind of meet people in my family background."},{"speaker":"Marcus","time":"00:00:59-6","content":"Okay."},{"speaker":"Robert","time":"00:01:00-7","content":"But my mother raised me, and my stepfather is Caucasian descent. My real father's Puerto Rican, my mother's Puerto Rican. I got 3 sisters and 2 brothers from my stepfather."},{"speaker":"Marcus","time":"00:01:14-2","content":"Okay, where were you raised?"},{"speaker":"Robert","time":"00:01:15-3","content":"I was raised in New York City, the Bronx."},{"speaker":"Marcus","time":"00:01:17-2","content":"Okay. And so tell me a little bit about your siblings. So you're the only, you don't have siblings from your mother and father?"},{"speaker":"Robert","time":"00:01:25-4","content":"Right."},{"speaker":"Marcus","time":"00:01:26-4","content":"Okay so tell me about the siblings you have from your stepfather."},{"speaker":"Robert","time":"00:01:29-3","content":"Okay, I'm the oldest of course. I got 3 sisters and 2 brothers. It was kind of turbulent growing up with them. Because being the oldest you pretty much got everything, but I had to share everything, and I always got blamed for everything. So child abuse was a reality in my household, because I wasn't theirs."},{"speaker":"Marcus","time":"00:01:55-4","content":"Sure, from the stepfather."},{"speaker":"Robert","time":"00:01:56-8","content":"I had to compete for love. All I ever wanted from him was to love me and accept me as his own. And that was not there. So when you get older, you tend to become immune to the beatings. And so when he realized he couldn't get to me. He would take it out on my mother."},{"speaker":"Robert","time":"00:01:56-8","content":"And so I ran away at the age of 11 and I never looked back. I couldn't stand to see my mother take a beating based upon misdirected anger. Couldn't take that. So I figured if I was to remove myself form the equation, my mother wouldn't be beaten no more."},{"speaker":"Marcus","time":"00:02:36-7","content":"Where did you run away to?"},{"speaker":"Robert","time":"00:02:39-1","content":"I ran away in the streets of New York. I mapped out the subway system, learned all the train maps, pretty much worked in grocery stores, I look Arab. So one of my best friends, I ran away with him. Actually he's been gone for a year and I just caught up with him. And I'm like man where you been at, he disappeared. He was my best friend for the neighborhood, what happened, I don't find you no more. He told me he's working in grocery stores."},{"speaker":"Robert","time":"00:02:39-1","content":"I said I'm not going back home man, I can't take it no more. He understood where I was at. So he introduced me to the people he was working with. He was working in grocery stores with Arabs, Palestinians, Spanish descent folks. And so throughout the city, Bronx, Brooklyn, Manhattan, Queens, I found a job wherever I could get it."},{"speaker":"Marcus","time":"00:03:27-5","content":"Where are you putting your head down at night?"},{"speaker":"Robert","time":"00:03:31-1","content":"It was kind of uncertain, sometimes the owners of the grocery store where I was working, sometimes they would provide a place to lay my head. Sometimes, I would have to find an abandoned building or a parked car, or believe it or not even the twin towers before they were knocked down."},{"speaker":"Robert","time":"00:03:31-1","content":"We used to play in those buildings, the skyscrapers, and at night when everybody go home and just close their offices, we'd sleep in the hallways or places where they didn't have security cameras."},{"speaker":"Marcus","time":"00:04:02-4","content":"Wow, so from 11, from that point on you're living by yourself?"},{"speaker":"Robert","time":"00:04:07-5","content":"Yeah, I turned myself in the age of 13, two years of hard living on the streets of New York. It was so hard."},{"speaker":"Marcus","time":"00:04:14-4","content":"And cold."},{"speaker":"Robert","time":"00:04:15-5","content":"And cold, yeah we felt every season."},{"speaker":"Marcus","time":"00:04:18-4","content":"Yeah you did."},{"speaker":"Robert","time":"00:04:19-7","content":"Most definitely"},{"speaker":"Marcus","time":"00:04:21-5","content":"So you're in and out of these grocery stores, finding cash as you can. And at 13 you've had enough? Where do you turn yourself in, child protective services?"},{"speaker":"Robert","time":"00:04:35-5","content":"Yeah, I've had a bout with them before, before I ran away from home. My mother and my stepfather used to use drugs, there were methadone clinics. And one day they found out that I was taking care of my siblings at home rather than going to school. And they called the bureau of child welfare, next thing, I'm taken away."},{"speaker":"Robert","time":"00:04:35-5","content":"They put me in like a makeshift foster home with all my siblings. My 3 sisters and 2 brothers. And then my parents fought custody to get us back. So nothing changed, I mean I figured that the beatings would stop, that maybe the neglect would stop. And it never did, it just progressed even worse. But my job was still to take care of everybody at home until I couldn't do it no more."},{"speaker":"Robert","time":"00:04:35-5","content":"So when I did come back from running away at age 13. There was no home to go back to. Sisters and brothers were gone, they were in foster care. Their names were changed, never even saw them again. My mother was a prison for drug use. And my stepfather was shacked up with some other woman."},{"speaker":"Robert","time":"00:04:35-5","content":"So the home was gone. I was devastated. The bureau of child welfare go ahold of me again and put me in like a place in upstate New York. They didn't want me to become a juvenile delinquent, so they tried to give me an opportunity to go through a normal high school process and so forth."},{"speaker":"Marcus","time":"00:06:01-9","content":"In a foster home?"},{"speaker":"Robert","time":"00:06:03-2","content":"No, I was too old to go to a foster home, so they put me like on a campus, an all-male campus."},{"speaker":"Marcus","time":"00:06:08-5","content":"Okay."},{"speaker":"Robert","time":"00:06:09-8","content":"It was upstate New York. So I mean, it had a private high school, a swimming pool, 3 cottages. It was nice, it was a nice campus."},{"speaker":"Marcus","time":"00:06:21-8","content":"Yeah that's a big change."},{"speaker":"Robert","time":"00:06:22-9","content":"It was a very big change from the city."},{"speaker":"Marcus","time":"00:06:26-0","content":"And I'm going to guess that you were probably pretty good at school?"},{"speaker":"Robert","time":"00:06:31-8","content":"I was, I only went to 5 grades in school. I only went to 1st grade, I went to 7th grade, tried to enroll myself in 8th grade but it didn't turn out good cause I was on the run, I was a runway so. When they found out that you're not living in that home, so where are you living."},{"speaker":"Robert","time":"00:06:31-8","content":"So they sent police to come get me and I was gone. So when I did turn myself in at the age of 13, yeah I went to junior high school, took a placement test. Put me in 8th grade 9th grade, and I think I took the 10th, and the 11th, and the 12th together. I combined 2 grades. So really just 5 grades of school."},{"speaker":"Marcus","time":"00:07:10-1","content":"Wow, you're a quick learner then."},{"speaker":"Robert","time":"00:07:13-1","content":"I had no choice."},{"speaker":"Marcus","time":"00:07:15-9","content":"That's impressive right there. So you were obviously good at school, I mean you didn't really have traditional schooling. But you go upstate, all the sudden you're in a safe environment, I assume. And you're doing well in school. Do you- you graduated from high school?"},{"speaker":"Robert","time":"00:07:38-0","content":"I did. The school I went to is private, but it was all males. But it was everybody from the city. They went up there because they were also a ward of the Tate. Their parents couldn't take them, or like me they ran away from home, or they got in trouble."},{"speaker":"Robert","time":"00:07:38-0","content":"And a lot of them never saw school seriously, they just saw it as an opportunity to go back home, cause every year we would go to family court to see if our parents wanted us back. Every year I went to family court, there was no parent to accept me back."},{"speaker":"Marcus","time":"00:08:09-5","content":"Sure."},{"speaker":"Robert","time":"00:08:10-8","content":"So I said man all I got is this. So I took the opportunity and I used it the best that I could. But what really propelled me to graduate, because I felt like I was spinning my wheels too, the only thing I had really good that was interesting in school. I excelled at all the subjects, social studies, English, math, science, you name it. It was basketball and music. I really felt like I could just do me. And so when I met my fiancé, long distance pen pal relationship. That's what really motivated me to want to finish high school."},{"speaker":"Marcus","time":"00:08:50-2","content":"Okay, how did that pen pal relationship start?"},{"speaker":"Robert","time":"00:08:55-5","content":"I don't know that they even have the magazine in print anymore, it was a pen pal magazine article, and I had subscribed to 4 different pen pals. And this one female, she was 16, I lied to her I said I was 16, I was really 15. She was 11 months older than me. And so we corresponded for a year and a half."},{"speaker":"Marcus","time":"00:09:16-7","content":"Where was she?"},{"speaker":"Robert","time":"00:09:17-6","content":"She was from down here in Laplace Louisiana, yeah. And I'm in upstate, Chester New York. And I'm like man it's kind of strange she doesn't want to give me the phone number, but they have 411 so I wound up getting it anyway when she graduated from high school. I found her, she went to Southern, she started going to southern."},{"speaker":"Robert","time":"00:09:17-6","content":"She said why you ain't graduate yet, what's the deal? I said I got left back on a few classes, I got to finish it up, and I lied again. So I finally came clean and said look, I'm taking the 11th and 12th grade together, I'm almost finished. So I did, I graduated. And she was already about 1 year ahead of me in college."},{"speaker":"Marcus","time":"00:09:57-7","content":"Okay. And so she's from LaPlace, Louisiana, she's enrolled at Southern. You graduate from this place up in Chester. And you bum a ride down here?"},{"speaker":"Robert","time":"00:10:12-2","content":"Yeah, well they put me in a group home and tried to get me acclimated to living a normal life apart from the campus. And then next thing they kick me out the nest, you're on your own. It's $300 a greyhound bus ticket to Louisiana, good luck, have a good life, hope we don't see you no more."},{"speaker":"Marcus","time":"00:10:32-9","content":"Okay. And your plan, such as it was, was to get on a bus to come down here and find a pen pal."},{"speaker":"Robert","time":"00:10:40-2","content":"My plan was to pursue love. Let it take me where it could."},{"speaker":"Marcus","time":"00:10:46-4","content":"Okay, so tell me about that."},{"speaker":"Robert","time":"00:10:47-4","content":"Oh man, I went to Southern University. And I'm like man this is what it's like, I even got a chance to see what it was like at Loyola. They showed me a video tape of the campus. But I wasn't going to play no games with me, I applied to Harvard University as well."},{"speaker":"Robert","time":"00:10:47-4","content":"I'm like, they're not going to accept me, Loyola's got high standards they're not going to accept me. I didn't make high SAT scores on it. And so Southern University accepted me with open arms and that's where my high school sweetheart was going."},{"speaker":"Marcus","time":"00:11:18-8","content":"What year was this?"},{"speaker":"Robert","time":"00:11:19-8","content":"This was '91. 1991."},{"speaker":"Marcus","time":"00:11:21-4","content":"Alright. So you catch up with her. And what does she think about this arrangement?"},{"speaker":"Robert","time":"00:11:32-2","content":"Oh she was flabbergasted, she was so glad that I left and finally came down south. Cause I had come down from New York to Louisiana in 1990 for Christmas."},{"speaker":"Marcus","time":"00:11:44-0","content":"Oh for a visit."},{"speaker":"Robert","time":"00:11:45-0","content":"For a visit. I spent 3 days with her, and I didn't have any money in my pocket. Matter of fact I lied, it was a sham as the way I got down here. My mother was sick, she was so sick, and I said mom I promised this girl that I'm going to go see her during the Christmas holidays, I need money I got to get down there, I packed a bag and everything. And she was like baby I can't do it I'm on my sick bed. And I was frustrated, all I could see was just me."},{"speaker":"Robert","time":"00:11:45-0","content":"I said mom I got to keep my word, I'm going, so I went down to the greyhound bus station on 42nd street in Manhattan, tore my clothes, I stood in the bus station just thinking, trying to get my thoughts together for 6 hours. I said I got a plan, tore my clothes, hid my bag, I went to the police station, I roughed myself up, and I said I was mugged, I said I'm from down south, I tried to put on a southern drawl and everything."},{"speaker":"Robert","time":"00:11:45-0","content":"I said look I don't have no way to get back down, I ended a one way bus ticket back to Louisiana. Sure enough they gave it to me, they gave me a voucher. Next thing I'm on my way to Louisiana, 3 days, no food, stomach is touching my back. But I made it."},{"speaker":"Marcus","time":"00:12:59-3","content":"Yeah."},{"speaker":"Robert","time":"00:13:00-6","content":"I even the sad thing about it is I stuck with the lie. I told her that I was mugged and everything. Eventually I came clean, I said look, and love will make you do some strange things."},{"speaker":"Marcus","time":"00:13:13-0","content":"Yeah."},{"speaker":"Robert","time":"00:13:15-9","content":"A year later I came back for good."},{"speaker":"Marcus","time":"00:13:18-8","content":"Okay, alright so how did that first, those 3 days that visit must have gone well enough for both of you?"},{"speaker":"Robert","time":"00:13:23-4","content":"Oh, yeah. I met her whole family. I was really saddened and disappointed that I couldn't reciprocate the love she showed me for Christmas. I'm like, oh man, I told her the truth, and I came clean to her."},{"speaker":"Marcus","time":"00:13:41-4","content":"Sure. Okay so you come down here, are you living with her?"},{"speaker":"Robert","time":"00:13:47-2","content":"I came down, lived in Baton Rouge, she gave up her money for room and board because her grandparents had set aside some money for her to go to college, so she was living with her auntie sometimes. And she said, look, Baton Rouge has got some good apartments, it's got low level security deposits, and so she used her money, along with my $300 and we'd been living with each other for like 3, 4 months."},{"speaker":"Robert","time":"00:13:47-2","content":"I couldn't make ends meet, so I tried working in springs for a little while, do a little telemarketing. I couldn't even get a job from McDonalds or Burger King because I wasn't from the state of Louisiana. They considered you to be an alien if you're not from here. So they said you got to have a 1 year residency and you can get a job anywhere. I don't have a year, all I have is now."},{"speaker":"Robert","time":"00:13:47-2","content":"So I drop out of Southern University and her grandparents said come live with us. But I didn't know of the ridicule, the verbal abuse, of you haven't done a day of work in your life, your hands are soft, and you're young, what can you do? You got to take care of her, matter of fact you can't even live in this household unless you marry her."},{"speaker":"Robert","time":"00:13:47-2","content":"That's how old fashioned they were, so I'm like, back to the hotel room again are you serious. So I said, what I got to do? He said you got to get ready to marry her. So I decorated the church, whatever money I did have saved aside from telemarketing, we used that for the wedding gown, tuxedos, invites, paid for the wedding."},{"speaker":"Robert","time":"00:13:47-2","content":"And the next step was to join the U.S. Navy, it's the only way I could make ends meet. Because I wasn't going through that verbal abuse, coming from a background of abuse already, I couldn't deal with that. So my pride was up. So I said, no."},{"speaker":"Marcus","time":"00:15:31-6","content":"So you joined the navy, she stays in school?"},{"speaker":"Robert","time":"00:15:35-3","content":"She dropped out of school too, believe it or not, and she's still living with her grandparents."},{"speaker":"Marcus","time":"00:15:42-0","content":"Oh, what is this woman's name?"},{"speaker":"Robert","time":"00:15:43-6","content":"Melinda Johnson."},{"speaker":"Marcus","time":"00:15:45-7","content":"And then, she's with her grandparents, you join the navy, where are you based?"},{"speaker":"Robert","time":"00:15:51-7","content":"I was stationed in several places. I was stationed in Orlando, Florida. San Diego, California in border aircraft carrier, U.S."},{"speaker":"Marcus","time":"00:16:01-1","content":"Okay, how old are you now?"},{"speaker":"Robert","time":"00:16:03-5","content":"I'm 44 years old."},{"speaker":"Marcus","time":"00:16:04-7","content":"I'm sorry, I mean in the story."},{"speaker":"Robert","time":"00:16:08-2","content":"I'm 18, I just turned 18."},{"speaker":"Marcus","time":"00:16:09-4","content":"Alright, so you're 18. So then, bring me form there up to this offense that got you here."},{"speaker":"Robert","time":"00:16:09-4","content":"Okay. Get out the navy, right. I could've stayed all the way in for a 44 year enlistment. But I had it aborted about a year and 3 months. My wife, she became pregnant, she said look you got to choose the navy or the military or marriage. She said, when you get back from desert storm and all that there, I won't be here. And that just, that just blew my mind, cause like how could you make me choose. I love you, but I'm committed to the military too, I took an oath."},{"speaker":"Robert","time":"00:16:09-4","content":"And so I went AWOL for unauthorized absence, I went AWOL 7 times, 7 times in my military career. My officer said, look, they want to bring you up a special court martial, they want to kick you out the navy, what do you want to do? I said I don't want to be kicked out of the navy, I don't want no dishonorable discharge."},{"speaker":"Robert","time":"00:16:09-4","content":"He said they're not going to give you a dishonorable discharge, that's reserved for the worst, he said they will give you a bad conduct. Said you want to stay in, I said my wife is giving me all kind of ultimatums, I don't think it's going to be good for my marriage."},{"speaker":"Robert","time":"00:16:09-4","content":"So I left the military with a bad conduct discharge, but I was able to get a job anywhere in the state because of my military background. So I went and became a security officer. Really they kind of bent the rules because I wasn't even 21 yet, I wasn't even legal to carry a firearm. But nonetheless, military background they overlooked all of that."},{"speaker":"Robert","time":"00:16:09-4","content":"So I worked at various places, like, Pinkerton security, all around New Orleans on the parade route, Toys R Us. And I decided to go back to school, me and my wife went back to Philips junior college in Metairie Louisiana. And I majored in the medical field this time, trying to become an assistant."},{"speaker":"Robert","time":"00:16:09-4","content":"She wanted to become a computer tech and go to Beauty College. So I still never got a chance to graduate, I was so close. Until one night of fun, changed everything."},{"speaker":"Marcus","time":"00:18:23-2","content":"Yeah, so tell me about that."},{"speaker":"Robert","time":"00:18:27-0","content":"All right. There was a lot of things that happened, between me going back to college and getting out of the military, between that. I had lost my son, my son died of crib death. And so it was real hard to put the pieces of our life back together, and so going back to school was the next best thing. So we tried again, my daughter was born, 3 months. She was 3 months old before I was picked up on this charge right here."},{"speaker":"Marcus","time":"00:18:56-0","content":"What's her name?"},{"speaker":"Robert","time":"00:18:56-4","content":"Briana, Briana Juarbe. So, I wound up going back to school. But there was a hole in my marriage, something wasn't right. I felt like I had sacrificed a piece of myself when I sacrificed my military career, and my son was gone. So my marriage was on rocks. So I would lie to my wife, saying look I'm working late tonight, graveyard shifts. I'd be out in New Orleans, drinking, partying, going to nightclubs, trying to use it as an escape."},{"speaker":"Robert","time":"00:18:56-4","content":"And so one night, I took 4 friends, or so I thought they were my friends, 4 of my friends, 2 females, 2 males, and we went to New Orleans. One night of fun, turned into a tragedy when a man was killed. And it was by accident. And the gun that was used in the crime, used to kill this man, was in the purse of the young female, one of the sisters, and we kind of hid the gun there to get into nightclubs, just in case we would get into any altercations with anybody."},{"speaker":"Marcus","time":"00:20:07-1","content":"It was your gun?"},{"speaker":"Robert","time":"00:20:08-2","content":"No it was one of my co-defendants gun."},{"speaker":"Marcus","time":"00:20:11-2","content":"Okay."},{"speaker":"Robert","time":"00:20:12-3","content":"And I certainly knew that one of the young females was carrying it."},{"speaker":"Marcus","time":"00:20:20-1","content":"Give me one second here, sorry. So if there's 5 of you, all 5 of you get convicted?"},{"speaker":"Robert","time":"00:20:26-1","content":"We all got convicted. All of us. They used the females to testify against us. And by them being 16 and 15, the father trusted me to take care of them first of all, because I was a security officer. Her father owns a bar, he says look, take care of my daughters."},{"speaker":"Robert","time":"00:20:26-1","content":"He said, I know you're married, they're in good hands, so take care of them. I can't afford a babysitter, no problem. So I go to New Orleans and take them with me, but I got these two other guys, and they strapped. I don't bring my gun with me because that's the gun I use for work, I leave that at home."},{"speaker":"Marcus","time":"00:21:07-0","content":"So, they all get convicted of the same crime."},{"speaker":"Robert","time":"00:21:10-1","content":"Right."},{"speaker":"Marcus","time":"00:21:10-9","content":"Do they try you together?"},{"speaker":"Robert","time":"00:21:12-4","content":"No we all has separate trials."},{"speaker":"Marcus","time":"00:21:15-2","content":"And you all had the same conviction."},{"speaker":"Robert","time":"00:21:16-6","content":"We all did, really, all of our cases were supposed to be overturned. Because they have a law in the books, called conflict of interest. That if you have one particular law firm that represents everybody, it's not very good. And that's exactly what happened, and so the judge in my case, which is not on the bench now. Decided to deny that motion, and overlook all of that."},{"speaker":"Marcus","time":"00:21:45-0","content":"So the three women, two women."},{"speaker":"Robert","time":"00:21:50-0","content":"Two women."},{"speaker":"Marcus","time":"00:21:51-0","content":"Are they still serving their life sentence?"},{"speaker":"Robert","time":"00:21:54-2","content":"No, the youngest female, sister, she had 5 years."},{"speaker":"Marcus","time":"00:22:00-2","content":"Oh, so she did not get the same conviction."},{"speaker":"Robert","time":"00:22:02-1","content":"No, she got 5 years for testifying against me."},{"speaker":"Marcus","time":"00:22:05-5","content":"Okay."},{"speaker":"Robert","time":"00:22:07-4","content":"The other one got the life sentence, but in 2006, innocence projects came here and asked me about her case, give a history of the case, which exonerated her, so she's home right now. I felt like I was the one that was responsible, I really do take all the blame for what happened that night. Because I could have prevented that, I could've stopped it. I could've stopped all that from happening."},{"speaker":"Marcus","time":"00:22:35-4","content":"What about the other guys?"},{"speaker":"Robert","time":"00:22:38-3","content":"The other guys are just, they're just doing them."},{"speaker":"Marcus","time":"00:22:41-9","content":"Are they serving a life sentence?"},{"speaker":"Robert","time":"00:22:43-3","content":"They are also serving a life sentence."},{"speaker":"Marcus","time":"00:22:45-3","content":"Here?"},{"speaker":"Robert","time":"00:22:45-2","content":"Yes."},{"speaker":"Marcus","time":"00:22:48-8","content":". So, you are 20, you spent some time in Harry Connick's facilities, and then you get bused up to Angola around 21 or so?"},{"speaker":"Robert","time":"00:23:02-7","content":"Yeah, I almost didn't make it. The way of Angola- or the way of Orleans parish is to keep you there for 6, 7 years. So that you die, literally, you can die physically before 7 years is up. Or you can die, legal wise, and after that there, send them up there. It doesn't matter what law library you attend, what legal program. Calvin Dunkin will tell you. Those years of your incarceration. The first years of your incarceration are the most precious ones."},{"speaker":"Marcus","time":"00:23:33-9","content":"Yeah they are. You run out of time."},{"speaker":"Robert","time":"00:23:36-3","content":"That's right."},{"speaker":"Marcus","time":"00:23:37-5","content":"So I assume you're around 21 years old or so, cause about a year passes in the parish?"},{"speaker":"Robert","time":"00:23:43-6","content":"Yes."},{"speaker":"Marcus","time":"00:23:44-0","content":"Tell me a little bit about your time in the parish."},{"speaker":"Robert","time":"00:23:47-1","content":"It was hard, it was really hard."},{"speaker":"Marcus","time":"00:23:49-2","content":"Because you're an outsider."},{"speaker":"Robert","time":"00:23:50-2","content":"I'm an outsider, I'm young, and I'm light skinned. I probably look good to all these other males there. I had a complex. I could fight a little because I was in the navy. And I mostly stayed to myself. I had a complex out of this world. I can only think about one thing and that was trying to get back home."},{"speaker":"Robert","time":"00:23:50-2","content":"I'm still trying to process what was happening to me, receiving a life sentence. Didn't know what that was. That was a new variable, what does that mean. So I'm like, I'm talking to a few of the old-timers. They got me form Orleans parish, which is like the bottom of the barrel."},{"speaker":"Marcus","time":"00:24:28-2","content":"Yes."},{"speaker":"Robert","time":"00:24:28-5","content":"Put me in HOD, separate me from my co-defendants. Then they put me in 3. And I'm like man, how do I leave from out of here they're shuffling me, it's a shuffle game. They said look, when we give you the look, this is what you got to do, and Charles C was sheriff at the time. He said, when the old timers said I'm not going to be here long, I'm from Angola."},{"speaker":"Robert","time":"00:24:28-5","content":"He said this what you got to worry about, what you got to deal with. So they kind of schooled me before I got up there. He said but if you really want to leave here and get up to that roof, this is what you got to do."},{"speaker":"Robert","time":"00:24:28-5","content":"You got to find every little small thing that's wrong with the prison, and you got to file and ARP on it. And that's exactly what I did. I had 10 ARPs on this ting that thing this thing that thing. Then they called me and asked me what do you want, what is it that you want?"},{"speaker":"Robert","time":"00:24:28-5","content":"To drop all these ARPs. I said I want to be on at Angola. He said you got that. In June of 1995, I was. And that's when they put me in the cell with this old timer named Robinson."},{"speaker":"Marcus","time":"00:25:34-2","content":"Tell me about that."},{"speaker":"Robert","time":"00:25:35-6","content":"Oh man. I felt like I was being put in a cage with a tiger or a lion or something. I had never seen anything like this."},{"speaker":"Marcus","time":"00:25:45-7","content":"Paint a picture for me here because I'm trying to imagine."},{"speaker":"Robert","time":"00:25:50-1","content":"Angola's still wild, I don't know this though. They bring you before a board, a majors got to determine a classification, where you going to live at. Back then it was so ruthless it was like man, they're playing games with your life. If you're frail, if you're young, if you got this working for you or you don't."},{"speaker":"Robert","time":"00:25:50-1","content":"And they place you in a different part of the prison to see if you would make it and they would place bets on that. I'm like man, I never knew what C block was like."},{"speaker":"Robert","time":"00:25:50-1","content":"It was full of drug heads, people shooting heroin, it was full of killers, it was full of hustlers, and it was full of homosexuals."},{"speaker":"Robert","time":"00:25:50-1","content":"I'm talking about tall homosexuals, young homosexuals, old homosexuals, I'm talking about when they see a person like me coming through at 21 years old, and they've already got plans. But I came up here with my mind already, and if you ever crossed my path I'm going to send you. They knew that. They can tell that with the look of a person's eyes."},{"speaker":"Robert","time":"00:25:50-1","content":"I was gone, I had transformed to this environment. This environment had breed a certain sort of mentality. And I breathed it all in. And I'm like man I'll be damned if I'm down in a place like this, I'm sure as hell not wearing anything like that, I don't want to become a part of this environment. This is not mine, this is alien landscape for me, and I want outta here."},{"speaker":"Marcus","time":"00:27:16-5","content":"So your story is very atypical. But obviously there are some themes that each person's path is unique, but there are some themes that are common. And I think that, whatever it was that was getting you down the path of trouble."},{"speaker":"Marcus","time":"00:27:16-5","content":"Let's say you hadn't gotten into the car with those guys, with those girls that night. Let's say, I don't know, you didn't get out of bed that day. How do you envision your-what would've happened with your life do you think?"},{"speaker":"Robert","time":"00:27:53-1","content":"I think, I think my marriage would have been savaged. I don't think I would've just let it hit rock bottom. Even after being incarcerated, I was still deeply in love with my wife, even though it didn't last like 4 more years. When you doing time, the one that you're doing time with, your loved ones, they do time with you. And so she had to divorce me."},{"speaker":"Robert","time":"00:27:53-1","content":"But I think for the most part, I would have eventually graduated from college, don't know when. Me graduating from the school seminary, it's probably the only thing I've competed in my life, besides high school. But I didn't know myself then, my wife was complimenting me as well as helping me know myself, but I was completely gone."},{"speaker":"Marcus","time":"00:28:46-1","content":"Well how would you describe that person?"},{"speaker":"Robert","time":"00:28:48-5","content":"That person there was wild. He was just living life recklessly. He was just living life one day at a time, and didn't know himself. No self-confidence, no self-awareness other than just survival mode. Selfish, oblivious, still trying to heal from the hurts and trauma of unresolved trauma when I was young."},{"speaker":"Marcus","time":"00:29:14-6","content":"Sure. So I want to get into a little bit of the kind of man you are now. You're obviously, you're one of the first cohorts to go into the graduate program in the seminary. Which is a really a big deal. Can you tell me a little bit about your transition from that C block to now?"},{"speaker":"Robert","time":"00:29:43-4","content":"I had a made a pact with myself, I told them that I don't want to die here I still don't want to die here, I don't envision myself dying here. And if I do, I'd rather do it because of fulfilling my calling. I found out that I do have a religious background, my mother told me, she said on my side of the family, everybody was religious catholic. But I never got a chance to really meet them, so I said, mom, before she passed away, I said I'm going to make it."},{"speaker":"Robert","time":"00:29:43-4","content":"I'm going to leave Angola, with every fiber of my being, I'm not going to permanently make this my home. So they had self-help programs her back in the day. And then they had a lack of them, so me and my generation at the time. We come up with programs to try to help better the environment."},{"speaker":"Robert","time":"00:29:43-4","content":"Like I said, this was a wild place back then, just making the transition when warden cane was here. And so he had his eye open, he was scouting to see who was going to help become change agents in this place. The seminary already existed when I got here, I didn't know that."},{"speaker":"Robert","time":"00:29:43-4","content":"As a matter of fact, my chapel then gave me a recommendation to go to seminary in 1999. As a matter of fact, what I thought was that this environment was the only thing that existed. So I lived in the education building, going to classes, working in the education building, I was a tutor. I knew I wanted to change the environment, but I needed to change myself first. There's no way I could help somebody else if I couldn't help myself that's just hypocritical."},{"speaker":"Robert","time":"00:29:43-4","content":"I said man how do I do it because warden cane said one of the things that makes a prisoner different from other people in society is that we're needy people and we're selfish. And I just thought he was just trying to crap on us, just trying to ridicule us. What do you mean were selfish, we already got Xs on our backs. You represent us, you're our warden are you serious, but he wasn't lying, he was telling the truth. Inmates are selfish to an extent until they break out their shell."},{"speaker":"Robert","time":"00:29:43-4","content":"And so I started going through that process and started realizing man he wasn't lying, it's true. It takes a heck of a person to think altruistically, to get away from themselves. Because it's not always about you, it isn't. And if you could learn that in this environment right here, I think you've learned. I think it's more valuable than gold. It took me to work with a lot of individuals to get there."},{"speaker":"Robert","time":"00:29:43-4","content":"I've never ever really just wanted to be selfish, all my life. I've definitely wanted to heal the wounds that were caused. And I couldn't rely on other people, so I became co-dependent, so I had to break that cycle and realize that's not the way to go."},{"speaker":"Robert","time":"00:29:43-4","content":"You can't fix yourself by trying to fix everybody else."},{"speaker":"Robert","time":"00:29:43-4","content":"That's not going to work. And so I abandoned that, and so therefore I started surrounding myself with other leaders, rubbing shoulders with people that were change agents for real. And stopped playing games incurving. Because we don't have that time, we don't have that luxury."},{"speaker":"Robert","time":"00:29:43-4","content":"Prison is a serious place. You can waste your life just like that, and I chose not to. I have a daughter that's 24 years old right now, Briana, and I have a grandson that's 6 years old. I'm trying to get back to them, by any means I'm trying to get back to them."},{"speaker":"Marcus","time":"00:33:11-0","content":"Yeah. Who visits you up here?"},{"speaker":"Robert","time":"00:33:13-7","content":"Those two right there."},{"speaker":"Marcus","time":"00:33:15-5","content":"Okay. Do you remember the last interaction you had with your ex-wife?"},{"speaker":"Robert","time":"00:33:21-7","content":"They used to have what is called returning hearts. Returning hearts is when you children come in and you spend the day with them and kind of build a bridge. And so I would always have to communicate with her, but we always had good terms. The last time was 2013."},{"speaker":"Marcus","time":"00:33:38-6","content":"Okay. I mean, it was like a practical, like this isn't going to work kind of situation?"},{"speaker":"Robert","time":"00:33:44-3","content":"No. she moved on in her life, she got married twice over, and she had other children. It was like, I don't blame you, you have to do something, you have to compensate. But she's kind of, she's real frustrated at the decision she made. My daughter tells me that she feels like it should've been you, these should've been your children."},{"speaker":"Marcus","time":"00:34:04-2","content":"Sure. Tell me about Briana. I can imagine you try to be present in her life."},{"speaker":"Robert","time":"00:34:13-3","content":"She's I'll show you a picture of her she's like my twin, my twin sister. We look like carbon copies. I didn't know how strong my genes were until I seen how she blossomed and grew up. Briana's 24 and she's headstrong, she's very optimistic, she's confident about herself. Over the years, I've taken a class called victim awareness. I never knew how much pain I would cause in her life by not being there."},{"speaker":"Marcus","time":"00:34:43-1","content":"Sure."},{"speaker":"Robert","time":"00:34:44-0","content":"I didn't know that, how people are also victims, not just the victim's family. I never knew that, it broke my heart to think about how she would have to hide the fact that daddy's not there. Where's your father at? Or she would have or make up a lie, he's on vacation, or he died, or he's not there, he ran off."},{"speaker":"Marcus","time":"00:35:06-0","content":"Similar to what you did, so you can rely it."},{"speaker":"Robert","time":"00:35:08-1","content":"Yeah. So I been looking for a way to break that cycle and so I have a date coming up, I have a pardon board date coming up September 17th, which is ironically my wife's birthday, ex-wife's birthday. And I look forward for my daughter being there and a few other people. But my hope is that I cannot make up for lost time, but I don't want my grandson coming to a place like this, to follow in the footsteps that I did. Cause he's having right now, and I see the cycle can potentially progress and lead down the same place."},{"speaker":"Marcus","time":"00:35:52-4","content":"Right. So, did Briana go to school, go to college?"},{"speaker":"Robert","time":"00:35:57-2","content":"She went to college, but like me she didn't stay in school. About a year."},{"speaker":"Marcus","time":"00:36:03-2","content":"Living in New Orleans?"},{"speaker":"Robert","time":"00:36:04-9","content":"Living in LaPlace. She worked in New Orleans for a little while."},{"speaker":"Marcus","time":"00:36:10-7","content":"Does she have your last name?"},{"speaker":"Robert","time":"00:36:12-0","content":"She has my last name, she does."},{"speaker":"Marcus","time":"00:36:14-4","content":"And your grandson?"},{"speaker":"Robert","time":"00:36:14-4","content":"My grandson's. And she named him after, I actually met him, I met her fiancé when I was a missionary at a correctional center. He came to visit, I talked to him, gave him a little father-in-law son talk, don't break her heart. She's got her head strong. She's like man, he messed her over one time and that's all it took. And so she bears a son. Which is like, but she has nothing to do."},{"speaker":"Marcus","time":"00:36:51-4","content":"Okay. So when you come before this pardon board, I've been attending the pardon hearings sense we started this project and it feels very present when you're in Baton Rouge, and of course it's really important that there are people there. But you're going to be on a video screen-"},{"speaker":"Robert","time":"00:37:13-3","content":"Which is totally new to me."},{"speaker":"Marcus","time":"00:37:17-0","content":"It's very distant. What do you want to make sure they know about you?"},{"speaker":"Robert","time":"00:37:27-1","content":"The most important thing is that, from the time of me even coming up here. That I never ever meant all my actions to cause the victim any pain, for their loss. And there's nothing I can do, there was nothing I could do over the years to change that no matter how much I want to. There's a law in the books in Louisiana that prevents us from contacting any of our victims. And I understand why that law is in place I really do. But it's frustrating at the fact that when you're doing time you also make them do time too."},{"speaker":"Robert","time":"00:37:27-1","content":"Because they deserve to heal despite what we've done. Despite all the classes that we go through, they don't get a chance to see how we've changed, or how we really feel toward them. And so I have a remorse that can't even be measured. And I can't even express that to them. So all the years I've had to live with the shame of what happened, especially that loss. Which I can't even fathom what they go through, who's really affected by it."},{"speaker":"Marcus","time":"00:38:32-2","content":"Yeah. What are the organizations, the things that you've done? The seminary, what are the things that you're going to highlight for like this is what I've done with my life at Angola?"},{"speaker":"Robert","time":"00:38:44-3","content":"One of the things that contributes to becoming a delinquent, to become a criminal, because you can become an even greater criminal in prison. You don't learn that stuff out there. This place will turn you rotten."},{"speaker":"Robert","time":"00:38:44-3","content":"Is when you don't have education? When you have low education you make bad decisions. And bad decisions lead to bad actions. So I've always tried to change the way people think by educating them. I've been involved in education for 20 years, teaching. And I said well educations also tied to ministry."},{"speaker":"Robert","time":"00:38:44-3","content":"It's also about how god transforms us. Spiritual, moral rehabilitation is not something that's programmed, that's something that has to start from the inside. So god changes us based up on who he designed us to be. I definitely want to be part of that. So I accepted my calling wholeheartedly, to become a pastor, an associate pastor or a minister in this prison. And you can't fake it to make it in this environment."},{"speaker":"Robert","time":"00:38:44-3","content":"People see you. This is an open fishbowl society. So if you're not living life Christian or Muslim. They're going to tell you, you're going to be called a hypocrite, they're going to deal with you, and they're going to brand you. I'll tell you this right here, we used to go down that walk. Camp C, camp D, main prison, or camp F, well known. We wouldn't even get 5 steps before people call my name, this way, this way, that way, this way. And I would introduce you to all of them."},{"speaker":"Robert","time":"00:38:44-3","content":"I would tell them that I walked the walk. I'm going to be just what I was doing here instrumentally. Just as I do in here, I plan to be instrumental out there. I plan to change people's lives, this does not have to be your reality. I rubbed shoulders with people. When I been here, they were here, they were the change agents, when they left, those are some very big shoes to fill."},{"speaker":"Robert","time":"00:38:44-3","content":"So I've been involved in a lot of organizations that have been here. Malachi dads, Toastmaster, Latin community, you name it lifers association, I've been part of them."},{"speaker":"Marcus","time":"00:40:49-1","content":"And through the seminary, obviously, are there specific trades that you've picked up that are marketable?"},{"speaker":"Robert","time":"00:40:58-0","content":"I've picked up on collision repair, I learned how to become an estimator. And carpentry. Plus, namely I was a chef, so I always had that. Seminary has prepared me down the road for a professional and so it's good to have a background if you have a trade, so. Hopefully, they won't use my X on my back."},{"speaker":"Marcus","time":"00:41:21-3","content":"Yeah, so let's talk a little bit about that. So, you will have served, by September. Like how much time will you have served in September, 25?"},{"speaker":"Robert","time":"00:41:31-4","content":"It will be 24 years, 24 and a half years."},{"speaker":"Marcus","time":"00:41:33-5","content":"24 and a half years."},{"speaker":"Robert","time":"00:41:37-2","content":"I'll be 45 by then."},{"speaker":"Marcus","time":"00:41:38-7","content":"Yeah, okay, so let's say they give you, they change your sentence to a fixed term, give you a parole eligibility date. Then you get out. So can you must have thought about this quite a bit. Like what is the future, what's the next chapter? What are the steps for you?"},{"speaker":"Robert","time":"00:41:57-9","content":"I have, I wanted to first get on my feet, of course. Get established. I wanted to go back to Orleans parish, where it began. Because I felt like my life was forfeit and the system took my life from me, I pretty much gave it up. I want to go back through the system to kind of help these guys with some of the programs that they need. Like think for a change. A lot of them never had fathers."},{"speaker":"Robert","time":"00:41:57-9","content":"A program like inside outside dad. A lot of them need counseling skills, they need to know who they are, and they need to be reassured that people do care about them."},{"speaker":"Marcus","time":"00:42:34-2","content":"So who are these people that you're reaching out to?"},{"speaker":"Robert","time":"00:42:37-5","content":"Mainly a lot of juveniles, a lot of juvenile offenders. And a lot of people that are in the parish prison already, which is held in limbo. I ask that the judge would allow me the latitude of going to the Baton Rouge Prisons. Going to like, Orleans parish prisons, these satellite prisons. I would love to become a chaplain, a DOC somewhere."},{"speaker":"Marcus","time":"00:42:59-3","content":"Yeah, that sounds like a perfect fit for you, okay. Wow I've gotten so much interesting information I really appreciate your time. Is there's something that I should- there's 2 things: I want you to say a little bit about coping mechanisms with the possibility of ending up at point lookout. Which I think for a lot of people, is...we all try to distract ourselves from unpleasant things. But for a lot of people who have a life sentence, you're constantly reminded that it's a possibility. How do you cope with the possibility?"},{"speaker":"Robert","time":"00:43:53-9","content":"There was a time when this prison, in 2005, the year of Katrina. Where I thought that because of what I did, an act I did, that I wouldn't make it past that day. Because of how people's view in this prison, I'm talking about inmates offenders, have a certain view towards security. And that's a very real, sobering thought. That this might be your last day in prison because of how they hold you in the steam based upon one act. 2005, there was a free man, and I was living in camp C at the time, was working as a minister."},{"speaker":"Robert","time":"00:43:53-9","content":"But I lost my job in the chapel because I did something I wasn't supposed to do. I used a phone without permission. So one of my colleagues went and told the warden on me. And so they classified me to go work in the field, so I lost it. No more minister. I'm in the field, but it's the holidays, 2005. The major did not respect that fact that somebody ratted me out, so to speak, but he always said damn it, whatever you do you got to give it to you."},{"speaker":"Robert","time":"00:43:53-9","content":"Whatever you do, you always take your lick. So therefore we're going to do you something. I didn't know this now. We're going to send you up front to and Spruce. The classification had a hand in that, but I didn't know this here. So I'm scheduled to leave from here, even though I'm in the field, but I'm going to the E after the holidays are over, I didn't know this. As a free man, at night, excuse my French, real asshole. Yells, he's about 65, close to 70 years old."},{"speaker":"Marcus","time":"00:45:36-4","content":"He's security?"},{"speaker":"Robert","time":"00:45:37-2","content":"Security officer, tall, lanky, old, cranky, always brings a bad attitude to work. He was yelling at the top of his voice at 1 o'clock in the morning to an offender. Schizophrenic. So me and another offender at night we were talking, just talking about old times, drinking hot chocolate. And so we see the guy get up, and he starts going up front. I'm like man this is interesting. Half the dorm is watching movies, they're in the TV room. So this is interesting like manes what's going on."},{"speaker":"Robert","time":"00:45:37-2","content":"All the sudden we hear a bang, the freeman is yelling, don't you come back here! Don't you come back here! So I automatically get up from my rack, I already know what's happening. Put my shoes on, by the time I get my shoes all the way on, people are rushing from the TV room to come sit on the bed. The freeman took his walkie talkie, hit him with it, broke it in half, ripped the phone out the wall, wailed on him. I tried to get up there as quick as I can."},{"speaker":"Marcus","time":"00:46:39-3","content":"You're trying to get up to where he is?"},{"speaker":"Robert","time":"00:46:40-6","content":"I'm trying to get to where the freeman is at. So I finally get in there I intervene. The guys no longer dealing with that freeman, I'm with him now. Trying to take care of him. Not one person in that dorm lifted a finger, and they were closer than I was, they could've stopped that."},{"speaker":"Robert","time":"00:46:40-6","content":"They didn't lift one finger to help that man. If that man would've died in that dorm, they would've killed 3, 4 people in front of me just to prove a point. And I couldn't have that on my conscious. I couldn't have- one person already dead, I couldn't have that on my conscious no more."},{"speaker":"Robert","time":"00:46:40-6","content":"So I stood with that freeman until the warden came and everything. But you had no idea what I had to endure, the ridicule. That night, scared to death to go to sleep, because of helping a free man. Especially, I didn't even like him, he was an asshole to begin with. So he wound up going to the hospital, and of course they kind of like interview several other people about what really happened. And the free people came in the dorm that morning, 2 people, a major and the son that was on the shake down crew."},{"speaker":"Robert","time":"00:46:40-6","content":"And I'm hearing the walkie talkies, but I'm still groggy cause I ain't get no sleep, I'm still sleeping with one eye open so the speak. 2005, and he comes in there, and he makes a broad statement, he says, the only reason why we don't flip this fucking dorm is because of one person in here."},{"speaker":"Robert","time":"00:46:40-6","content":"And I said oh man they going to do it anyway, so I'm trying to turn over and get me some rest. Because I knew what they going to do, they going to shake down and tear this place up. That man comes all the way to my bed, sits on my bed, shakes my hand and cries, and tells me thank you for saving my father."},{"speaker":"Robert","time":"00:46:40-6","content":"And I'm like, it ain't nothing, that's what you're supposed to do. That's a human thing to do. But I had to endure all the ridicule, get locked they punished the dorm. And I'm like man I never want to be put in a situation like that ever again, ever. But you talk about coping mechanisms that was the hardest things I've had to do, because everybody in the prison knew about that. Oh you the person that helped that free person."},{"speaker":"Robert","time":"00:46:40-6","content":"Yeah I helped that free person, I'd do it again if I had to. But don't get it twisted, I'm not like you and you. I ain't a rat, I don't go shooing, and I don't go sucking up to these free folk. Cause at first, man my first 10, 12 years I was at war with them. I was hard to adjust, this is not my environment, you're not my people, and you're not going to talk to me in any kind of way. I was at war with them-"},{"speaker":"Marcus","time":"00:49:20-8","content":"With security?"},{"speaker":"Robert","time":"00:49:21-5","content":"With security. Until I realized I'm not at war with them, I'm at war with myself, you're tripping. So I got beyond that, so the first 12 years of my life, 33 write-ups. Second 12 years of my life, 1 write-ups."},{"speaker":"Marcus","time":"00:49:38-2","content":"For the phone."},{"speaker":"Robert","time":"00:49:39-6","content":"Big difference, big difference."},{"speaker":"Marcus","time":"00:49:41-9","content":"Yeah, of course. Alright, so anything else I should've asked you about?"},{"speaker":"Robert","time":"00:49:49-4","content":"I just want to say that, point lookout doesn't have to be a reality for any of us with a life sentence. But you got to have that gumption you got to have that same type of vision to see beyond this place."},{"speaker":"Robert","time":"00:49:49-4","content":"I'll share this one part with you, Calvin Duncan has been one of my motivating factors in this environment because every day I used to come up here and Calvin used to be here, he would be in that room right there. In that big auditorium, teaching law class, even on the weekend, if it was just 5 people. But it was really never a small number like that."},{"speaker":"Robert","time":"00:49:49-4","content":"Year after year, month after month, day after day. He would come up here motivated. And I'm like man what drives this dude. This dudes got more drive than me, what drives him. And he was determined not to make this his reality. My reality is out there. And all the other great men that I've seen leave this prison had this same mindset. They're become too large for the prison because of their vision that goes beyond this environment."}]}