{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:05:50",
      "content": "Ron Hicks Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:50",
      "upperBoundTime": "00:06:02",
      "content": "So, Ron thank you for sitting with us. I want to ask you a little bit about growing up in Opelousas. Can you tell us a little bit about your family and who raised you, the adults that took interest in you?"
    },
    {
      "speaker": "Ron",
      "time": "00:06:02",
      "upperBoundTime": "00:07:55",
      "content": "Well my family of 5 siblings three boys two girls one of my sisters in 2009, she left us, went on. Two parents, mother and father in a home, pretty good environment from what I knew as I look back on life and as I develop as a person."
    },
    {
      "speaker": "Ron",
      "time": "00:06:02",
      "upperBoundTime": "00:07:55",
      "content": "I was I'm able to see some of the maybe the only way that I can term it is some of the dysfunctions not intentional dysfunctions more not knowing how to raise kids and it's a learning process for everybody so my parents did the best job that they can they could've done and I look back at my mother and my father growing up and what I've learned was the way that they parents raised them was so strict."
    },
    {
      "speaker": "Ron",
      "time": "00:06:02",
      "upperBoundTime": "00:07:55",
      "content": "Like you can't do this so they flipped the coin the other way and said well I'm not going to be as strict on my kids and I'm not going to let them pretty much have so I had grown up calling my mom and dad by the names or they nickname not mom and daddy so it was a unique situation but they were my dad was the provider, that's what he knew, provide for the family pretty much the extent of what he knew how to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:55",
      "upperBoundTime": "00:07:55",
      "content": "That was his job."
    },
    {
      "speaker": "Ron",
      "time": "00:07:55",
      "upperBoundTime": "00:08:29",
      "content": "That was his job, that's what he, that's the way he learned how to do parenting, and my mother was pretty much a housewife and she would we would go to her when we needed things done so normal within the environment but as you expand and learn you that there was some areas that could have been better to help develop children."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:29",
      "upperBoundTime": "00:08:31",
      "content": "Yeah so maybe too permissive"
    },
    {
      "speaker": "Ron",
      "time": "00:08:31",
      "upperBoundTime": "00:08:32",
      "content": "Correct."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:32",
      "upperBoundTime": "00:08:35",
      "content": "Where as their upbringing might have not been really permissive enough"
    },
    {
      "speaker": "Ron",
      "time": "00:08:35",
      "upperBoundTime": "00:09:22",
      "content": "Right and I was the baby of the family so I pretty much got away with a lot of mischievous things that I should've been really chastised for but my mom didn't that wasn't her way that was my father's way of dealing with situations my dad would punish us and whip us and it's okay to say that because in this day and time you can't pretty much whip kids and I would get whippings, but I still had the run to just go where I wanted to go and pretty much do what I wanted to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:22",
      "upperBoundTime": "00:09:26",
      "content": "Would you say that you were raised in a loving family?"
    },
    {
      "speaker": "Ron",
      "time": "00:09:26",
      "upperBoundTime": "00:10:01",
      "content": "Yeah I'm more than sure my parents loved me they loved all of us. And yes no, no doubt about that. But it goes back to me thinking about learning and sometimes when you love people you sometimes you can love them the wrong way. And the love that they really need is this, but you giving them this. So they did they best of what they was equipped to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:01",
      "upperBoundTime": "00:10:09",
      "content": "What about friends growing up? Did you get in fights with folks a lot or?"
    },
    {
      "speaker": "Ron",
      "time": "00:10:09",
      "upperBoundTime": "00:11:34",
      "content": "Did I have fights, yes indeed. I mean, I mean when I hear people didn't have fights growing up its like weird to me. Because I met a few people I never had a fight before I'm like what, where was you raised at, but that was like when I was growing up my brothers because I'm the baby my older brothers would give other guys in the neighborhood that had younger brothers and that would be the thing."
    },
    {
      "speaker": "Ron",
      "time": "00:10:09",
      "upperBoundTime": "00:11:34",
      "content": "My brother fight your brother for sport for like bragging rights my little brother is badder than your little brother and if you didn't get in the fight if you didn't do what your bigger brother was telling you then you was soft you was this is the mentality of this is really barbaric when you think about it if you don't fight you weak that's the foundation of the mentality that we were reared in."
    },
    {
      "speaker": "Ron",
      "time": "00:10:09",
      "upperBoundTime": "00:11:34",
      "content": "So you had to do this in order to survive. Or don't get picked on or don't get bullied. Or people bullying you so you had to exert some type of aggression."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:34",
      "upperBoundTime": "00:11:39",
      "content": "It sounds very similar to how people describe the prison experience."
    },
    {
      "speaker": "Ron",
      "time": "00:11:39",
      "upperBoundTime": "00:12:25",
      "content": "Correct. And I had a conversation with someone about that with someone outside of the prison system about aggression. Because we live in aggression every day and I had to find ways to tone it down because when I would talk to my parents my mother she was saying you don't know how to talk to people. And it wasn't that I was intending to exert aggression it's just I was in aggression every day around the prison. Because its males and it's abnormal for real."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:25",
      "upperBoundTime": "00:14:44",
      "content": "Can we stop? So we were talking about the culture of fighting."
    },
    {
      "speaker": "Ron",
      "time": "00:14:44",
      "upperBoundTime": "00:14:46",
      "content": "Yes"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:46",
      "upperBoundTime": "00:15:00",
      "content": "That you grew up in, at first sort of fighting for sport, as kids got older what were fights about?"
    },
    {
      "speaker": "Ron",
      "time": "00:15:00",
      "upperBoundTime": "00:16:05",
      "content": "For me, because fights would be about I always seen people that were being picked on, I want to help them. So if I was to get into a situation of always being behind somebody that somebody was trying to take advantage of so I would if I was going to school the person that would be deemed the least on the school bus that's the person I want to sit with."
    },
    {
      "speaker": "Ron",
      "time": "00:15:00",
      "upperBoundTime": "00:16:05",
      "content": "Because if I would if anybody would mess with them I would be like take up the because for that individual or my presence would stop that individual from being picked on so that's if I would get in a fight it would be behind those situations like that. Or if somebody would say something to me the wrong way and try to bully me then I would aggress for those purposes but basically that was the extent of my fighting."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:05",
      "upperBoundTime": "00:16:08",
      "content": "Did you ever get kicked out of school for fighting?"
    },
    {
      "speaker": "Ron",
      "time": "00:16:08",
      "upperBoundTime": "00:16:43",
      "content": "Yes I did. I got kicked out of the ninth grade for fighting and my fight was with a teacher that slapped me and I turned around and picked I was in industrial arts class picked up a piece of stick off the a piece of stick off the ground and I used it I hit that teacher for what they had done to me."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:43",
      "upperBoundTime": "00:16:45",
      "content": "Did you get kicked out of school?"
    },
    {
      "speaker": "Ron",
      "time": "00:16:45",
      "upperBoundTime": "00:16:57",
      "content": "Yeah I got expelled for the year, for the year so I had to repeat the ninth grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:57",
      "upperBoundTime": "00:16:59",
      "content": "Did you finish high school?"
    },
    {
      "speaker": "Ron",
      "time": "00:16:59",
      "upperBoundTime": "00:18:53",
      "content": "I didn't me was in the 12th grade and just stopped going. And it's really when I think about that right now it's really heartbreaking even now thinking about my mentality. I was in the 12th grade of high school and then I don't know how it is now but we had six weeks like periods like I had six six weeks to graduate I had took my graduation pictures and I just woke up one morning and said I'm not going back. Because I was selling drugs doing illegal activity and I was like I'm not going back to school."
    },
    {
      "speaker": "Ron",
      "time": "00:16:59",
      "upperBoundTime": "00:18:53",
      "content": "And my mother and she was like what in the world because I was the both my brothers didn't graduate so I was like the promised son to graduate this my only boy that's going to graduate high school 12th grade and I just decided not to go no more. And I think about that today and it's like wow where my thinking was? Just it was confusing its like how do you wake up and think about something like that?"
    },
    {
      "speaker": "Ron",
      "time": "00:16:59",
      "upperBoundTime": "00:18:53",
      "content": "What kind of what kind of thoughts were you having so I was valuing other things over or enjoyment in this then something that was beneficial to me? So I didn't graduate high school."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:53",
      "upperBoundTime": "00:19:13",
      "content": "So you are one of the leading mentors in this entire prison for so many other inmates. Did you have any mentors when you were growing up? Positive mentors?"
    },
    {
      "speaker": "Ron",
      "time": "00:19:13",
      "upperBoundTime": "00:19:59",
      "content": "I'm thinking I had a, I can't really put my finger on one. Like outside of my parents trying to do what they could but I can't think of somebody like really invested in my life like to that extent. I don't really, had a couple of baseball coaches but I wouldn't I mean that was I would play sports and that was it no nothing after the activity."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:59",
      "upperBoundTime": "00:20:04",
      "content": "Do you have any mentors here? Even at this stage of your life?"
    },
    {
      "speaker": "Ron",
      "time": "00:20:04",
      "upperBoundTime": "00:21:44",
      "content": "Yeah and I've learned I didn't develop this kind of stuff until I heard Bill Hybels I don't know if you're familiar with Bill Hybels, he's the pastor at Willow Creek Church Chicago and he talked about mentoring he said you don't have to really sit with a person to person and have that person be your mentor; he said you can read their literature watch them anything that they any videos anything they publish and they can mentor you can be mentored like that."
    },
    {
      "speaker": "Ron",
      "time": "00:20:04",
      "upperBoundTime": "00:21:44",
      "content": "So I have a lot of mentors from that experience of watching videos and reading literature on leadership, but I do have I had a pastor here he's passed away he passed away in prison he was in prison his name was Joe Stevenson and he was a mentor to me. Some of the older guys that were here pastor Sidney DeLoch. He was a mentor."
    },
    {
      "speaker": "Ron",
      "time": "00:20:04",
      "upperBoundTime": "00:21:44",
      "content": "Leo Jackson he was a mentor because I see these guys like live a life before me that was positive and so those guys mentored, invested in my life Norris Henderson, Chico Yancy, yes those guys were around and I was able to have a model to look at and say these guys are really trying to make a difference in this environment that they in so I feel like I was being mentored by them to some degree."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:44",
      "upperBoundTime": "00:21:47",
      "content": "Do you remember the first time you got arrested?"
    },
    {
      "speaker": "Ron",
      "time": "00:21:47",
      "upperBoundTime": "00:23:27",
      "content": "Yes I do. I remember it I got arrested in I was in the same school that I had got expelled from. I was they had a rule not to walk in the hallway with your cap on your head and I'd come through the hallway had my cap and I'm strolling. And a teacher passed and took the cap off my head and went into the principal's office. And in turn I went into the principal's office, locked the door behind me when I went in and took the phone and jacked the cord out of the phone out of the plug and demanded my cap back and they ran into another office inside the bigger office and called the police and I was arrested."
    },
    {
      "speaker": "Ron",
      "time": "00:21:47",
      "upperBoundTime": "00:23:27",
      "content": "I was about maybe 14 or 15 years old and I was well; I don't want to say arrested but I was brought to the police department and my parents had to come and get me and I remember that and I was from that point I was arrested for a second degree attempted murder. I was arrested and stayed in jail for and then right after that I was here. So those three experiences of being arrested."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:27",
      "upperBoundTime": "00:23:35",
      "content": "You mentioned that you were hustling a little bit with drugs and so forth, were drugs and alcohol a part of your own life? Personal life?"
    },
    {
      "speaker": "Ron",
      "time": "00:23:35",
      "upperBoundTime": "00:25:00",
      "content": "I was I used I liked to drink beer and I liked to smoke marijuana. That's I mean pretty much that's another thing that I know this is crazy, because I did it to my nephews I mean we growing up we smoked weed and my little I remember my brother and all the people around me they'd take a joint and blow weed in my face and then I started smoking weed and I in turn did that to my nephew when they were acting bad mimes blowing out smoke."
    },
    {
      "speaker": "Ron",
      "time": "00:23:35",
      "upperBoundTime": "00:25:00",
      "content": "They'd break out running and go this is like I mean that's dysfunctional it's not that not normal for you to do that, but I mean it was a cycle that what I was done to me I in turn practiced it on doing it to my nephews and so I indulged in smoking weed. I never used cocaine or shot heroin, never put anything in my arm but I was a regular smoker of marijuana every day I used."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:00",
      "upperBoundTime": "00:25:19",
      "content": "So you were 19. I imagine that during the trial you were housed in the parish jail. Do you remember when you first came to Angola? Those first few days?"
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "Yeah I was I went to Camp A which is closed down it's a cell block and when I was evaluated by the classification department they were judging my physical size whether or not I can live in that particular environment and I remember these words: well he's big enough look like he can handle himself we'll send him to Camp A line 21. That was the name of the field line, 21."
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "And that camp had a reputation for violence. And the first day on the tier the next morning I wake up work call there's a knife fight, somebody got stabbed on the yard, and I'm like I've never been in prison I never this is my first time ever being incarcerated I never spent an extended time in a jail, so I was only arrested and then was able to get out like, so this is like brand new, and I'm in this environment and I'm thinking ok so what is my mindset what do I need to do?"
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "So I'm working this in my mind that I'm not going to let nobody really harm me but I'm not looking to harm anybody at the same time. I'm not looking to like target people or make a name for myself or do none of those things I was really I'm going to protect myself and that's the mindset that I had I'm protect myself, but thanks be to the powers of outside of my control that I lived a life and it was I didn't have to go through that route where being hurt somebody targeting me or me having to defend myself to that degree."
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "So but it was an experience for me because I had been dropped in an abnormal environment. And anybody say prison is not abnormal? They have to be abnormal. It's like I said, because it's very abnormal. People weren't created to live in situations like this. It's not conducive to who we are as a human being. Neither is the way that people were living in society in those neighborhoods and growing up in that type of environment that's not the way people supposed to live."
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "So it was a weird experience and I capitalized on it because I from that point on I had to make a decision on what road that I was going to travel and in prison there are many roads to travel and I decided that hey I know what I want to be I think I'm developing into a starting to have some thought processes in my mind of working on what I want to try and make something out of my life."
    },
    {
      "speaker": "Ron",
      "time": "00:25:19",
      "upperBoundTime": "00:29:37",
      "content": "So it lined up that I was able to get around some people that were positive like I was saying earlier. That was doing positive things and I was looking and seeing and checking it out but from a distance not wanting to get trapped in a situation because some things that look good in prison can turn out to be a trap. People trap you in situations to take advantage of you so I was not jumping at every thing that I seen that may have appeared to be positive I was just checking it out with out making any statements about it so."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:37",
      "upperBoundTime": "00:29:51",
      "content": "What advice now that you're so many years removed what advice would you give that young man coming in here?"
    },
    {
      "speaker": "Ron",
      "time": "00:29:51",
      "upperBoundTime": "00:30:35",
      "content": "I wouldn't necessarily have advice what I would say is… you chose the right path. You actually made some of the right decisions that other people unfortunately didn't make. So my advice to somebody else is to find positive people and gravitate towards those people and because I can promise you every person that comes to prison had a dream of wanting to be something more."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:35",
      "upperBoundTime": "00:30:36",
      "content": "Of course."
    },
    {
      "speaker": "Ron",
      "time": "00:30:36",
      "upperBoundTime": "00:32:06",
      "content": "Than what they are. And for the circumstances the environment just let me back up because I'm growing up in school, going to school and to be smart was not popular. It's crazy. To actually display intelligence was like you nerd you soft you weak it's and I think about those things now like how can I make being smart the thing to be and I look at the paper now and I see people I went to school with and it's like oh this guy's a doctor. So he didn't let the environment that he lived in like make him go in another direction."
    },
    {
      "speaker": "Ron",
      "time": "00:30:36",
      "upperBoundTime": "00:32:06",
      "content": "He was called a nerd and now he has people working for him his employees. It's crazy it's weird but it's true. So I would tell people man if you had a dream you could still try to unfold what you wanted to be. You may be limited because of the situation of being in prison, but you can try to do some of the things that you feel that you were created to do. Whether it's through writing whether it's through people around you whether it's talking to your family trying to instill some values in them."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:06",
      "upperBoundTime": "00:32:36",
      "content": "So I guess I was asking you that question because most people come to prison with a very different mentality that's not particularly productive or positive and then they transform their lives while they're here. From what I'm understanding you're saying that you pretty much realized that when you walked in here. And that you didn't have to go through some kind of transformation. You just picked a path."
    },
    {
      "speaker": "Ron",
      "time": "00:32:36",
      "upperBoundTime": "00:34:24",
      "content": "The shock of, the reality of my situation in the parish jail. It was shocking. Because I was 19, had experience with a lawyer that said listen, if you get found guilty of this charge that you're on, you could spend the rest of your life in prison. And I was it was sobering it was like it's like you was sleeping and now all of a sudden snaps you awaken with this is real. And so I'm in this parish jail and I'm like man and I cried like a baby because what happened in my life I'm like how did this happen it's something I know that I didn't dream about doing this is something I didn't think about or so."
    },
    {
      "speaker": "Ron",
      "time": "00:32:36",
      "upperBoundTime": "00:34:24",
      "content": "Now I'm in Angola and I'm in this transform process don't get me wrong it's not like I came here like oh I got everything together. I had a glimpse of what I wanted you now I wanted to salvage some of my life. Put it like that. I wanted to say ok man I've failed I've failed my parents I want to try to bring something to the table. And I took that path. Now along that path there was some pitfalls, but I took the path that was the least travelled at that time in prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:24",
      "upperBoundTime": "00:34:40",
      "content": "So you're we all change in the course of our lives and hopefully we get smarter about things as we live. How are you a different person now than you were when you came here?"
    },
    {
      "speaker": "Ron",
      "time": "00:34:40",
      "upperBoundTime": "00:36:41",
      "content": "Because now I'm able to I have a holistic approach to everything. I'm thinking I'm able to think and that's something that I didn't do. I'm able to sit back and think and be patient and think about things the unfolding of things. I'm able to sit back and if something happens I'm able to like think it through and see the outcome in different scenarios of what these outcomes can be."
    },
    {
      "speaker": "Ron",
      "time": "00:34:40",
      "upperBoundTime": "00:36:41",
      "content": "And I'm able to say okay, I think this is the best route to take and that's something that I did not have. I wasn't capable of thinking. I didn't want to think. I was geared to pretty much act. If somebody do something react to it? Put a stop to it immediately don't let that happen never again. And now I'm able to think about it so if somebody was to say somebody was disrespect me in some kind of way, now I'm able to now think about maybe this guy don't know what respect is."
    },
    {
      "speaker": "Ron",
      "time": "00:34:40",
      "upperBoundTime": "00:36:41",
      "content": "Before, no he needed to know that he disrespected me he needed to feel the consequences of being disrespectful now it's a whole different ball game so the person that I am now I'm caring. I care about people I care about life I care about human beings. And I work diligently in that area of trying to to make people live to the fullest that they can under the circumstances that they in."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:41",
      "upperBoundTime": "00:36:48",
      "content": "Yeah can you describe what your typical day looks like here? Typical routine?"
    },
    {
      "speaker": "Ron",
      "time": "00:36:48",
      "upperBoundTime": "00:37:56",
      "content": "So today, pretty much every day I like leadership that's what I work in, been doing that for the last probably three years just cultivating and developing as a leader. Some things that I already knew, but I'm working, so I wake up in the morning and this morning I woke up 7 o'clock I was facilitating a leadership class with a group of guys seven guys that are leaders and we were discussing leadership."
    },
    {
      "speaker": "Ron",
      "time": "00:36:48",
      "upperBoundTime": "00:37:56",
      "content": "Leadership principles the power of leadership, the privilege of being a leader, and sitting around the table talking about what we think how can we help this environment that we in how can we make it better. Leave from there meeting with different people throughout the day because I graduated from the bible college so."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:56",
      "upperBoundTime": "00:37:58",
      "content": "The first one."
    },
    {
      "speaker": "Ron",
      "time": "00:37:58",
      "upperBoundTime": "00:38:52",
      "content": "So I'm pretty much able to go around and talk to people it's my job it's what I love to do just go around listening to people talking to people. Trying to help people in different situations that they in so my day is really just giving up myself to other people to try to make they life better."
    },
    {
      "speaker": "Ron",
      "time": "00:37:58",
      "upperBoundTime": "00:38:52",
      "content": "That's what I do that's what I love to do."
    },
    {
      "speaker": "Ron",
      "time": "00:37:58",
      "upperBoundTime": "00:38:52",
      "content": "That's what my day is about and when I don't accomplish that I don't feel like I did what I was supposed to do. If I go throughout a day and I don't touch anybody life, I don't make a difference in anybody life then I feel that my day has been that I really wasted a day. So that's my day every day. Teaching Malachi Dads."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:52",
      "upperBoundTime": "00:38:53",
      "content": "Are you a father?"
    },
    {
      "speaker": "Ron",
      "time": "00:38:53",
      "upperBoundTime": "00:39:35",
      "content": "yes I am I had a, my daughter was 4 years old when I came to prison. So I had a daughter when I was 15. So my daughter grew up and I was here in prison. I have 2 daughters but one of them I was more connected to than the other one. So we developed a relationship because she was more active with my family. So my parents would come they would bring her with them. So I had more time with my older daughter than the daughter that's right under her like a year apart."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:35",
      "upperBoundTime": "00:39:37",
      "content": "Are you still in contact with your daughter?"
    },
    {
      "speaker": "Ron",
      "time": "00:39:37",
      "upperBoundTime": "00:40:11",
      "content": "Yes I am one of, I'm in contact with both of them but still the older one I communicate with her more. Its I think that my the one right underneath her she's kinda like because we didn't really have this connection through the years it was in and out in and out it's still kind of like trying to work that out. But we do communicate from time to time."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:11",
      "upperBoundTime": "00:40:18",
      "content": "I don't know everything about Malachi Dads but I imagine its sort of telling you about parenting from within prison walls."
    },
    {
      "speaker": "Ron",
      "time": "00:40:18",
      "upperBoundTime": "00:42:21",
      "content": "Right so the whole concept of Malachi Dads is the scripture is taken from the Malachi bible 4 and 6, God would turn the hearts of fathers to the children and the hearts of children back to their fathers. As a matter of fact the guy you was just talking to, Keith, he was actually the founder of Malachi Dads. And he brought a couple of guys together and said we need to try to work on doing something just because we in prison we got the responsibility of being a father we don't have the luxury just to relinquish that responsibility."
    },
    {
      "speaker": "Ron",
      "time": "00:40:18",
      "upperBoundTime": "00:42:21",
      "content": "So we started meeting and then we started doing training and one of the things that we encourage guys to do to write they kids that's a part of the curriculum. Part of the program you have to write your kids once a week. You have to do this; it's mandatory. So we encourage guys to write they kids we encourage guys when they visit not to spend more because in prison if a mother is bringing a child most likely the child is going to be neglected in that process and the reason not all the time, but the reason is that person is trying to spend as much time with his mother to try to keep this relationship together that the child is neglected."
    },
    {
      "speaker": "Ron",
      "time": "00:40:18",
      "upperBoundTime": "00:42:21",
      "content": "So we're like man listen you have to spend time with your kids you have to sow into your kid's life you don't want them to repeat what you're experiencing right now. So Malachi Dads has this fantastic outreach ministry which they meet tonight on Monday nights once a week and we do a curriculum and guys try to go out and be the best father that they can be under the circumstances."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:21",
      "upperBoundTime": "00:42:50",
      "content": "So a moment ago when I asked you what your typical day was like, if I just were to listen to your description it would sound like an extremely meaningful way to live. If you're released from here, when you're released from here, how do you envision your life? Well how do you see yourself living?"
    },
    {
      "speaker": "Ron",
      "time": "00:42:50",
      "upperBoundTime": "00:44:11",
      "content": "I live my life in here how I believe that I'm live when released from here, and everything I tell guys even when we was in this leadership class and we not doing leadership just for prison this is not like this prison concept this leadership is leadership anywhere. Different circles you might have to adjust a little bit but we don't develop for prison we develop as a human being so my life is given to humanity to make people better."
    },
    {
      "speaker": "Ron",
      "time": "00:42:50",
      "upperBoundTime": "00:44:11",
      "content": "And as they get better I get better so I believe 100% when released my life is going to be dedicated to the community. The people in the community to try to make a difference in the lives of people I want to do this for the rest of my days on earth. I don't want to do anything else but find ways to encourage and develop and listen to empower people to be the best that they can be."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:11",
      "upperBoundTime": "00:44:59",
      "content": "I think that the best evidence for that is what you do every day here. I'm going to ask you a question that sort of hinges on remorse when you look back and it's more time than you were ever even alive for when you committed this crime has passed since then, when you look back on it and think of the victims it's been so long, how do you feel with so much time passed in the context of being punished every day for all that time?"
    },
    {
      "speaker": "Ron",
      "time": "00:44:59",
      "upperBoundTime": "00:46:54",
      "content": "It's even more painful because you cannot express it to the person that you have offended. You can't express it you can't there are laws so that you can't contact victims so you're living with if I do you something that brought pain to your life, and I never can release and ask forgiveness and ask for restoration and ask or even be expressed back what that person wants to say to me."
    },
    {
      "speaker": "Ron",
      "time": "00:44:59",
      "upperBoundTime": "00:46:54",
      "content": "Not to be able to experience that is painful because you living with, will I ever be able to say to that individual or those individuals that I hurt or brought pain into the life, will I ever get the opportunity to really have a to really express this?"
    },
    {
      "speaker": "Ron",
      "time": "00:44:59",
      "upperBoundTime": "00:46:54",
      "content": "Apart from the pardon parole which is limited in that process, will I ever be able to express the deep remorse that I have of knowing that I've brought trauma to somebody life. And being able to allow that person to express whatever that they will have to express to free them, for freedom to take place between the two people if it's possible."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:54",
      "upperBoundTime": "00:47:17",
      "content": "I think people tend to have a very narrow view of who the victim is in a typical violent crime because it's obviously it's not only the direct victim but its these ripple effects around both the offender and the victim, your family and the victim's family."
    },
    {
      "speaker": "Ron",
      "time": "00:47:17",
      "upperBoundTime": "00:49:11",
      "content": "The ironic thing is that so these two families I caused trauma in one family life have an effect upon their family my family and the extended part of that is that those two families that have been affected they're not, there's a separation between those two families."
    },
    {
      "speaker": "Ron",
      "time": "00:47:17",
      "upperBoundTime": "00:49:11",
      "content": "Because they don't even its nobody well, I don't want to say anybody because I don't know, but in my situation there's nobody mediating. Because here it is my parents and the parents of the person that I'm in prison for they haven't even talked. I mean this goes deep, deep, deep."
    },
    {
      "speaker": "Ron",
      "time": "00:47:17",
      "upperBoundTime": "00:49:11",
      "content": "They haven't even talked and it's generations of people not communicating with each other because of a situation that took place. And I'm responsible for that. I'm the one that's responsible for that pain in both of those people's lives. And not being able to express that, not being able to ask for forgiveness, not being able to really allow them to see that this is like something that if I can change if I whatever I was able to do that to replay it it would not be the course of action that would have been taken."
    },
    {
      "speaker": "Ron",
      "time": "00:47:17",
      "upperBoundTime": "00:49:11",
      "content": "So not only do I express and feel remorse for the crimes that we've committed everybody I come in contact with."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:11",
      "upperBoundTime": "00:49:52",
      "content": "Let me ask you something that I've been thinking quite a bit about since this project started and that is, now there are variations in there's all kinds of conduct that results in a life sentence. At what point is a person able to sort of forgive themselves not to diminish what they did but to forgive themselves and to have a right to say, I've been punished enough."
    },
    {
      "speaker": "Ron",
      "time": "00:49:52",
      "upperBoundTime": "00:51:43",
      "content": "Right so it's like wanting to express that, but being misunderstood in the process of saying that. Because you have these concepts of like at some point something should be restored, I mean throughout history there were restoration processes even dealing with other countries conflict is always a time of restorations where we get passed the that point in life and I think that because we don't have that opportunity to do it we don't have the opportunity to do it effectively at the beginning they still live with people still live with that. If you never was able to express forgiveness, then because human beings that's and I mean I'm not a sociologist or a psychologist none of those things."
    },
    {
      "speaker": "Ron",
      "time": "00:49:52",
      "upperBoundTime": "00:51:43",
      "content": "But just living life you these are things normal things that you want to do. It's just something if you hurt somebody you want to be reconciled you want to ask for forgiveness and because you don't get to do those things it can have it can make people bitter, angry, people can be angry or become very angry towards really the system that creates these environments. But for the most part I think that I think that it comes a point in time that we have to move forward."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:43",
      "upperBoundTime": "00:51:48",
      "content": "How much punishment is enough?"
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "I think when a person has been rehabilitated and there go another word that what is that? Because people have different concepts of what rehabilitation is. So I think that when a person has come to a place in they life when they realize that hey I'm functioning and I'm able to my life is able to impact society I can be used for better service than what I am."
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "Not diminishing the service that's in prison because people need but I can be used in a better way. My life can be used to touch somebody else life and they don't have to experience somebody else don't have to experience hurt and trauma."
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "That's what I want to do that what other people want to do and I guess I have the freedom to talk about my experience I mean this is the person that I am no matter what the circumstance I have to keep pressing forward and believing that impacting lives is meaningful whether it's in prison whether it's outside of prison this is what I want to do this is who I am."
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "And I think that it comes a point in time that the system or the society has to really say hey is it appropriate to waste money on people that can be doing positive things in society and making a difference in somebody else life than to be wasting taxpayers dollars on a person sitting in the prison?"
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "And can't contribute back financially can't pay taxes can't do the things that they are rehabilitated there's no other rehabilitation for me I think personally that the prison can offer. There's no prison I think in the world that can develop my rehabilitation because I'm rehabilitated. There's nothing else that I can do inside the prison context. I self rehabilitate I self learn and I continue to grow as a person but the prison I've outgrown what the prison system has to give."
    },
    {
      "speaker": "Ron",
      "time": "00:51:48",
      "upperBoundTime": "00:54:33",
      "content": "And when a person is at that point I think that they should be really really considered for release."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:33",
      "upperBoundTime": "00:55:00",
      "content": "How do you make sense of all the high-quality programming, treatment, vocational training that goes on here at Angola where 85% or so of people will never get out?"
    },
    {
      "speaker": "Ron",
      "time": "00:55:00",
      "upperBoundTime": "00:56:21",
      "content": "That's not normal that's not normal for you to invest in something that you it's not normal in business it's not normal nowhere for you to invest in people and don't expect the return of a quality return. What you invest in this is the is documented, it's continually being documented that this is the most reformed prison in the probably in the world. I mean when you can go down to the dormitories get you don't see fights you don't see people that's it has to say something about the rehabilitation."
    },
    {
      "speaker": "Ron",
      "time": "00:55:00",
      "upperBoundTime": "00:56:21",
      "content": "And if the system had put this in place to gauge rehabilitation then the voice of the people that run the prison has to be greater to say this is these people should be released. It's not that they considering it, they should be released because they've met the qualifications set."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:21",
      "upperBoundTime": "00:56:43",
      "content": "The question really is well how much is enough? The Supreme Court has recently made a recommendation that juvenile offenders should be eligible for parole after serving 25 years. Is that enough?"
    },
    {
      "speaker": "Ron",
      "time": "00:56:43",
      "upperBoundTime": "00:59:52",
      "content": "It's definitely enough if that person has changed. I mean it's enough it's more than enough and every day that when you look at the people around you it's like wow this guy has been here and you've been watching him for the last 20 years and he's been here 40 years and this is a this is a waste of dollars. And I'm only using dollars because it takes money to run this place. Millions of dollars. And I think about it all the time even with this last legislative session like it's this instead of trying to heal and bring healing to people that's hurting."
    },
    {
      "speaker": "Ron",
      "time": "00:56:43",
      "upperBoundTime": "00:59:52",
      "content": "It's making them more bitter in this process of making them more hateful towards the person 30 years 20 years that committed this crime instead of trying to say hey how can we reconcile these people how can we make this better how can we bring healing to both of these situations but listening and reading the newspaper it was totally opposite. It was like how can we make these people that were hurting angrier towards these people that committed these crimes to further our agenda?"
    },
    {
      "speaker": "Ron",
      "time": "00:56:43",
      "upperBoundTime": "00:59:52",
      "content": "That's the only thing that I can see because if you want people to heal then you invest in they lives for healing and try to bring experts to deal with these people lives to help them to see how much more beneficial it is to heal than to stay living in hatred and bitterness."
    },
    {
      "speaker": "Ron",
      "time": "00:56:43",
      "upperBoundTime": "00:59:52",
      "content": "So I think that it then got to point that the criminal justice system is has been a planned planned this whole theme of we're paying respects to those who have been hurt by keeping a guy in prison. We are honoring them. I don't think that's the case. I don't think that's the case I think the case is is that it's a political thing."
    },
    {
      "speaker": "Ron",
      "time": "00:56:43",
      "upperBoundTime": "00:59:52",
      "content": "We are now political prisoners. That's what we've become political prisoners for the benefit of those that want to keep the power or keep people in situations that they can be empowered or feel empowered."
    },
    {
      "speaker": "Marcus",
      "time": "00:59:52",
      "upperBoundTime": "01:00:20",
      "content": "So I imagine just coping and trying to remain hopeful in the face of what sometimes appears to be hopeless is one of the most difficult things about the prison experience with the life sentence. What do you think the worst part aside from that what's the worst part about Angola?"
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "False hope. It's almost like dangling a carrot in front of the rabbit or whatever running the track and the dog running behind. A dog race it's false hope, because what I've learned even if a person say for instance go back to the parole board, pardon board. You can know it's not the you have rights you have certain things but you can know that what just took place to you, it's not right. But because the fear of opposing something that's not right because who's on the other side of the wrong, people shrink back."
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "Because of that whole, man if I offend this person who has the power to possibly let me go and I offend them I might not never get what they said in my situation right now I have to wait five years to reapply to have a possible hearing on the pardon board. And I've went around asking people that have been because I got denied because of judicial and law enforcement opposition."
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "I haven't had contact with the judicial branch or the law enforcement branch in 27 years they don't even know who I am they don't even really know of the person that I have become. And that's the official denial that I get back. And it's a false hope it really is. And a lot of people in prison live from that context of false realities and it's happening every day you can go around the prison and I don't try to bust people bubbles because I think hope is important but false hope is wrong."
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "If you already know that you going to deny this person but you give them the hope that you going to possibly let them go by creating the programs. All the things that's in prison that's false hope. Because I'm doing these things with the intent that Ima have a high consideration of proper evaluation of my rehabilitation but that's not the case and its true it's a false the worst thing about the prison is false hope."
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "People having false hope instead of having a real hope a real legitimate hope based in substance. Saying these programs are real and they are real and if you complete them you're going to have a proper impartial evaluation. And no outside factors is going to determine this."
    },
    {
      "speaker": "Ron",
      "time": "01:00:20",
      "upperBoundTime": "01:04:14",
      "content": "No law enforcement opposition no law enforcement opposition it's going to knock this down if you're going to have a fair hearing. And people in prison it's the worst thing I would consider it's the false hope people live in inside of prisons."
    },
    {
      "speaker": "Marcus",
      "time": "01:04:14",
      "upperBoundTime": "01:04:18",
      "content": "I suppose it's even harder though to live without it."
    },
    {
      "speaker": "Ron",
      "time": "01:04:18",
      "upperBoundTime": "01:06:45",
      "content": "Correct. So it's important but when I evaluate it I'm conscious enough to know that it's not real. I'm conscious enough to know that this is not real but it's real to some people. Because some people continue to bite after they carrot. They never going to taste it until real change take place they going to keep doing the same thing over and over and I mean this is a common saying, if you keep doing the same thing over and over and getting the same results its insanity."
    },
    {
      "speaker": "Ron",
      "time": "01:04:18",
      "upperBoundTime": "01:06:45",
      "content": "And false hope is what we have including myself because I'm a part of this by the people here false hope is insanity because you it's not real. And sometimes people don't say that sometimes people don't like that being said but it's true it's actually true. I had the chance to witness a couple of guys that fits into this 73 to 79 life sentence."
    },
    {
      "speaker": "Ron",
      "time": "01:04:18",
      "upperBoundTime": "01:06:45",
      "content": "I seem joyful because they never thought it was almost like and I don't know if you going to take this the right way and hopefully everybody they view this the right way but it's like all the black African American people hope and wonder will I ever see a black president in this country? And when this day happened it was like wow it really did happen."
    },
    {
      "speaker": "Ron",
      "time": "01:04:18",
      "upperBoundTime": "01:06:45",
      "content": "This same expression for these guys that have life sentences in that time frame of getting an opportunity and it's like this is real this is possible this is truly is happened. The joy in they hearts so I agree 100% that the needle is moving in the direction of change that is true. I think that it need to be pushed even further than what it is."
    },
    {
      "speaker": "Marcus",
      "time": "01:06:45",
      "upperBoundTime": "01:07:08",
      "content": "So let me ask you my last question which is there something I should have asked you that I did not that you would like me to ask you? Or is there something you would like to tell me that you haven't had a chance to tell me."
    },
    {
      "speaker": "Ron",
      "time": "01:07:08",
      "upperBoundTime": "01:07:22",
      "content": "I didn't talk about my faith. Talk about I didn't talk about every day I'm I follow a set of belief systems."
    },
    {
      "speaker": "Marcus",
      "time": "01:07:22",
      "upperBoundTime": "01:07:22",
      "content": "Tell me about that."
    },
    {
      "speaker": "Ron",
      "time": "01:07:22",
      "upperBoundTime": "01:07:35",
      "content": "Which is that I'm a Christian but I'm not a denominationalist person. I don't even know if that's a word but it"
    },
    {
      "speaker": "Marcus",
      "time": "01:07:35",
      "upperBoundTime": "01:07:37",
      "content": "I understand."
    },
    {
      "speaker": "Ron",
      "time": "01:07:37",
      "upperBoundTime": "01:10:16",
      "content": "But I'm not into denomination I'm more for I'm committed to the practices of the scriptures in my life. And I actually pastored the group of guys here about 200 or something guys I pastored every day within the prison and have worship services with those guys twice a week. And that's my joy that's my connection with my faith of trying to I believe in hope. I promote hope. I promote hope but I promote true hope that I feel is true."
    },
    {
      "speaker": "Ron",
      "time": "01:07:37",
      "upperBoundTime": "01:10:16",
      "content": "And that's my love that's love my life that's the one of the most proudest thing for me is knowing that my parents see me live a life my parents see me quit school my parents see me behave in ways that was inappropriate and for them for an extended period of time they able to see the real change that has taken place in my life."
    },
    {
      "speaker": "Ron",
      "time": "01:07:37",
      "upperBoundTime": "01:10:16",
      "content": "That's something that it's like a gift to them for them to know that man my son he's real and to graduate from a bible college and walk that's something that was a great day for me to for them to experience that to let them see that actually unfold in my life. So my faith is what I stand on. So that's basically something that I didn't talk about but that's it's the center of my life. It's the center of my life."
    },
    {
      "speaker": "Marcus",
      "time": "01:10:16",
      "upperBoundTime": "01:10:32",
      "content": "I'm sure it's very meaningful to your parents and in a way it's maybe giving them some hope too. My son's doing all right he's helping other people."
    },
    {
      "speaker": "Ron",
      "time": "01:10:32",
      "content": "I really want to. It's like how you want people to see this thing is truthful you want people that you meet you want the security you want the you want the legislators to know this is real this is a real change that took place this is not something a game or I want them to hear that, know that, and know that the value of a life even though a life may have been taken the value of another life is not retribution."
    },
    {
      "speaker": "Ron",
      "time": "01:10:32",
      "content": "It's not to punish and to exclude another life as a result of whatever took place that is that life is valuable and that life should be used for the value that it is. So I want people to know that. I want to get out and I want to be in the neighborhood and I want to see change take place I want to see people lives actually change the way that lives are changing inside of prisons."
    }
  ]
}
