{"name":"","transcript":[{"content":"Shawn Gaspard Transcription REDACTIONS FINAL"},{"speaker":"Shawn","time":"00:00:07-3","content":"I'm Shawn Gaspard. I was 24 years old. I was convicted of First Degree Murder. Doing a life sentence."},{"speaker":"Marcus","time":"00:00:12-1","content":"And how much time have you served, Shawn?"},{"speaker":"Shawn","time":"00:00:14-2","content":"24 years and 10 months."},{"speaker":"Marcus","time":"00:00:17-0","content":"I'm going to start by asking a few questions about your childhood, your time before that. Can you tell me a little bit about the folks who raised you?"},{"speaker":"Shawn","time":"00:00:30-3","content":"It was my mother and stepdad."},{"speaker":"Marcus","time":"00:00:32-8","content":"Tell me about them."},{"speaker":"Shawn","time":"00:00:35-1","content":"Well, my stepdad was a real heavy drinker and my mother, all she did was work in bars so."},{"speaker":"Marcus","time":"00:00:45-3","content":"Did you find yourself butting heads with your stepdad?"},{"speaker":"Shawn","time":"00:00:51-4","content":"No, not too often."},{"speaker":"Marcus","time":"00:00:54-6","content":"How old were you when he came into your life?"},{"speaker":"Shawn","time":"00:00:59-7","content":"A baby."},{"speaker":"Marcus","time":"00:01:02-7","content":"Okay. What's your last memory of interacting with him?"},{"speaker":"Shawn","time":"00:01:06-7","content":"My last memory. My mother kicked me out the house and he let me go stay with him for a day or a night. And he brought me back to Lafayette, and just drooped me back off at my mother's house."},{"speaker":"Marcus","time":"00:01:26-5","content":"Okay, so they were split up at that point?"},{"speaker":"Shawn","time":"00:01:28-0","content":"Well, then again, they do, he did come visit a few times up here."},{"speaker":"Marcus","time":"00:01:30-6","content":"Okay."},{"speaker":"Shawn","time":"00:01:32-3","content":"Yeah."},{"speaker":"Marcus","time":"00:01:34-0","content":"So, they're no longer together?"},{"speaker":"Shawn","time":"00:01:35-7","content":"Oh no. Well, he passed away years and years ago."},{"speaker":"Marcus","time":"00:01:38-4","content":"Oh okay. Alright. What about your mom? Tell me about your mother."},{"speaker":"Shawn","time":"00:01:41-7","content":"My mother. Like I said she was, she was a bartender all her life. So..."},{"speaker":"Marcus","time":"00:01:50-2","content":"In Lafayette?"},{"speaker":"Shawn","time":"00:01:52-8","content":"Yeah, yeah."},{"speaker":"Marcus","time":"00:01:55-1","content":"When was the last time you saw her?"},{"speaker":"Shawn","time":"00:02:00-3","content":"I guess the October rodeo. Yeah."},{"speaker":"Marcus","time":"00:02:02-9","content":"Does she come and visit you very frequently?"},{"speaker":"Shawn","time":"00:02:06-9","content":"Not anymore. She's having lung problems."},{"speaker":"Marcus","time":"00:02:08-3","content":"Okay."},{"speaker":"Shawn","time":"00:02:09-4","content":"So."},{"speaker":"Marcus","time":"00:02:10-5","content":"Sure. Do you have siblings?"},{"speaker":"Shawn","time":"00:02:12-0","content":"Oh, yeah."},{"speaker":"Marcus","time":"00:02:13-7","content":"Tell me about them."},{"speaker":"Shawn","time":"00:02:15-3","content":"I got two brothers and two sisters."},{"speaker":"Marcus","time":"00:02:16-6","content":"Do they visit you here?"},{"speaker":"Shawn","time":"00:02:19-5","content":"When I call and ask them to come see me."},{"speaker":"Marcus","time":"00:02:21-6","content":"Sure. Does anybody else visit you?"},{"speaker":"Shawn","time":"00:02:23-8","content":"I got an aunt. I got an uncle that comes sometimes. And a friend of mine every once in a while. We grew up together."},{"speaker":"Marcus","time":"00:02:33-7","content":"Sure. Would it be fair to say you were raised in a loving, caring household or not?"},{"speaker":"Shawn","time":"00:02:35-1","content":"That I don't know cause I don't have nothing to judge off somebody else to say, \"Oh yeah, it was loving.\" But I don't believe it was cause, once my mother and father, stepdad, divorced, it was just my mother, she was always working. So it was, it was just me, my sister, and two brothers. My older sister was already out of the house and all that. So, it was just kind of raising ourselves, I guess."},{"speaker":"Marcus","time":"00:03:26-7","content":"Where are you in the birth order?"},{"speaker":"Shawn","time":"00:03:28-6","content":"I'm the second, the second to oldest."},{"speaker":"Marcus","time":"00:03:32-8","content":"So, did you have the responsibility of taking care of your younger siblings? Did you feel that?"},{"speaker":"Shawn","time":"00:03:40-7","content":"At the time, not really. I didn't, I mean. I didn't have no responsibility saying to myself that my mother needs my help to raise them. No, it wasn't nothing like that. We was all, we was all running the roads all the time. So."},{"speaker":"Marcus","time":"00:03:59-2","content":"Right."},{"speaker":"Shawn","time":"00:04:01-0","content":"I wasn't going see where my sister was, or where my brother was because I was doing the same thing, running the roads,"},{"speaker":"Marcus","time":"00:04:05-6","content":"Sure."},{"speaker":"Shawn","time":"00:04:07-0","content":"Hanging out with friends. Going out every night."},{"speaker":"Marcus","time":"00:04:09-1","content":"Sure. Can you paint a picture for me? I've visited Lafayette a few times, but if I was in your neighborhood, where you grew up, your mom's house, if I was sitting on the stoop or the front porch looking out on a typical day, what would it look like?"},{"speaker":"Shawn","time":"00:04:31-1","content":"Well, we lived in condominiums."},{"speaker":"Marcus","time":"00:04:32-9","content":"Oh, okay."},{"speaker":"Shawn","time":"00:04:34-8","content":"It was a condominium, so it was a whole bunch of condominium apartment complexes."},{"speaker":"Marcus","time":"00:04:37-8","content":"Okay."},{"speaker":"Shawn","time":"00:04:39-4","content":"I guess if you, I guess if you were standing on the sidewalk, looking out, you'd see another apartment complex. That's what it was, yeah."},{"speaker":"Marcus","time":"00:04:46-9","content":"All right, was it in downtown Lafayette?"},{"speaker":"Shawn","time":"00:04:48-6","content":"Yeah."},{"speaker":"Marcus","time":"00:04:49-9","content":"Okay. What about school? Do you have some specific memories from school? Did you like school?"},{"speaker":"Shawn","time":"00:04:58-8","content":"Not really. I had a little girlfriend. I mean, I had friends. Was like, I was going to class. I wasn't learning. I mean, I wasn't participating, I wasn't taking things home and trying to learn, or do education. Do educational work. I was just going to school, that's all."},{"speaker":"Marcus","time":"00:05:17-7","content":"Did you finish school?"},{"speaker":"Shawn","time":"00:05:19-7","content":"I got a GED."},{"speaker":"Marcus","time":"00:05:21-6","content":"Okay, was that before Angola?"},{"speaker":"Shawn","time":"00:05:23-7","content":"Yeah, in the Parish."},{"speaker":"Marcus","time":"00:05:26-7","content":"Oh, okay, in the Parish Prison."},{"speaker":"Shawn","time":"00:05:29-3","content":"Yeah."},{"speaker":"Marcus","time":"00:05:30-9","content":"So, what was the highest grade you competed before that?"},{"speaker":"Shawn","time":"00:05:33-3","content":"Ninth or tenth. Somewhere around there."},{"speaker":"Marcus","time":"00:05:37-1","content":"Okay. What's your fondest memory of school?"},{"speaker":"Shawn","time":"00:05:44-7","content":"Fondest memory of school. I guess, just being with my little girlfriend I guess."},{"speaker":"Marcus","time":"00:05:50-5","content":"Tell me about her."},{"speaker":"Shawn","time":"00:05:52-8","content":"My little girlfriend? She was Iranian. Real nice people. As a matter of fact, she the one that actually, I had already quit school and she had told me to come back to school. So, I went back to school for a little while, but that was just to hang out with her. That's all."},{"speaker":"Marcus","time":"00:06:12-5","content":"What was her name?"},{"speaker":"Shawn","time":"00:06:14-7","content":"Ellie."},{"speaker":"Marcus","time":"00:06:16-2","content":"Ellie? Are you still in contact with her?"},{"speaker":"Shawn","time":"00:06:18-0","content":"No. I mean, we were 17 years old."},{"speaker":"Marcus","time":"00:06:24-9","content":"Sure. Any other women in your life before coming here?"},{"speaker":"Shawn","time":"00:06:30-9","content":"Man, I lived with a woman. I had a bunch of, I ain't going to say girlfriends, but I mean, I had women that, occupied my time every once in a while."},{"speaker":"Marcus","time":"00:06:42-4","content":"Sure. Yeah."},{"speaker":"Shawn","time":"00:06:43-8","content":"But other than that, like I said, I had no sense of direction. I was just, a friend of mine would go out sometimes, or me and a little girl would go out sometimes."},{"speaker":"Marcus","time":"00:06:54-2","content":"Sure."},{"speaker":"Shawn","time":"00:06:55-6","content":"Did I have a job? I bounced. I had some really decent jobs but I just kind of, I'm going to say pissed them away. I wasn't motivated to get a job, have an apartment, start pay bills, wasn't nothing like that. It was just, like I said, I was young."},{"speaker":"Marcus","time":"00:07:17-3","content":"Yeah. What was the best job that you had?"},{"speaker":"Shawn","time":"00:07:22-4","content":"Best job, probably offshore, I guess. Best paying job anyway."},{"speaker":"Marcus","time":"00:07:28-2","content":"What were you doing?"},{"speaker":"Shawn","time":"00:07:30-0","content":"I was just a galley hand, cleaning up, do the dishes,."},{"speaker":"Marcus","time":"00:07:37-2","content":"What about children? Do you have children?"},{"speaker":"Shawn","time":"00:07:39-4","content":"No, I don't have children."},{"speaker":"Marcus","time":"00:07:42-4","content":"You mentioned that you were kind of left to your own devices as a child –"},{"speaker":"Shawn","time":"00:07:48-1","content":"Yeah."},{"speaker":"Marcus","time":"00:07:49-6","content":"As an adolescent"},{"speaker":"Shawn","time":"00:07:50-7","content":"Right."},{"speaker":"Marcus","time":"00:07:52-6","content":"Was there much fighting in the house?"},{"speaker":"Shawn","time":"00:07:53-6","content":"Not too often."},{"speaker":"Marcus","time":"00:07:57-1","content":"Okay, what about outside the house?"},{"speaker":"Shawn","time":"00:07:59-7","content":"I had my share of fights."},{"speaker":"Marcus","time":"00:08:02-8","content":"What were they about?"},{"speaker":"Shawn","time":"00:08:04-5","content":"Oh, just, I don't know, boy stuff. I mean we just..."},{"speaker":"Marcus","time":"00:08:11-3","content":"I understand."},{"speaker":"Shawn","time":"00:08:12-8","content":"We didn't like each other. Instead of going our separate ways, we'd just fight each other."},{"speaker":"Marcus","time":"00:08:14-6","content":"Were you ever kicked out of school?"},{"speaker":"Shawn","time":"00:08:21-5","content":"Oh yeah, once."},{"speaker":"Marcus","time":"00:08:23-2","content":"What was that for?"},{"speaker":"Shawn","time":"00:08:24-3","content":"I think fighting."},{"speaker":"Marcus","time":"00:08:26-6","content":"Do you remember the first time you were arrested?"},{"speaker":"Shawn","time":"00:08:32-7","content":"Yeah."},{"speaker":"Marcus","time":"00:08:36-2","content":"What was that about?"},{"speaker":"Shawn","time":"00:08:37-4","content":"Shoplifting."},{"speaker":"Marcus","time":"00:08:39-0","content":"How old were you?"},{"speaker":"Shawn","time":"00:08:42-2","content":"17? Yeah, 17. I was going steal some little music tapes and I had a cousin, well, I got a cousin, she wanted me, she asked me if I was going shoplifting. I told her yeah and she said, \"Well if you can, can you get me this tape?\" And she went with me. But she stayed outside, and when I got busted, she went home and took a bunch of pills and tried to kill herself."},{"speaker":"Marcus","time":"00:09:06-2","content":"Do you remember what the tape was?"},{"speaker":"Shawn","time":"00:09:09-8","content":"No, I don't remember the tape."},{"speaker":"Marcus","time":"00:09:16-3","content":"Were you close with that cousin?"},{"speaker":"Shawn","time":"00:09:20-6","content":"My cousin. She still, she wants to come visit me now as a matter of fact. I mean, we alright. We don't stay in touch too much, but we okay. That's my aunt's daughter."},{"speaker":"Marcus","time":"00:09:36-7","content":"What about drugs and alcohol? Were drugs and alcohol apart of your life?"},{"speaker":"Shawn","time":"00:09:40-5","content":"I've had my share of them."},{"speaker":"Marcus","time":"00:09:42-7","content":"Yeah? Were they in any way related what got you here?"},{"speaker":"Shawn","time":"00:09:48-8","content":"This murder charge? Actually, I was doing some heavy drinking but I had stopped drinking a couple weeks before this ever happened."},{"speaker":"Marcus","time":"00:10:06-6","content":"Okay. Can you tell me a little bit about what lead you down this wrong road?"},{"speaker":"Shawn","time":"00:10:17-0","content":"Like I said, no sense of direction. I didn't have no responsibility to say I need to do this. I need to do that. I was just, just running the roads, like I said. Whatever came, if I had a little job, great? If I had a little money, I would stay from friends to friend's houses sometimes. Just going out every night."},{"speaker":"Marcus","time":"00:10:47-4","content":"If you had to isolate one main reason that this happened, what would it be?"},{"speaker":"Shawn","time":"00:10:55-0","content":"Hanging out with somebody that I should have never been hanging out with."},{"speaker":"Marcus","time":"00:11:05-4","content":"Okay. Wrong place, wrong time? Wrong person?"},{"speaker":"Shawn","time":"00:11:10-0","content":"Wrong person, right."},{"speaker":"Marcus","time":"00:11:15-7","content":"If somebody were to ask you if you were mistreated as a child, would you say yes or no?"},{"speaker":"Shawn","time":"00:11:25-8","content":"I'm going to say not really. I got whipped whenever I did something wrong. I mean, me and my momma didn't get along too much. I mean, she'd kick me out the house all the time. But, did I deserve it? Probably. Probably on some instances, I'd say that I did deserve it sometimes. Sometimes, maybe she was going through menopause, I don't know."},{"speaker":"Marcus","time":"00:11:52-6","content":"So one of the reasons we wanted to talk with you is that you are now, 25 years on, you are considered a trusted, rehabilitated member with this community."},{"speaker":"Shawn","time":"00:12:07-0","content":"I would hope I am."},{"speaker":"Marcus","time":"00:12:09-6","content":"So, I want to try and understand a little bit about that change? But, if we go back to the 24 year old Shawn who was convicted of this crime, what kind of person was that? Can you describe that person?"},{"speaker":"Shawn","time":"00:12:30-1","content":"24 years ago…"},{"speaker":"Marcus","time":"00:12:32-1","content":"Or if you can think of yourself as you were escorted through those gates?"},{"speaker":"Shawn","time":"00:12:39-8","content":"I didn't have the wisdom I have now. I was still off in the, I'm going to say, the stupid things. I mean, I wasn't a, I probably smoked a little weed back then when I was escorted through the gates. Get write-ups. Not caring what the free man or the security guard would say or do. I was, I'm going to say, rebellious. I wasn't rebellious, I mean, I was hard-headed I would say. I was hard-headed. I didn't care because I had a life-sentence so whatever they threw at me, I was going to accept it or not accept it and deal with the consequences."},{"speaker":"Marcus","time":"00:13:29-6","content":"Did you find yourself getting into fights when you first got here?"},{"speaker":"Shawn","time":"00:13:32-8","content":"No, I never, never had no trouble."},{"speaker":"Marcus","time":"00:13:41-4","content":"How is Angola different today than when you first came here? A lot of folks talk about, some of them being here in the 80's and they talk about how it's changed."},{"speaker":"Shawn","time":"00:13:56-4","content":"Yeah. I got here in the 90's. You work a little harder. You had a little more respect for each other. That's about, I mean, I think that's about it. I mean, I don't, yeah. I'd say that's about it. I could go on and on about certain things and vent, but it's a waste of time. It's a waste of time, I mean. Security's a whole lot easier-going now, they don't harass you, I mean. Besides, mostly women working here now anyways."},{"speaker":"Marcus","time":"00:14:50-2","content":"Okay, sure. So, how different are you now from that person? You said that you are wiser."},{"speaker":"Shawn","time":"00:14:53-5","content":"Yeah."},{"speaker":"Marcus","time":"00:14:56-3","content":"That you are less rebellious."},{"speaker":"Shawn","time":"00:14:57-6","content":"Oh, yeah."},{"speaker":"Marcus","time":"00:14:58-7","content":"How else are you different?"},{"speaker":"Shawn","time":"00:15:02-7","content":"I isolate myself now. I don't, I'm going to say I make my world small, which means I don't communicate with too many of them. I'm either going to the hobby shop, trying to do my little hobby craft, reading my Bible, or exercising. So, I try to have as little communication with too many people so, I just kind of."},{"speaker":"Shawn","time":"00:15:02-7","content":"Don't get me wrong, a whole bunch of people know me. I respect everybody, but like I said, I just, I try to make my world a little small, so I can say, \"Okay, I don't need to be bothered with this person. I don't need to be bothered with that person. I don't feel like listening to this one here, talking about all these other people.\" It's just, so I made my world small, and it's just, I like it like that. So like I said, I go to the hobby shop, go to the gym, work out, go to the yard, run the yard."},{"speaker":"Marcus","time":"00:16:06-1","content":"So, that's your typical day here? Between the hobby shop and …"},{"speaker":"Shawn","time":"00:16:08-3","content":"Yeah."},{"speaker":"Marcus","time":"00:16:11-9","content":"What organizations are you involved with or have been involved with since you been here?"},{"speaker":"Shawn","time":"00:16:16-9","content":"None."},{"speaker":"Marcus","time":"00:16:19-9","content":"Okay."},{"speaker":"Shawn","time":"00:16:21-3","content":"I don't, I've seen the way they, the way some people. I wanted to, I would've liked to go into school. I was in school. I graduated from Auto mechanics. I would've liked to get into HVAC, which is learning about air conditioning and refrigeration. But now, it's just reentry now. So now, my hands are tired and I can't get in that. Like I said, all I do is go to work when they have work. But other than that, hobby shop."},{"speaker":"Marcus","time":"00:16:55-6","content":"What work?"},{"speaker":"Shawn","time":"00:16:57-2","content":"I work in the clothing room. I load trucks for the clothing room."},{"speaker":"Marcus","time":"00:17:04-0","content":"Okay. Have you been doing that for a long time?"},{"speaker":"Shawn","time":"00:17:05-7","content":"A couple of years."},{"speaker":"Marcus","time":"00:17:08-3","content":"Okay. What were you doing before that?"},{"speaker":"Shawn","time":"00:17:09-6","content":"I worked for a colonel. We just, I did his paperwork and."},{"speaker":"Marcus","time":"00:17:18-1","content":"So the HVAC training is something that you are interested in doing, but because it's predominately for reentry folks, there's no room for people serving a life sentence?"},{"speaker":"Shawn","time":"00:17:27-0","content":"Right, yeah. I would have liked to get on it. My thing is this here. I have an uncle that knows somebody, that knows somebody. They trying to get me out of here. I have my pardon papers put in, so I'm waiting to hear back on that."},{"speaker":"Shawn","time":"00:17:27-0","content":"So I said well, if I'm going to do this, then let me learn something that I can make a lot of money fast, because I'm at an age now where I can't extend my life, to where, I've got a short window so say, I don't got but so many years to work and to accumulate enough money to where, it's going to take me through to, yeah."},{"speaker":"Marcus","time":"00:18:20-5","content":"Many people go through transformations, whether they're in prison or not, as they grow older. Sometimes when people make the changes to better their lives, it's because they just get tired of the way they were doing things before, or sometimes it's a lightbulb thing that goes off. It could be a person, mentor, something. How was the change for you? Would you say it's just getting older?"},{"speaker":"Shawn","time":"00:18:51-4","content":"Yeah, yeah. You're not off in the foolishness no more. You can see where a bunch of them are going to run into a wreck sooner or later. So you try to avoid all that, you say, \"I've been there, done that,\" so leave it alone."},{"speaker":"Marcus","time":"00:19:10-1","content":"Yeah, so what advice do you have for a young man coming in with a life sentence? They come to you and say, \"Shawn, I'm lost here. I just got here, can you help me out?\" Can you tell me, what advice would you give that person?"},{"speaker":"Shawn","time":"00:19:26-7","content":"Could I point them in the right direction? I'd say, man, get, I guess, get all the education you can. Leave the knuckleheads alone, and sooner or later you're going to figure out which ones they are, I can't, it's hard to tell someone, \"Hey, don't do that,\" unless they experience it themselves then they understand why you said, \"Don't do that,\" Because until they experience it themselves, they don't know,"},{"speaker":"Marcus","time":"00:20:01-7","content":"So, I am going to ask you a little bit about your feelings about the crime you are convicted of."},{"speaker":"Shawn","time":"00:20:12-2","content":"Yeah."},{"speaker":"Marcus","time":"00:20:17-6","content":"When you look back, it's been, 25 years is a long time."},{"speaker":"Shawn","time":"00:20:19-1","content":"Yes, it is."},{"speaker":"Marcus","time":"00:20:20-1","content":"To get away from it. But at the same time, you are reminded every day that you are being punished for it."},{"speaker":"Shawn","time":"00:20:26-1","content":"Yes, I am."},{"speaker":"Marcus","time":"00:20:28-9","content":"When you think back on the crime and the victim, victims, how do you feel about it now?"},{"speaker":"Shawn","time":"00:20:41-9","content":"I get upset, like I said. I get upset being with somebody. You got to understand, if you go to my crime, you would see that I wasn't the one that killed this person. I was there. And, I can't lie, I was there, I know what happened, I did hit the guy. It was at a bar. But, as far as killing the guy, they know who killed him, he took his charge. He did tell them that, \"Hey, I'm the one that killed him."},{"speaker":"Shawn","time":"00:20:41-9","content":"All Shawn did was take the money.\", so, he was, he was on the side. I don't, like I told him. I don't, I don't blame you. I know I was there. I blame myself for being there. So, that's where I'm at now, as far as this crime goes. I wish I could talk to the people and say, \"I'm sorry for your son or your brother dying,\" but 25 years is a long time."},{"speaker":"Marcus","time":"00:22:04-4","content":"Yeah it's one of the things that's been very clear in this project that there is a very wide breath of offenses for which people are serving a life sentence. All the way from someone like yourself, someone driving a car to a robbery that goes bad, to somebody that commits the most heinous thing you can think of. All with the same punishment, without distinction."},{"speaker":"Shawn","time":"00:22:34-2","content":"Right."},{"speaker":"Marcus","time":"00:22:36-3","content":"What do you think about that?"},{"speaker":"Shawn","time":"00:22:42-5","content":"25 years. I understand now that, whatever happens, don't surprise me. I mean, it's just. I accept my responsibility for what happened. I thank God that I'm not in a little cell where the walls close in on you. At least I do have opportunity to move around, at time."},{"speaker":"Marcus","time":"00:23:23-0","content":"What's the worst part about this place? What's the worst part of the punishment for you?"},{"speaker":"Shawn","time":"00:23:36-5","content":"The worst part. Not being able to get out."},{"speaker":"Marcus","time":"00:23:42-0","content":"Yeah, and so, this is also a difficult question, when I understand the need to maintain hope..."},{"speaker":"Shawn","time":"00:23:52-9","content":"Oh, yeah."},{"speaker":"Marcus","time":"00:23:54-6","content":"But, there must be times when you are forced to reckon with the likelihood that you may never leave here, and how do you handle that? How do you make sense of that?"},{"speaker":"Shawn","time":"00:24:14-4","content":"It never hit me yet."},{"speaker":"Marcus","time":"00:24:23-2","content":"Why do you think it hasn't hit you?"},{"speaker":"Shawn","time":"00:24:26-6","content":"I guess because I still got hope."},{"speaker":"Marcus","time":"00:24:33-8","content":"Do you see guys who just give up hope? Guys who just come to accept that they are going to die here."},{"speaker":"Shawn","time":"00:24:47-0","content":"No. I mean, I think if they accepted it, they probably would have lost their minds already and done something stupid to go sit in a cell. But as for them giving up hope. I live in a trustee dorm, they always have a little hope. I mean with the administration they have now, they saying, \"Hey, we might be able to get a pardon or who knows.\" There is still hope."},{"speaker":"Marcus","time":"00:25:28-2","content":"Do you think it's sort of a survival mechanism?"},{"speaker":"Shawn","time":"00:25:31-9","content":"Hope?"},{"speaker":"Marcus","time":"00:25:32-8","content":"Yeah."},{"speaker":"Shawn","time":"00:25:34-8","content":"Yeah, I guess it is."},{"speaker":"Marcus","time":"00:25:42-4","content":"So, let's get through this scenario. Let's say you get a hearing before the pardon board."},{"speaker":"Shawn","time":"00:25:48-6","content":"Okay."},{"speaker":"Marcus","time":"00:25:49-9","content":"You will have a short window of time to present your case. What do you want them to know about you, and why should they take a chance on you?"},{"speaker":"Shawn","time":"00:26:08-0","content":"My short window to explain to a pardon board. I could tell them where I was from, where I'm at now, and where I'm going. I have a jobs that's waiting on me. They have my record to say, \"Hey, we see where Shawn was and possibly where he's going.\" I don't know. I'd have to sit there and talk to them face-to-face, I don't review anything as far as saying what you're going to tell them. I'll wing it whenever the time is right, I'll ask them for mercy?"},{"speaker":"Marcus","time":"00:27:03-8","content":"Have you forgiven yourself?"},{"speaker":"Shawn","time":"00:27:04-9","content":"Oh, yeah."},{"speaker":"Marcus","time":"00:27:26-6","content":"Do you think the guys who are serving a shorter sentence maybe don't have as much of an incentive to turn their lives around? It seems to me that the guys who have the longest sentences, including life sentences, seem to go to the greatest lengths to change their lives, to get more training, vocational training, albeit with the understanding that they might not be able to get out."},{"speaker":"Marcus","time":"00:27:26-6","content":"And the guys with shortened sentences may not. Do you think it's something to do with the lengths of the sentence?"},{"speaker":"Shawn","time":"00:28:01-2","content":"I don't think so. I think, once you get to a certain age, if you didn't experience learning when you were in school, I think when you get into a certain age, as we do in here, you want to learn. That's when wisdom comes in. You want to learn everything you can, while you can, I guess, about different things. There's plenty, plenty of guys down the ward that all they do is study."},{"speaker":"Shawn","time":"00:28:01-2","content":"Whether it be the Bible or schools they're in, or schools they want to get into, they come to the library and get books on different, different things. They learning. I guess, this opens your mind, like a sponge, you want to get all the knowledge you can, I guess. You're a professor? How does it feel?"},{"speaker":"Marcus","time":"00:29:05-1","content":"Feel pretty lucky. Yeah. Are you reading something right now?"},{"speaker":"Shawn","time":"00:29:10-3","content":"As far as, I got a sign language book in there that I look at every once in a while. But, my thing is the history of the Church, the Bible."},{"speaker":"Marcus","time":"00:29:26-4","content":"Okay. Of all the things that you've done, we all have things that we are not proud of and we all have things that we are proud of. What are you proud of?"},{"speaker":"Shawn","time":"00:29:35-6","content":"What am I proud of, making it this long, I guess. Yeah."},{"speaker":"Marcus","time":"00:29:50-0","content":"Yeah, one fella told me that he's proud that he maintained his sanity."},{"speaker":"Shawn","time":"00:29:58-1","content":"I could see that."},{"speaker":"Marcus","time":"00:29:59-2","content":"Yeah."},{"speaker":"Shawn","time":"00:30:00-0","content":"Yeah."},{"speaker":"Marcus","time":"00:30:03-2","content":"So, tell me a little bit about the goals you have for the future? You referred to them briefly when you talked about the pardon board. What are your goals for the next 10, 20 years?"},{"speaker":"Shawn","time":"00:30:14-7","content":"My goals are to, like I said, I have a couple of jobs waiting on me. If I was to get out, try to make as much money as I could. Maybe get a wife. Do I want kids? I think I'm at the age now where I might be a little too old for that now. But, just live the rest of my life."},{"speaker":"Marcus","time":"00:30:50-5","content":"So, part of this project is to educate people about the reality of what life without parole actually means for people. Is there something that I should've asked you that I didn't ask you, that I didn't give you the opportunity to talk about that you think it'd be important for people to know."},{"speaker":"Shawn","time":"00:31:22-5","content":"I like to say, there's, I guess, there's a lot of things I'd like to tell the young ones that are trying to beat the doors down to come in here. That it's just not worth it. I mean, I don't know what society is now, I can't say, \"Oh, it'll be better later.\" I mean, from what the news tells me, everybody 16 on up is on video games or on, popping pills or on heroin or going out all the time. Trying to shoot each other."},{"speaker":"Shawn","time":"00:31:22-5","content":"I don't know what their goals are, if they have any. Like I said, I was that age at one time and, like I told you, I didn't have no goals. I didn't understand going to work. Supporting myself. Getting a house or trying build towards a house or having a wife and kids. That's something I didn't understand when I was growing up. Now that I stopped, now that my life stopped, that I could see and say, \"Oh, I want that now.\" I don't know what to tell them"},{"speaker":"Marcus","time":"00:32:47-8","content":"Sure. It makes sense."},{"speaker":"Shawn","time":"00:32:49-1","content":"Yeah."}]}