{
  "name": "",
  "transcript": [
    { "upperBoundTime": "00:00:00", "content": "Sherman Singleton_Mix" },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:07",
      "content": "Lets start with just a few questions. Okay, back to life before you came here. Where did you grow up?"
    },
    {
      "speaker": "Sherman",
      "time": "00:00:07",
      "upperBoundTime": "00:00:09",
      "content": "New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:09",
      "upperBoundTime": "00:00:11",
      "content": "New Orleans. Whereabouts?"
    },
    {
      "speaker": "Sherman",
      "time": "00:00:11",
      "upperBoundTime": "00:00:19",
      "content": "Third ward, Calliope housing project."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:19",
      "upperBoundTime": "00:00:21",
      "content": "So can you tell me a little bit about your family and folks who are close to when you're coming up?"
    },
    {
      "speaker": "Sherman",
      "time": "00:00:21",
      "upperBoundTime": "00:01:21",
      "content": "When I'm definitely the oldest of three children, I have a brother and a sister. I grew up with my mom and stepdad. I had a great father, they just didn't get along. But he treated me I mean, even a stepfather. I can't say anything bad about either one, all dead now. All 3 die while since I've been incarcerated. My brother and sister, they're doing great. And growing up, we grew up in here, like I say, the Calliope housing project."
    },
    {
      "speaker": "Sherman",
      "time": "00:00:21",
      "upperBoundTime": "00:01:21",
      "content": "It was pretty uneventful, until I was maybe 14, you know, when I kind of got away from being a nice kid. But definitely growing up there, got relatively good grades. I failed second grade because of missing too many days. And they were doing it, and you only could miss 30 or something like that. Yeah, but I had a pretty uneventful up until 14, childhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:21",
      "upperBoundTime": "00:01:24",
      "content": "What happened at 14?"
    },
    {
      "speaker": "Sherman",
      "time": "00:01:24",
      "upperBoundTime": "00:02:01",
      "content": "I started hanging with the wrong crowd at that point. I felt that I was old enough to go out on my own and pick my own friends, you know, you let your mom pick your friends all the time. Like, no, these guys here are the guys that don't want to be with. They went on a nice clothes and things like that. So that's the cool, all the girls like them. So that's when you want to be with."
    },
    {
      "speaker": "Sherman",
      "time": "00:01:24",
      "upperBoundTime": "00:02:01",
      "content": "And so that's when I started having, I would say problems, besides maybe just being kicked out of school once, and that was really for missing too many days. I don't know why I was missing all of them days. But I was missing a lot of days of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:01",
      "upperBoundTime": "00:02:05",
      "content": "Was there fighting?"
    },
    {
      "speaker": "Sherman",
      "time": "00:02:05",
      "upperBoundTime": "00:02:18",
      "content": "I probably had 2 fights the whole time. It wasn't much fighting, as in physical at all. No, at school maybe once or twice. I probably started them but yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:18",
      "upperBoundTime": "00:02:19",
      "content": "What school was it?"
    },
    {
      "speaker": "Sherman",
      "time": "00:02:19",
      "upperBoundTime": "00:02:35",
      "content": "James Derome. Okay, well, my elementary schools are Florence Johnson Chester School. Grade school I ended up at James Derome. For high school, I went to L. E. Rabouin."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:35",
      "upperBoundTime": "00:02:36",
      "content": "Did you finish high school?"
    },
    {
      "speaker": "Sherman",
      "time": "00:02:36",
      "upperBoundTime": "00:03:11",
      "content": "No sir. So I graduated to the 11th and I quit. My mom kept telling me like, \"All you got to do is go to school, so you can make a lot of money.\" So at this point, I was making a lot of money. So I'm like, \"Well, I got to go to school. Now that's stupid, right?\" It backfired on them. But yeah, I was like, really into drugs and stuff. So I was really nice at that time. So I'd stopped going to school, what's the reason of going to school, I got all the money. So I just stopped going and I was full time drug dealing."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:11",
      "upperBoundTime": "00:03:14",
      "content": "Now was drug use and alcohol use part of your life as well?"
    },
    {
      "speaker": "Sherman",
      "time": "00:03:14",
      "upperBoundTime": "00:03:48",
      "content": "No, I didn't start. I tried marijuana three times. It was all in jail. And a guy kept saying, \"Try this, you know, this can be way better?\" And I try all in one day, right? And the third, well the fourth time I said, keep that out of my face, because it wasn't doing anything, no matter. They lay it all over their phone and I was laughing from the mouth like some real is going on. Then they tell me, I got a look for it. And I'm like, look for it. And so no and that was it. This girl, I used to drink Amaretto pineapple juice at dinner with her. And she's a girl that has some kids for me."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:48",
      "upperBoundTime": "00:03:50",
      "content": "Okay, how many kids do you have?"
    },
    {
      "speaker": "Sherman",
      "time": "00:03:50",
      "upperBoundTime": "00:03:51",
      "content": "I have six kids."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:51",
      "upperBoundTime": "00:03:53",
      "content": "Six kids."
    },
    {
      "speaker": "Sherman",
      "time": "00:03:53",
      "upperBoundTime": "00:04:03",
      "content": "Yeah. Two parents, were two women. One hand 4, the other one had 2, a set of twins in between there. And they all stair step and they all were within like a three year period."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:03",
      "upperBoundTime": "00:04:08",
      "content": "And the three years prior to turning 20."
    },
    {
      "speaker": "Sherman",
      "time": "00:04:08",
      "upperBoundTime": "00:04:15",
      "content": "In, yeah like 18 to 21 maybe."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:15",
      "upperBoundTime": "00:04:21",
      "content": "Yeah, I think your offense which you were convicted on was a month before your 21st birthday."
    },
    {
      "speaker": "Sherman",
      "time": "00:04:21",
      "upperBoundTime": "00:04:22",
      "content": "Okay, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:22",
      "upperBoundTime": "00:04:30",
      "content": "So is it fair to say that for the most part, you felt loved and cared for by adults?"
    },
    {
      "speaker": "Sherman",
      "time": "00:04:30",
      "upperBoundTime": "00:04:32",
      "content": "Oh, definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:32",
      "upperBoundTime": "00:04:38",
      "content": "Okay. All right, you wouldn't characterize anything as having been mistreated as a child?"
    },
    {
      "speaker": "Sherman",
      "time": "00:04:38",
      "upperBoundTime": "00:05:57",
      "content": "No, my mom, I'd never seen a drink. Well she smokes cigarettes. That's what, it ended up killing her, with COPD. My dad I've never seen him drink if so it was probably once a beer with a guy or something. My step dad, not that I know of. My problem was my family members as far as cousins and stuff like that. All of it was in the drugs."
    },
    {
      "speaker": "Sherman",
      "time": "00:04:38",
      "upperBoundTime": "00:05:57",
      "content": "A few was getting high, but everybody else was like really selling them. And even it was showing love, like, bad love because he was giving me money. And that was encouraging like, I want my own money. And you think like my dad, he was building, his own houses, he's out of home and not New Orleans. Every summer I go down and we build a house, you sell it give me, just show us everything what's happened with a profit, it wouldn't get much of a profit."
    },
    {
      "speaker": "Sherman",
      "time": "00:04:38",
      "upperBoundTime": "00:05:57",
      "content": "Me, one of my brothers by another lady, but he was perfect. I just wasn't, even the stepfather was perfect. I just, I wanted my own money in the way I did consider it. Okay, you shouldn't be doing it that way. I knew better. But I'm like, \"Look, I got to get this money.\" When nobody else going to jail at the time and stuff. If they were, they wouldn't be doing like, a bunch of time and do like six months or something and they're burning their way out of it. I was like, \"Okay, I just do that.\""
    },
    {
      "speaker": "Marcus",
      "time": "00:05:57",
      "upperBoundTime": "00:05:58",
      "content": "In and out of OPP?"
    },
    {
      "speaker": "Sherman",
      "time": "00:05:58",
      "upperBoundTime": "00:06:10",
      "content": "Yeah, that type of deal, they never stayed. I mean, like I said, as long as I ever seen was six months, you wouldn't think 27 years later I'd still be here, that type of thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:10",
      "upperBoundTime": "00:06:26",
      "content": "So can you take me back, so that I can envision what it would be like? Say I'm standing in front of your front door Calliope, and I turn around and look around in the neighborhood? What would I see on a typical day in your teens?"
    },
    {
      "speaker": "Sherman",
      "time": "00:06:26",
      "upperBoundTime": "00:06:55",
      "content": "All of them, you'd have more buildings identical to the one that you standing in. So you have a lot of kids out playing, several guys selling drugs here and there, but they're kind of being, they try not to let the kids see it at this point. But you see a few coming and goings to work. But other than that some ladies are sitting on a porch drinking or smoking cigarettes. But that is a typical day."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:55",
      "upperBoundTime": "00:06:57",
      "content": "Did you feel safe?"
    },
    {
      "speaker": "Sherman",
      "time": "00:06:57",
      "upperBoundTime": "00:07:17",
      "content": "Yeah, relatively several times I have come out. And I think that was a pivotal point in my life. Once I came out, there was a guy right next door, a guy shot five times in the head. And it wasn't blood, it is like white stuff coming out, like his brains, I guess. And he like..."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:17",
      "upperBoundTime": "00:07:20",
      "content": "Sorry. He had been shot five times in the head."
    },
    {
      "speaker": "Sherman",
      "time": "00:07:20",
      "upperBoundTime": "00:08:13",
      "content": "...yeah. And I'm like, that'll never be me. And my whole thing was to make sure that never be me. It was bad I'm like, jeez. I used to see murders all the time. I hear about them on because I will say every three days you wouldn't go without a murder. And you'll go to the site, you'll see it and everything else and stuff like, \"Oh that's so and so,\" or something like that."
    },
    {
      "speaker": "Sherman",
      "time": "00:07:20",
      "upperBoundTime": "00:08:13",
      "content": "But I was hell bent on never been on that ground with the way, it's just something about his murder, even though it was right there with the other guys killed in that hallway. But something about his murder, and I didn't know why. And I'm like, \"That will never be me.\" And that was something about that that really touched me and said, \"Look whatever you got to do. Don't never let that be you.\" It was pivotal."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:13",
      "upperBoundTime": "00:08:13",
      "content": "Did you feel the need to have a weapon with you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:08:13",
      "upperBoundTime": "00:08:46",
      "content": "At the time, no, I was still young. At that time when I'd seen that, it was probably I was probably 12. I haven't, I didn't have a weapon until I was maybe 16, or something like that. Everybody else had weapons around me. But when I turned 16, I believed that I needed one because the amount of drugs I was dealing at the time. So that's when I started definitely having a weapon."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:46",
      "upperBoundTime": "00:08:55",
      "content": "Do you have a specific memory of specific friends, your best friends that you had?"
    },
    {
      "speaker": "Sherman",
      "time": "00:08:55",
      "upperBoundTime": "00:10:22",
      "content": "Yes, Troy Robinson is one. He's a physician in Atlanta right now. They say he came back, I'm not sure that a masterpiece or rapper gave him some type of funding at the Rosenwald gym that there. We were always in the same class and everything. Well, always raced to see who can do, be the best and doing the work. His mother was like a mother to me. One day I was hanging with the wrong guys, and I went, I normally go there afterwards. I'm like okay I'm the good guy and I'm still like 13. And I got there one day, she said, \"Look, if you're going to hang with them guys, you can't be coming here. You know, I love you like a son and everything else.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:08:55",
      "upperBoundTime": "00:10:22",
      "content": "And she was right. She treated me identical to him. She couldn't have any more children. And I'm like, \"Okay.\" So I chose the other group, right. So Sherman been in jail 27 years. Troy has been a doctor, 15 years I think maybe. And that was crazy, right? And I was thinking about them the other day. I said, the only in touch with them, is Brenda, that was Brenda Jackson. And I'm like, \"God that is serious.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:08:55",
      "upperBoundTime": "00:10:22",
      "content": "Because I was on that pack with them. When she took him to the parks into the beach, I was with him. But again I chose that other crew to hang with and all of them are dead right now. Every last one of them, been dead a long, long time ago"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:22",
      "upperBoundTime": "00:10:24",
      "content": "Do you think maybe being incarcerated saved your life?"
    },
    {
      "speaker": "Sherman",
      "time": "00:10:24",
      "upperBoundTime": "00:11:03",
      "content": "Oh definitely. I needed the first six years to really calm down see after that I was like, \"Okay, I definitely need to be getting things.\" Now, I always was educating myself, but it was like something just clicked like, \"Okay, you know, I want the world to be a better place.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:10:24",
      "upperBoundTime": "00:11:03",
      "content": "And I've been that way ever since. And I tell everybody, they'd be like, \"What do you mean the first six years,\" because everybody want to go home as soon as they get incarcerated like you're ready to go back out there. And it took me like six years to really calm down I believe, but yes, I think that as a desperation."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:03",
      "upperBoundTime": "00:11:09",
      "content": "Did you end up spending some time at OPP, before coming here at Angola?"
    },
    {
      "speaker": "Sherman",
      "time": "00:11:09",
      "upperBoundTime": "00:11:44",
      "content": "Just a year and a half, like I'm just enough time from arrest to conviction, and then you stay just a little bit more maybe three, four months, and your ship you to where you need to be going. You are going to go Hunts first, ARDC and they choose from there once they process your whatever, where you need to go. If you got a life you come to Angola, and if you've got 40 years you may end up at any of the other prisons."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:44",
      "upperBoundTime": "00:11:46",
      "content": "Do you still have relationships with the kids? They visit you here."
    },
    {
      "speaker": "Sherman",
      "time": "00:11:46",
      "upperBoundTime": "00:13:35",
      "content": "Yeah, my oldest daughter her and I are like really crazy. But she would visit me more than everyone else but the other ones are we have a decent relationship but it's definitely a strain more than anything. One I haven't seen in a while that's my youngest twin daughter, for some reason she don't come as much. But the other ones, they come to the rodeo."
    },
    {
      "speaker": "Sherman",
      "time": "00:11:46",
      "upperBoundTime": "00:13:35",
      "content": "I make special visits, I put them on the list but they don't come they're much, most of I will spread it out. But we never had that that close relationship anyway because of incarceration. My relationship is definitely, the jury's still out on really all of them, but my oldest daughter her and I we clash a lot. We're clashing now as we speak, and she's down this way because she's in California. She's in production. She's doing the real, that low show whatever that is. It's something she's working with a director some kind of way."
    },
    {
      "speaker": "Sherman",
      "time": "00:11:46",
      "upperBoundTime": "00:13:35",
      "content": "She did a whole bunch of that stuff. You know she's down here now. She just came and we have that hooked up and all that but she's mad right now, but yes we have a pretty decent relationship. I would say except for one out of the bunch, all of them graduated. I was glad for that. 3 of them went to college. One I have a problem with, and that's the boy, he looks like he's trying to be me. You don't need to be me, you know what I'm saying, don't follow your father."
    },
    {
      "speaker": "Sherman",
      "time": "00:11:46",
      "upperBoundTime": "00:13:35",
      "content": "So I think he has served two, three years or something one time, and I don't think he actually learned his lesson. So I'm still reaching out to him, and he's been telling me you want to come see me. So he probably going to be here not this weekend but next. So I'll be able to talk to him and see what's going on."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:35",
      "upperBoundTime": "00:13:37",
      "content": "They are all here in New Orleans, except for the daughter in California?"
    },
    {
      "speaker": "Sherman",
      "time": "00:13:37",
      "upperBoundTime": "00:14:58",
      "content": "Well we have, one of my, she is the one, fashion design school. That's one I haven't seen, she is the one with the clothing and stuff. We have one in New Orleans now. The boys in New Orleans, and Nikki, that's the one in the middle. We have one in Texas. He's driving trucks."
    },
    {
      "speaker": "Sherman",
      "time": "00:13:37",
      "upperBoundTime": "00:14:58",
      "content": "Actually my daughter the one I'm telling you, she's crazy. But she just got this lawsuit like a half a million dollars. So she bought the oldest boy in Houston, this big old long truck with the 18 tractor trailers wheeler, 18 Wheeler. So they went into business with that. So she's very enterprise. She has my spirit as far as, she's a hustler. She'd been, she have college degrees and all that, but she always had this. She just came from India, because she has these different groups she's mentoring and everything else and like the lady that started this one that she does in New York. It is a summer camp that she goes with her. So she said, \"Come to India. You got to see how all this started.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:13:37",
      "upperBoundTime": "00:14:58",
      "content": "So she just came back. She had spent like three weeks there, but she got to always be on a run, and I hate that but, it's her life. But she's doing everything right. Even marijuana, she just started this marijuana in California. She made them brownies and marijuana Chicken or something like that. I'm like, \"Oh Lord, you just have to enter the drug game some kind of way, right?\" So she's doing great."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:58",
      "upperBoundTime": "00:15:00",
      "content": "Good."
    },
    {
      "speaker": "Sherman",
      "time": "00:15:00",
      "upperBoundTime": "00:15:02",
      "content": "I just don't like that much no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:02",
      "upperBoundTime": "00:15:08",
      "content": "Do you remember the first time you got arrested?"
    },
    {
      "speaker": "Sherman",
      "time": "00:15:08",
      "upperBoundTime": "00:15:40",
      "content": "Yes. I was in a Swagman shopping center, to show you how crazy I was us. I think I stole a latch that you put on your door, like my mom was going to let me put that on the bedroom door. Are you crazy? She bust me in my head or something. She wasn't a violent woman. But I'm like, \"What I was going to do with it. That's stupid.\" You know, there's a 59 nice latch. You had no use for it, because your mom wouldn't let you put that on the door. And that was crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:40",
      "upperBoundTime": "00:15:42",
      "content": "How old were you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:15:42",
      "upperBoundTime": "00:15:45",
      "content": "Probably 10 or something like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:45",
      "upperBoundTime": "00:15:47",
      "content": "And then did you have more arrests after that."
    },
    {
      "speaker": "Sherman",
      "time": "00:15:47",
      "upperBoundTime": "00:15:53",
      "content": "I think I stole some candy or something that was the last time as a juvenile."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:53",
      "upperBoundTime": "00:16:12",
      "content": "So when you look back to the person, before for those six years, when you look back at the person who was driving through the gates here. How would you describe that person?"
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "Definitely. I had heard all these wild stories about Angola and everything else, then when you get through, you come to the gate, and you'd be like you're now entering a real prison. You've been in a parish where everybody is kind of crazy anyway, but they'd like talking about Angola, they've been there and all the knives fights, and killings and all that."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "So I'm like, okay, that don't sound too good. So I'm kind of nervous and at the same like, man I will format to go with all this. Hopefully I don't have to really, really hurt nobody. So they feed you and bring you and will process you, they knock all the hair off your face and hate and all this kind of stuff. So you look really, really young now, then they throw you in the cell, because most of the guys my age will go into cell first. They let you do like 90 days, six months in there."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "So you won't be around, let's say 60 Guys, at that time in a dorm. You're in a cell with one guy hopefully you end up with a good guy and you're like, \"Look, man, this is what you need to be doing.\" But for me I got in a cell with a pretty decent dude on a tier that had a lot of crazy stuff. A lot of homosexuality, all this going on, on drugs and stuff like that."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "But I think after my talk with him, I kind of settled down. Oh, see, okay, I don't have to hurt this guy. He's not trying anything. He had been here at that time like 12 years, this is my first night. So I've been very lucky in Angola. From that standpoint, I never had a fight. I never really had a fuss in 27 years. Because for one, I'm not going to do any drugs. I'm not going to mess with your phone call, I'm not going to mess with gambling. I'm not a gamble."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "So I'm not, there's no reason for you just not to just come build a case on me. What are you looking at me for, or something? And I'm going to talk my way out of that. So I had to learn to do that too, because I've seen things dude get killed behind nothing, \"Why are you looking at me.\" And you didn't kill him. And that's the crazy part. I'm like, \"Okay, you got to think for everybody.\" And that's a crazy situation to be in, and it's like, \"Okay, I'm at the wrong place. I suppose to be going to a jail, not a mental.\" It was just, you've got to learn fast."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "I mean first day, you better be rolled in with it, because, like I say, everybody on the tier was like, 26 guys, you got to think for every last one of them on there, at any time, anything can go wrong, behind something so trivial. You'd be like jeez. And that's just the way it was at that point."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "But the six years that it took I mean, what I mean by that from, I was ready to go home and continue selling drugs up until that because I'm like, \"Whoa, they're doing that now.\" And everybody's still talking to me, \"Look, we got you bro.\" And then you hear about all the guys who was messing with, you got 50 keys and all this kind of stuff and you're hearing these stories, like, \"Whoa, I can't wait to get out of here.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "And six years later, like man, you better bring nothing around me. And you telling them this, I'm out of this for real. No, don't send none of that money. I want nothing. That's what I mean by that, and live that way. Just be hungry first before I accept your $200, $100 or whatever it is. I'd starve first I mean, they feed three times a day, it may not be the way you like it."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "But you're not going to die of starvation in Angola at all. Because you're going to eat three times a day no matter what, never missed yet, in 27 years. Even if the count went up, back to back, you know, 30 minutes you go back and get your meal, it don't matter. So that's what I mean by them."
    },
    {
      "speaker": "Sherman",
      "time": "00:16:12",
      "upperBoundTime": "00:19:59",
      "content": "Six years I have matured real well then, and I'm looking at all these guys at that point they've been here 37 years. And now these guys have been in 60 years. Sort of like okay. I'm hoping that is not mine, definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:59",
      "upperBoundTime": "00:20:02",
      "content": "Is it a safe place than it was when you got here?"
    },
    {
      "speaker": "Sherman",
      "time": "00:20:02",
      "upperBoundTime": "00:22:46",
      "content": "Yeah definitely, even from a mental standpoint, guys don't play that many with other people, they don't play that many mind games, people like, \"Look, man, I'm trying to go home as a wrap.\" And older guys will tell you that when you first come in like, the other you can't go home, you have a few crazy guys, that are never changing, because you don't have no education, we have nothing for real."
    },
    {
      "speaker": "Sherman",
      "time": "00:20:02",
      "upperBoundTime": "00:22:46",
      "content": "You can't go back to your family members because you mess them all in illness. That's why they're saying, this, most of them, out of common diseases and everything. But for the most part, you're going to get guys say, \"Man, look, don't worry about the foolishness, get all you could get as far as education, because at some point in maybe 20, 30 years from now, we're going to be able to get some kind of relief and you've got to be mature to latch on to that for real.\" Because you've 30 years, you know, like, because everybody feeling going to be home in the next couple of years no matter what you did."
    },
    {
      "speaker": "Sherman",
      "time": "00:20:02",
      "upperBoundTime": "00:22:46",
      "content": "It's just you got to really learn, and then six years, it definitely shaped me as far as looking at how other people will get messed over for little things. I'm like, \"Okay, that is one of those moments, I'm like, God, you got to really be careful.\" And that's when I took that attitude was man, you better be careful for real, and so that's what really saved me."
    },
    {
      "speaker": "Sherman",
      "time": "00:20:02",
      "upperBoundTime": "00:22:46",
      "content": "Because a lot of guys, I'd be mindful that a lot of that was here, I had dealt with them in the past as far as whether they worked for me, or I knew them, or the dad or whoever. And so everything was here that I wanted to meet."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:46",
      "upperBoundTime": "00:22:55",
      "content": "So Sherman can you describe your typical day here Angola. What's a typical routine for you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:22:55",
      "upperBoundTime": "00:24:15",
      "content": "Waking up at about 4:45 getting ready to leave out the door to go to work at like 5:45 and I get in about 4:00, well I knock off at 4 o'clock. I work at the new administration building but I still have to wait on the counter to clear and sometimes the counter clear at six o'clock. So you'd have put in like 12 hours or something like that of definitely but other than that I probably end up at church or some group."
    },
    {
      "speaker": "Sherman",
      "time": "00:22:55",
      "upperBoundTime": "00:24:15",
      "content": "And I volunteer with hospice so sometime I have a patient they just gave me one, so I'm going to have to go see him and see how bad off is he. And I'll know for sure how much care he needs."
    },
    {
      "speaker": "Sherman",
      "time": "00:22:55",
      "upperBoundTime": "00:24:15",
      "content": "And so but then I do a little quilting, and so I starting off to raise money for hospice and I have a little room where I does the quilting for myself so I go do some of that it has a little television there. So I do alright as far as I mostly be isolated from everyone else long as I'm there but I have to come out of there around 11 anyway unless it's around Rodeo time. Yeah but that's my typical day. I don't do much else besides work and those few other things."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:15",
      "upperBoundTime": "00:24:17",
      "content": "What does your job entail?"
    },
    {
      "speaker": "Sherman",
      "time": "00:24:17",
      "upperBoundTime": "00:24:46",
      "content": "Well I'm an orderly in the new administration building where you came in at the front gate to your right. Well I'm in the records department so all day I'm bringing big boxes of records out because every time there is disciplinary actions every morning they have a sheet that they receive and they may send out maybe 3, 400 records."
    },
    {
      "speaker": "Sherman",
      "time": "00:24:17",
      "upperBoundTime": "00:24:46",
      "content": "So I'm bringing the boxes down putting them in the trucks in the evening. I pick them back up when they finished with them but in the meantime I'm cleaning the offices and just running a lot of little errands that they need there"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:46",
      "upperBoundTime": "00:24:47",
      "content": "How long have you been doing that?"
    },
    {
      "speaker": "Sherman",
      "time": "00:24:47",
      "upperBoundTime": "00:24:52",
      "content": "4 years maybe? Yeah 4 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:52",
      "upperBoundTime": "00:24:51",
      "content": "Do you get to choose?"
    },
    {
      "speaker": "Sherman",
      "time": "00:24:51",
      "upperBoundTime": "00:24:54",
      "content": "The job?"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:54",
      "upperBoundTime": "00:24:55",
      "content": "Yes."
    },
    {
      "speaker": "Sherman",
      "time": "00:24:55",
      "upperBoundTime": "00:25:03",
      "content": "Well yeah I could put in for a job like a job change or something like it yeah, that wouldn't I don't think they'd let me go."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:03",
      "upperBoundTime": "00:25:05",
      "content": "They value you over there."
    },
    {
      "speaker": "Sherman",
      "time": "00:25:05",
      "upperBoundTime": "00:25:20",
      "content": "Yeah you don't need that other job. And the crazy part is like 20 something women up there right? You'd think it be like you want to work there but like okay, you can imagine catering to just your wife right? Okay, you're catering to 20 something women, so that's the crazy part."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:20",
      "upperBoundTime": "00:25:27",
      "content": "What other organization, you mentioned hospice which I know quite a bit about but what other organizations are you involved with at Angola?"
    },
    {
      "speaker": "Sherman",
      "time": "00:25:27",
      "upperBoundTime": "00:25:57",
      "content": "That now? Right now I'm Doing Angola Special Civic Project I'm a member of that group of course we're fighting for parole eligibility for everyone in the church. So right now I haven't been doing too much and only been doing tutoring and doing some classes over here and over there I just been calming down because of the job in the last 3, 4 years. Like this is a lot. I've been getting a lot of offers, and I'm like I can t do them right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:57",
      "upperBoundTime": "00:26:34",
      "content": "Well it's very interesting to hear what you had to say about sort of reaching this point about six years where you just you didn't want to return back and keep doing the same thing. In many cases people's changes are just gradual transformations. For others there's this sort of eureka moment where people think, they see something, they realize something, a light bulb goes off, they have a conversation with somebody. Was there anything specific like that for you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:26:34",
      "upperBoundTime": "00:28:22",
      "content": "No I would say just listening to the stupidity like a lot of times we would come in here and guys were like \"You get an education you stupid!\" Okay, now that's really bad like I don't want to be around you guys. It was just crazy for me to that's political you dealing with those political dudes and all this they using the n word and stuff right and I'm like, \"That don't sound right. Even if I died here I don't want to die the dummy I came.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:26:34",
      "upperBoundTime": "00:28:22",
      "content": "So I'm like that even more so made me want to get educated so I won't be hopefully I was never there but I'm like oh no so if it was one thing it was this guy named John Boise. He was teaching this class transactional analysis and it was during substance abuse, and it was one sentence if it was anything he said, \"Don't ever let no one determine how you're going to feel today.\" And that just like whoa, and he gave an example of this, you passed that all day ah inmate get on the right side of the walk and all of them, and dudes be all, man I hate it here."
    },
    {
      "speaker": "Sherman",
      "time": "00:26:34",
      "upperBoundTime": "00:28:22",
      "content": "Man oh man it's crazy. He said that man don't even remember, you pass and go, hey how are you doing buddy. He said you'd let that man mess up your whole day and so I'm like and things were just coming to me and I'm like oh, and that's why every day that's why I never had a problem I'm like ok if you want to do it that way fine with me. And so if it was anyone it was him that one sentence."
    },
    {
      "speaker": "Sherman",
      "time": "00:26:34",
      "upperBoundTime": "00:28:22",
      "content": "And he had a lot of other good things but when he said that I'm like jeez this guy is a genius. And I'm serious. He just and I tell everyone I'm like why you going to let someone do you this and I'm talking about they'd be mad for months. They'd go man I hate him, blood pressure way up here. That man don't even remember you, and I'm like that's crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:22",
      "upperBoundTime": "00:28:23",
      "content": "Yeah that's a lot of wisdom in there"
    },
    {
      "speaker": "Sherman",
      "time": "00:28:23",
      "upperBoundTime": "00:28:52",
      "content": "Yeah and I'm like God that was just something about in the way he said it. He was a man of wisdom. He was a Muslim guy but he was teaching the class and he ended up getting out and dying ode-ed of course. He would be the one with wisdom go out on the street and OD of heroin but he was the one if anything. Nobody else on the street or I've read what I've read, seen on television or nothing and that's crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:52",
      "upperBoundTime": "00:28:58",
      "content": "If you were to come before a parole board which one day, what would you want them to know about you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:28:58",
      "upperBoundTime": "00:30:32",
      "content": "Well definitely I'm a changed man. But if it was anything that they could verify it would be that if you go back to when I came in '92, '93 we'll say from that point I have always been in some part even when everybody was telling you're going to die here the warden was telling everybody on the street telling you, I'm talking about the governor everybody telling you're going to die here I would say ok well I'm not gone die dumb."
    },
    {
      "speaker": "Sherman",
      "time": "00:28:58",
      "upperBoundTime": "00:30:32",
      "content": "That's for sure I want to get educate myself I've been in hospice maybe 7 or 8 years well 2010, 7 years as far as everything else I've been tutoring everyone that I can tutor. I went through the bible college, after that I been doing ministry the whole time. So I mean there's nothing else I could have done and its not to go home because you telling me I'm going to die here so, and I'm looking for 40 years later maybe I might go home but this is not for 40 years later because I'm still at that point thinking well something's going to happen."
    },
    {
      "speaker": "Sherman",
      "time": "00:28:58",
      "upperBoundTime": "00:30:32",
      "content": "So it would be that okay, well you can see truly where my heart is it's not something where if they changed the law today and you see where well he just started after they changed the law I been doing this for the 27 years I been here I'm not a violent person that's why I haven't even had a fight or an argument or whatever. So I mean that's about all I mean you can go with the sure no free person could say anything bad about me. I mean I don't know anything else what the barometer, what else would you use."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:32",
      "upperBoundTime": "00:30:33",
      "content": "It can be very subjective."
    },
    {
      "speaker": "Sherman",
      "time": "00:30:33",
      "upperBoundTime": "00:30:35",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:35",
      "upperBoundTime": "00:30:39",
      "content": "What's the worst thing you deal with being here?"
    },
    {
      "speaker": "Sherman",
      "time": "00:30:39",
      "upperBoundTime": "00:30:47",
      "content": "Probably the loneliness you would like to have a woman every night, and then it's been 20 some years."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:47",
      "upperBoundTime": "00:30:49",
      "content": "I understand."
    },
    {
      "speaker": "Sherman",
      "time": "00:30:49",
      "upperBoundTime": "00:30:51",
      "content": "Yeah the loneliness definitely yeah for sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:51",
      "upperBoundTime": "00:30:53",
      "content": "Yeah."
    },
    {
      "speaker": "Sherman",
      "time": "00:30:53",
      "upperBoundTime": "00:31:33",
      "content": "Yeah because they allow that for sure you'll get in trouble if you do that type of thing but that more than anything. You don't have any privacy of course and that's why I love my little room so much because it is mine and I'm in there doing quilts. I can watch the little television little beat up television but it catch all the channels."
    },
    {
      "speaker": "Sherman",
      "time": "00:30:53",
      "upperBoundTime": "00:31:33",
      "content": "So that's good but that's probably the only time I really have to myself but there's a camera there. So the little bulb got me they don't have none in here but so that's that is it really privacy you just alone but there's no privacy I mean so I guess."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:33",
      "upperBoundTime": "00:31:34",
      "content": "And you're in the dorm."
    },
    {
      "speaker": "Sherman",
      "time": "00:31:34",
      "upperBoundTime": "00:32:17",
      "content": "Yeah I'm in the dorm but there's a hobby shop and there's these little rooms they call them special project rooms so I have one of those, very small probably from there and they come here but a little bigger and I have a sewing machine which I do the quilts on and some desks and stuff that I use but definitely it would be the loneliness, and the little privacy I'll take the privacy every now and then."
    },
    {
      "speaker": "Sherman",
      "time": "00:31:34",
      "upperBoundTime": "00:32:17",
      "content": "The loneliness I'm not tripping. I'm used to the loneliness now because being around 87 guys still doesn't mean you're not alone because you don't have that type of relationship with them. It look like everybody waiting to die so it that doesn't, definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:17",
      "upperBoundTime": "00:32:25",
      "content": "If there is such a thing what's the best thing about Angola for you?"
    },
    {
      "speaker": "Sherman",
      "time": "00:32:25",
      "upperBoundTime": "00:33:56",
      "content": "Giving me the chance definitely to rehabilitate myself. I truly believe it saved my life. Definitely probably the my kid's life if something was going to happen to me they'd probably run in the house and do it something like that of course it saved me gave me a chance to even build a relationship with them."
    },
    {
      "speaker": "Sherman",
      "time": "00:32:25",
      "upperBoundTime": "00:33:56",
      "content": "That type of thing there but that would be probably the best thing I love that in everybody say I'm crazy when I say I say, \"When I got my GED that was way more powerful than getting my bachelors.\" And people like and I say, \"I don't know.\" I can't explain it just something about getting that GED and after all the other things I've been through like 40 programs so and there like that's it?"
    },
    {
      "speaker": "Sherman",
      "time": "00:32:25",
      "upperBoundTime": "00:33:56",
      "content": "The G I say yeah even walking across the stage getting an associates and a bachelors and I say seriously and several other guys went to saying it after that like I don't know what it is something about that so I definitely would say that would be that GED is probably tops. But if it's anything that's ongoing it would probably be my job at this point."
    },
    {
      "speaker": "Sherman",
      "time": "00:32:25",
      "upperBoundTime": "00:33:56",
      "content": "I've had nice jobs like working at the ranch house but this one its very strenuous but again you around women you hear all the crazy stuff they laughing and joking its different from the guys look like everybody waiting to go to war or something. Its totally different and they go to war too don't get me wrong, but it's a totally different war for sure, definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:56",
      "upperBoundTime": "00:34:18",
      "content": "So one of the things that I'm trying to accomplish with this project is to really communicate the reality of life without parole and how one makes sense of such a thing. How do you make sense of that?"
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "You try not to think about it. Because you're trapped in this situation you feel you got yourself in however it happened you got yourself into it now it's time to work your way out and your given these tools but it's without the parole you're trying to shoot for this I mean you got your stuff in court you got some pardon after 15 years everybody know not even put it in now until John Bel Edwards of course he's doing some things that are just amazing."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "But on a day to day basis it is crazy because no woman really wants to spend the rest of her life wondering, they're coming in life and be like, \"Oh I love you,\" and everything else 6 months into the relationship its basically over if she stay 4 5 more years 6 months into the relationship it was basically over."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "And so then there's the kids and everything dad when you coming home you now and what almost made me cry because I don't cry is my daughter one day she said dad, she was visiting she was young that's the oldest one she's maybe 6 at that time. I said, \"What's up?\" She said, \"I haven't been eating no honey buns or nothing like that.\" I say, \"Yeah why you ain't been eating the honey buns?\""
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "\"I been saving all my money.\" She said, \"I got 81 dollars and 65 cent.\" I said, \"Yeah what you saving all that money for?\" \"Because you need 25, 000 to get out? I'm going to save. I ain't gone eat no more honey buns or nothing till I get them 25,000.\" I'm about to cry now and I'm like, no I wish I did just need 25000 but I'm talking about just blew me away. She wasn't going to eat that's how serious it is I'm not eating nothing else, not spending my money on that junk I want my daddy out."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "So now they have kids well I have 2, 3 grandkids, they are the size of my children when I left. Well actually one is way older one is six years old. So when I left my oldest daughter was like 3. So you can imagine they have kids now so it's crazy that. I haven't even held them at this point because she just moved back. So I'm waiting on her to bring the grandkids."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "One have 2 the oldest doesn't, the middle girl have 2 and one of the boys have one. So I'm waiting not just for one is 6, and I haven't even seen her and sending us stuff and talking to her but the other ones one is brand new, but two of them brand new. One of them just made a year, the other one made like 4 months."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "So not being able to hold them so all of this is excruciating of course at this point because okay I'm blaming only me for this situation. There's no one else to blame no matter how it went out I don't care I'm taking that blame now because it's so seriously and I've affected all these people this way not even looking at let's say this other guys family and everyone else."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "And the other people that came in its so far reaching I couldn't even calculate it I just sit down a whole year I bet out a day after that year I could come up with something else. And that's how bad it is. When you in a situation like this and so you try to make the best of it as you can and making sense of it I don't think other than my education I tell everybody at least I got a bachelors out of it or something."
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "And its crazy because I don't think there's an answer to that. That makes sense. Because it's too long it's just too long to spend that much time it's just too long. Especially with a person you can look at and say, well maybe there's a chance like right now I've been out 27 years this is how crazy they say look Sherman you've gotten more years left no, I be so happy you won't believe how happy I'd be and in the beginning I wouldn't even cop out for ten years"
    },
    {
      "speaker": "Sherman",
      "time": "00:34:18",
      "upperBoundTime": "00:38:16",
      "content": "I'm wishing I get it 27 years later to do ten more I would be so happy you wouldn't believe it. I'm for real and I'm like okay now I can see now, I can see a little something I'll be with the grandkids in ten more years or something so and that's how crazy it's you can't even quantify it"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:16",
      "upperBoundTime": "00:38:18",
      "content": "It is crazy."
    },
    {
      "speaker": "Sherman",
      "time": "00:38:18",
      "upperBoundTime": "00:38:25",
      "content": "Yeah it is crazy I would love to have ten years more. Begging for it actually. I would love to have it."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:25",
      "upperBoundTime": "00:38:49",
      "content": "It's astonishing that so many thousands of people who are serving life without parole in Louisiana find a way to make some kind of, find some kind of hope in there"
    },
    {
      "speaker": "Sherman",
      "time": "00:38:49",
      "upperBoundTime": "00:40:59",
      "content": "Yeah we see little glimmers because we're looking at the last five years we see the laws is changing pretty decently like drug lifers have gone the habitual offenders just got some about 6, 7 hundred dudes they haven't left but they have that opportunity and a lot of guys that were going to die are home already older guys that are no the juvenile thing has fallen the 40 year guys have gotten a little something. So we're looking at this and we're like ok there is hope."
    },
    {
      "speaker": "Sherman",
      "time": "00:38:49",
      "upperBoundTime": "00:40:59",
      "content": "And we're hoping that next year because we have this maverick of a governor and we love him to death because we haven't seen this ever. Put all of them together you would haven't see this and that's how beautiful this guy is. Like I said, my hospice volunteering and I'm like why is this guy still here. I mean he's gulping for air. He's got 4, 5 different cancers or something. He got multiple sclerosis whatever."
    },
    {
      "speaker": "Sherman",
      "time": "00:38:49",
      "upperBoundTime": "00:40:59",
      "content": "We got guys here with half a body, like okay what he gone do? Paraplegic you got paraplegic what are you gone do? They brought one back they said he had marijuana in his system okay, but your paraplegic I don't know how he smoked it whatever but I'm like, you're going to spend another $100,000 a year just because he smoked a marijuana joint and I'm like god and all these guys are dying right now that's in the program and I'm like okay he's really bedridden for real he can't move."
    },
    {
      "speaker": "Sherman",
      "time": "00:38:49",
      "upperBoundTime": "00:40:59",
      "content": "I'm washing him, I know you look at his legs look like my arm. I'm talking about big healthy guys they you're not studying he's going to die in 3 why would we spend money to keep him let him go home. I know you feel bad about whatever he did but and then we talking about 30 years, 40 years later and you're I mean I golly what you want? Like Hampton what his name Clifford Hampton he been out 60 year or what he did?"
    },
    {
      "speaker": "Sherman",
      "time": "00:38:49",
      "upperBoundTime": "00:40:59",
      "content": "What I'm saying. I got to go check again what did he do? You're still mad at somebody 60 years everybody got to be dead in the case. The judge everybody I'm like golly and if you go talk to him you be talking, you be like this guy been locked up that long. He's very articulate wonderful person."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:59",
      "upperBoundTime": "00:41:20",
      "content": "I mean obviously one of the purposes of prison is retribution there's also rehabilitation there's incapacitation, there's deterrent there are a number of things and in a case of say second degree murder. How much punishment is enough? That becomes the question."
    },
    {
      "speaker": "Sherman",
      "time": "00:41:20",
      "upperBoundTime": "00:41:25",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:25",
      "upperBoundTime": "00:41:30",
      "content": "Is 27 years for what you did enough?"
    },
    {
      "speaker": "Sherman",
      "time": "00:41:30",
      "upperBoundTime": "00:42:06",
      "content": "I would say a resounding yes. I would say at the 15 year point I think everybody really looking at my jacket everything else should have been like well yeah he'll never do this again. I wouldn't have said the 6 years because even though I felt that way I say 15 years in let's take a look at it ok this guy is serious about this college school, culinary arts I could go on and on and on."
    },
    {
      "speaker": "Sherman",
      "time": "00:41:30",
      "upperBoundTime": "00:42:06",
      "content": "So yes, I was doing all the right things, no write ups doing, so if you going to choose someone you want to pick the cherry, pick your inmate or whatever I would say yes 15 years is definitely enough."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:06",
      "upperBoundTime": "00:42:11",
      "content": "And you've done 27."
    },
    {
      "speaker": "Sherman",
      "time": "00:42:11",
      "upperBoundTime": "00:44:04",
      "content": "Yes. When that judge say life you don't get it right then but when you go to really thinking about it he means that. It's a death sentence. Even when they say natural life? Okay, what is natural like but there giving you a death sentence when they say life they just don't say it that way and that's why it's better to even be on death row because at least you're not working until you die?"
    },
    {
      "speaker": "Sherman",
      "time": "00:42:11",
      "upperBoundTime": "00:44:04",
      "content": "If they going to kill you which they don't do on you probably you got to ask them to kill you on death row on Louisiana to kill you. But they got the younger guys that come in they know they going home so there's no incentive to do that thing so they come in they like, \"Well I'm going home anyway so I don't have to do these things to get this and get that.\""
    },
    {
      "speaker": "Sherman",
      "time": "00:42:11",
      "upperBoundTime": "00:44:04",
      "content": "With us it's like whoa there's this rude awakening that happens and so we're like man I was a horrible person and now we want to correct that if nothing else. We just want to be the best person we can because there's nothing else to do. You could be a dummy the guy you used to be you don't want to be that guy no more the guy that got you here."
    },
    {
      "speaker": "Sherman",
      "time": "00:42:11",
      "upperBoundTime": "00:44:04",
      "content": "So that's what it is, that rude awakening this I got to be much I could do way better than that and so some family members help some other guys here help but you going to have to make that change within yourself like I never do that again or whatever it is. So that's what you go to working towards."
    },
    {
      "speaker": "Sherman",
      "time": "00:42:11",
      "upperBoundTime": "00:44:04",
      "content": "I think that's what really changes a person when they really get hit with something really nice like 80 years or a life sentence which is that's a quasi-life sentence 80 years now especially now you gone do 85% of that okay, you live to 73 or something but that is a rude awakening when you get here and everybody telling you're going to die here and everything else you're like ok I won't die that same person I know that. And that it becomes personal then, I'm much better than that."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:04",
      "upperBoundTime": "00:44:06",
      "content": "What are you proudest of?"
    },
    {
      "speaker": "Sherman",
      "time": "00:44:06",
      "upperBoundTime": "00:45:22",
      "content": "That I'm not a crazy guy at this point. For real because I'm looking at guy we have a friend now I'm like this guy is so strong I wouldn't even tell you the stuff he's such a thinker he thinks ten years and he puts things in place for ten years from now and I'm like he's going crazy he's talking about people putting stuff in his toothpaste he's sending it home to get tested to make it to prove his allegations and he's wrong every time and what I'm talking about when I say strong legally and everything and he's losing it."
    },
    {
      "speaker": "Sherman",
      "time": "00:44:06",
      "upperBoundTime": "00:45:22",
      "content": "He haven't lost it all the way but we see it all the time and that's why we tell people back away from your case I'll do it I'll back away like a year back away from it because I can feel that pressure coming. Every morning he wakes up he go to reading it. It's the same stuff and so now it done took its toll and everybody I seen go crazy that's what they go crazy off reading their case."
    },
    {
      "speaker": "Sherman",
      "time": "00:44:06",
      "upperBoundTime": "00:45:22",
      "content": "And my mental stability is really intact and so that's what I love the most the most proud of that I haven't went crazy in this situation and I could hold a decent conversation because otherwise because this place can drive you mad."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:22",
      "upperBoundTime": "00:45:29",
      "content": "You think life sentences have driven some folks mad here?"
    },
    {
      "speaker": "Sherman",
      "time": "00:45:29",
      "upperBoundTime": "00:46:02",
      "content": "Yes indeed yeah and it's mostly that I can't find a way out because most guys you catch in our situation, we're always doing something, we're always being creative with things and that's what get us in trouble. Come in here we're always go getters, we want to get it ourselves and when you get here and these courts go to doing all kind of stuff you like."
    },
    {
      "speaker": "Sherman",
      "time": "00:45:29",
      "upperBoundTime": "00:46:02",
      "content": "I know if I got this reversal and to my stuff whereas they don't reverse this guy's stuff. Where somebody had a green shirt on instead of turquoise and here you got guys saying, he didn't do it and people taking their statements back and stuff like that I'm talking about other cases right and other people confessing, so it's a lot of stuff, you wouldn't believe the stories."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:02",
      "upperBoundTime": "00:46:12",
      "content": "Then even folks who admit that they are guilty of the crime for which they were convicted the concept of a life sentence I think can drive you crazy."
    },
    {
      "speaker": "Sherman",
      "time": "00:46:12",
      "upperBoundTime": "00:48:02",
      "content": "Definitely not only that. The thing is when you give a guy a life sentence for a crime let's say in our area most likely if I kill a guy he was trying to kill me at some point, something went wrong somewhere so it's not like I came in your house, I'm not even supposed to be there and I robbed and killed you."
    },
    {
      "speaker": "Sherman",
      "time": "00:46:12",
      "upperBoundTime": "00:48:02",
      "content": "Most likely this guy done shot me up before I done shot him up and we fire finally killing this time or whatever he been trying to kill me. Most of the circumstance with the guys I know who are here they here for killing a guy that's been trying to kill him for three years too and all this kind of stuff."
    },
    {
      "speaker": "Sherman",
      "time": "00:46:12",
      "upperBoundTime": "00:48:02",
      "content": "So when you give a guy a life sentence. So you got two of them out the way now this type of thing but I don't think he deserve a life sentence. This guy was trying to kill him too he just didn't go to the police. Because they wasn't going to do nothing anyway for real, they do us dead for real literally. They're like handle your own business because they already know y'all going to kill each other and I'm going to get the other one."
    },
    {
      "speaker": "Sherman",
      "time": "00:46:12",
      "upperBoundTime": "00:48:02",
      "content": "So I'm like God and I knew what the guy was targeting this other guy kept trying to get him behind a guy like man go I don't want the girl I don't mess with her no more, but you done had sex with her, so the dude mad that type of thing. I'm talking about that turned out so bad, that turned out real bad."
    },
    {
      "speaker": "Sherman",
      "time": "00:46:12",
      "upperBoundTime": "00:48:02",
      "content": "And so then when I tell you like guys like 20 guys get killed and 35 in jail behind it, that was crazy and then both of them had old ladies it just was like this stripper brawl. And I'm like god but like I say with those guys I can't see them doing a life sentence and he trying to kill you too. There's nothing in the law that allows it for them to look at those circumstances because 2nd degree is you can't say well okay well you going to get a 20 year sentence. You got to get that life sentence, that's it, there's nothing else."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:02",
      "upperBoundTime": "00:48:13",
      "content": "Well if and when you're released let's say when you're released how do you envision your life after here?"
    },
    {
      "speaker": "Sherman",
      "time": "00:48:13",
      "upperBoundTime": "00:50:08",
      "content": "The first week I want to be alone I don't want to see a human being. I want to be snowed into I'm not talking a woman or nothing I don't need to see a human being not around me in so long for the first week of course. But I see myself in recycling, the business I love that. I once read that we throw away 300 billion a year in recyclables, and I've been running behind that ever since."
    },
    {
      "speaker": "Sherman",
      "time": "00:48:13",
      "upperBoundTime": "00:50:08",
      "content": "I actually started outside recycling with this young lady, we had bins down and everything but that's what I want to do recycling. And I'm definitely going to get them grand babies and definitely try to build a relationship with them because I think the relationship with the kids is not solid. I don't think it's going to take a lot longer than the grandkids like grandpa they jumping on you they love you off top. I got a grandpa."
    },
    {
      "speaker": "Sherman",
      "time": "00:48:13",
      "upperBoundTime": "00:50:08",
      "content": "But with the other kids we still having issues like you wasn't there well okay I was in jail. I didn't like desert you and move to Utah but I definitely want to do the recycling thing, have a wife and my kids already. But I mean she want to have a baby I'm 47 now, not that I can't but like raising a 2 year old at 50, but that's definitely what I'd like to do."
    },
    {
      "speaker": "Sherman",
      "time": "00:48:13",
      "upperBoundTime": "00:50:08",
      "content": "I'm all about business I have to have a business I probably could work for someone three months like that. And I'm going to have to start something online or something, I still could continue to work but I have to be seeing that I'm going somewhere, but that's it. I want to walk in the ocean like I have that recurring dream, I want to be free walking in the ocean just walking, that's really far now from what I see my dreams are. And you can only hope and dream."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:08",
      "upperBoundTime": "00:50:43",
      "content": "So tell me if there's something that I should have asked you that you wanted me to ask you that I haven't asked you what would you I mean whether it's what do legislators need to know about life without parole experiences or why didn't you ask me about my spirituality or why didn't. Is there something that you would like to talk to me about that I haven't asked you? Or any else anything else you want to share with us?"
    },
    {
      "speaker": "Sherman",
      "time": "00:50:43",
      "upperBoundTime": "00:52:04",
      "content": "I can't really think of the I just I have a question about like how can the states around us have these beautiful laws like Mississippi or something like ten years you go for life sentences in Texas you don't want the death sentence but if you got a life sentence you're good. You got all in all these other areas I don't think its equal protection to do that I don't think that even like let's say cars let's say a guy that's steal a car in new Orleans can get 20, 30 years but if you stealing in California the max is 6 months."
    },
    {
      "speaker": "Sherman",
      "time": "00:50:43",
      "upperBoundTime": "00:52:04",
      "content": "Now that's not actual, but I'm saying that is not equal protection, and I don't understand that. That's crazy I don't care if they have a crazy car problem what I'm saying and I feel like and let them enact they laws and to the crime situation that still should be a maximum. Look I don't care what he stole he ain't getting more than three years. You shouldn't be able to give this guy a life sentence for stealing a car. I mean the worst thing to him was a bad day he had to go rent a car or something."
    },
    {
      "speaker": "Sherman",
      "time": "00:50:43",
      "upperBoundTime": "00:52:04",
      "content": "So it's different if its murder irrevocable or something like that. I'm talking about a guy stole a car and you got it back 2 days later but he has a life sentence you're going to spend a million dollars keeping him just buy him a car and he can stop stealing. No I don't have anything I just have so many questions like why would they do that?"
    },
    {
      "speaker": "Marcus",
      "time": "00:52:04",
      "upperBoundTime": "00:52:05",
      "content": "Yeah that's a very good question."
    },
    {
      "speaker": "Sherman",
      "time": "00:52:05",
      "upperBoundTime": "00:52:22",
      "content": "Yeah I'm like that's crazy even guys that's continue to steal. Okay what are you stealing cars like in New Orleans, look we are going get you a car but you gone pay her back for this car. Little 2500 dollar car, come on you're working for me, make sure I get my money out you or something instead of paying 40,000 a year 30,000 keeping him in jail, you're going to buy him a little car"
    },
    {
      "speaker": "Marcus",
      "time": "00:52:22",
      "upperBoundTime": "00:52:24",
      "content": "Yeah and there is this."
    },
    {
      "speaker": "Sherman",
      "time": "00:52:24",
      "upperBoundTime": "00:52:27",
      "content": "It's radical."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:27",
      "upperBoundTime": "00:52:39",
      "content": "There is this sort of there's a lottery of geography right where you happen to be, where you happen to have been raised, where that makes a big difference in terms of the variation in punishment yeah."
    },
    {
      "speaker": "Sherman",
      "time": "00:52:39",
      "upperBoundTime": "00:52:43",
      "content": "Yeah it's crazy."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:43",
      "upperBoundTime": "00:52:50",
      "content": "Yeah well I have so much enjoyed listening to what you had to talk to us about."
    },
    {
      "speaker": "Sherman",
      "time": "00:52:50",
      "upperBoundTime": "00:52:52",
      "content": "Yeah there's so much more."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:52",
      "content": "There is. There is and who knows we might have to ask you to talk with us again."
    }
  ]
}
