{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:04",
      "content": "Sidney Anderson Transcription REDACTIONS FINAL"
    },
    { "upperBoundTime": "00:00:04", "content": "Sidney Anderson" },
    { "upperBoundTime": "00:00:04", "content": "Transcribed by Dari Zeltser" },
    { "upperBoundTime": "00:00:04", "content": "02/03/18" },
    {
      "speaker": "SA:Sidney",
      "time": "00:00:04",
      "upperBoundTime": "00:00:20",
      "content": "My name is Sydney Bradley Anderson I've been convicted as a principal to second-degree murder. I was 19 at the time. I've been locked up going on 24 years."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:00:20",
      "upperBoundTime": "00:00:26",
      "content": "Mr. Anderson tell me a little bit about your childhood growing up tell me about who raised you"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:00:26",
      "upperBoundTime": "00:01:33",
      "content": "Well my mother my mother raised me I had a stepfather who participated in raising me for a small amount of time. Had a big impact on my life in the beginning Three other siblings I'm the Third. I have two other brothers and I have aan older sister. We grew up in a low-income neighborhood and you know this was a neighborhood where a lot of less fortunate people strive to make best of the little bit they have pulled together. They express love in certain ways and just made do with the little that we had."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:01:33",
      "upperBoundTime": "00:01:37",
      "content": "and uh What was your relationship Likelike with that stepfather?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:01:37",
      "upperBoundTime": "00:03:09",
      "content": "That stepfather well actually he- in the small time that I would say about 10 years 10 years he was with my family. I said he made a large impact on me at that time because I learned a lot of things from him."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:01:37",
      "upperBoundTime": "00:03:09",
      "content": "He was a he was employed and he used to be a janitor he had separate jobs where he used to clean offices for the military people like different offices he also was an entrepreneur what I mean by entrepreneur is he had his own janitorial job too. He used to clean up offices at the airport. And he used to bring me with him a lot."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:01:37",
      "upperBoundTime": "00:03:09",
      "content": "He also you know he was really loving and supportive of me. He taught me a lot I learned a lot from him. And I remember he used to always support me in sports you know taught me how to play baseball supported me in that area. I become a nice baseball player and he was basically my support system because he would always he would be the only one in the stands supporting me and baseball so I wanted to make him proud."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:03:09",
      "upperBoundTime": "00:03:10",
      "content": "What was his relationship like with your mother?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:03:10",
      "upperBoundTime": "00:05:18",
      "content": "So I spent a lot of time with him and and I believe a lot of their altercations was a bit because of anger you know I would see anger and looking over my life now I would see you know I've learned how to deal with my feelings about what I saw. And then this home now that I'm looking over my life I was never taught boundaries. Boundaries or communicating."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:03:10",
      "upperBoundTime": "00:05:18",
      "content": "I was never taught as a kid how to communicate myself in a healthy way so that I could have healthy relationships. So and dealing with my feelings you know I didn't I wasn't taught boundaries so when I was feeling anger or any different type of feelings that it could would feel you know I would never learn how to deal with those in a healthy way."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:03:10",
      "upperBoundTime": "00:05:18",
      "content": "So naturally I would act out. And an acting out it became like a relief to me. And obviously it became a normal way of dealing with my feelings. And because of thatt you know it comes with the territory it began to cause me problems."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:03:10",
      "upperBoundTime": "00:05:18",
      "content": "5:14"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:05:18",
      "upperBoundTime": "00:05:20",
      "content": "So fighting?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:05:20",
      "upperBoundTime": "00:05:23",
      "content": "Fighting. You know Acting out."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:05:23",
      "upperBoundTime": "00:05:24",
      "content": "Violence?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:05:24",
      "upperBoundTime": "00:05:42",
      "content": "violence. Violence as far as fighting and you know eventually it escalated to more violence in different ways."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:05:42",
      "upperBoundTime": "00:05:45",
      "content": "What is the highest year of school that you completed?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:05:45",
      "upperBoundTime": "00:05:46",
      "content": "Excusescuse me?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:05:46",
      "upperBoundTime": "00:05:46",
      "content": "What was the highest year of school that you completed?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:05:46",
      "upperBoundTime": "00:05:52",
      "content": "Well I would say I would say the seventh grade because in the seventh grade I was put in a program because I kept getting suspended behind my anger. I hadn't been able to deal with my feelings it all goes back to not being able to deal with my feelings. I say the seventh grade because that is the highest grade I was put in this program which was getting me to the ninth grade."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:05:46",
      "upperBoundTime": "00:05:52",
      "content": "An alternative program and I passed the alternative program and got put in the 9th grade but I still have this problem with my feelings. And I would get suspended obviously I would get suspended for others and I would never see school again."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:05:52",
      "upperBoundTime": "00:06:53",
      "content": "Okay, what now that you look back what were you angry about?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:06:53",
      "upperBoundTime": "00:07:36",
      "content": "Well various reasons. But I think my anger probably a rose because of conflict. I'm thinking I'm right thinking that somebody don't have the right to talk to me the way they talking to me. Maybe even something I didn't receive at home I don't know. Or maybe even now that I'm looking at it maybe I learned that. Who knows.knows?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:07:36",
      "upperBoundTime": "00:07:41",
      "content": "So your stepfather Waswas in your life until you were 10?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:07:41",
      "upperBoundTime": "00:07:44",
      "content": "Well he was in my life for 10 years"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:07:44",
      "upperBoundTime": "00:07:53",
      "content": "For 10 years okay, and then your parents they split up. Was there another man in your mother's life? That came into your life?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:07:53",
      "upperBoundTime": "00:08:02",
      "content": "Well.. obviously Anotheranother man there occasionally not living there but"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:08:02",
      "upperBoundTime": "00:08:04",
      "content": "Did you ever have conflict with any of those men?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:08:04",
      "upperBoundTime": "00:09:59",
      "content": "Well somewhat. As I got older as I got older Whenwhen I will actually prior to getting locked up I believe from like the age of maybe 15, 16 this particular guy was staying with us and and he didn't like us. How I know because I had already experienced somebody that liked us that respected us that loved us that supported us. So this particular guy was a stranger who has kids outside of our family. They were more important. So there goes the conflict."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:08:04",
      "upperBoundTime": "00:09:59",
      "content": ""
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:08:04",
      "upperBoundTime": "00:09:59",
      "content": "And he was very strict. Yet he wouldn't fight with my mother Thatthat was the distinction between the two. He wouldn't fight with her. That's one thing I could say he wouldn't fight with her. But he had other relationships. And as a kid and as a young adult and I was venturing off in two different neighborhoods on the wrong path I would see him. So there it goes."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:09:59",
      "upperBoundTime": "00:10:04",
      "content": "Did you and he ever have any sort of physical fight?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:09:59",
      "upperBoundTime": "00:10:04",
      "content": "10:00"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:10:04",
      "upperBoundTime": "00:11:11",
      "content": "Well it never got that far. Because of him. He always when he seen it getting close to that point he would always find a way out of it. Because he knew I knew everything about him. He couldn't hide. It seemed like everywhere he was I was there. Or I knew somebody. So he couldn't really hide it. But it put a strain on me and my mother's relationship because of that. And actually when I got locked up when he felt like I was too far out there he left. he just left."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:11:11",
      "upperBoundTime": "00:11:16",
      "content": "Did any of your siblings get into any trouble?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:11:16",
      "upperBoundTime": "00:13:31",
      "content": "Well yes they did. andAnd I believe I play a big part in that. Because I strayed and I didn't know it at the time that I was a leader people were watching me. And I was leading them the wrong way. Unconsciously. And of course my brother is my older brothers he used to play basketball he had a future."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:11:16",
      "upperBoundTime": "00:13:31",
      "content": "Yet I was wrapped up in my emotional rollercoaster and finding other things dealing with what I was dealing with. And I had people in my life that were mentoring me loving me like a father I used to go to the Boys & Girls Club and they have this guy named Mr. Harold Alexander."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:11:16",
      "upperBoundTime": "00:13:31",
      "content": "He used to raise all the kids and boys and girls club. All the kids. He took a special interest in to me. $$ And he became a father figure to me. And I didn't know until I got in Angola and I had changed my life at the time and I was in the church service day before the short time that I had been going to church at that time I found out he was a pastor. I didn't know that."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:11:16",
      "upperBoundTime": "00:13:31",
      "content": "It messed me up. BecauseCuz I looked at him like a father but he didn't force anything on me not religion nothing. Only thing he did to me was the same thing he did to everybody else everybody else kids that he encountered. And he loved them."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:13:31",
      "upperBoundTime": "00:13:57",
      "content": "S so in spite of having adults $$ further then this pastor take an interest in you as a kid and be a father figure to you You still found yourself going Downdown the wrong path. Were drugs and alcohol part of your life? Tell me about that."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:13:57",
      "upperBoundTime": "00:15:20",
      "content": "Well I started Ime believe I may have been 13 when I started Sneaking away start adventuring off. Started finding that this was easier for me to deal with everything I was dealing with. If I go this way this wrong path I'm among people who feel the same way."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:13:57",
      "upperBoundTime": "00:15:20",
      "content": "So it's easy it's easy to succumb to what they are doing because Theythey are numbing themselves to what we all dealing with. And of course we understand what comes with the territory hurting people hurt people. Not because they want to. Not because they have to because they think they should. That's how they dealing with what's inside what's the problem they dealing with. Their pain."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:13:57",
      "upperBoundTime": "00:15:20",
      "content": "15:08"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:15:20",
      "upperBoundTime": "00:15:24",
      "content": "Yeah Werewere you addicted to anything? As a nineteen-year-old?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:15:24",
      "upperBoundTime": "00:16:15",
      "content": "I was- well at 19 I was on my way here. Not here but on my way to making the biggest mistake of my life. I wouldn't say I was addicted to anything I tried you know I used to drink I tried to smoke a little marijuana I couldn't handle it. It made me too paranoid. And I think I tried I don't think I tried I tried cocaine on several occasions but I don't believe I wouldn't say I was addicted to any drug may be drinking."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:16:15",
      "upperBoundTime": "00:16:18",
      "content": "How were you supporting yourself?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "Well I like I said the wrong path always leads you to the streets. And the streets there's drugs. In the streets is the life of a taking a chance taking a risk. To support yourself. I didn't want to lean on anybody. I wanted to provide for myself. And of course I have had people that you know seen potential in me potential I didn't see and of course it had influence and of course they tried to help me."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "Assist me to change my life they offered me jobs. I went on the job actually I went on this job where Probably was hope for me I remember I don't think with it I don't remember I think it was 1992 and I had this father-in-law this mother-in-law I was with their daughter and they seensee something in me that I didn't see in myself."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "So the father-in-law got me a job. I think it was yeah it was Outback Steakhouse and in the back I was a dishwasher I would wash the dishes. I was supposed to stay where I was. And I think I can remember being the only black person but I knew my brother-in-law work their also but it wasn't many blacks. And they were taking a chance with me. I don't know if they saw me as this certain person taking a chance with me. And this particular night I think I work there just 2 days prior to this night this particular night they asked me to bring some of the dishes to the other side."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "Now where I was working to the other side that's all kind of traffic out back is a popular at the time restaurant. A lot of activities and as I'm taking it I see a big Aa big wad of money on the floor. Mind me that there's a lot of activity back and forth trays waitresses coming in Cooks no way no way would nobody I know that there's money on the ground going to kick it like you you going to step on it."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "You're going to step on a lot of money and they're asking me to take these trays to the other side. And when I take them I look down and there's a lot of money. I know what's going on. They're testing me. So I decided that this is not this is not where I want to be."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "20:08"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:16:18",
      "upperBoundTime": "00:20:23",
      "content": "I wanted to engage in something different. Because somebody believed in me somebody was taking a chance on me."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:20:23",
      "upperBoundTime": "00:20:27",
      "content": "Tell me about your girlfriend."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:20:27",
      "upperBoundTime": "00:20:30",
      "content": "My girlfriend. Which one?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:20:30",
      "upperBoundTime": "00:20:35",
      "content": "The one whose father in law got you think job."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:20:35",
      "upperBoundTime": "00:20:46",
      "content": "Well her her name was Anitra. I liked that Anitra."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:20:46",
      "upperBoundTime": "00:20:48",
      "content": "Do you have any children?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:20:48",
      "upperBoundTime": "00:21:57",
      "content": "With Anitra? Funny you ask actually Anitra had a son prior to me getting locked up. Only to find out that- we named him Sydney Anderson Bradley Anderson Jr. Only to find out years later that Sydney Bradley Anderson Jr. is not my biological son. So now there's a Kid named Sydney Bradley Anderson Jr."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:20:48",
      "upperBoundTime": "00:21:57",
      "content": "Who I still have a relationship with as father to son that knows that I'm not his dad. But we still have the same relationship we had prior to him and I finding out that he's not my biological son so there goes the relationship between me and Anitra."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:21:57",
      "upperBoundTime": "00:22:00",
      "content": "Sure. Any other children?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:22:00",
      "upperBoundTime": "00:22:34",
      "content": "Well I'm proud to say that I have a daughter Cindy Simone Anderson. She's going to make 24 August 31st. And with the help of her mother I've been raising Cindy right from prison because we both understand that I don't have to be there to be there."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:22:34",
      "upperBoundTime": "00:22:37",
      "content": "Who visits you here?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:22:37",
      "upperBoundTime": "00:23:24",
      "content": "Cindy Simone Anderson. I have a son named Tyrell Shelvin and I have a mother and a sister I have two brothers everybody visit me. I have a fiancé and a daughter she don't play the step dad I'm a father figure in her life. Her father is you know what they called him. Deadbeat. So I've been influencing her life."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:23:24",
      "upperBoundTime": "00:23:31",
      "content": "Is this fiancé somebody you met after you'd been incarcerated?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:23:31",
      "upperBoundTime": "00:23:33",
      "content": "This fiancé God sent me."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:23:33",
      "upperBoundTime": "00:23:38",
      "content": "Okay, so when did you meet her?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:23:38",
      "upperBoundTime": "00:24:13",
      "content": "2010 God saw fit in 2010 I wasn't ready for a relationship prior to 2010. It was after 2005 when I gave my life to Christ. And Christ began to shape my life and get me ready for a life with him first then with others."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:24:13",
      "upperBoundTime": "00:24:22",
      "content": "Sydney can you describe the Sydney Anderson who was brought into the gates of Angola?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:24:22",
      "upperBoundTime": "00:24:24",
      "content": "That was brought into?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:24:24",
      "upperBoundTime": "00:24:26",
      "content": "Through the gates of Angola."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:24:26",
      "upperBoundTime": "00:25:22",
      "content": "well Well I was, a I got locked up at 19. At the age of 20 I was coming to Angola dealing with feelings a dark man. A man that said I don't have friends I'm by myself. A man that says that I'm not taking no what nickels I'm not taking nothing from nobody I don't have nothing to lose. That type of man that type of man that was always waiting and ready for whatever."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:25:22",
      "upperBoundTime": "00:25:23",
      "content": "Did you fight?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:23",
      "upperBoundTime": "00:25:44",
      "content": "Yeah."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:23",
      "upperBoundTime": "00:25:44",
      "content": ""
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:23",
      "upperBoundTime": "00:25:44",
      "content": "25:20"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:23",
      "upperBoundTime": "00:25:44",
      "content": "I fought. that was the only thing I knew how to do. When it came to my feelings when I got angry remember I didn't know how to communicate how I was feeling."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:25:44",
      "upperBoundTime": "00:25:46",
      "content": "Do you fight now?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:46",
      "upperBoundTime": "00:25:47",
      "content": "No. I don't have to."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:25:47",
      "upperBoundTime": "00:25:49",
      "content": "Why not?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:49",
      "upperBoundTime": "00:26:43",
      "content": "Because I've changed. I understand now the fight is spiritual. I don't have to file like that I understand God is with me. I've changed my mind my heart has changed. I hear a lot of people talking about Rehabilitation what about reformation. I've been reformed I've been transformed. And because of that because of that encounter my life has been different I'm at peace. I've been reconciled with my feelings."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:25:49",
      "upperBoundTime": "00:26:43",
      "content": "I understand I don't have to lash out. I understand I don't have to act out. I understand it's all right when somebody don't believe the way I believe I understand that now."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:26:43",
      "upperBoundTime": "00:26:58",
      "content": "Did you go through some of the opportunities that they have here at Angola like anger management AA. canCan you tell me a little bit about some of those activities that you went through?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:26:58",
      "upperBoundTime": "00:29:01",
      "content": "I've been in AA and every aas that is and I made A A. And I've learned a lot I've learned a lot through the years. And so on I've been educated I got a GED. I've even an associate's degree I've gotten a bachelor's degree. I've gotten an electrical degree and now I'm a mentor in the reentry program and it's really touching to me because that's where my heart at. Trying to help guys not to be like me. Trying to teach guys and show guys how our thoughts attitudes and beliefs has the potential to get us in trouble or out of trouble."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:26:58",
      "upperBoundTime": "00:29:01",
      "content": "And I shared my story and I help assist them so that they can see that man the way we think the way we believe the way we feel affects us. And communicating socially with others it affects everything about us so I try to help them to see that we got to become better observers of ourselves and I think over the years and teaching these men I've been learning a lot about myself and teaching these men has been teaching me also. So it's a give-and-take. ItsIt's strange between the two."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:29:01",
      "upperBoundTime": "00:29:08",
      "content": "So is it your typical day at Angola now does it start off with a mentoring meeting in the morning?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:08",
      "upperBoundTime": "00:29:10",
      "content": "Yes."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:29:10",
      "upperBoundTime": "00:29:12",
      "content": "Tell me about your day here now."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "Well typical day now is 6:45 we have to be out of the dorm we have to be on our way to the morning motivation meeting. In this meeting we have a moderator which is a mentee. He opens up in prayer he calls several other mentees that have a job in this meeting. I will give announcements the other will give a word of encouragement the other one will give a thought for the day the next one would will come up any and introduce any new mentees that have come the new one would give announcements as far as he would be the guy that watches the news and reports the news."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "The one after that would be the one to give the Creed. We have a Creed that says we are better than our worst mistakes. And then the final guy will do the closing prayer. After that the guys will depart. They'll go to their careers. Not their vocation their careers. And learn more about- learn skills and things about their career, and"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": ""
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "30:38"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "whilewhile they're all there what we do is we take care of the small things we make rounds. You know Guys like when you come at their school and they teach you what they have learned about their skills. You know And we monitor them we talk to them we make ourselves available for them."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "A lot of guys have never had a mentor in their lives a lot of guys have never had anyone to really show them interest. Love them or just genuine love a lot of guys goes through the streets or take the wrong path numb themselves with drugs why? Because they holding in stuff that they would like to share. So what they do since they feel they can't share it- nobody will be patient enough to an understanding enough to listen?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "They choose the path of least resistance. To numb themselves. Not that they want to do it it's just the fact that they feel that's the only way I can handle this. And it's the path of least resistance. You know When you have so many guys in the program and in the prison it's not bad guys."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:29:12",
      "upperBoundTime": "00:33:01",
      "content": "We always, I tell the mentees all the time we all here for the same reason. The root of our problem is all the same. I may be here for principal to second-degree murder he may be here for rape he may be here for this he may be here for that and so on We all in the program for 2 years behind something simple yet the roots is all the same. Every charge second-degree, murder, rape that's just a branch on the tree. The route is we're here because we made bad decisions. So it's not the person it's the behavior. Sometimes we look at the person but it's the behavior."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:33:01",
      "upperBoundTime": "00:33:37",
      "content": "Yeah let me ask you a couple of difficult questions I'm going to ask you a couple of difficult questions. One is after more than 20 years when you look back on the crime that you're serving the sentence for and the victim victims family how do you feel about that today after so long after being punished for so long?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:33:37",
      "upperBoundTime": "00:34:32",
      "content": "Well, I'm going to speak about the victim right now and his family. I'm crushed. theseThese people receive a loss when their son died when they lost they son they lost a part of themselves. So I understand I truly understand I understand I feel for them I feel their pain that is just like whenever we get locked up there's a loss. A part of our family is lost so I understand the hurts of victims I understand."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:34:32",
      "upperBoundTime": "00:34:38",
      "content": "Do you think you've been punished enough for your role in this crime?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:34:38",
      "upperBoundTime": "00:35:49",
      "content": "Of course. Of course. And I believe I deserve an opportunity the second chance for this reason. I've been reformed. I've been transformed. Not just rehabilitated a person who is rehabilitated just learned a new skill."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:34:38",
      "upperBoundTime": "00:35:49",
      "content": ""
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:34:38",
      "upperBoundTime": "00:35:49",
      "content": "35:16"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:34:38",
      "upperBoundTime": "00:35:49",
      "content": "But what changed inside? That should determine everything. That's determine why I deserve a second chance I've Been Changed inside. So I'm making an outward expression of an internal decision inside and that should be the difference with everybody."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:35:49",
      "upperBoundTime": "00:36:24",
      "content": "Yes but you're serving a life sentence in Louisiana. And unless things change you I'm sure you've thought about the fact that you may never leave here. I find that difficult to get my head around. And yet people are dying here in hospice. How do you deal with that possibility?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:36:24",
      "upperBoundTime": "00:37:33",
      "content": "Well the first is a Reality. They say die in prison. It's a reality. They say $$ in prison. But I deal with it because I believe what God say. I believe that's not God's plan for my life. I believe God allowed me to come here. Why because I have purpose."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:36:24",
      "upperBoundTime": "00:37:33",
      "content": "I wasn't tapping into my purpose. I wasn't being the leader that I was supposed to be. I was leaving for the wrong reasons. And I was leading unconsciously. But I believe God allowed all things- the Bible says all things work together for the good."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:37:33",
      "upperBoundTime": "00:37:44",
      "content": "Do you ever think it's possible that God's plan for you is to stay here and Mentor these young guys for the rest of your life?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:37:44",
      "upperBoundTime": "00:39:17",
      "content": "Well at times I question that I question that but I get so caught up in helping someone else to change helping someone else to get out to where I don't even question God you won't let me die here. I just have hope. And what he showed me. I have hope that he will deliver me I have hope that he will change the laws that's in my favor and that's in the favor of others who have changed internally."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:37:44",
      "upperBoundTime": "00:39:17",
      "content": "And I just have hope that I know the Bible said a king's heart is in his hand and he turns them whichever way he pleases so I have hope in the word and what the word says about me. So in that in-between time I'll do what I'm called to do and that's to help men. And I'm doing that now this is intervention but I'm looking forward to prevention becauseCuz this is what I plan to do when I get out of here."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:39:17",
      "upperBoundTime": "00:39:23",
      "content": "Let's talk about that. What do you how do you envision your life if you were to be released?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:23",
      "upperBoundTime": "00:39:28",
      "content": "Well when I get released."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:39:28",
      "upperBoundTime": "00:39:31",
      "content": "When you get released."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "I believe that the answer to the problem out there with young guys with the culture the answer to it is right in here. And I'm part of the answer. And I plan on everything every class every part of the program that we are instituting here facilitating here I plan to try attempt to reach for to strive for, I plan and I let nothing get in my way"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "40:25"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "I'm trying to Institute that out there. I plan on taking the influence that I still have I really I still have it I realize they got people come to the rodeo to see me. I had a guy years ago told me I asked him what's going on out there?there."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "Why are they killing up everybody what's wrong on with the young generation? He said man that we can't do they don't want to listen to us I said why? I said y'all need to do something about it. He told me we need to start bringing them here. I said why? They need to hear y'all story. You can't do nothing about it since you're not going to step up and take a chance for them I said we are leaders leaders we are leaders God has chosen us to be leaders for the benefit of others not for ourselves I said I'm a leader why?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:39:31",
      "upperBoundTime": "00:42:08",
      "content": "For the benefit of others so I say you can bring him here I'll talk to them. And what I realize is a lot of people starting to come to the rodeo to hear our stories. And they're realizing that it's not where you want to be a man this is your destiny. And more and more I'm realizing that I'm still a leader from prison."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:42:08",
      "upperBoundTime": "00:42:28",
      "content": "Sure. So Whenwhen you first came here there were probably different things that would be considered the worst part of the prison experience. What's the purse part of being in prison for you today?"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:28",
      "upperBoundTime": "00:42:33",
      "content": "Here? Or the worst experience I've had since I've been in prison?"
    },
    {
      "speaker": "K:Marcus",
      "time": "00:42:33",
      "upperBoundTime": "00:42:37",
      "content": "Well maybe you can tell me that."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "I think the worst experience I had since I've been locked up was in 96. My mother shortly after I came here my mother caught an aneurysm. At the time my mother was all I had besides my kids. I didn't have nobody else coming to see me besides my family. My mother was my support."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "Then she caught an aneurysm. And I knew that she caught an aneurysm because of me. I had put my mother through all kind of stuff So when my sister come up here and say my mother caught an aneurysm and she had been died twice they saved her twice. She might not make it again I remember it so clearly that can't be."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "I walked out from the visiting shed saying mama ain't going to die No it's all I have mama ain't going to die. And sometime later I had got a court order I was going back to court post convictionpost-conviction and my lawyer at the time had gotten me a special visit. Now my mother was out of the hospital I got a special visit behind the glass and I'm looking at my mother that I've never seen in this situation that I never envisioned dying twice she had died a third time after the visit."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "Yet months later when I get the court order I'm looking at my mother come to the glass now this is a mother that I see for the first time. Her hair is not done she has a big scar on her face her face iss"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "45:15"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": ""
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "Downsideddown-sided because she was paralyzed on one size. Walking with a cane for the first time and she comes up to the glass knowing how I'm feeling and looks at me straight in the eye and try to smile. When she smiled it makes it more real that she's paralyzed."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "And after asking how she doing and her being ashamed to tell me how she doing worrying about me in that particular moment instead of herself she tells me that she says you heard I died 3 times they save Me 3 times I said you'rea mom you wasn't going to die and even now I'm kind of feeling jittery every time I share this story but it's all right my mother look at me in the eye never started before and she said I I couldn't just dieddie and leave you in prison man I heard that. That tore me up. I heard that for a long time even after coming back off the court order."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "And every time I heard it I wasn't changed at the time. I didn't know how to deal with what I was feeling so at the time every time I heard it I was lashing out. I was lashing out. I couldn't deal with it. I was planning lashing out and causing more trouble for myself. But I thank God for 2005, 2005 everybody know about Katrina. Angola was a dark place 2005. Everybody know about Louisiana was a dark place 2005. I'm from Lafayette I wasn't affected like the people in New Orleans but by the time 2005 I had accumulated a lot of friends here grew up with them here."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "So their pain was my pain this was a dark quiet place. Free folks are skeptical of saying anything. Why? Because you don't want to start no trouble at a time like this. Guys don't know if they families are alive or not so in this dormitory at Camp C Several guys got death messages."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "I had one particular guy I was close with got a death message and they invited him to church and I've had a lot of inmate ministers come try to talk to me but you know I would I wasn't ready for that but that particular night when my partner got a death message and was invited to church I said I was going to go with him to support him and to be nosy."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "Because I wanted to see all these guys in church that used to try to talk to me. I wanted to see now what y'all doing in there but I wanted to support my friend. Little did I know God was using that experience to call me to him.him? And after some time after the service started and we in worship I'm lifting my hands and I'm crying. I didn't know what was going on. I understand it now. God use that situation to call me."
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "50:13"
    },
    {
      "speaker": "SA:Sidney",
      "time": "00:42:37",
      "upperBoundTime": "00:50:20",
      "content": "And from that day in 2005 to this day August 15th 16 I've never looked back. I've never looked back."
    },
    {
      "speaker": "K:Marcus",
      "time": "00:50:20",
      "content": "That's a good place to stop."
    }
  ]
}
