{"name":"","transcript":[{"content":"Solomon Birdsong Jr._ Transcription REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"Would you mind, just for the record, stating your name, the crime of conviction, your age at the time, and how long you have served up to this point."},{"speaker":"Solomon","time":"00:00:12-1","content":"Solomon Birdsong Jr. I was convicted in 1982, well I was arrested in 1982 but I was convicted in 1984 of first degree murder, killing Phyllis Bratton in a pizza hut restaurant. Up to this day I've been incarcerated, February will be 37 years."},{"speaker":"Marcus","time":"00:00:36-3","content":"Okay, and so I said earlier, the purpose of this is just to learn about your life. And so, maybe you can start by telling me a little bit about the folks that you, that you came up, or the folks that raised you?"},{"speaker":"Solomon","time":"00:00:49-3","content":"My mother and father. Which both are still living today. I just talked to them the other day on the phone, they doing well. Mom just had a knee replacement surgery so she's going to her therapy 3 times a week. But they met at Southern University and my dad is a retired junior high school principal. And, his parents were, well you could say he was the son of sharecroppers. So he always pushed for me to excel because he felt like that's what he had to do. He used to tell me all the time I had it good, I didn't realize how good I had it."},{"speaker":"Solomon","time":"00:00:49-3","content":"He said when he was growing up he didn't have but one pair of shoes and when he came home from school he had to take them off to go outside and play. So he used to tell me all the time I didn't appreciate what I had. But a lot of times when you have something there all the time, you take it for granted, so it's not something you really, really think about. You just go in the closet and get you a pair of shoes. He always used to instill in me you work hard, work hard, and work hard."},{"speaker":"Solomon","time":"00:00:49-3","content":"But I was like, work hard for what? Everything right here. So anyway like I said, he was the son of a sharecropper, I think his dad or his grandfather was like an ex deputy sheriff or something like that. But anyway he was one of the few in his family, he had 11 brothers and 4 sisters. His family was big. Now my mom's side was the opposite she just had 2 sisters. One of them died young."},{"speaker":"Solomon","time":"00:00:49-3","content":"So anyway, they met at Southern University and he was one of the few in the family that went to college. He graduated from Southern University in Baton Rouge. So and him pushing to excel, he wanted me to excel, also. But most times I let him down because most times I didn't take life or many things for reality, I took it for granted, and I didn't take it for what it was. He used to say there's a whole world out there, people not going to give me anything."},{"speaker":"Solomon","time":"00:00:49-3","content":"So he would always push me to do the right thing and to be a better person. And like I'm telling you now, I was like, enough to get by. That's what I felt, just enough to get by. So like I said, he and my mom met at Southern University. She's from the Baton Rouge area, New Roads. And my dad is from Shreveport."},{"speaker":"Marcus","time":"00:03:12-4","content":"And where did you grow up?"},{"speaker":"Solomon","time":"00:03:14-4","content":"In Shreveport. But I was born in, Jonesborough. And that was only because, when my dad got out of college, you do a little intern when the teachers start teaching somewhere? Well, that's where he began teaching at, in that area right there, so I was born there."},{"speaker":"Marcus","time":"00:03:29-6","content":"And is this Jonesborough, Arkansas?"},{"speaker":"Solomon","time":"00:03:31-6","content":"Louisiana."},{"speaker":"Marcus","time":"00:03:32-3","content":"Okay, cause there's a Jonesborough in Arkansas."},{"speaker":"Solomon","time":"00:03:33-6","content":"Yeah, it's up north toward Shreveport, up in that area, probably about an hour or so away. So my dad majored in biology, and he later on because a school principal. And mom, she was, well she was going to school, and she ended up getting pregnant with me. And so that cut that short and she ended up raising me."},{"speaker":"Marcus","time":"00:03:54-9","content":"What about siblings? Do you have any siblings?"},{"speaker":"Solomon","time":"00:03:56-8","content":"I have one younger brother, he's 3 years younger than me. He's living in Texas right now. He's a machine operator."},{"speaker":"Marcus","time":"00:04:03-0","content":"Okay, and are they able to come visit you, still to this day?"},{"speaker":"Solomon","time":"00:04:07-6","content":"Yes!"},{"speaker":"Marcus","time":"00:04:08-0","content":"Okay, alright. And you maintain a good relationship? I mean it seems you just talked to your parents."},{"speaker":"Solomon","time":"00:04:14-1","content":"Yes."},{"speaker":"Marcus","time":"00:04:14-7","content":"What about with your brother?"},{"speaker":"Solomon","time":"00:04:17-7","content":"I'm not gone say it's nonexistent, but it's not often that I do talk to him. I mean, he was arrested with me on this charge, and it was my, I guess you could say, it was my brainchild, trying to bring him into this situation that got in prison now. And I think, to an extent, he holds a little bit against me for that, because I kind of messed his life up a little bit."},{"speaker":"Solomon","time":"00:04:17-7","content":"But my dad is happy for him now, because he carried himself. Like I said, he's a heavy machine operator, and my dad is kind of like, he kind of proud over that. And then on the flip side, I let my dad down because everybody in the family was like, \"Junior going to do this, Junior going to do that, Junior's so smart.\" And true enough, I was going to school and I wasn't really studying a lot but I was doing well."},{"speaker":"Solomon","time":"00:04:17-7","content":"Now, I if I had really done what my dad wanted me to do, I probably would've excelled, but I didn't because, it was like 'Why?' So I feel like my brother holds a little, animosity, might be a little too strong but, a little resentment toward me."},{"speaker":"Marcus","time":"00:05:46-6","content":"Right, I understand. It's complicated. So is it accurate though, I'm assuming this, you grew up in a home knowing you were loved and cared for, there were adults there taking interest in you and nurturing you? Was there any fighting in the house? Was it a peaceful place for you coming up?"},{"speaker":"Solomon","time":"00:06:10-6","content":"The only fighting might've happened, would've been, again, because of me. And that was me probably trying to be a little professor. I knew my dad was strict. So if I knew my dad didn't' want me to go outside and play, I wouldn't ask him. I'd go and ask mom. And I'm not looking way up the road thing, that this was going to cause a conflict and so I would ask her, and she would say yeah."},{"speaker":"Solomon","time":"00:06:10-6","content":"My dad might come home and say \"What are you doing outside? You should be inside doing your homework.\" or something, and them two would start arguing with each other. And then I would feel bad about that because I grew up closer to my mom but my dad, being so strict, I kind of like, shied away from him."},{"speaker":"Solomon","time":"00:06:10-6","content":"But really, if you look at in retrospect, he probably loved me more than my mom did because he wanted the best for me. But I didn't see it like that. I didn't see it like that until after I was incarcerated, that he really did care for me. I just always figured he was just being hard and really hated me, but it was the opposite. And so I felt bad because Mom and Dad would always argue, and it was because of me. But Like I said, I didn't realize that until a lot later."},{"speaker":"Marcus","time":"00:07:28-6","content":"And would that arguing ever get physical?"},{"speaker":"Solomon","time":"00:07:31-8","content":"No."},{"speaker":"Marcus","time":"00:07:33-8","content":"And there's no physical abuse or sexual abuse in your history?"},{"speaker":"Solomon","time":"00:07:36-8","content":"No."},{"speaker":"Marcus","time":"00:07:37-2","content":"Okay. Can describe your home? I'm trying to get a mental picture of it. Because I'm in Shreveport, it has a kind of urban piece to it, but there's also a very rural piece to it. Where were you? Let's say I was standing on the stoop of your home, looking out into the neighborhood: what would I be seeing?"},{"speaker":"Solomon","time":"00:08:01-0","content":"Our first house, I guess you could say was in the country area where houses were spaced far and there were a lot of large yards and small wooden houses and green grass. I mean like the houses were about two bedrooms, real small wooden houses. And then, I think it was '76, we moved to a subdivision where they're living at now."},{"speaker":"Solomon","time":"00:08:01-0","content":"I think at that time I was in junior high school, just started junior high."},{"speaker":"Solomon","time":"00:08:01-0","content":"And this was a large subdivision where everybody in the neighborhood is like doctors and principals and stuff like that. So the houses there are like 2 stories, 3 or 4 bedrooms, 4 cars in the driveway and what not. A sidewalk, streetlights. So that was a subdivision so."},{"speaker":"Marcus","time":"00:08:58-8","content":"Sure, I get the picture."},{"speaker":"Solomon","time":"00:08:59-5","content":"It wasn't one of those crime areas, it was one where you could leave your door unlocked."},{"speaker":"Marcus","time":"00:09:04-2","content":"Yeah. So did you attend the same junior high school that your father was the principal of?"},{"speaker":"Solomon","time":"00:09:09-9","content":"No, but a lot of the teachers knew it."},{"speaker":"Marcus","time":"00:09:15-3","content":"Sure, I guess it's hard to be a principal's son. Any particular memories of teachers that still stand out to you today? A teacher that took an interest in you?"},{"speaker":"Solomon","time":"00:09:30-4","content":"Well, one, Mr. Cooper, he was my, like industrial arts, science teacher. And he was always-he would always go through the students and mess with them like, 'you going to be a firefighter, you going to be a police.' And he used to always say I was going to be a teacher. And I'm like 'I'm not going to be no teacher, I don't want to be no teacher.' And years after I was here and there and gone, been to Philly at the clubs and whatnot, guess what? I found myself teaching. It might not have been at school, but I was in here teaching."},{"speaker":"Solomon","time":"00:09:30-4","content":"I thought about that, I said \"Yeah, he had me right\" I was gone end up being a teacher. So up here I've done taught a lot of classes for the JC and what not. Self-help classes. And I had another one, she taught biology. That Ms. Logan. And she knew my dad well. And she used to always get on me about just doing enough to get by."},{"speaker":"Solomon","time":"00:09:30-4","content":"She would tell my dad all the time, and we had one, when I was a little younger, Ms. Mersion. She was my godmother because I was born catholic. And she gave me my first spanking in school. I threw some little boy cap out the window, she told my mom and then she spanked me in front the class. I was so embarrassed."},{"speaker":"Marcus","time":"00:10:52-9","content":"Yeah, I imagine. Was there a lot of fighting at school? Did you find yourself getting into fights?"},{"speaker":"Solomon","time":"00:10:59-5","content":"I got into 2 fights at school, and both of those were behind my brother. Somebody was picking on my brother. One day we was in elementary school. We had just went from Catholic school and they transferred me and my brother to public school because my dad felt like we weren't achieving or excelling as we should. So about the first, probably maybe about second week of school somebody was pulling on my brother and I saw him and I tripped the dude up and we had a fight."},{"speaker":"Solomon","time":"00:10:59-5","content":"And then another time in junior high school, it was behind, but the school itself, it wasn't really fighting. Maybe during junior high, during that time when the movie 'Roots' and stuff came out. They had a lot of fighting then, it was blacks versus whites fighting."},{"speaker":"Marcus","time":"00:11:54-5","content":"Did you graduate from high school?"},{"speaker":"Solomon","time":"00:11:56-4","content":"Yes, yeah."},{"speaker":"Marcus","time":"00:11:57-3","content":"Because you were 19 when this happened?"},{"speaker":"Solomon","time":"00:12:00-1","content":"Yes."},{"speaker":"Marcus","time":"00:12:02-5","content":"Were you ever kicked out of school?"},{"speaker":"Solomon","time":"00:12:03-6","content":"No. Nah, later on at college I was put on academic probation."},{"speaker":"Marcus","time":"00:12:03-6","content":"Where did you start college?"},{"speaker":"Solomon","time":"00:12:12-8","content":"At University, Southern University in Baton Rouge, in 1982."},{"speaker":"Marcus","time":"00:12:20-0","content":"Okay, and did you finish your freshman year there?"},{"speaker":"Solomon","time":"00:12:23-6","content":"I finished freshman year. I graduated from high school 1980- so my last year would have been in 1982. So I did 3 semester."},{"speaker":"Marcus","time":"00:12:30-5","content":"Three semesters?"},{"speaker":"Solomon","time":"00:12:31-4","content":"Yes, and I majored in architecture."},{"speaker":"Marcus","time":"00:12:33-3","content":"And then this happened?"},{"speaker":"Solomon","time":"00:12:35-7","content":"Right. Because I got on academic probation, and I'm around the house, I wasn't doing anything."},{"speaker":"Marcus","time":"00:12:42-4","content":"You had to take a semester off?"},{"speaker":"Solomon","time":"00:12:44-0","content":"Yes, and I ended up in this."},{"speaker":"Marcus","time":"00:12:46-3","content":"I see, okay. What about any intimate relationships that still stick with you, before coming here? Or before this happened?"},{"speaker":"Solomon","time":"00:12:56-9","content":"I had a lot more female friends than I did male friends. I guess a lot of the girls looked at me like I was a little brother. Like it felt like they were just safer around me or whatever. But I had one that we were real close and when I was in college we were still together. We were talking about getting married and this, that, and the other, and unfortunately I messed that up. She ended up becoming a farm assistant."},{"speaker":"Marcus","time":"00:13:21-8","content":"Oh, okay, alright. Any children?"},{"speaker":"Solomon","time":"00:13:24-2","content":"No."},{"speaker":"Marcus","time":"00:13:25-0","content":"Okay. You had no prior arrests when this happened? So can you make sense of this for me?"},{"speaker":"Solomon","time":"00:13:38-9","content":"You ever heard that saying sometimes what was that saying about \"Always the preacher's daughter that's the wildest one?\" Well in my situation, I guess I got loose after going to college. Because before then, I was always sheltered and protected. Dad made all the decisions for me. If I went outside, if I didn't go outside, if I ate with him or where, my hair, how long my hair was going to be. He made all the decisions for me. And I was protected from drugs and all that."},{"speaker":"Solomon","time":"00:13:38-9","content":"I never saw all that all the way up to high school. I didn't start seeing that until college, because then I was around dudes from, I was in a suite, we had dudes from Texas, Memphis, Tennessee, all over. And so some of them were using drugs and that was the first time I saw it or smelled marijuana, it was because my phone went out. And so I had to go into the next room to use their phone, and while I was in there, they were smoking."},{"speaker":"Solomon","time":"00:13:38-9","content":"So on my way out, they were asking me did I want any and I said no. And they kept questioning me and I guess they realized that I had never smoked before. So I guess they realized I was going to be the entertainment that night. They kept messing with me and I finally smoked some. But it didn't really phase me, it wasn't like I wanted to smoke or anything. But what flipped was, I didn't start smoking, I started selling it."},{"speaker":"Solomon","time":"00:13:38-9","content":"Because now I see that's where all the focus is they got all the attention, the dudes that were selling drugs and doing this, that, and the other. And so before long, I started not going to classes as much as I wanted, as I was supposed to. My first semester, I did well. I was on the little honor roll for the architecture department."},{"speaker":"Solomon","time":"00:13:38-9","content":"The second semester I was so, my grades had started going down. But that third semester, I started going to little parties and whatnot and not going to classes and ended up going on the academic suspension. And that's when I was like, making the wrong decisions. And I guess you could say in retrospect, my dad should have been making decisions for me. Because I was making the wrong decisions."},{"speaker":"Solomon","time":"00:13:38-9","content":"Because I'm thinking the world and stuff is well everything was there. You see on TV the people carrying guns and selling drugs and everybody flocking around them and whatnot. They like, celebrities. And I migrated like, today that was what I wanted. And really that was the worst thing in the world. I should've just been like the old square. Because when you go to surgery, you want a square working on you, doing surgery. You don't want no dope head."},{"speaker":"Marcus","time":"00:16:30-3","content":"Well, you weren't a dope head."},{"speaker":"Solomon","time":"00:16:33-0","content":"No, but I was just saying someone that's off into that life, though. You want somebody that's going to be stable and sane."},{"speaker":"Marcus","time":"00:16:39-7","content":"Were you supporting yourself selling marijuana?"},{"speaker":"Solomon","time":"00:16:41-6","content":"Beg your pardon?"},{"speaker":"Marcus","time":"00:16:42-6","content":"Is that the primary way that you supported yourself?"},{"speaker":"Solomon","time":"00:16:42-6","content":"No, and I didn't really need the money. That's what was so exasperating about this situation. When I was arrested for this charge, everybody was like, \"What'd he do it for? He didn't need anything. Look where he living', look what his parents do, look at his uncles and aunts, all of them are doing well\" So, it was more me trying to impress others. It was myself putting myself under peer pressure. I didn't have to try and rob. I mean, whatever I needed or wanted, I had it."},{"speaker":"Solomon","time":"00:16:42-6","content":"My dad I was the only one in my neighborhood that had a car in high school. I drove every day to high school and everyone either rode with me or rode the bus. So it wasn't like I needed money it was just me trying to be accepted by a lot of people, who, I thought were my friends. And my dad used to try to tell me \"Oh they don't care about you, they only care about what you have\" But I wasn't listening. I figured he didn't know what he was talking about."},{"speaker":"Solomon","time":"00:16:42-6","content":"And a couple times, not long before I got arrested, he would say the same, and I was- it was in one ear and out the other. But years later, after I got here, I realized a lot of the stuff that he was saying was true. Like my mom would say 'you start lying, you start stealing. You start stealing, you start killing.' And life, that stuff snowballs like that. Because like, they might have asked me \"Where you been.\""},{"speaker":"Solomon","time":"00:16:42-6","content":"I'm going to tell a lie. \"What you been doing?\" I'm gone tell a lie. And it was to coverup another lie and that's what ended up happening. I wanted to please the people that wasn't really in my corner, instead of realizing that everything I needed was at home."},{"speaker":"Marcus","time":"00:18:36-1","content":"So this particular incident, you thought that it would impress some of your friends?"},{"speaker":"Solomon","time":"00:18:40-9","content":"Because they were doing it, and I'm listening to them telling stories about how they was in Texas, pulling off the little fake robberies at McDonald's and all that. They have somebody that they know working there and pull up like they gone rob it but, all in all, they weren't involved in and that's how they were getting their money. And so I started carrying a little pistol, thinking I needed one and whatnot, and one thing just lead to another."},{"speaker":"Marcus","time":"00:19:06-2","content":"Okay. Let me ask you this if you didn't do this, this thing never happened. Let's say you get back in school after this semester probation. How do you think your life would have continued? Do you think you would have continued going down this wrong path, or? What do you think? I know you can't know for sure but how do you imagine your life would have continued?"},{"speaker":"Solomon","time":"00:19:35-3","content":"Initially, and had I done what my dad wanted me to do, I probably wouldn't be here. But the week that I was arrested, I pulled this- tried to rob this Pizza Hut that was a Tuesday I think. That Monday, I was supposed to go to New Orleans. I had took a pre-test for the Air Force and I passed the test. And that Monday I was supposed to go to New Orleans to do the rest of it. And had I went, I wouldn't have been in Shreveport to do the robbery."},{"speaker":"Solomon","time":"00:19:35-3","content":"But at the same time, I'm thinking, \"Dad don't want me around, he being' mean, he trying to get rid of me and trying to put me in the Air Force\" But really he felt like, had I went there, that would allow me to mature as a person and decide what I wanted to do in life. Even though I said I was going to school for architecture, it was like, once I got to school, my focus shifted and he felt like I'm still young, I don't know what I want to do, I need to see the world and whatnot."},{"speaker":"Solomon","time":"00:19:35-3","content":"And that was his way of sending me somewhere where I could grow up and raise my level of values and whatnot and I chose not to go and this ended up happening."},{"speaker":"Marcus","time":"00:20:56-3","content":"Yeah, well, so, I want to switch gears a little bit and talk about the life that was unfolded for you because of that one event. But, before I switch gears could- Is there something about your first 19 years of your life that's really important about who you are today or what had happened and that we didn't get a chance to talk about? Anything else that stands out as a pivotal experience for you?"},{"speaker":"Solomon","time":"00:21:32-1","content":"Well, like I said, I'm momma's baby and I've never hurt my mom, cursed, she never drank or smoke, and to the best of my knowledge, my dad is probably the only man she's known. She's religious. And I think I pick up- I mean, put this charge to the side, I believe I picked up a lot of her values because today, if you ask anybody, they going to say, \"Go to Birdsong, Birdsong will help you. Birdsong will get you. Birdsong goes to church. He tries to help people. He's not trying to hurt nobody."},{"speaker":"Solomon","time":"00:21:32-1","content":"I mean, people be wanting to give me their phone numbers, their combinations to their locker boxes and I be like \"I don't need to know all that\" But people trust me. And my mom was always preaching that you always want people to trust you to be able to feel comfortable around you and if you ask anyone, they tell you they can trust me and I'm willing to help any and everybody. I mean, I put myself last sometimes to help people."},{"speaker":"Solomon","time":"00:21:32-1","content":"Sometimes I get frustrated, but I be like, no, God wouldn't want it that way, God sends people to you for that reason, you have, I mean, even now I've never had to like go to the kitchen and eat if I didn't want to. I mean whatever advantages and things at my disposal so, it's like I could help feed other people. I could help clothe other people just like it was before I come to prison. I don't really, I don't want for anything. I mean, my family, and I helped take care of myself here and God and them looking out for me."},{"speaker":"Solomon","time":"00:21:32-1","content":"So I believe that's what I picked up from my mom to like just stay good. It's almost like that Karma, you do good, good come to you. You do bad, bad come to you. And I always live by that just to continue doing well. And I try to I always try to help people out. I mean, sometimes it be frustrating I'll do whether I want to or not sometimes, but it's just in me and people tell me all the time, there ain't no bad in you. You somebody going to ask you to do something and they might of messed over you, you going to come back and help them anyway."},{"speaker":"Solomon","time":"00:21:32-1","content":"And I find myself doing that. I tell myself, I'm not going to help him no more, he don't appreciate it and they come going to come back a month later and I'm going to help them again."},{"speaker":"Marcus","time":"00:24:11-2","content":"Okay, so, I imagine then, there are some people who are in and out of juvenile system, spend some time in parish jails, and then they find themselves here at Angola is one common path. For you, you must have just felt like this fish out of water."},{"speaker":"Solomon","time":"00:24:35-5","content":"I didn't really know what to feel. I remember when I was in the parish jail, I didn't know the consequences of the charge. I was on a capital offense charge meaning I was facing the death penalty but, I didn't know it. I'm in the parish jail and dudes were making jokes and fun of me and I didn't really know they were doing it."},{"speaker":"Solomon","time":"00:24:35-5","content":"They were being like \"yeah, they going to get you\" and they were making the sounds like the electric chair like \"buzz\" \"buzz.\" \"They going to get you, this that and the other\" and I heard and other dudes were saying stuff like \"Man, you're facing more time than any of us in here put together.\""},{"speaker":"Solomon","time":"00:24:35-5","content":"I didn't realize it because I never knew anybody that had dealings with the penal system. Nobody in my family had been to jail before. I've never visited a jail. I didn't know anybody in jail. So, while I'm in the parish jail, I'm hearing all this but, I didn't know the repercussion and the consequences of what I had done. And even though I spent like about a year and a half or so in the parish jail, even after I was convicted and given a life sentence, I still didn't comprehend what that actually meant."},{"speaker":"Solomon","time":"00:24:35-5","content":"It was years later and it was like I was walking in a fog and all of a sudden, I'm like man, I'm never going home. And I'm like what have I done? And now I'm like, I'm seeing people that's been locked up 20 and 30 and 40 years, but initially I was like \"I'm going to get out, I'm going to get out, so\" but it was like I'm looking for a miracle that's not going to happen and I didn't realize when the jury said life, it meant I'm going to be here the rest of my life."},{"speaker":"Solomon","time":"00:24:35-5","content":"But, like I said, I didn't realize that then. It was years later and it just dawned on me. You're not going nowhere. You're not going home to Mom and Dad. You're not going to be choosing where you're going to sleep at or what you're going to do. So, like I said when I was in the parish jail, I didn't realize that all that that they were saying was actually true."},{"speaker":"Solomon","time":"00:24:35-5","content":"They were telling me, man's you're facing more time than anybody in here, they were probably in there for, I don't know, J-walking, kickboxing or something, there. They would probably do a couple years and get out. But, me, I wasn't ever getting out and I didn't realize that."},{"speaker":"Marcus","time":"00:27:08-6","content":"Sure. Do you remember the bus ride to Angola?"},{"speaker":"Solomon","time":"00:27:14-1","content":"Yes."},{"speaker":"Marcus","time":"00:27:15-2","content":"What was going on in your mind?"},{"speaker":"Solomon","time":"00:27:18-7","content":"I remember when I was leaving, my mom and they had come to see me the same day. And on the way out, well, they wouldn't let them in because they told me they were going to send me here."},{"speaker":"Solomon","time":"00:27:18-7","content":"So, I didn't get a chance to see them, initially at that point, but I was on the bus coming this way and we out and passed them up on the highway on the interstate and I remember looking down and I could see my mom and dad in the car and they were taking me away, I'm like I done really messed up now, that this was something that they couldn't get me out of even though I wasn't one that was always getting in trouble because I had never been expelled from school, or suspended or anything like I never even missed a day from school."},{"speaker":"Solomon","time":"00:27:18-7","content":"And so, we passing them on the interstate and I'm looking down at the car, and I could see my mom crying, my dad, he wanted to cry but he always tried to hold it in and I'll never forget that day. But I didn't know where I was going and when I got here, I didn't know a thing about prison, I didn't know what to expect. Dudes be making jokes about it they'll do this and do that to you and I wasn't afraid when I got here because I didn't know what to expect anyway."},{"speaker":"Solomon","time":"00:27:18-7","content":"I wasn't thinking somebody going to be trying to approach me with a knife or anything like that or whip so I never was scared. So people used to ask me years later, \"Were you scared?\" And I'm like, \"No.\" And they're like \"Oh, you lying, you lying.\""},{"speaker":"Solomon","time":"00:27:18-7","content":"But I wasn't lying. I wasn't scared because I didn't know what to expect. As far as I was concerned, I was going to a boot camp or something how you go to those summer camps from school or something, right? Far as I was concerned, that's where I was going, but like there, I didn't know what to expect because I never knew anything about all of this. So, I wasn't scared."},{"speaker":"Marcus","time":"00:29:33-5","content":"I'm sorry to bring that memory back to you like that. When you got here, I assume they put you in a working cell block. Did you- did they send you into the field? What was that like?"},{"speaker":"Solomon","time":"00:29:46-6","content":"Yes, they sent me right over to A block and I got here at night, so, the ride from AU used to be at the front camp where you came in at. And so we stayed up there a couple of days and at night they brought me in and so, it's coming down. And coming down gets real dark and all I see is a lot of lights they have this way and I'm thinking \"where am I going, this look like a big old city.\""},{"speaker":"Solomon","time":"00:29:46-6","content":"So, we get to the cell block area, and I go in, they bring me in the A block and it's like dark. You would think it would be lit up so security could see and what not but, it's real dark. And they put me, I was downstairs, and I'm passing the shower."},{"speaker":"Solomon","time":"00:29:46-6","content":"They had people in the shower. And they stuck me in a cell by myself well, I wasn't by myself."},{"speaker":"Solomon","time":"00:29:46-6","content":"The person I was in the cell with, they called him Jesus, but he was in administrative lockdown, we call it the dungeon, so, for a while, he wasn't ever in there. I was in there by myself. And I remember dudes, they got what they call little peepers, little pieces of mirror, and dudes stick it out on a toothbrush or something so they can see up and down the hall and he kept sticking it out trying to talk to me, trying to see me in the cell."},{"speaker":"Solomon","time":"00:29:46-6","content":"And I kind of got to offended and I asked him what he kept sticking the thing out there for. I think his name was Scooby Doo. He's still here now. And so, the next day, that was a Thursday, so Friday we go in the field. So I been in the parish jail for 2 years with no exercise and we had to walk all the way back to the Camp C. So, the walk there was no problem, and we were doing it doesn't make any sense but, security does keep busy they say keep the inmates busy so they don't get into anything. And we were moving dirt from one pile, like 100 200 yards over this way just spreading it out."},{"speaker":"Solomon","time":"00:29:46-6","content":"So, it's time to come in, and my legs were burnt. I couldn't walk no more and Andres Serena was on one side of me and Ronny James, we called him Rocky, Rock head they had to literally, just carry me in because we were like it seemed like about a mile from the cell block area and they put me in between them and had to carry me the rest of the way in. That's how I had my legs out of shape."},{"speaker":"Solomon","time":"00:29:46-6","content":"So they told me, they brought me outside that weekend and made me just walk, walk, walk, to build my leg strength up. But, the cell block area was like it was loud, it stayed dark a lot, people making all sorts of noise. But, fortunately for me I was in a cell by myself even though I had somebody assigned in there with me, he was just, not in there, and it helped me to like focus a little bit."},{"speaker":"Solomon","time":"00:29:46-6","content":"And I stayed there, I think about 9 months. And I had a few fights in there because once you get there they want to try to see how you are. So I'm on the basketball court, and dudes were just swinging his elbows real hard just to see if I was going to throw up or anything like that."},{"speaker":"Solomon","time":"00:29:46-6","content":"But, like I said, I didn't know to be scared. I didn't know they were playing these types of games with me to see where my head was at. I'm just thinking them playing rough basketball. I just used a little common sense, when those two games was over, I just didn't go back out there. And so a couple of them, like when we are in work lines, they wouldn't do the work well, \"I ain't going to do it, you don't do it\" we got to go to the dungeon or something like that and I would do the work and then I got into a couple of arguments and a couple of fights but, it wasn't nothing real major during that time."},{"speaker":"Solomon","time":"00:29:46-6","content":"But, it was just a wild environment, I mean, they was off into whatever they was off into. Whether it was just smoking or gambling or whatever and it was just all new to me, so like, again, like I was saying, I just didn't know what to expect. I was just soaking it all in and mainly I just kept to myself with the exception of the two that helped me come in from the field, and Ronny James, he just went home last year and he was the first person I met when I came here and so for I guess you could say 35 36 years me and him were pretty close to each other."},{"speaker":"Marcus","time":"00:34:26-3","content":"Yeah, so do you managed to stay relatively safe when you first came here?"},{"speaker":"Solomon","time":"00:34:26-3","content":"Yes."},{"speaker":"Marcus","time":"00:34:32-8","content":"Yeah, that's good."},{"speaker":"Solomon","time":"00:34:33-7","content":"Just like I said, I wasn't."},{"speaker":"Marcus","time":"00:34:35-6","content":"Yeah, maybe ignorance was bliss at that point."},{"speaker":"Solomon","time":"00:34:38-1","content":"Right, it worked out in my best interest. So nothing really intimidated me."},{"speaker":"Marcus","time":"00:34:53-5","content":"So, as I said earlier one of the reasons that we're talking to folks like yourself is that you've been here so long. Can you tell me a little bit about some of the change that you have gone through? All of us would be different people after 37 years, but how specifically have you, in this environment, sort of brought some of the changes that you've gone through here. Tell me a little bit about that."},{"speaker":"Solomon","time":"00:35:19-8","content":"Well, I've, initially, first and foremost, I don't let peer pressure dictate what I do and don't do. My skin is a little tougher now where as when I first came, if somebody said they don't like my shoes, I was all bent out of shape. Not bent out of shape where I where I would physically do anything but, just bent out of shape where my feelings were hurt. \"Oh you don't like my shoes\" and so, that used to bother me a lot. I respect people's boundaries and opinions now. I realize now that human beings have a value."},{"speaker":"Solomon","time":"00:35:19-8","content":"Not saying I didn't have, didn't place no value on the human beings, I just took it for granted because had I really thought about it during that time, I would have pulled the trigger, but I realize that people are individuals and they have their own likes and dislikes and now I respect all that. And I try to help people now. I've realized now that human nature is- how could I say it- we take people at face value, I mean if they say their a police officer, they is a police officer, they are supposed to help. So, if someone I encounter somebody and they start talking to me and whatnot, I want them to be comfortable in my presence."},{"speaker":"Solomon","time":"00:35:19-8","content":"I want them to actually be able to trust and confide and talk to me. I realize now that nothing in life is just given to us. We have to work for what we have, I mean, some people may be born with a silver spoon in their mouth or whatever or in their hand, but I realize now that work. I don't have a problem with working I don't have a problem with being religious and open, some people want to pray in the corner or closet or whatever like that. I don't have a problem of whatever I feel or believe in the end just, expressing or showing it openly now."},{"speaker":"Solomon","time":"00:35:19-8","content":"I realize and respect and value family values now. Before then, like I told you about my dad, he was showing he showed me he loved me. He didn't tell me he loved me and I realize that now. That family is real important now. I don't take it lightly now. And I feel for the people who grew up without it like single parent homes and what not that grew up without who had to come off the porch or out of the womb and they had to probably rob and steal to feed themselves and whatnot so now, I value and I have sympathy for people like that now and if I can help them, I can, and mainly it's just being a good human being now a responsible human being."},{"speaker":"Solomon","time":"00:35:19-8","content":"And taking action or control of one's life and whatnot and being responsible for my actions. If I do something, okay, I got to take responsibility for it I need to think things out before I make decisions now, before I just prompt, I just do something without thinking of the consequences. Now, I think before I act now. I think before I open my mouth now and I realize now that words and actions can hurt people. And before I didn't realize that. I done try my best to not to even lie to anybody now."},{"speaker":"Solomon","time":"00:35:19-8","content":"My mom used to tell me that all the time about lying and it was like years later when I was here and people started lying to me that I realized how it hurt because you take a liking to the person, feel like they're a friend, and then when they lie to you about this that or the other, it really hurts. So, I try not to do stuff like that now and just try to be a good person."},{"speaker":"Marcus","time":"00:39:20-8","content":"Sure, can you describe what you're typical day is like here? What's your routine?"},{"speaker":"Solomon","time":"00:39:29-9","content":"I stay busy. Times changed now, so I'm working one job that I had was in the inmate canteen where we sell items to the inmates in the population, the food, the clothes, and items and what now. That opens up at 9:30 so, I normally wake up around 4, 4:30. I wake up, I read my daily prayer, I read the Bible, and our count usually clears around 6 that morning. I probably go, if the weather's okay, I will exercise a little bit for about an hour. I go to the hobby shop for about another hour or so."},{"speaker":"Marcus","time":"00:40:08-5","content":"What do you do there?"},{"speaker":"Solomon","time":"00:40:10-0","content":"I make leather goods, belts, wallets, little girl purses. Initially, I started doing a lot of stuff for little kids because nobody was ever doing stuff for little kids so I made little wallets with little cartoon characters on them. Little girl purses and paint them little bright colors, the pinks and whites and all that. But I do adult items also wallets and what not, bible covers."},{"speaker":"Solomon","time":"00:40:10-0","content":"So I stay in there about an hour and a half. I go to the dorm and shower. I go to work at 9:30. And the Canteen stays open till about like 6 so, I'm pretty much in there all day long. And I have another job where I go to the Angola Bank over here and I go on the inside and I clean that out like once or twice a week."},{"speaker":"Marcus","time":"00:40:56-2","content":"Okay, what is that?"},{"speaker":"Solomon","time":"00:40:59-5","content":"The Credit Union? It's like a little bank for the Angola security employees. Yeah, so, they trust me in the bank."},{"speaker":"Marcus","time":"00:41:10-0","content":"They trust you in the Canteen."},{"speaker":"Solomon","time":"00:41:10-7","content":"Yeah and most jobs I've had here have been even when I was in the main prison here, I worked right down the hallway in the education department. I was clerk for a long time. So was in that little circle with all of the other women working in there. And then I had the other job which is shift work, like, this work it'd be tonight and tomorrow, Wednesday and Thursday. And I do the food preparation for security, when they order food. Prepare their foods, put it on the tray and what not deliver it to them at the Camp or outside the Camp. So I stayed busy with that. So got those 3 jobs, I have the hobby shop, I exercise."},{"speaker":"Solomon","time":"00:41:10-7","content":"I just started studying Sign Language. I'm learning that and like you said, earlier, you can't really say I'm trying to rehabilitate because I come here having already attended college, so Angola didn't really have a whole lot to offer me other than the self-help programs and I've taken most of those two or three times and then facilitated a lot of classes. So, when I'm not doing those jobs, I'm studying a little sign language, I maybe exercise or the hobby shop…"},{"speaker":"Marcus","time":"00:42:33-3","content":"This is also a little bit difficult maybe, but its 37 years. Which by any stretch of the imagination is a lifetime. You've had so much time to distance yourself from what happened and yet it's this defining incident that's that sort of makes your life, your life here. When you look back on what happened and you look back on the impact it had on the victim, the victim's family, what are your thoughts about that now, so far removed from there?"},{"speaker":"Solomon","time":"00:43:09-0","content":"That I was being selfish at the time. I didn't think that killing Phyllis Bratton was a cruel act at that time. Really, at that time, I was just thinking of myself. I didn't want to get caught in an attempted robbery, that, by my own estimate was supposed to been a genius plan went a rye/all wrong and at the time, I was just thinking about myself. And not getting caught and I felt like killing her was going to keep me from not getting caught but at the same time, I didn't think then, that I'm going to take away somebody's mother, somebody's wife and daughter and what not."},{"speaker":"Solomon","time":"00:43:09-0","content":"And years later, after I got here, and went to thinking about it, like I said, one of the things that has changed me now is that I value human life now and at that time, I just, like, took it for granted. But, now, no. I wouldn't have done that had I done what I said I would do now and pause and think \"oh no, that's not the right thing to do.\" That's what I would have done."},{"speaker":"Marcus","time":"00:44:18-7","content":"What about the impact on your family? Obviously they felt like they lost a son. I know that was a painful memory. How are they, what impact did this have on them over the years?"},{"speaker":"Solomon","time":"00:44:37-0","content":"It hurts me because I realize now, in retrospect, that my dad actually did love me. I made that uneducated or foolish decision in my mind that he didn't care for me, that he hated me, when all along… you got millions of kids across the world where the love to have had what my dad was doing for me. But, I'm thinking he was being mean. I didn't take into account that he was putting a roof over my head and putting shoes on my feet and food in my stomach."},{"speaker":"Solomon","time":"00:44:37-0","content":"I wasn't looking at all of that. I felt like that's what he was supposed to do he's my dad. But, he didn't have to that and he was doing that and that's what really hurts because they did care and love me and I just didn't realize that. I'm sorry I forget the last question."},{"speaker":"Marcus","time":"00:45:37-1","content":"No problem at all. I was asking you about the impact of you of what you did and coming here how that's impacted your family over the years."},{"speaker":"Solomon","time":"00:45:49-8","content":"To this day, they still love me. Thank God. Because they could have easily turned their backs on me. They showing their love for me, I mean, like I said, 37 years later- they could have stopped after 5. They could have stopped after ten or 15 and just said we tired, but they haven't stopped."},{"speaker":"Solomon","time":"00:45:49-8","content":"So, I'm appreciative for that, but what really hurts is when I was arrested, I saw the newspaper. They had on the incident and they had the cooler murder because they found the body in the cooler, but what really hurt was they said \"Son of Prominent School Principal Kills Pizza Hut Attendant,\""},{"speaker":"Solomon","time":"00:45:49-8","content":"And that's what really hurt because now, he's the focal point of society and they don't see me. They just going to probably just read about me but he has to get up every morning, go to the grocery stores, go here, go there, and they seeing Mom and Dad. They not seeing me."},{"speaker":"Solomon","time":"00:45:49-8","content":"They had to put up with what I did all day every day and probably to this day they still putting up with it because it's no secret that I'm here so they seeing- oh that's the lady they'd son is in prison and all that. They got to put up with all this so. Really, they probably feeling it more than I am and that's what hurts me that I'm bring all of that shame and disgrace to them."},{"speaker":"Marcus","time":"00:47:34-6","content":"Have they forgiven you?"},{"speaker":"Solomon","time":"00:47:38-0","content":"I would say so. I mean Mom gets the moods where she says \"yeah Jr if you was here, you could have been driving me to my hair or you could have been taking me to the store, but you chose to go to prison.\" When she uses that word, like I chose, usually I try to be defensive \"I didn't choose to come to prison\" but when you think about it literally, it's like, if you do a crime, you get caught, you're going to prison, so you chose to go to prison, so initially, used to tried to argue with her and what not that \"I didn't choose\""},{"speaker":"Solomon","time":"00:47:38-0","content":"But she was like \"yeah, but you went to try to do what you did when you was going to get caught.\" And that hurts me a lot because she wants me there with her because I was always at her side. I was always helping her in the kitchen. She would teach me to cook and to clean and this that and the other. And I'm not there now. And she's like by herself. She doesn't have anybody."},{"speaker":"Marcus","time":"00:48:43-3","content":"Have you petitioned for clemency?"},{"speaker":"Solomon","time":"00:48:48-3","content":"Everybody just felt like I was going to get it because it felt like Birdsong done this he done that he done that and now it's like damn, Birdsong got denied, what hope do I have? so after about a couple of months of looking at it and crying and feeling sorry for myself and wanting to give up and what not, I started looking at it."},{"speaker":"Marcus","time":"00:49:12-0","content":"Sure, I mean that's all you can do is reapply. But the thing is, this gets to one of the things I'm trying to explore in this project which is how people cope with the reality of possibly dying here. I mean, there's point look out here, there's a hospice here. People are- people are dying here."},{"speaker":"Solomon","time":"00:49:33-0","content":"And the way it's my way of convincing myself, alright, just stay healthy and alive for a few more years. And when you go back up there, you're going to get a recommendation and whatever favorable Governor gets signed it's my way of tricking myself to continue going on because I'm on the Point Lookout Project so I know what the graveyards look like. I was there burying people when there was the Point Lookout 1 and we didn't move to 2 now."},{"speaker":"Solomon","time":"00:49:33-0","content":"So I been seeing them over and over and over. We go to the chapel, we do the funeral services, and we put somebody in the ground. So, I'm aware of that real good. But that's my way of, like I said, like tricking myself just to be good for a few more years, it's going to be alright and it's like putting a carrot before the horse to keep me going."},{"speaker":"Solomon","time":"00:49:33-0","content":"I was talking to someone the other day he's a juvenile offender, plus he's under one of them other bills, but, I think I was walking the other day with my head down and he asked me he said \"Hey, what's happening?\" And I said \"Man, I don't know.\" And he said I told him same as what I'm telling you now about the first degree murder I said \"It look like everyone getting a shot except for us.\" I said, \"It don't look like mine ever coming.\" He said \"Man, don't ever give up\" he said \"One time the drug lifers didn't have anything\" He said \"One time the 10-6 didn't have anything\" he said \"One year to 40 year lifers didn't have one,\""},{"speaker":"Solomon","time":"00:49:33-0","content":"And he said, \"Your time coming, just continue on.\" And so he was like trying to lift me up a little bit but I get days often where I be like man, first degree murder, for some reason, they just- it ain't going to happen. And I try to stay busy and I think about it I get those days where I just don't want to be bothered with nobody. It just- I don't know you just, like what the hell? You be like I mean, even around here, they tell you to be good. And you get those, they tell you don't mess with the cell phones. Don't mess with the mojo and all that."},{"speaker":"Solomon","time":"00:49:33-0","content":"But when the dudes get caught with it, they just slap them on the wrist and give them a dorm change or something. But you probably take someone like myself, if I just say I don't feel like going to work today, they'll throw me up under the cell block. And I'm like I didn't get all this, good for all these years and the trusted me here and there. I make a little tiny mistake and I am in max and the ones that always messing up, when they mess up, they won't to nothing. What's the use? Why keep trying?"},{"speaker":"Marcus","time":"00:52:28-8","content":"Yeah, I understand. I mean if we take, if we go back 20 years when you were here for 17 of those years, let's say, how were you coping then with the possibility of not leaving?"},{"speaker":"Solomon","time":"00:52:47-3","content":"During that time, it was."},{"speaker":"Marcus","time":"00:52:49-6","content":"Because nobody was going home then."},{"speaker":"Solomon","time":"00:52:51-8","content":"No, they weren't but, during that time, we were, I was I was with Norris Henderson and Calvin Dunkas we were on Angola Special Civics Project Six or Sects project and coincidentally, the daily bread this morning is talking about people supporting each other and that's what the daily bread is about today. But, back then, you had a group of us, and we all helped each other. We all supported each other, you had your Norris Henderson you had your Calvin Dunkas you Lionel's in there and they were like our leaders so to speak."},{"speaker":"Solomon","time":"00:52:51-8","content":"They were the brains child so to speak. And they had the voices that they motivated you to continue to fight and not give up. They were like, \"Look, we are going to try to get parole eligibility to lifers, that's what we're going to try to do.\" And we'll come up here in some rooms, same rooms up here and they'd hold our meetings twice a week and what not and we would try to get this done. We would try to get people to register to vote we would try to get our families and stuff involved so we had a focus."},{"speaker":"Solomon","time":"00:52:51-8","content":"We were putting out energy into a vehicle and we were trying to bring about a meaningful change for people that didn't have parole eligibility and so that's what carried us back then, but a lot of those people are gone now. And so you don't have that somebody that you start to drag to pull you up now. And so that's what made it easier back then."},{"speaker":"Solomon","time":"00:52:51-8","content":"Even though they told us way into the sunset somewhere, but it was like look, we don't have they have one say used to say all the time \"We don't have the option of giving up\" and he would preach that to us all the time and our motto was \"No surrender, no retreat.\" No matter how bad it gets, okay, that obstacle, get well, we're just going to go around it. We kept each other up."},{"speaker":"Marcus","time":"00:55:01-5","content":"Sure, sort of like a family."},{"speaker":"Solomon","time":"00:55:04-0","content":"Right. And so, now, it's like this family member going home, that family member going home and it's now, it's almost like, and I'm the only one left now."},{"speaker":"Marcus","time":"00:55:17-2","content":"Sure, so, can you tell me a little bit about your vision for what the next chapter of your life would look like?"},{"speaker":"Solomon","time":"00:55:26-1","content":"Hopefully, my mom and dad are still here alive. I want to spend time with them. I mean, they've been here with me for a lifetime and just to be with them. I mean, I'm not concerned dudes be like \"Oh find me a lady and this and that\" \"Go get laid\" And all that. I mean, I'm not concerned about all that. I just want to be with Mom and Dad. Get me a couple of dogs, raise a couple of dogs. Maybe try to hold a family reunion and trace my family. Little simple stuff. That's all I want. I'm not trying to go get a Bentley and all."},{"speaker":"Marcus","time":"00:56:10-0","content":"How do you think you might support yourself down the road? I mean, you've picked up all kinds of skills here."},{"speaker":"Solomon","time":"00:56:14-6","content":"Yes, well, first and foremost, I mean, the job opportunities I had when I went on the board in October, one was for concrete finishing. My dad has a small little video graphing business where he does like weddings and high school events and what not and he puts music to them and what not. And he said I kind of inspired him to do that because one of trades I picked up was the print shop and I learned to print pretty much inside and out."},{"speaker":"Solomon","time":"00:56:14-6","content":"He said I kind of inspired him to do that. I had another job lined up for Cherry Lane Chevrolet. So, first and foremost, I get what I can to get started and I still have a host of family, friends, relatives that will help me in whatever way I need. But like I said, I'm not trying to go get me a big old mansion and all of that. So if I could live out of a locker box, I could go out there."},{"speaker":"Marcus","time":"00:57:12-5","content":"Yeah, you put your feet on the ground. Let me ask you this, what's the- what are you most proud of? Of all the things you've survived and conquered and accomplished, what are you most proud of?"},{"speaker":"Solomon","time":"00:57:29-1","content":"That I haven't run away the people that care for me. That I can actually say that I was good enough while I was in society, that all the people that knew me in the end, felt like something just had to click in my mind or head for me to do what I did and that they still embrace me with warmth and I'm not somebody that once I came here, they turned their back on me. And so that means a lot to me."},{"speaker":"Solomon","time":"00:57:29-1","content":"And even the people that I've met now, I mean some of them are former inmates and what not, some people I've met at rodeo, some people I've met around here with the and whether they all want to stay in touch with me, so everybody doesn't want to stay in contact with somebody if they don't feel like they getting some kind of positive vibe or something from them or if they getting something."},{"speaker":"Solomon","time":"00:57:29-1","content":"I mean, intangible from them, so I feel good about that. That I'm not somebody that people just throw up under a rug or that would just pass by."},{"speaker":"Marcus","time":"00:58:38-9","content":"Sure. I have to say, I've really enjoyed sitting with you and learning about your life. And I'm really glad that you decided to come along and do this today. Is there something that we should have talked about or something I should have asked you about that I didn't?"},{"speaker":"Solomon","time":"00:59:05-3","content":"No, I believe we may have covered it all. I mean-"},{"speaker":"Marcus","time":"00:59:09-0","content":"Yeah, we covered a lot. I guess, let me put it this way, I'm trying to use your voices, to reach people who may not be aware of what's going on here and therefore, they don't care about it, but if they knew about it, they would care, so what should they know about what this experience is and why we should have people eligible for parole consideration?"},{"speaker":"Solomon","time":"00:59:42-8","content":"Well, first and foremost, I truly regret what happened. I mean, I don't take taking somebody's life lightly and I hate that I messed that family's life up. But at the same time, I'm just someone that made a mistake it's not like I was criminally minded or one of them career type criminals that just going out doing something all day every day. I actually did something I shouldn't have done and for that I'm sorry and to whoever may see or hear this, that's what happened. I'm not one that they would have to be afraid of in society."},{"speaker":"Solomon","time":"00:59:42-8","content":"I can go back out there and function as an individual, a member of society. I'm not one that they have to worry about locking they doors and putting they valuables in they pockets and what not when they come around. I was raised by parents. I had probably one of the best set of parents you could have. It wasn't their fault I veered off to the left. I mean, they taught me right. They gave me everything I needed. It was me made that one decision that affected not only my family's life but Phyllis's family's life as well."},{"speaker":"Solomon","time":"00:59:42-8","content":"And I feel that sometimes you should be able to. I mean like they say in the sentencing guide laws- a judge or somebody should be able have some leeway in being able to say well, this is just somebody that just made a decision, he went off into this and he made a mistake. I mean, I believe we all have well in us, it's just, we have to be able to make good choices and that day there, I didn't make a good choice. It's about- bottom line."},{"speaker":"Solomon","time":"00:59:42-8","content":"I just made a bad choice. I felt like pleasing others was more important than doing the right thing and that's all. And I had to learn that as the years went on. I'm not I shouldn't be influenced by peer pressure. I know I hear that in schools all the time that kids are influenced by peer pressure. I was one of them and I just made a fatal decision."},{"speaker":"Marcus","time":"01:02:04-2","content":"Sure, okay, well, I think that's a good place to end."}]}