{"name":"","transcript":[{"content":"Steve Evans REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-0","content":"So Steve as I said earlier, the purpose of this is just to learn about your life, who you are. But could you just start by setting the record by stating your name, the crime of conviction, how old you were at the time, and how much time you've served."},{"speaker":"Steve","time":"00:00:00-7","content":"My name is Steve Evans, I'm convicted of second degree murder, I was 18 or 19 when I when the crime happened, when I got here."},{"speaker":"Marcus","time":"00:00:12-4","content":"Okay. And how much time have you served?"},{"speaker":"Steve","time":"00:00:14-1","content":"26 years."},{"speaker":"Marcus","time":"00:00:17-1","content":"Okay. So, I'm going to start with your life before coming here. Tell me a little bit about your family, the folks who raised you."},{"speaker":"Steve","time":"00:00:25-9","content":"Well I mean, I was raised by my mother. By herself on welfare. And, what I mean, with 4 or 5- 4 brothers, in project Fischer housing development."},{"speaker":"Marcus","time":"00:00:48-5","content":"In- in New Orleans?"},{"speaker":"Steve","time":"00:00:49-9","content":"In New Orleans."},{"speaker":"Marcus","time":"00:00:52-8","content":"What about grandparents, did you have some grandparents in your life?"},{"speaker":"Steve","time":"00:00:55-4","content":"My grandmother, she stayed right with us in the project. That's where all of us stayed in that one house, first what I'm saying like my brother and he came along like 3 or 4 months. My mom moved into her own apartment which was behind my grandmother."},{"speaker":"Marcus","time":"00:01:15-3","content":"Okay. Now, were their men that came into your mother's life that then became part of your life?"},{"speaker":"Steve","time":"00:01:22-7","content":"Yes. My own stepfather."},{"speaker":"Marcus","time":"00:01:25-3","content":"Okay, tell me about him."},{"speaker":"Steve","time":"00:01:28-7","content":"My stepfather he worked for the project office and until now, he died about 2-3 years ago- but, he was- when he came in our lives a lot of things changed with me. But I still didn't accept a stepfather."},{"speaker":"Marcus","time":"00:01:53-6","content":"Okay, so what was your relationship like?"},{"speaker":"Steve","time":"00:01:58-7","content":"With him? It was, it was, it was great. It's just when you have your father, you always want your mother to be with your father. And when he come into play it was like but now I look at it a little sad and I accept him as a father."},{"speaker":"Marcus","time":"00:02:24-3","content":"Who was the disciplinarian in the house?"},{"speaker":"Steve","time":"00:02:27-6","content":"Me."},{"speaker":"Marcus","time":"00:02:29-8","content":"You were? With your siblings you mean?"},{"speaker":"Steve","time":"00:02:33-2","content":"Yeah."},{"speaker":"Marcus","time":"00:02:36-2","content":"And who disciplined you?"},{"speaker":"Steve","time":"00:02:37-4","content":"Shoot my mother and my stepfather."},{"speaker":"Marcus","time":"00:02:40-8","content":"Alright."},{"speaker":"Steve","time":"00:02:44-4","content":"That's why at that time I ain't accept a stepfather, because what I'm saying, me always having to be disciplined."},{"speaker":"Marcus","time":"00:02:49-0","content":"Okay, so, was your house a place where you felt that there were adults who loved you and who were concerned about you and nurtured you or did you feel like you kind of had to make it on your own?"},{"speaker":"Steve","time":"00:03:01-8","content":"Well then, what I'm saying, my mother, but we always felt like, by we being poor, she couldn't give us the things we wanted. The things we see around us, what I'm saying. So we had to get it ourselves."},{"speaker":"Marcus","time":"00:03:24-6","content":"Okay, alright. How about school, how was school for you? Where did you go to school? Elementary, middle..."},{"speaker":"Steve","time":"00:03:34-1","content":"North Henderson, to Fischer, went from North Henderson to Fischer. Because what I'm saying a whole lot of reasons. From, discipline."},{"speaker":"Marcus","time":"00:03:46-7","content":"Okay, did you ever get kicked out of school?"},{"speaker":"Steve","time":"00:03:50-8","content":"Yes that's why I had to go to another elementary school. Because of them reasons."},{"speaker":"Marcus","time":"00:03:55-9","content":"And what were you getting kicked out for?"},{"speaker":"Steve","time":"00:03:59-4","content":"I'd say I was being picked on because I stand out more than a lot of other kids then, and everybody always had they own. But we was poor so we had to be able to fight, stuff like that."},{"speaker":"Marcus","time":"00:04:23-3","content":"So fighting mainly."},{"speaker":"Steve","time":"00:04:25-0","content":"Right."},{"speaker":"Marcus","time":"00:04:25-8","content":"Can you describe, if I was standing right by your front door, can you paint a picture for me. What would I be seeing in the neighborhood in the evening?"},{"speaker":"Steve","time":"00:04:39-7","content":"You're talking about there? Well shoot, I mean everybody doing they own thing, Drugs, prostitutes, that was my window right there. You look out my window, drugs, shooting, everything right there. We stuck right in the midst of everything."},{"speaker":"Marcus","time":"00:05:08-3","content":"Okay, did you feel safe?"},{"speaker":"Steve","time":"00:05:11-6","content":"Well, it was like that's you wasn't worried, I mean I guess you was safe cause you wasn't worried about what was going on, it was just there."},{"speaker":"Marcus","time":"00:05:11-6","content":"It was normal."},{"speaker":"Steve","time":"00:05:28-9","content":"Yeah you could say that."},{"speaker":"Marcus","time":"00:05:30-2","content":"Sure, any particular memories of a teacher that you still have in your mind?"},{"speaker":"Steve","time":"00:05:43-9","content":"There was one teacher, what was her name? But she stayed, she do-man her name always came to my mind"},{"speaker":"Marcus","time":"00:05:57-0","content":"What grade was that?"},{"speaker":"Steve","time":"00:05:58-2","content":"It was like the 5th or 6th grade."},{"speaker":"Marcus","time":"00:06:00-1","content":"And she took an interest in you?"},{"speaker":"Steve","time":"00:06:02-9","content":"Right, yeah. That's why I always did her work when she come in the class if I'm in her class. She usually be right there. Miss Pat? It's not Pat. But I forgot her name."},{"speaker":"Marcus","time":"00:06:25-6","content":"Okay, that's okay, it's been awhile."},{"speaker":"Steve","time":"00:06:27-6","content":"Yeah."},{"speaker":"Marcus","time":"00:06:29-3","content":"So was there a lot of fighting in the home? You talked about fighting in school, but what about at home?"},{"speaker":"Steve","time":"00:06:36-7","content":"Yeah with my big brothers."},{"speaker":"Marcus","time":"00:06:39-6","content":"Where are you in the birth order?"},{"speaker":"Steve","time":"00:06:40-6","content":"I was the second to the oldest."},{"speaker":"Marcus","time":"00:06:44-3","content":"Okay so you would be fighting with your brothers?"},{"speaker":"Steve","time":"00:06:46-0","content":"Yeah, with my older brother and my cousin who used to be there? Cause all of us living in the same house. My grandmother's children and all them, all of us lived in the same house."},{"speaker":"Marcus","time":"00:07:00-4","content":"Okay. When you look back, were you ever physically abused?"},{"speaker":"Steve","time":"00:07:05-9","content":"No."},{"speaker":"Marcus","time":"00:07:14-0","content":"Okay. Where you whipped?"},{"speaker":"Steve","time":"00:07:17-3","content":"Oh yeah definitely, shit I would pull a ride. But it didn't matter because you was still doing what you wanted to do."},{"speaker":"Marcus","time":"00:07:30-1","content":"Right, I get it. So what was the highest year of school you finished?"},{"speaker":"Steve","time":"00:07:34-6","content":"9th grade."},{"speaker":"Marcus","time":"00:07:37-9","content":"And why did you drop out?"},{"speaker":"Steve","time":"00:07:40-4","content":"Wanted to do what I wanted to do."},{"speaker":"Marcus","time":"00:07:44-5","content":"Okay, and what was that?"},{"speaker":"Steve","time":"00:07:45-7","content":"I wanted to have nice things, what I'm saying. I wanted what I seen when I looked out the window when I was small. Selling some drugs to try to get the things I wanted to do."},{"speaker":"Marcus","time":"00:08:04-3","content":"Yeah, and were you able to get the things you wanted?"},{"speaker":"Steve","time":"00:08:06-7","content":"Yeah. I mean the materialistic stuff we looked up as the right thing to do."},{"speaker":"Marcus","time":"00:08:14-8","content":"Sure, yeah. What kinds of things?"},{"speaker":"Steve","time":"00:08:17-3","content":"Jewelry, money, clothes. Stuff like that."},{"speaker":"Marcus","time":"00:08:24-1","content":"Sure, did you have a car?"},{"speaker":"Steve","time":"00:08:25-0","content":"Yeah."},{"speaker":"Marcus","time":"00:08:25-9","content":"What kind of car?"},{"speaker":"Steve","time":"00:08:27-1","content":"A Lincoln '05."},{"speaker":"Marcus","time":"00:08:34-2","content":"What about any particular special relationships with anybody? Intimate relationships."},{"speaker":"Steve","time":"00:08:38-4","content":"I mean I had a girlfriend but I was never at the point in my life that I was really messing, at that time, what I was doing I felt was good, I had new tennis shoes and what not. Just looking good."},{"speaker":"Marcus","time":"00:09:01-6","content":"Alright, so no girl in particular comes into mind?"},{"speaker":"Steve","time":"00:09:05-1","content":"Well she came but it wasn't really nothing serious. I fell in love with her or what I thought was love."},{"speaker":"Marcus","time":"00:09:14-6","content":"Sure, sure. Does anybody- well let me ask you this, do you have any children?"},{"speaker":"Steve","time":"00:09:21-7","content":"No."},{"speaker":"Marcus","time":"00:09:23-6","content":"Okay. Does anybody, after 26 years, does anybody visit you up here still?"},{"speaker":"Steve","time":"00:09:29-1","content":"Well, my mother, she's in another state since the Katrina stuff. She used to be the one who used to come see me. But nobody come see me since then."},{"speaker":"Marcus","time":"00:09:42-2","content":"Okay alright. Did Katrina displace pretty much your whole family?"},{"speaker":"Steve","time":"00:09:46-9","content":"Yeah."},{"speaker":"Marcus","time":"00:09:48-8","content":"None of them came back?"},{"speaker":"Steve","time":"00:09:50-0","content":"Well, a few years ago, about 5 years ago."},{"speaker":"Marcus","time":"00:09:52-7","content":"So alright, so most of the families back in New Orleans but not your mom?"},{"speaker":"Steve","time":"00:09:55-7","content":"No nobody. They all out of state."},{"speaker":"Marcus","time":"00:09:58-0","content":"Where?"},{"speaker":"Steve","time":"00:09:59-6","content":"Texas."},{"speaker":"Marcus","time":"00:10:01-2","content":"Oh, sure, Texas took in a lot of folks."},{"speaker":"Steve","time":"00:10:03-5","content":"Yeah."},{"speaker":"Marcus","time":"00:10:06-7","content":"Do you remember the very first time you got arrested?"},{"speaker":"Steve","time":"00:10:10-1","content":"Yeah, stealing out the store."},{"speaker":"Marcus","time":"00:10:12-7","content":"And how old were you?"},{"speaker":"Steve","time":"00:10:16-2","content":"I was probably about 10."},{"speaker":"Marcus","time":"00:10:19-9","content":"Any arrests after that?"},{"speaker":"Steve","time":"00:10:21-6","content":"Yeah, because it was a juvenile thing, I think I was like 15."},{"speaker":"Marcus","time":"00:10:30-4","content":"Okay so you spent some time in juvenile."},{"speaker":"Steve","time":"00:10:31-5","content":"Yes."},{"speaker":"Marcus","time":"00:10:34-1","content":"Okay, which one?"},{"speaker":"Steve","time":"00:10:35-2","content":"LTI in Scotland."},{"speaker":"Marcus","time":"00:10:37-5","content":"Yeah, yeah sure."},{"speaker":"Steve","time":"00:10:38-8","content":"I think about 6 months I stayed there."},{"speaker":"Marcus","time":"00:10:41-0","content":"How was that?"},{"speaker":"Steve","time":"00:10:42-4","content":"Same thing as, what we thought was the norm."},{"speaker":"Marcus","time":"00:10:49-9","content":"So a lot of fighting there?"},{"speaker":"Steve","time":"00:10:52-8","content":"A lot of fighting."},{"speaker":"Marcus","time":"00:10:56-3","content":"Yeah. I assume that if you're- anybody who's selling drugs in New Orleans is armed. I'm assuming you had fairly easy access to a weapon?"},{"speaker":"Steve","time":"00:11:11-5","content":"That was the same as looking out the back window that was the norm. Something, we thought was right."},{"speaker":"Marcus","time":"00:11:25-0","content":"Yeah."},{"speaker":"Steve","time":"00:11:27-1","content":"But as you live on past that, getting into an environment that you haven't been witnessed- so"},{"speaker":"Marcus","time":"00:11:47-5","content":"It was normal."},{"speaker":"Steve","time":"00:11:48-6","content":"Right."},{"speaker":"Marcus","time":"00:11:51-3","content":"Okay. Steve, things are more complicated than this, I know there never one reason for many things. But if you look back, you've had all this time to reflect back on your situation. What do you think would be the single most important cause or reason that you are here? What lead you to that?"},{"speaker":"Steve","time":"00:12:16-9","content":"Being with the wrong people."},{"speaker":"Marcus","time":"00:12:18-0","content":"Okay."},{"speaker":"Steve","time":"00:12:20-4","content":"What I'm saying. Being bad if you look at it, me being in the situation. Being just hooked up with the wrong person at the wrong time. Affiliating myself with someone and not knowing their past or the history or what's going on what I'm saying."},{"speaker":"Steve","time":"00:12:20-4","content":"By me just coming up to the plate and it was just that fast, I was in a police car, in a time span of 3, 4 days, this where I'm at. And I look at it like, if I wouldn't have meet you here, I wouldn't even be in this situation. And you only served only 2, 3 days in here. But that's a whole other story."},{"speaker":"Marcus","time":"00:13:22-0","content":"So you had co-defendants in this?"},{"speaker":"Steve","time":"00:13:24-6","content":"Yeah."},{"speaker":"Marcus","time":"00:13:27-7","content":"And are they serving a life sentence?"},{"speaker":"Steve","time":"00:13:30-6","content":"Yeah one of them are."},{"speaker":"Marcus","time":"00:13:32-1","content":"Okay but the other one."},{"speaker":"Steve","time":"00:13:33-8","content":"Yeah, that's the one I put myself in the mix with."},{"speaker":"Marcus","time":"00:13:41-3","content":"And somehow he got out of it."},{"speaker":"Steve","time":"00:13:43-1","content":"Yeah, ain't that something?"},{"speaker":"Marcus","time":"00:13:47-3","content":"Okay. Was it drug related?"},{"speaker":"Steve","time":"00:13:49-1","content":"Yeah."},{"speaker":"Marcus","time":"00:13:50-2","content":"So, were drugs and alcohol part of your lifestyle?"},{"speaker":"Steve","time":"00:13:58-2","content":"Well, in somewhat it was, but I wasn't into the drug thing. I mean I smoked marijuana that was basically it. But actually being addicted to any of it."},{"speaker":"Marcus","time":"00:14:17-2","content":"Okay, so it wasn't a problem for you?"},{"speaker":"Steve","time":"00:14:19-8","content":"Well, I'm talking about what I got into when I was younger, yeah."},{"speaker":"Marcus","time":"00:14:23-9","content":"Okay, no but I mean when you were a teenager, before this happened."},{"speaker":"Steve","time":"00:14:30-3","content":"Before this happened, I was on drugs, but I'm saying before I got this charge, no I kind of like kicked the habit. But when I was like 13, 14, stealing cars and messing with a gun. That's what I meant I was using drugs then."},{"speaker":"Marcus","time":"00:14:51-6","content":"Okay, alright. How do you think your life- let's say this particular thing didn't happen, right, you didn't get into the same circle of friends with this guy. How do you imagine the next few months and years would've gone for you?"},{"speaker":"Steve","time":"00:15:08-9","content":"I'd probably be dead too. I'd probably be dead too. Because I mean, this incident wasn't the- if this incident didn't occur I probably wouldn't have been here. But I said I'd probably be dead somewhere, I'd probably be on the other side. What I'm saying? So I mean, honest to god, I'm appreciative of this. Because it taught me, it showed me a whole lot about life. Something that I didn't even cherish then. But now that I look at the way we was living it wasn't even human. It wasn't life."},{"speaker":"Marcus","time":"00:15:55-3","content":"Sure. Yeah and in some ways, even though nobody wants to go to prison, but in some cases, it saves people's lives."},{"speaker":"Steve","time":"00:16:04-5","content":"Yes it does. Yes it has. Because it got them for real."},{"speaker":"Marcus","time":"00:16:10-8","content":"Sure, so I want to move past that, the charge. And look at your first few years here at Angola. And your time since and all of the changes that you've gone through in the last two decades. But before I do that, is there anything else about you coming out your teenage years or anything that's very important in terms of shaping who you are now that we didn't have the chance to talk about?"},{"speaker":"Steve","time":"00:16:38-7","content":"I would say that me- we was firm before about my life. I'd probably be on the other side. I mean me being, me being here- that even the past of how I was living on the street. Everything that we did, it was humane, but you was like, this the way I was living, this the way I was taught, you know what I'm saying."},{"speaker":"Steve","time":"00:16:38-7","content":"Coming up, I was taught wrong. Then I didn't even cherish myself looking at them days there and I'm like man, I thank god every day that I'm here. I'm like man, to even put myself in this situation I thank god, I'm not dead. I'm like thank you lord for giving me a chance to even see- to see how life's supposed to really be."},{"speaker":"Steve","time":"00:16:38-7","content":"Because then, it wasn't...the way we was living it wasn't the proper way of living. It's hard to say that because that's the way were brought up. I know people always look at it and think of it as if it's not real but it is real. That's how it was."},{"speaker":"Marcus","time":"00:18:41-6","content":"Right, you didn't see anybody doing anything different."},{"speaker":"Steve","time":"00:18:44-0","content":"That's the truth."},{"speaker":"Marcus","time":"00:18:47-4","content":"So, I imagine that you spent a bit of time in the parish going through trial and so forth. How old were you when you finally got to Angola?"},{"speaker":"Steve","time":"00:19:01-6","content":"I think I was 19 or 20."},{"speaker":"Marcus","time":"00:19:04-2","content":"Okay. So do you remember the bus ride?"},{"speaker":"Steve","time":"00:19:06-7","content":"Yeah."},{"speaker":"Marcus","time":"00:19:08-1","content":"What's going through your mind during the bus ride?"},{"speaker":"Steve","time":"00:19:10-6","content":"Let me show you how messed up that is...when I was reading something and I was like, that's the first thing in my mind- before you asked that question, I'm like man it ain't even hit me until I hit that bus ride when I got here, that I even was sentenced to life. Cause it was like life."},{"speaker":"Steve","time":"00:19:10-6","content":"The jail that we was living at. It didn't even wrestle me like that. But when I got on that bus and came up here and hit that little bitty cell, man the wall to ceiling about. You can't even really sit up. Man I really cried, I said damn what I got myself into. I didn't even believe it until then. And this was like a few months that passed. It didn't even resident to try and hit that cell."},{"speaker":"Steve","time":"00:19:10-6","content":"I'm like man, I got life and I'm never bout to go home. What I'm saying. That individual, man I hope you all brought get some help but get someone help me out, you gone be here 100 years ago from that man open your mouth. Keep it silent. What people say? And, man, until that day I mean when I got here it's not near how it was back then."},{"speaker":"Marcus","time":"00:21:00-7","content":"How was it?"},{"speaker":"Steve","time":"00:21:02-0","content":"Oh it was rough. If you ain't stand on yours would be a punked or whatnots, what I'm saying, doing what you don't want to do."},{"speaker":"Marcus","time":"00:21:10-9","content":"Right."},{"speaker":"Steve","time":"00:21:12-6","content":"So it's like you a slave for somebody else, you're already a slave for that state. Then you become a slave for the person that you living with every day."},{"speaker":"Marcus","time":"00:21:22-6","content":"Right, sure. Did you work in the fields?"},{"speaker":"Steve","time":"00:21:25-8","content":"Yeah."},{"speaker":"Marcus","time":"00:21:27-2","content":"Tell me about that."},{"speaker":"Steve","time":"00:21:29-1","content":"That was hard, I'm talking about. I don't believe I walked a half a mile and I had blisters on my feet. From just walking and working. It was hard then, talking about work now...we was working then. We were down all day and top it chopping down trees."},{"speaker":"Marcus","time":"00:21:51-2","content":"Right, right. Steve, if you could go back, time changes all kinds of things and it also changes your perspective on life. If you could go back to the Steve Evans that was put in that bitty cell, what advice would you give him?"},{"speaker":"Steve","time":"00:22:16-0","content":"Educate yourself, get into positive things. Don't go over there, because that's what push you here. Because they got a lot of negative stuff that's here, people- negative people. So if you don't involve yourself around positive people, what I'm saying, you going to be damaged goods."},{"speaker":"Marcus","time":"00:22:44-4","content":"Did you, would you have taken that advice?"},{"speaker":"Steve","time":"00:22:49-7","content":"Then? You ain't really had no choice. You couldn't have took it. You couldn't have took it. You couldn't have took it because if you decide that man I'm not, I'm going to do this and do that, dudes would see that as weak and they would mess with that. Not like today, what I'm saying. Oh he going to church, that's it for him. Wash all my clothes, stuff like that. So you have to fight or whatnot."},{"speaker":"Marcus","time":"00:23:26-8","content":"I see, yeah."},{"speaker":"Steve","time":"00:23:28-8","content":"So if you was back right now today and I'm giving you this mission it's hit that law library, go to school. I'm telling you this the path right here. Get in different classes, man."},{"speaker":"Marcus","time":"00:23:43-5","content":"Okay, well tell me a little bit about that. What kinds of opportunities have you taken up here? Any classes or any training or anything?"},{"speaker":"Steve","time":"00:23:53-1","content":"Right now, I'm in the process of trying to get into electrical school trade. But in the past I had been through anger management, substance abuse, 100 hours. I've been through a lot of different classes."},{"speaker":"Marcus","time":"00:24:17-3","content":"Did you get your GED here?"},{"speaker":"Steve","time":"00:24:18-6","content":"Yes I'm in the process of doing it right now. I'm in school, I'm in night school."},{"speaker":"Marcus","time":"00:24:20-9","content":"Okay."},{"speaker":"Steve","time":"00:24:22-1","content":"I'm trying to bring my grades up to take the GED test because of me trying to get electrical trade."},{"speaker":"Marcus","time":"00:24:34-1","content":"Sure. So earlier when we were talking you were saying that when you look back on the guy you were when you came here, it's just like night and day."},{"speaker":"Steve","time":"00:24:42-9","content":"Right."},{"speaker":"Marcus","time":"00:24:44-3","content":"How long into you time at Angola did that change happen for you?"},{"speaker":"Steve","time":"00:24:50-3","content":"I'd give it or take about 12 years."},{"speaker":"Marcus","time":"00:24:55-2","content":"Okay. And before that were you just bucking the system, just getting in trouble?"},{"speaker":"Steve","time":"00:24:59-6","content":"Yes."},{"speaker":"Marcus","time":"00:25:01-6","content":"Cellblocks?"},{"speaker":"Steve","time":"00:25:02-9","content":"Cellblocks. I mean, recently, what I'm saying, like I went to the dungeon because of me not wanting to participate so that came about as of me training somebody that's saying don't want to be taught anything and I'm not messing with him."},{"speaker":"Marcus","time":"00:25:32-3","content":"This is for boxing?"},{"speaker":"Steve","time":"00:25:33-5","content":"Yeah. I'm not- you in it for all the wrong purposes. So I have a whole I have to deal with. So, if you negative, I'm not going to let you pull the rest of the tree. So security, they just want you to do what they say to do, but I'm not going to do that so."},{"speaker":"Marcus","time":"00:25:59-4","content":"They put you in the dungeon."},{"speaker":"Steve","time":"00:26:01-4","content":"Yeah for a couple days."},{"speaker":"Marcus","time":"00:26:04-0","content":"Walk me through your typical day now, what do you do from when you get up to when you go to bed."},{"speaker":"Steve","time":"00:26:08-9","content":"Well that's practically, like I go to I normally on certain days, we'll have a big fight or what not, I'm taking care of the elders in the ward."},{"speaker":"Marcus","time":"00:26:26-4","content":"Is that your job?"},{"speaker":"Steve","time":"00:26:27-4","content":"That's my job. I help the patients in the ward. Elderly Guys who can't really take care of themselves, I help them out and whatnot. But when I take care of a few them I'm at the gym and the gym training guys teach them how to fight."},{"speaker":"Marcus","time":"00:26:51-2","content":"And then what do you do after that?"},{"speaker":"Steve","time":"00:26:53-0","content":"Well basically I go to the library, what I'm saying. But I bring my books to the dorm a lot of times."},{"speaker":"Marcus","time":"00:26:53-0","content":"What kind of books do you read?"},{"speaker":"Steve","time":"00:27:01-7","content":""},{"speaker":"Marcus","time":"00:27:14-3","content":"Okay, in the law library."},{"speaker":"Steve","time":"00:27:15-5","content":"Yeah."},{"speaker":"Marcus","time":"00:27:16-2","content":"So let me ask you a difficult question. When you are working in the ward with some of the guys, who many of them came here as young men and are now elderly and they can't take care of themselves. That has to be a really painful kind of reminder that that could be you."},{"speaker":"Steve","time":"00:27:42-2","content":"Right, right."},{"speaker":"Marcus","time":"00:27:43-5","content":"So when you think about the reality of the- or let's say the possibility- that you may never get out of here. How do you cope with that?"},{"speaker":"Steve","time":"00:27:53-7","content":"I mean I try not to...I mean, I look at it knowing me being...when I take care of a few of them, cause a lot of them dudes, when I got here as a young person, young man, they was in the bracket I am right you. And I'm like man, I remember when he used to be doing this here, he used to be doing that."},{"speaker":"Steve","time":"00:27:53-7","content":"Now he barely can even hold a spoon up to feed himself. What I'm saying, barely even able to clean himself. So every day when I wakes up and thinks about that, and I'm like man, look what I subjected myself to from not knowing, what I'm saying...life. Put myself in that situation and now I could be in this type of, type of illness. I try not to even think about it."},{"speaker":"Marcus","time":"00:29:12-6","content":"Right."},{"speaker":"Steve","time":"00:29:14-7","content":"But the possibility can heat up a number a dozen times. But, I just try to deal with it to help them, to not even think about being in there. Just think about me as helping them. Because if I even think about it, how can I be able to help him cope with his illness and his problems. So I try to give him my energy."},{"speaker":"Marcus","time":"00:29:48-8","content":"Sure. The way out for folks who are in your situation really is now through the pardon board. Is that something that you're planning pursuing?"},{"speaker":"Steve","time":"00:30:00-6","content":"Yeah."},{"speaker":"Marcus","time":"00:30:02-6","content":"Okay."},{"speaker":"Steve","time":"00:30:03-7","content":"I mean right now I'm in the process of trying to, what I'm saying. I mean I hopes it works out, my family and a lot of colleagues in the law library feel I should."},{"speaker":"Marcus","time":"00:30:24-4","content":"Yeah, okay. So let me ask you another very difficult question I think. So when these things happen, people focus on the victim's family, rightly so. But they tend not to think very much about the convicted persons family."},{"speaker":"Steve","time":"00:30:43-2","content":"Right."},{"speaker":"Marcus","time":"00:30:45-7","content":"Can you tell me a little bit about the impact that your life sentence has had on your family?"},{"speaker":"Steve","time":"00:30:52-3","content":"It's been hard for my mother. Her coming to see me...is a lot of the time I get on the phone with her and she's crying, what I'm saying. Because I'm her only child that's in prison, or ever really been to prison. My mom has 5 boys and I'm the only one ever been to prison."},{"speaker":"Steve","time":"00:30:52-3","content":"And I got back to reflection on what I said about that window. When my stepfather came into my life, I respected him but I still, he tried to teach me the right way, the way all the rest of my brothers. And he took my mother from them and put her in a better environment, and none of my brothers ever been to prison but me. My older brother have, but he been doing the, he ain't ever been since then. And I was on the screw."},{"speaker":"Marcus","time":"00:31:59-2","content":"So it's your mother that's taken it the worst."},{"speaker":"Steve","time":"00:32:01-4","content":"Yeah she's stressed every day."},{"speaker":"Marcus","time":"00:32:06-9","content":"Right. Yeah somebody was telling me that if you have a family that loves you, they do the time with you."},{"speaker":"Steve","time":"00:32:17-2","content":"Yes."},{"speaker":"Marcus","time":"00:32:20-1","content":"Okay let's go back to this change that you've been through here. So you say about 12 years into this place you changed, why? What happened?"},{"speaker":"Steve","time":"00:32:29-1","content":"What made me change?"},{"speaker":"Marcus","time":"00:32:30-0","content":"Yeah."},{"speaker":"Steve","time":"00:32:31-3","content":"It was like boxing actually changed me."},{"speaker":"Marcus","time":"00:32:35-4","content":"Okay, did you box before you came here?"},{"speaker":"Steve","time":"00:32:39-4","content":"No."},{"speaker":"Marcus","time":"00:32:40-9","content":"Okay, well tell me about it."},{"speaker":"Steve","time":"00:32:43-2","content":"When I got here, I mean I started but by me still wanting to be protective of myself and watching my surroundings, I couldn't really get into boxing. It's something that I wanted to do, but I was a young man. And then they have people who try to misuse you back then, you being a young man looking at your appearance and like man I like I'm a mess with that."},{"speaker":"Steve","time":"00:32:43-2","content":"So you had to really check yourself and I really count get off into boxing. But once I got into the mix of like going to like...they used to have classes before you even go to boxing and dude said man I think I should get this little brother here he's really submissive he's real disciplined about trying to learn. So when I got to boxing, it took the frustration off me."},{"speaker":"Steve","time":"00:32:43-2","content":"The ones I couldn't deal with, the people on all sides that was negative. Because if you didn't discipline yourself, the best will dispose you would get killed, you would get hurt real bad. So I- that really relieved a lot of stress, me going to boxing."},{"speaker":"Marcus","time":"00:34:22-2","content":"Okay, yeah sure. What's been the worst part of this experience for you?"},{"speaker":"Steve","time":"00:34:30-9","content":"Worst part? Me being here I guess. And my family, I'm saying because they go through a lot to even keep me staying I'm here. That's really what the last 7, 8 years I've been here I've been stressing kind of hard and really like backstabbing me when I say that its trying to escape."},{"speaker":"Steve","time":"00:34:30-9","content":"I don't want to deal with the reality of being here. And that would cause a person to go to drugs or stuff like that. The last few years have been like that for me, me stressing because I want to be out of here. Man, why I'm here. Man, I'm a good person, why I mean they got some bad people, what I'm saying. And me? The only person that cared that I'm here, why I'm not on the street? Why nobody looking at me? But, if it went to the fact like, I don't know."},{"speaker":"Marcus","time":"00:36:03-3","content":"Yeah, I mean I think it's actually, wanting to escape by any means necessary is a very normal reaction to a very abnormal situation."},{"speaker":"Steve","time":"00:36:18-8","content":"That's basically like, what went down for the last few years. I mean I went all the way back what I mean when I say all the way back. I mean me not smoking marijuana, I mean I was, it was like man what's wrong with you. But that actually helped me to backslap and try to escape with the marijuana stuff cause then I might not ever get out of here."},{"speaker":"Steve","time":"00:36:18-8","content":"I'm going to be the frank, I'm clean. I know a frank, he's been running football around here one of the old people. We had football back then we played different camps and whatnot. And Frank, he used to run that ball, he can't do nothing, he can't even brush his teeth. Stuff like that."},{"speaker":"Steve","time":"00:36:18-8","content":"So the stress of me being here, doing things for people that was normal like I was, I mean healthy when I say normal. And now you can't, I'm like man psh, I hope somebody can care for me like I'm caring for the rest of them when I'm in this situation."},{"speaker":"Marcus","time":"00:37:57-9","content":"Yeah, yeah. Of all the things that you've accomplished, what are you most proud of?"},{"speaker":"Steve","time":"00:38:07-2","content":"Being socialized with people. Cause I was so bud-up, and wasn't talking to anybody because I felt everybody was saying was against me. What I'm saying, like nobody likes me."},{"speaker":"Steve","time":"00:38:07-2","content":"So I wasn't talking to anybody because I put them in a man you the reason why I'm here. Everybody's a victim for me, because I ain't supposed to be here. So I was accusing everybody. So my biggest accomplishment is me even starting to socialize with people in the last 15 years because I felt everybody was the reason why I'm here. I'm talking about the people who live in the dormitory would be, you the reason why I'm here cause people talk about keeping it real."},{"speaker":"Marcus","time":"00:39:22-8","content":"You said that you have a co-defendant who's serving a life sentence here too. What's your relationship like with that person?"},{"speaker":"Steve","time":"00:39:30-3","content":"We, we cool."},{"speaker":"Marcus","time":"00:39:32-1","content":"Okay, good. Well, let me ask you this, if you do go before the pardon board, it seems like your mind is in that space a little bit. If you do and they say they'll make you parole eligible after 35 or 30 years or whatever it might be. If that works out for you, what kind of a- how do you see that working out? What's that vision?"},{"speaker":"Steve","time":"00:40:01-8","content":"Well, it's like now because of, like I was telling you before about me the last few years, I've done slacked back and done tried to escape my environment, my reality of this situation."},{"speaker":"Steve","time":"00:40:01-8","content":"That put me in a bad spot for myself but not what other people would think, man I got a write up, what I'm saying. I was using drugs. So if I got up in front of a pardon board, they not going to look at, you know what I'm saying?"},{"speaker":"Marcus","time":"00:40:43-3","content":"Yeah you have to be free of any write ups for 2 years before you can go before a pardon board."},{"speaker":"Steve","time":"00:40:46-1","content":"It's like even then"},{"speaker":"Marcus","time":"00:40:51-1","content":"All right is there anything else I should've asked you that I haven't asked you? That's important about knowing who you are?"},{"speaker":"Steve","time":"00:40:58-8","content":"Not really."},{"speaker":"Marcus","time":"00:41:00-3","content":"Okay, we covered quite a bit."},{"speaker":"Steve","time":"00:41:02-0","content":"Yeah, I know one my sinus is so stuffed up my thinking ain't clicking."},{"speaker":"Marcus","time":"00:41:10-8","content":"That's okay."},{"speaker":"Steve","time":"00:41:12-6","content":"Cause its things that what I'm saying, that come to mind but it's just no clear."},{"speaker":"Marcus","time":"00:41:22-9","content":"Okay, sure."},{"speaker":"Marcus","time":"00:41:22-9","content":""},{"speaker":"Steve","time":"00:41:30-1","content":"And I'm feeling grateful to even sit here even trying to explain my story."}]}