{"name":"","transcript":[{"content":"Steven Garner REDACTIONS FINAL"},{"speaker":"Steven","time":"00:00:00-0","content":"Okay, my name is Steven Garner. I have been in, I'm serving a life sentence. I been incarcerated now 26 years. I have a life sentence."},{"speaker":"Marcus","time":"00:00:11-0","content":"And what was the crime of conviction."},{"speaker":"Steven","time":"00:00:13-0","content":"Murder."},{"speaker":"Marcus","time":"00:00:13-7","content":"And how old were you?"},{"speaker":"Steven","time":"00:00:15-0","content":"I was 20 years old."},{"speaker":"Marcus","time":"00:00:16-8","content":"Where are you from?"},{"speaker":"Steven","time":"00:00:18-8","content":"I'm from New Orleans."},{"speaker":"Marcus","time":"00:00:20-2","content":"Okay whereabouts?"},{"speaker":"Steven","time":"00:00:23-8","content":"If you're familiar with New Orleans, I guess you could say the third ward area."},{"speaker":"Marcus","time":"00:00:28-6","content":"Okay what street? I live there."},{"speaker":"Steven","time":"00:00:30-5","content":"I lived on Magnolia Street."},{"speaker":"Steven","time":"00:00:30-5","content":""},{"speaker":"Marcus","time":"00:00:32-9","content":"Okay."},{"speaker":"Steven","time":"00:00:33-5","content":"In between felicity and St. Andrew."},{"speaker":"Marcus","time":"00:00:36-7","content":"So, the point of this interview is for me to learn who you are as a person, about your life history. Both before this charge and then after, right. So this charge currently is this punctuation mark in your life. It sent you down a different course and we want to look at that a little bit as well but mainly we want to explore your life outside of that. So it makes sense, then, to start with your childhood. So can you tell me a little bit about the folks that raised you?"},{"speaker":"Steven","time":"00:01:05-0","content":"My family, well my mother and father they were very involved in my life coming up. We had seven, my mother and father had 7 kids. My daddy worked every day, my momma she was more like, yea, a housewife. But we didn't really have like any other kids coming up, I mean mother and father always wanted to make sure that you had the things that you need to go through life. My father after he worked, he was a retired longshoreman. $3000 to be exact."},{"speaker":"Steven","time":"00:01:05-0","content":"He worked and he provided for his family and I mean coming up, I watched him go got work come home, watch my mother make sure had food on the table, make sure we had clothes on our back never anything of you always have to kids we always getting off into different little small things as a child but they would pretty much good."},{"speaker":"Marcus","time":"00:02:05-1","content":"Sure did they get along."},{"speaker":"Steven","time":"00:02:06-6","content":"Yes, my mother and father was married 50 years."},{"speaker":"Marcus","time":"00:02:10-3","content":"Wow, are they still alive?"},{"speaker":"Steven","time":"00:02:13-5","content":"No. my mother, my mother passed away in 2002 when I came up here and my father passed away in 2014."},{"speaker":"Marcus","time":"00:02:20-7","content":"I'm sorry. What about siblings. Tell me about your siblings."},{"speaker":"Steven","time":"00:02:27-6","content":"My oldest sister, I have a, let me see. I'm the fifth child of seven. Four boys 3 girls"},{"speaker":"Marcus","time":"00:02:44-0","content":"Okay what are their names?"},{"speaker":"Steven","time":"00:02:45-2","content":"One was, my sister, my oldest sister name is Brenda. My next to oldest is Diane, Darlene. Another Elmore the third, then me then my."},{"speaker":"Marcus","time":"00:03:00-2","content":"So Elmore is the first boy?"},{"speaker":"Steven","time":"00:03:01-7","content":"No."},{"speaker":"Marcus","time":"00:03:03-0","content":"No okay."},{"speaker":"Steven","time":"00:03:03-9","content":"Brenda was the first girl. Let me backup. It was Brenda, then Ronnie which is a brother. And then a sister Diane, then Darlene then me and Glen no then my Elmore, then me then Glen."},{"speaker":"Marcus","time":"00:03:23-2","content":"Elmore was the junior?"},{"speaker":"Steven","time":"00:03:26-5","content":"He was the junior."},{"speaker":"Marcus","time":"00:03:27-1","content":"He was the junior."},{"speaker":"Steven","time":"00:03:27-6","content":"And his father was the senior?"},{"speaker":"Marcus","time":"00:03:29-1","content":"I got it. So is it accurate for me to say that growing up you felt that you were in a nurturing, loving family with folks who cared for you or did you feel that."},{"speaker":"Steven","time":"00:03:42-5","content":"Absolutely."},{"speaker":"Marcus","time":"00:03:42-7","content":"Or did you feel you had to make it on your own."},{"speaker":"Steven","time":"00:03:45-0","content":"Absolutely."},{"speaker":"Marcus","time":"00:03:48-9","content":"Was there any fighting in the house?"},{"speaker":"Steven","time":"00:03:51-0","content":"No, not far as parent. My mother and father just like fighting and stuff like that. I didn't see any of that."},{"speaker":"Marcus","time":"00:03:58-8","content":"Ok alright."},{"speaker":"Steven","time":"00:03:59-7","content":"I didn't see anything where my father jumping on my mother or my mother jumping."},{"speaker":"Marcus","time":"00:04:04-2","content":"Right."},{"speaker":"Steven","time":"00:04:05-3","content":"I didn't see that I mean it was a bunch of love."},{"speaker":"Marcus","time":"00:04:09-4","content":"Right, that's great. Who do you think you, you would identify as the person that you got on best with coming up? It could be an adult or it could a sibling or a cousin or a friend. So somebody who really stands out as this is my soulmate this is the person who gets me."},{"speaker":"Steven","time":"00:04:27-4","content":"You talking about in the family?"},{"speaker":"Marcus","time":"00:04:28-8","content":"It could be, sometimes it's a friend."},{"speaker":"Steven","time":"00:04:30-1","content":"Well."},{"speaker":"Marcus","time":"00:04:32-6","content":"Sometimes it's your mother I mean."},{"speaker":"Steven","time":"00:04:34-1","content":"I would say my parents because my parents and then my, my oldest sister she there are some things that when you can kind of like sit down and talk to your mother and your father about different things and sometimes because of their love their shielded love, it's not that they don't want you doing things but its everything that you do it's basically I want I don't want to see you get into any trouble or anything like that."},{"speaker":"Steven","time":"00:04:34-1","content":"So you can always, I used to always go to my father and my mother and talk to them about things that I wanted to do when I was coming up in life. As well as my sister I mean I can go to any of my older, older ones and go talk to them about what I wanted to pursue or what I wanted to do in life. So I don't really want to pick and choose because I can because all of them was available."},{"speaker":"Marcus","time":"00:05:26-1","content":"Sure. So the important thing too is that you always thought that there was somebody that you could go to with a problem?"},{"speaker":"Steven","time":"00:05:31-9","content":"Yes."},{"speaker":"Marcus","time":"00:05:32-3","content":"Ok, because not everybody has that."},{"speaker":"Steven","time":"00:05:34-2","content":"Yes."},{"speaker":"Marcus","time":"00:05:35-0","content":"Yes, so I'm somewhat familiar with your neighborhood, but for somebody who may not be familiar with your neighborhood could you describe what we might be saying let's say in your late teens if we're sitting on the front stoop of your house, what would, paint a picture for me. What would I be hearing, smelling and hearing, and I mean and seeing."},{"speaker":"Steven","time":"00:06:01-4","content":"Well you had a store, a neighborhood store that was like on a corner of Magnolia and everybody pretty much knew everybody around there. You had the older people at that time there were everything was basically respectable. It wasn't if the neighbor knew that I was wasn't supposed to be around at a certain time then they had the permission to run me back to my house they, \"Look you need to get on home. \""},{"speaker":"Steven","time":"00:06:01-4","content":"Or whatever or if they see me hanging around with people that are \"bad company\" then you need to get on and I'm, tell your mother and I'm going to tell your daddy about this and that this and that. So it was, it was a, it was a connection in the neighborhood. You had another area where it was an area of barbeque stand potnas, you may be familiar with that. Then not far from it you had the sixth district police station that was like close around."},{"speaker":"Marcus","time":"00:07:06-2","content":"Sure."},{"speaker":"Steven","time":"00:07:07-3","content":"So everybody was basically in the neighborhood that I grew up in it was basically like a connection I mean it wasn't a lot of violence."},{"speaker":"Marcus","time":"00:07:17-9","content":"Okay."},{"speaker":"Steven","time":"00:07:19-1","content":"It wasn't a lot of violence where you see different shootings and shootings and stabbings and stuff like that."},{"speaker":"Marcus","time":"00:07:31-8","content":"Right."},{"speaker":"Steven","time":"00:07:32-4","content":"You didn't see a whole bunch of that in that particular area there but you had, across the street, you had another area where it was the where you could go actually and play basketball it's like a park they'll sit right across from where we were and you can go over there and just play basketball with the guys or the fellas or whatever and everybody just really would just coming up just really just was having some fun."},{"speaker":"Marcus","time":"00:08:00-1","content":"Sure. What about school? How was school for you? Did you like school?"},{"speaker":"Steven","time":"00:08:03-6","content":"I went to Booker T Washington high school, right on Romans."},{"speaker":"Marcus","time":"00:08:07-3","content":"Okay."},{"speaker":"Steven","time":"00:08:07-6","content":"I think and the back of it is like on Earhart and I graduated from here in 1988. I also played football for Booker T Washington high school as well. We was state champions"},{"speaker":"Marcus","time":"00:08:21-1","content":"Wow."},{"speaker":"Steven","time":"00:08:21-3","content":"Yes and district 10 champs."},{"speaker":"Marcus","time":"00:08:26-4","content":"Yes."},{"speaker":"Steven","time":"00:08:27-3","content":"We travelled from different school to school and I played there for like 2 years. My junior year and my senior, my senior year."},{"speaker":"Marcus","time":"00:08:36-9","content":"Ok. What about elementary and middle school, where were you there?"},{"speaker":"Steven","time":"00:08:40-1","content":"Actually we went to, when coming up we went to St. Monica. St. Monica right there on Galvez and I think that's first."},{"speaker":"Marcus","time":"00:08:46-7","content":"Okay."},{"speaker":"Steven","time":"00:08:47-0","content":"We went in between Jackson and first we went to St. Monica, we went to a catholic school. So I went to a catholic school from I think it was like ... first we went to, elementary school, we went to McDonough 36, right there off of Jackson. And then from there we went to St. Monica for like about 2 years. Then I went to, what, Wayne that's on carondelet for one year and then I went to Booker T I wanted to play football, that's the whole thing."},{"speaker":"Marcus","time":"00:08:47-0","content":"Sure, what position did you play?"},{"speaker":"Steven","time":"00:09:19-1","content":"I actually played pulling guard."},{"speaker":"Marcus","time":"00:09:21-1","content":"Okay."},{"speaker":"Steven","time":"00:09:22-3","content":"Then from pulling guard then I went to center"},{"speaker":"Marcus","time":"00:09:24-2","content":"Okay alright, that's great. So did you kind of identify as your main identity would be like an athlete."},{"speaker":"Steven","time":"00:09:35-7","content":"Yes I mean I was pretty much about the - no well me and my brother was pretty much about the only two that was that was not athletic inclined but just played that physical contact sport."},{"speaker":"Marcus","time":"00:09:47-9","content":"Glen? The other brother?"},{"speaker":"Steven","time":"00:09:49-0","content":"No, Elmore."},{"speaker":"Marcus","time":"00:09:50-8","content":"Elmore ok. Did you have a particular teacher that stands apart from others as somebody who took an interest in you?"},{"speaker":"Steven","time":"00:10:02-1","content":"Well I had a coach, his name was Coach Norman Mack. Sometimes when you younger you really can't see what somebody else can see in you. He took time with me with practice he seen a few things in me that I didn't see in myself. He really wanted me to be a part of the team. And me not really actually playing organized football I really didn't know that you have to remember the plays to run the plays."},{"speaker":"Steven","time":"00:10:02-1","content":"So I had to remember plays, I had to be more focused because most people don't realize as a center or as a pulling guard I mean we know the count. You probably be familiar with that I bet. but it's a lot of responsibility even coming up as a teen as a youngster and I really didn't looking back at it now and looking at things where they are right now today it is a position that you control you control things"},{"speaker":"Marcus","time":"00:11:15-9","content":"Okay."},{"speaker":"Steven","time":"00:11:16-3","content":"Offense everything move on your count."},{"speaker":"Marcus","time":"00:11:19-0","content":"Right and that coach recognized that ability in you."},{"speaker":"Steven","time":"00:11:21-6","content":"Yes he did."},{"speaker":"Marcus","time":"00:11:22-6","content":"Okay, fighting in school, did you ever get kicked out of school?"},{"speaker":"Steven","time":"00:11:27-3","content":"I never got kicked out of school, I'm fortunate. They had a lot of things that teenagers, going on in school, that you see people getting involved in all kind of things at school and sometimes I always was just conscious because I was like if this was to happen what my parents would think about, what my sisters and what the family would think. It was really just, really the flection of the family."},{"speaker":"Marcus","time":"00:12:02-3","content":"Right, you want to make sure you didn't bring."},{"speaker":"Steven","time":"00:12:04-5","content":"Yes I didn't want to bring anything that I know that I can control because against the family."},{"speaker":"Marcus","time":"00:12:12-0","content":"Sure, I understand that. I don't want to disappoint them."},{"speaker":"Steven","time":"00:12:16-9","content":"Didn't want to disappoint them."},{"speaker":"Marcus","time":"00:12:18-8","content":"Sure, so, any trouble with the law prior to this particular charge."},{"speaker":"Steven","time":"00:12:23-1","content":"No, I haven't, I have not any problems with the law."},{"speaker":"Marcus","time":"00:12:27-5","content":"So you're a first offender?"},{"speaker":"Steven","time":"00:12:28-6","content":"My first offence, first offender."},{"speaker":"Marcus","time":"00:12:30-4","content":"Wow."},{"speaker":"Steven","time":"00:12:31-4","content":"Yes."},{"speaker":"Marcus","time":"00:12:34-6","content":"What about girlfriends"},{"speaker":"Steven","time":"00:12:37-7","content":"Well."},{"speaker":"Marcus","time":"00:12:39-4","content":"Anybody particularly specials stands, stands, anybody?"},{"speaker":"Steven","time":"00:12:43-1","content":"Well actually when I was in school I dated a few girls in school one I had a relationship with one up, actually up until I came here it's like three years I mean so it's like I was like her an I went to each other prom. I went to, when I graduated in 1988 I took her to my prom and the next year she graduated in 89 and we went to her prom and her name was Sonia Haskins I still love her today."},{"speaker":"Steven","time":"00:12:43-1","content":"Sometimes when young you meet people and sometimes people they tends to come and go into your life and sometimes you really don't, being young sometimes you really don't know that this might be the."},{"speaker":"Marcus","time":"00:13:39-9","content":"The one."},{"speaker":"Steven","time":"00:13:40-4","content":"The one for you. But you young you're playing football you got you got several of the girls looking at you, you got several of them wanting so you think you big stuff and so but, but that was just the one that I really kind of liked."},{"speaker":"Marcus","time":"00:14:01-6","content":"Yes sure there's always one."},{"speaker":"Steven","time":"00:14:03-1","content":"Just kind of like one just like, \"Hmmm.\" I had asked my sister, I asked my sister Brenda about her one time and I asked I said \"Well then what you think about her\" and she said \"Yes what, she said I think you need to marry her\""},{"speaker":"Marcus","time":"00:14:14-9","content":"Yes, ok. Did you end up getting married to anybody before you?"},{"speaker":"Steven","time":"00:14:19-2","content":"No I never been married."},{"speaker":"Marcus","time":"00:14:20-8","content":"What about children?"},{"speaker":"Steven","time":"00:14:21-7","content":"I have one. Actually he's living in Oklahoma."},{"speaker":"Marcus","time":"00:14:27-1","content":"What's his name?"},{"speaker":"Steven","time":"00:14:28-0","content":"His name Jacoby, Jacoby Burns."},{"speaker":"Marcus","time":"00:14:30-4","content":"Okay."},{"speaker":"Steven","time":"00:14:31-4","content":"Actually right before this situation that happened he was like three weeks old."},{"speaker":"Marcus","time":"00:14:37-7","content":"Okay."},{"speaker":"Steven","time":"00:14:39-4","content":"And then this happened."},{"speaker":"Marcus","time":"00:14:40-6","content":"Okay, wow. So maybe you can just tell me very, as I said earlier really the point of this interview is not to get into the details of the crime. Can you just give me a very quick overview what happened, and who else was involved."},{"speaker":"Steven","time":"00:14:59-6","content":"Well it was just a, we was never looking for any type of trouble or anything and we went out to a little place, a little club place. And we just hanging out and it really was nothing that everybody out just trying to have a good time. and, really like I said I just wish the day, that day that would just have never came and-"},{"speaker":"Marcus","time":"00:15:29-0","content":"Sure."},{"speaker":"Steven","time":"00:15:30-8","content":"Because it's a lot of stuff going on that night. It's a lot of things that was, that was, that, that, that, that shouldn't have gone on that night. I just sometimes wish that that day that would have never, never took place."},{"speaker":"Marcus","time":"00:15:47-5","content":"Sure I understand. But it was a fight?"},{"speaker":"Steven","time":"00:15:51-2","content":"Well, it wasn't really well a fight in the beginning but then a fight led to other things."},{"speaker":"Marcus","time":"00:15:57-9","content":"Yes, so it escalated out of control."},{"speaker":"Steven","time":"00:15:59-9","content":"Sometimes you could try to walk away from things but sometimes people just like it's like some people don't know how to control their, their anger. Even when I was coming up I mean I always was the type to try to walk away or try to rethink some things"},{"speaker":"Marcus","time":"00:16:22-1","content":"Sure."},{"speaker":"Steven","time":"00:16:23-1","content":"Other than just because I think it's easy to be violent violent sometimes it comes without thinking but when you can actually have can think about the act before the act I think that that is."},{"speaker":"Marcus","time":"00:16:42-4","content":"Sure, it's also something that comes with age, right?"},{"speaker":"Steven","time":"00:16:45-3","content":"Yes."},{"speaker":"Marcus","time":"00:16:45-9","content":"New perspective. But did any codefendants in this situation?"},{"speaker":"Steven","time":"00:16:52-3","content":"Yes, I had my, Glen, my brother I had I had a codefendant Glen. I had another guy that was named Harold. He actually wind up getting like 15 years, and he done that time in like 10 years ago."},{"speaker":"Marcus","time":"00:17:08-3","content":"Okay sure, what about your brother Glen? Did he get the same?"},{"speaker":"Steven","time":"00:17:12-7","content":"Same thing."},{"speaker":"Marcus","time":"00:17:13-4","content":"Okay, so is he here?"},{"speaker":"Steven","time":"00:17:15-4","content":"Yes he is."},{"speaker":"Marcus","time":"00:17:17-0","content":"Do you see him a lot?"},{"speaker":"Steven","time":"00:17:17-9","content":"I see him every day."},{"speaker":"Marcus","time":"00:17:18-8","content":"Yes I guess that's bittersweet"},{"speaker":"Steven","time":"00:17:22-6","content":"It is because you can look, I mean I can look at my life now back then and I see the potential that's from me of what I could've become and it's like, it's like man but I try to look at prison like this. It's another day that you can do something that you didn't do before and when you look at yourself like that because the potential is in you."},{"speaker":"Steven","time":"00:17:22-6","content":"The potential doesn't stop because you're here. The potential is progressive, or if it's the potential is in you and it's progressive I mean it's going to find ways to come out anyway so you might as well let release it. So every day that I live I just try to release what's, what god has given me to release"},{"speaker":"Marcus","time":"00:18:21-0","content":"Yea. I actually really want to get into that with respect to hospice work that you do. So, alright so were drugs and alcohol a big part of your life."},{"speaker":"Steven","time":"00:18:33-1","content":"No."},{"speaker":"Marcus","time":"00:18:33-4","content":"A part of your lifestyle. I mean you're an athlete I don't how does that."},{"speaker":"Steven","time":"00:18:38-2","content":"We couldn't less alone we couldn't even drink cold drinks or sodas because if you wanted to but when you're an athlete I mean you always have to be mindful of your diet. You have to always be mindful of how you treat your body."},{"speaker":"Marcus","time":"00:18:57-5","content":"Actually let me ask you one question so you had already graduated when you were 18. What's going on in those two years before?"},{"speaker":"Steven","time":"00:19:05-3","content":"I had got a job working for American residential service which is the garbage truck. I had worked there for maybe like about a year or so, then I wind up finding that was like way out in Michaud, so I wind up finding another job that was like Borden's ice cream company, right there on carondelet. And so I worked there for a little worked there a little while but I was then I was then right before I come here I was about to start working local."},{"speaker":"Marcus","time":"00:19:37-6","content":"Ok."},{"speaker":"Steven","time":"00:19:38-2","content":"On longshoreman. My dad, by him being retired he knew people and he was gone get me a job over there. So but that never materialized, so"},{"speaker":"Marcus","time":"00:19:50-8","content":"Sure. Speaking of that so I'm sure that you've, you've said a couple of times you wish that day never happened or you just didn't get up in the morning if you could avoid that how do you think your life would've what would have happened in the next few months years of your life had this thing not happened?"},{"speaker":"Steven","time":"00:20:10-3","content":"I think I would be very much progressive I mean I think that I would probably been married maybe more than one child, maybe my own home I mean I wasn't an easy person."},{"speaker":"Steven","time":"00:20:10-3","content":"I mean I had good examples before me I mean my father he always instilled the work ethic, because if you don't work you won't eat so he always encouraged that he always encouraged that you have to look at life the way that it is. what I mean by that is that you have to work because if you don't work it's gone lead to other things you gone eventually take something that don't belong to you."},{"speaker":"Marcus","time":"00:21:00-4","content":"Sure."},{"speaker":"Steven","time":"00:21:00-7","content":"You gone eventually get off into something that you not supposed to be getting off into and that was the example that I've always seen coming from him I know it was days that he didn't feel like working but he know he had to feed me he had to clothe me he had to do the same thing for the other family members in the house pay bills so it and it's a lot of responsibility."},{"speaker":"Marcus","time":"00:21:25-4","content":"Yes, I want to move on now to, to your time since then, it's most of your life actually since then so before I move on from your childhood and adolescence is there something that, that I should've asked you that's kind of important about who you are from those earlier experiences that we didn't get a chance to talk about?"},{"speaker":"Steven","time":"00:21:25-4","content":"No."},{"speaker":"Marcus","time":"00:21:51-3","content":"Ok, alright. We covered a fair amount I just wanted to make sure that"},{"speaker":"Steven","time":"00:21:54-3","content":"I mean when you talking about growing when you talking about being a teenager and coming up and being in school you're going to always have ladies and girls and stuff like that going to be everybody they because I believe that, that as a teenager girls see men and when they see men they see potential they see good things as well, in them as well. Sometimes more better than the person can see in his own self."},{"speaker":"Steven","time":"00:21:54-3","content":"So I think that they have had a lot of coming just coming and go in my life, coming and go in my life but there's only gone be sometimes of you can't have them all it's just gone be some that's going to actually stand out and well maybe I might, maybe her and I might be able to get this, get something serious going"},{"speaker":"Marcus","time":"00:22:56-4","content":"Sure. Who was the mother of your three week old at the time that this happened."},{"speaker":"Steven","time":"00:23:05-3","content":"Monica Burns."},{"speaker":"Marcus","time":"00:23:06-6","content":"Monica Burns, okay."},{"speaker":"Steven","time":"00:23:07-7","content":"Monica Burns."},{"speaker":"Marcus","time":"00:23:08-5","content":"Alright. Are you still in touch with any of those folks?"},{"speaker":"Steven","time":"00:23:11-2","content":"I was in touch with her maybe for about like about three years ago I would say but just."},{"speaker":"Marcus","time":"00:23:20-2","content":"Yes."},{"speaker":"Steven","time":"00:23:21-0","content":"Just things just happens."},{"speaker":"Marcus","time":"00:23:23-0","content":"Yes."},{"speaker":"Steven","time":"00:23:23-4","content":"I been trying to really rekindle that relationship and rekindle that relationship but when you hear it's hard."},{"speaker":"Marcus","time":"00:23:39-5","content":"Yes."},{"speaker":"Steven","time":"00:23:40-7","content":"It's very hard."},{"speaker":"Marcus","time":"00:23:43-0","content":"Yes, life goes on."},{"speaker":"Steven","time":"00:23:44-2","content":"His mother because of the fact that she's been there for him throughout his coming up and by me not being there he will most likely take her side concerning whatever the situation might be so he really don't know so sometime people like that can paint the picture the way they want it to be any way so I fell that it's really nothing that I, it's really nothing that I can do."},{"speaker":"Marcus","time":"00:24:14-8","content":"Yes. So you haven't had much contact with him since you got incarcerated."},{"speaker":"Steven","time":"00:24:14-8","content":"No he and I had we would call and we would talk on the phone he never, I never actually laid eyes on him. But I have pictures that I have, that they have sent me concerning him and actually he's a married man now with two kids and a wife."},{"speaker":"Marcus","time":"00:24:39-1","content":"Okay, where are they at?"},{"speaker":"Steven","time":"00:24:40-7","content":"They're in Oklahoma."},{"speaker":"Marcus","time":"00:24:41-7","content":"Oh you said that, I'm sorry"},{"speaker":"Steven","time":"00:24:42-4","content":"Yes."},{"speaker":"Marcus","time":"00:24:43-2","content":"Okay. Alright, well, look I mean one of the reasons that we're doing this project and talking to people like you is that people also go through a lot of positive change as time goes on. Not everybody, but a lot of people do and whether it's in prison or outside of prion and I want to talk a little bit about that transformation, in your life, but maybe you could start from ground zero and tell me what can you describe the man that you were when you came in through the gates of Angola?"},{"speaker":"Steven","time":"00:25:01-2","content":"Well when I came through the gates of Angola I really didn't know what to expect when I came to this place it's the first time that I've been ever been in a place like then and one of the first things that I thought about was I heard so much about it its how would I survive? How would I be the man that I came into this place to be? It's a lot of, lot of stuff was going on a lot of it's a lot of mental, games that men and people can play, and it's you have to be mentally tough."},{"speaker":"Steven","time":"00:25:01-2","content":"More or less alone sometime it's not always physical it's just mental and you can be able to be able to think because I think that trouble is trouble anywhere you go. Whether you're out in society, whether you in prison or wherever. I just think that you still have to be able to think."},{"speaker":"Steven","time":"00:25:01-2","content":"You still have to be able to how you want to control what you do in here. And so I wanted to control what I do in here. I know that I mean I can't I'm limited. But I still can have control on my choices on things that I need to be doing and the things that I shouldn't be doing, so."},{"speaker":"Marcus","time":"00:26:35-0","content":"So how are you different? In what ways are you different now?"},{"speaker":"Steven","time":"00:26:41-1","content":"Well, well I think now growing up in this place I mean I have I try to get around positive people first and foremost I try to get around people that really that actually don't think like some people think in prison. Getting around positive people and just trying to educate myself as much as I can while I'm here taking different programs taking just getting around guys that really that can actually you can feel comfortable in talking to."},{"speaker":"Steven","time":"00:26:41-1","content":"Negativity is negativity and positivity is positivity so you can see who's going in a direction of positive of positive things and who's not. So and as time goes on I mean your thinking has to change."},{"speaker":"Marcus","time":"00:27:42-0","content":"Yes. So, how far into your sentence at Angola did you kind of realize that this is the direction you wanted to go into?"},{"speaker":"Steven","time":"00:27:53-2","content":"Well when I, when I came here I was already when you leave your family it's already a disappointment."},{"speaker":"Marcus","time":"00:28:03-1","content":"Okay."},{"speaker":"Steven","time":"00:28:04-5","content":"So when you come into a place like this you don't want to keep on being a disappointment. So, when you come here that this is a place where you have to be able to not only be strong for yourself, be strong for you family as well because if your family sees that you're doing the right things, the positive things that in transition of trying, work on still trying to get out of prison because I mean nobody, I mean, I ain't want to say nobody but I don't want to remain in prison for the rest of my life. So, you have to be able to get on a get on a journey where you can still make your family proud of who you are."},{"speaker":"Marcus","time":"00:28:52-6","content":"Ok, I get it. So pretty fairly soon into your sentence you realized that?"},{"speaker":"Steven","time":"00:28:57-5","content":"Well when I first came I went to the B block. And the reason was because sometime when you young you just come to prison sometime security they feel like maybe you need to work your way. Into population because population in cell block, it's just a totally whole different world sometime."},{"speaker":"Marcus","time":"00:29:18-4","content":"Right."},{"speaker":"Steven","time":"00:29:19-1","content":"When you go to, you have less movement to more movement when you in population. So, and I worked in there for a while, I worked in there. They have a thing where you have to go on the board to see how you operating and what you doing and etcetera. So they say, \"Well okay well then we going to give you a chance an opportunity to go down to walk.\" Which is in population and I been in population ever since."},{"speaker":"Marcus","time":"00:29:47-9","content":"Yes. Is that for your protection?"},{"speaker":"Steven","time":"00:29:50-6","content":"No most people, when they come to prison they don't really know what to expect, they don't know what's going on. It's not for any protection it's just really just a way"},{"speaker":"Marcus","time":"00:30:02-7","content":"Get you acclimated."},{"speaker":"Steven","time":"00:30:03-9","content":"Yes, it's just the way they just do things."},{"speaker":"Marcus","time":"00:30:06-5","content":"Sure, ok. So tell me what your typical day is like now when you get up in the morning, what's your routine?"},{"speaker":"Steven","time":"00:30:21-0","content":"Well, when I get up in the morning I always thank god for another day because I mean I know that I couldn't have been who I am today without him. That's firsts and foremost. And giving me the strength to be able to get up in the morning and to be able to do the things that I do. But, when I get in the morning I mean I just try to look for ways to maybe be an encouragement to somebody or somebody being an encouragement to me. Because, like I say they got negativity in here all day long, every day."},{"speaker":"Steven","time":"00:30:21-0","content":"I mean it's no difference from the way that a person would get up on the street because I mean you gone if you gone live in this house, you got to pay bills. Which we don't pay any bills in here, so to speak, but you just it just being conscious of what you need to be doing for your life this day whether it's, going over to a hospital, helping a patient. Most times I go to the hospital and I might go see a patient, or I might go see the coordinator."},{"speaker":"Steven","time":"00:30:21-0","content":"I might ask the coordinator if there's anything that need to be done or anything that need anything any patient may need. I try to start my day with that because, hospice is a volunteer program. But I also have a 40 hour, I work in a library. So I have to balance those two throughout my day. Plus I'm a quilter so I sew. So I have to I have those things that I have to really be thinking about all the time."},{"speaker":"Steven","time":"00:30:21-0","content":"Sometimes I spend, sometimes in the morning time sewing or sometime if I'm not sewing I might have to go to work. And if I'm not working I will make a few rounds in the hospital, and I have to."},{"speaker":"Marcus","time":"00:32:26-5","content":"It's a busy day."},{"speaker":"Steven","time":"00:32:26-9","content":"It's a busy day, very busy."},{"speaker":"Marcus","time":"00:32:29-3","content":"I think it takes somebody very special to do hospice work."},{"speaker":"Steven","time":"00:32:32-7","content":"Thank you."},{"speaker":"Marcus","time":"00:32:33-1","content":"I mean I don't think it's something anybody can do. How long have you been doing that?"},{"speaker":"Steven","time":"00:32:40-1","content":"I've been in hospice since 1997."},{"speaker":"Marcus","time":"00:32:43-1","content":"Wow."},{"speaker":"Steven","time":"00:32:43-6","content":"When I came I came to prison in 1992, September of 1992. And in 1993 I came - in population. And four years after that hospice was born. And at that time they were just asking people. Well like Chico and Norris Henderson, you probably familiar with them."},{"speaker":"Steven","time":"00:32:43-6","content":"And Chico seen me and another guy coming through the gate and he said \"man look we just had a meeting with the warden\" They said man they said \"I know you would be a good hospice volunteer.\" I'm like \"you think so?\" And they was like yea. And actually that's how I got in hospice and I been in hospice ever since."},{"speaker":"Marcus","time":"00:33:28-6","content":"Well, I don't know that I don't think I've talked to anybody who's managed to stick out hospice for twenty years. Some people do it for a little while, because it takes an emotional toll. So, let me ask you a difficult question about this."},{"speaker":"Marcus","time":"00:33:28-6","content":"Okay, so, I think when you're doing hospice on daily basis you're kind of, while you're helping people in a very meaningful way, you're also being confronted with: these men are dying here in prison. Which has to be a little difficult because it must also make you aware that that could be you."},{"speaker":"Steven","time":"00:34:11-6","content":"Okay."},{"speaker":"Marcus","time":"00:34:13-1","content":"Does that go through your mind? And if it does how do you cope with, with that idea that you might not get out?"},{"speaker":"Steven","time":"00:34:20-9","content":"I'm always hopeful, alright, first and foremost. When I joined hospice I didn't know I never heard of hospice before, even while I was on the street. I never really actually heard of hospice, I ain't never worked in hospice. But my oldest sister Brenda, she used to always she used to always help like older people, like in the community. And whether she would have to cook for them or like one lady she was Ms. Geraldine. She had a stroke."},{"speaker":"Steven","time":"00:34:20-9","content":"And my sister used to always take me over there with her and I had to pick up on anything she was me to do those, the manly things, while she cared for her. And I think that I didn't know that me seeing that and me being with her that she was really mentoring me without me even knowing that that was what I would be doing. And so when I got into hospice I was like I didn't know that when a guy get in hospice that he's going to pass away, he's going to die , and he's going to."},{"speaker":"Steven","time":"00:34:20-9","content":"So my answer to you is that I think that I try to take one day at a time and I try not to allow my mind to go there but it is a reality. And I try not to see myself there, and I try not to see myself in that situation. So, I try my best to take that one day at time and allow myself to really, sometimes try to just it is a reality and sometimes, reality we don't want to see or don't want to face."},{"speaker":"Steven","time":"00:34:20-9","content":"But I just try to be hopeful about the things that I do for those guys and it be in the reverse for me. What I, that me giving them their hand and helping them to transition from this life to the next that maybe what I'm saying that my transition might be to the other side. If that makes any sense."},{"speaker":"Marcus","time":"00:34:20-9","content":"Do you mean that somebody might be there to take care of you?"},{"speaker":"Steven","time":"00:36:57-7","content":"Well not."},{"speaker":"Marcus","time":"00:36:59-3","content":"Or do you think of somebody just letting you transition getting out?"},{"speaker":"Steven","time":"00:37:02-3","content":"Getting out."},{"speaker":"Marcus","time":"00:37:02-8","content":"Ok, I got it."},{"speaker":"Steven","time":"00:37:05-1","content":"Because I think life is a sowing and reaping its principle. I've been raised up on principles. And I think that if, that if you do good I believe that good will come back to you. I mean sometimes you can do bad then bad will come back to you. So just believe that if you do good that good will come back to you. It'll reward you some way somehow."},{"speaker":"Steven","time":"00:37:05-1","content":"I think that the reward that when you actually give yourself to somebody and become their hands their eyes their feet their mouth their ears. When you can actually be able to give yourself to somebody you not sending somebody for you but actually giving you to that person and his transition. I think that a great reward will be given unto that person."},{"speaker":"Marcus","time":"00:38:13-5","content":"Do you find that a lot of the guys that you tend to are very fearful? Are they very frightened about dying?"},{"speaker":"Steven","time":"00:38:21-4","content":"Some are because I think that, nobody knows about what they will encounter when they see death. Because death is a spiritual thing. And I think that when a person sees death, or we don't know what he see. But he can only describe to us what he seeing. So I think that that if a person has lived a good meaningful life in prison or out of prison. I think he has no fear."},{"speaker":"Steven","time":"00:38:21-4","content":"But if a person has been doing things that he know that he shouldn't have been doing or he actually just have never gotten himself right with his god, I think that, that sure would be fearful. That sure he will be he don't know what to expect because he know he's done some things that you that he's not proud of."},{"speaker":"Marcus","time":"00:39:30-9","content":"Sure. Are there other organizations that you've been a part of, they say you go up before a pardon board, they always want to see a list of things that you can do."},{"speaker":"Steven","time":"00:39:42-0","content":"I have taken hundred hours, I've taken anger management, I been in cases concerning with hospice, concerning body mechanics. Helping to assist patients. I been in effective listening with the ministers. I mean have been moving around in different organizations but I guess that hospice is just one that it just really kind of like has overtaken me."},{"speaker":"Marcus","time":"00:40:19-6","content":"It spoke to you."},{"speaker":"Marcus","time":"00:40:19-6","content":""},{"speaker":"Steven","time":"00:40:20-0","content":"Yes, it just kind of overtake because I mean those organizations they basically give you something. But with hospice it basically gives me something it gives me something that I can't even repay."},{"speaker":"Marcus","time":"00:40:35-3","content":"Yes, well you're also giving something."},{"speaker":"Steven","time":"00:40:37-9","content":"And then I'm giving."},{"speaker":"Marcus","time":"00:40:39-0","content":"When you look back on the events of the day or night that got you here, and you think about the victim's family, it's just been to me it's just been an unfathomable amount of time to look back 25+ years on one event. What are your feelings about it now?"},{"speaker":"Steven","time":"00:41:02-3","content":"Sometime with that, I always pray for him and the family and it's you always I mean I always feel that if I had the opportunity or the chance to really to say something to them it would be I wish that that day would never have come. But I've always offered my prayers to them, sincerely. Because I know that in life that nobody wants to experience those type of losses. Nobody wants to experience those type of pains. And just sometime just to think about it's always painful."},{"speaker":"Marcus","time":"00:41:49-1","content":"I mean when there's the victim's family, but there's also your family - your family lost two family to prison. How - and it sounds to me like that was not part of what was expected in your family. What was the impact of that on your family and who do you think took it the worst?"},{"speaker":"Steven","time":"00:42:14-4","content":"I think my mother did because mothers they grieve more different from anybody in the family because they come from your mother. And so I think that my mother probably have grieved more than anybody else in the family. I believe second my father because I mean because we're his seeds."},{"speaker":"Steven","time":"00:42:14-4","content":"I think that, the grieving process for them, I mean even my mother she, mothers they'll express their hurts and pains and stuff where us as men our father he may be just he may not show it, but it exist."},{"speaker":"Marcus","time":"00:43:05-9","content":"Sure. You said your mother passed away in 2002. That's kind of early. She must have been fairly young."},{"speaker":"Steven","time":"00:43:13-7","content":"Yes, She was 69."},{"speaker":"Marcus","time":"00:43:14-7","content":"Ok. Would your parents come and visit you quite often."},{"speaker":"Steven","time":"00:43:21-1","content":"My father would come twice a month."},{"speaker":"Marcus","time":"00:43:25-0","content":"Ok."},{"speaker":"Steven","time":"00:43:26-8","content":"And he did that for I just really, really have to say look we are fine. But it's just a parent. Or just parent instinct that just couldn't stop him. So, my father passed away when he was 84. And he would come. He would come twice a month wouldn't miss it."},{"speaker":"Marcus","time":"00:44:05-6","content":"Yes."},{"speaker":"Steven","time":"00:44:09-1","content":"And back then even if he wanted to come and he had to use his - his two visits that month he can always they had a system at that time, you can call and say \"Look I want to see my son I mean I miss him\" Or whatever you get on the phone and the warden be like ok \"come on in.\" So they had a little system back then, I mean not no more, but at that time they had a little system where you can actually say look I miss him I want to come and they would approve it and let him come on in, so."},{"speaker":"Marcus","time":"00:44:41-0","content":"Yes I always think about that these visits must be particularly difficult. I mean they're great you see your loved ones, but then you're also kind of confronted with that I mean the visiting got to be an intense place."},{"speaker":"Steven","time":"00:44:55-4","content":"It is. It's very because you got a lot of you got a lot of people that has to deal with family issues, a lot of people that has to deal with legal issues, got people that come something they have to deal with their kid issues. So it's a lot of stuff that that being dealt with there."},{"speaker":"Marcus","time":"00:45:20-4","content":"Tell me about the last interaction that you had with your father."},{"speaker":"Steven","time":"00:45:26-6","content":"When he came to see me and when he came to see me I think it was in 2011."},{"speaker":"Marcus","time":"00:45:38-6","content":"Ok. So he got to a point where he couldn't make the trips anymore?"},{"speaker":"Steven","time":"00:45:42-7","content":"Yea, well, well after he started coming and after he started coming I just had told him I said \"Dad you been coming for a long time\" I say just take you a break. I mean long as I can we talk on the phone and we can chit chat and stuff like that. I think that's appropriate. Chill out, take you a break. I didn't know how he was going to feel about it so but he wind up, he wind up taking it a little well."},{"speaker":"Steven","time":"00:45:42-7","content":"So after he wind up taking it well, then that was right after Hurricane Katrina, because they got up in Hurricane Katrina as well. And they wind up moving from here and got this place and it just was a whole lot of stuff going on with some of that. I'm good just take your break and he did and then after that he had got sick when he got sick. We would still talk, we would still talk on the phone, we would still chit chat and this and that and this and that. It's a hard one."},{"speaker":"Marcus","time":"00:47:01-7","content":"So let me ask you something that might seem a little odd you've been in prison for a while and I think that what's difficult about prison experience maybe changes depending on the various stages you are in your life. What's the, I mean you've got your whole routine, you're a trusted member of this community, you have certain amount of freedom because of that, you're a hospice volunteer and then of course your job, you live a pretty busy life. But what's the worst part of the prison experience for you now?"},{"speaker":"Steven","time":"00:47:36-9","content":"Well, meaning."},{"speaker":"Marcus","time":"00:47:41-4","content":"Yes what's the worst part of this thing? So for example when you first came here it might have been dealing with the uncertainty and the violence and the prospect of whatever it might be, after a while it could be something else."},{"speaker":"Steven","time":"00:47:56-3","content":"Well."},{"speaker":"Marcus","time":"00:47:57-7","content":"I mean, there's difficult things in life all the time."},{"speaker":"Steven","time":"00:47:57-7","content":"Inside of a community."},{"speaker":"Marcus","time":"00:48:04-5","content":"Yes."},{"speaker":"Steven","time":"00:48:05-4","content":"The way that I, I try to deal with it, like I do now is really no different from society. You going to always see guys who doing things their way or doing things try to do what they want do. The only consequences concern it is that whatever they do they got the consequences of getting locked up. When I get up in the morning I mean my there are times where that I may have to be here, I may have to be there I may have to be over here or whatever. But you have your own, you have your agenda."},{"speaker":"Steven","time":"00:48:05-4","content":"I have my schedule that I try to stick to daily. I have responsibilities. Because what I do, the program benefit from. And so if I make no quilts well then then the program make no money. And if I'm not on my job, well somebody else maybe have to it or however. But so I have the responsibility of taking care of the things that that that has been entrusted in my hand. And sometimes it's not always easy because sometimes, you be wanting to do I do things I mean I work out, I just try to stick to my obligations."},{"speaker":"Marcus","time":"00:49:58-9","content":"Sure."},{"speaker":"Steven","time":"00:49:59-2","content":"If that can sum it up."},{"speaker":"Marcus","time":"00:50:01-2","content":"It makes sense in some ways I think it's a healthy parallel to make."},{"speaker":"Steven","time":"00:50:06-9","content":"Because I think one of the things that we have always they taught me in hospice is that, if you cannot take care of yourself, you can't take care of the patients."},{"speaker":"Marcus","time":"00:50:16-8","content":"Right"},{"speaker":"Steven","time":"00:50:17-5","content":"So I have to find time where I just need to just get away from different things."},{"speaker":"Marcus","time":"00:50:24-5","content":"And take care of yourself."},{"speaker":"Steven","time":"00:50:24-9","content":"And take care of myself. I like working out, I like trying to just maintain as best I could."},{"speaker":"Marcus","time":"00:50:34-0","content":"So I think being a hospice volunteer is an amazing thing to do, but of the various things that you've done, since you've been here, what are you most proud of?"},{"speaker":"Steven","time":"00:50:48-0","content":"Hospice."},{"speaker":"Marcus","time":"00:50:48-5","content":"Ok yea. I thought you would say that."},{"speaker":"Steven","time":"00:50:51-7","content":"I think hospice just has been a blessing to me."},{"speaker":"Marcus","time":"00:51:00-1","content":"Yes."},{"speaker":"Steven","time":"00:51:00-6","content":"I've seen a lot of people come in hospice just like I've seen a lot of people go. And, sometimes and I've seen friends that has been in this place that I have been knowing that has actually helped me to be who I am today, older guys, and had helped me to be who I am today that has come into hospice, and I had to take care of them. And a lot of times it do get scary when you go to see the people who you have been who has helped you and been talking to you now they're in this situation and so as I say before it's always a reality."},{"speaker":"Steven","time":"00:51:00-6","content":"The reality is always there and it's real. And, so, but it's always a good thing to when I can just get up and I can just not give money because we don't have, we can't have money in prison and all this kind of stuff but it's when you can actually just give yourself. Give yourself like you, but, like the way you would take care of yourself, that's how you give yourself."},{"speaker":"Marcus","time":"00:52:16-7","content":"Yes having said all of that about this is a community within a community and you can live a meaningful life here, you also said \"Don't get me wrong I want to get out of here\" So let's visit that for a minute. Can you paint a picture for me - what vision do you have let's say you go before the pardon board and they give you a fixed term and they release you. What's your plan? What how do you envision the next chapter of your life?"},{"speaker":"Steven","time":"00:52:48-2","content":"Well I do plan would like to have a quilting business because I understand the business. Because I been actually. I do work for hospice and hospice do not pay me to do what I do. I volunteer to do it, ok. And I would like to take and get me a business that's up and running because with quilting because I have a little skill, not much, but and I would just like to take one day at a time."},{"speaker":"Steven","time":"00:52:48-2","content":"To try to mend the mend the little pieces that has been left of me. Try to and live that one day at a time. When that time and that day comes I would. I mean I just try to keep my record as best I could. Try to avoid the things that need to be avoided in prison and just stay on my course."},{"speaker":"Marcus","time":"00:53:56-7","content":"Sure. Do you think you would go into hospice related work?"},{"speaker":"Steven","time":"00:54:01-8","content":"I would, I would. I wouldn't leave it out of my life."},{"speaker":"Marcus","time":"00:54:05-3","content":"Yes. Because there's definitely a need for it."},{"speaker":"Steven","time":"00:54:07-7","content":"I would love to take and to get some type of organization going and my quilting would be connected to the patients. I mean, I would I want to give that percentage to hospice profit for nonprofit business. I want to give that to give what I have to give to hospice and the things that need to be where I can take care of myself I would like to do that but I want it to be connected"},{"speaker":"Marcus","time":"00:54:47-7","content":"Yes. It's interesting a lot of the folks who get who have led a very meaningful life at Angola who then come out Norris, Chico, Cal there's a whole bunch of people I could say. The interesting thing is that they continue to do almost exactly what they were doing inside the prison but they didn't from outside. Which means it was really meaningful then, it's not just a way of."},{"speaker":"Steven","time":"00:55:13-6","content":"Exactly."},{"speaker":"Marcus","time":"00:55:14-5","content":"So I get that, yes. So, I feel honored to have been able to sit with you and talk with you. I very much appreciate your time, I know you're busy and I've taught a lot about you so thank you."},{"speaker":"Steven","time":"00:55:28-5","content":"I know you can keep on going on and on."},{"speaker":"Marcus","time":"00:55:31-2","content":"I could. Let me leave with one last question which is similar to the question I asked you earlier: is there something about your time at Angola that I didn't ask you about that you think is important?"},{"speaker":"Steven","time":"00:55:44-1","content":"Well, when Chico and Norris those guys was here before me, Shante I remember him as well and I came in contact with those guys and they were very serious and focus minded. They had their agenda, listed. What they was going to do and how they was going to do what they was going to do. With the same in mind of getting out of here. I've watched them, most likely without them probably even knowing that they were being watched by me. But they were mentoring me as well on how to navigate myself through this prison."},{"speaker":"Steven","time":"00:55:44-1","content":"So, it's always people that sometimes that go sometimes before you just like I believe that there are people that's watching me, how I navigate through this prison. So with people that's just the way of life if you want something sometimes you have to wait your turn to get it. And then when you're number when your time has come and then you have to be able to be some type of leader to somebody's that's watching you. And sometimes leadership it's, it's a lot of responsibility."},{"speaker":"Steven","time":"00:55:44-1","content":"And sometimes you don't sometimes what you do it can because other people to wreck or to bump their car or their vehicle or even go on side of the road. So I just try to be steadfast in what I do, steadfast in what I say, steadfast in the journey that I'm on. And so with those guys that was before me Chico, Norris, Shante and all these other guys that that was before me I mean I've watched enough to know that I have to stay my course."},{"speaker":"Marcus","time":"00:57:53-1","content":"Sure."},{"speaker":"Steven","time":"00:57:54-9","content":"I have to stay my course and I think that my reward will be pretty much the same"},{"speaker":"Marcus","time":"00:57:59-7","content":"Yes, and I wish you all good things. So thank you."},{"speaker":"Steven","time":"00:58:05-1","content":"You're welcome."}]}