{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:55:13",
      "content": "Surge Sherman Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:55:13",
      "upperBoundTime": "00:00:03",
      "content": "Can you go ahead and state your name."
    },
    {
      "speaker": "Surge",
      "time": "00:00:03",
      "upperBoundTime": "00:00:18",
      "content": "Surge Sherman. I'm currently 44 years old born, August 22nd, 1972. Was convicted of second degree murder. Approximately have served 26 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:18",
      "upperBoundTime": "00:00:40",
      "content": "So Surge I'm going to ask you a few questions about your life before you were arrested for this crime. Can you tell me starting off with maybe just looking back at your family can you tell me a little bit about the people who raised you?"
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "I actually grew up in a relatively stable household. Mother, father, siblings 3 sisters 2 older than me and one younger sister. My household was like any other urban household in poverty stricken area we didn't have much but we managed in some way my father extremely worked 2, 3 jobs. So the household was stable but like any other household in America 90% of households are dysfunctional."
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "So on occasions you would see some of these dysfunctionalities occur in my household. For instance my daddy he drank and of course he had these tantrums that he would be angry at times so in my household my parents fought a lot which I didn't like. But as far as being a provider and an individual that reflected manhood my dad was perfect in that sense."
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "One instance that stands out about my childhood that perhaps contribute to some of my problems at an early age I wanted to play football and I was relatively good at football and one particular instance my coach would bring me to practice and our games et cetera."
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "So we had won the championship and as a reward the coach took the team to chuck e cheese and I didn't get home till like 11 o'clock. So I come in the door with my trophy and my father asked me well where you been all night its 11 o'clock and I explained we had won the championship."
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "I was most valuable player and showed him the trophy and he took it and threw it down and he made a statement that kind of resonated with me throughout my juvenile life is that you shouldn't waste your time playing sports and that instance kind of like discouraged me from playing sports."
    },
    {
      "speaker": "Surge",
      "time": "00:00:40",
      "upperBoundTime": "00:03:14",
      "content": "So the dysfunctionality even though in order to do better you must know better my father did a relatively good job raising me. I think that the lack of motivation or encouraging me to pursue an interest in life contributed to me having a disinterest in obviously leading to the street."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:14",
      "upperBoundTime": "00:03:16",
      "content": "Did you grow up in New Orleans?"
    },
    {
      "speaker": "Surge",
      "time": "00:03:16",
      "upperBoundTime": "00:03:20",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:20",
      "upperBoundTime": "00:03:23",
      "content": "Where in New Orleans?"
    },
    {
      "speaker": "Surge",
      "time": "00:03:23",
      "upperBoundTime": "00:03:33",
      "content": "Its called the third ward off of Freret not too far from Shakespeare Park and down the block from what was then the Magnolia project."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:33",
      "upperBoundTime": "00:03:35",
      "content": "Was there physical violence in your house?"
    },
    {
      "speaker": "Surge",
      "time": "00:03:35",
      "upperBoundTime": "00:03:52",
      "content": "No outside of my mother and father physically engaging in confrontations we didn't catch whoopings we might have been reprimanded for certain things like any other parent would do a child but as far as sexually or hitting and whooping there was no disciplinary."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:52",
      "upperBoundTime": "00:03:54",
      "content": "Ok but there was quite a lot of routine physical violence between your mother and father."
    },
    {
      "speaker": "Surge",
      "time": "00:03:54",
      "upperBoundTime": "00:04:04",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:04",
      "upperBoundTime": "00:04:05",
      "content": "Which is difficult to watch."
    },
    {
      "speaker": "Surge",
      "time": "00:04:05",
      "upperBoundTime": "00:04:09",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:09",
      "upperBoundTime": "00:04:30",
      "content": "So I'm fairly familiar with where you're talking about but if I kind of take me back there for a minute so if I'm sitting next to you on the stoop of your front door looking out into the neighborhood on a typical day when you were a teenager what would I see?"
    },
    {
      "speaker": "Surge",
      "time": "00:04:30",
      "upperBoundTime": "00:05:52",
      "content": "You would see like any other condition of poverty restriction it was very poor abandoned buildings trash garbage outside the corners of the alleys of that nature. But on the other hand you would see people that enjoyed themselves typical neighbors engaging in one another sitting on the porch and then as an additional element are those that engage in illicit activities not too far off from where you might ride your bike or be playing marbles with the neighborhood kids or in the park throwing the ball playing basketball."
    },
    {
      "speaker": "Surge",
      "time": "00:04:30",
      "upperBoundTime": "00:05:52",
      "content": "So that was the conditions I grew up not too far from my porch you had guys hanging on the corner selling drugs you had women engaging in high risk activities that they engage in those activities but at the same time you had people on the porch enjoying each other and the company of the family."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:52",
      "upperBoundTime": "00:05:56",
      "content": "Okay. How old were you when that incident occurred with the football trophy."
    },
    {
      "speaker": "Surge",
      "time": "00:05:56",
      "upperBoundTime": "00:06:02",
      "content": "I had to be approximately 9 years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:02",
      "upperBoundTime": "00:06:04",
      "content": "And after that did you continue to play sports?"
    },
    {
      "speaker": "Surge",
      "time": "00:06:04",
      "upperBoundTime": "00:06:07",
      "content": "No sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:07",
      "upperBoundTime": "00:06:13",
      "content": "Okay, so did you have a couple of people or a best friend that you remember from growing up?"
    },
    {
      "speaker": "Surge",
      "time": "00:06:13",
      "upperBoundTime": "00:06:53",
      "content": "Actually I was mostly a loner. Occasionally I used to play with a child called Kevin Calhoun and mostly he was a single his self I'm the only boy in my family. So I never really kind of like engaged in a friendship with my sisters although we close."
    },
    {
      "speaker": "Surge",
      "time": "00:06:13",
      "upperBoundTime": "00:06:53",
      "content": "And so every now and then we might play with the spinning a top or ride each other bikes or one incident in particular I slept by his house he slept by my house but for the most part of my childhood I was alone."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:53",
      "upperBoundTime": "00:06:57",
      "content": "Are you in touch with anybody from your childhood today?"
    },
    {
      "speaker": "Surge",
      "time": "00:06:57",
      "upperBoundTime": "00:07:01",
      "content": "Yes teenage childhood not adolescent."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:01",
      "upperBoundTime": "00:07:03",
      "content": "Okay so who are they?"
    },
    {
      "speaker": "Surge",
      "time": "00:07:03",
      "upperBoundTime": "00:07:13",
      "content": "A friend named Germaine, my fall partner which is named Tony individuals from the age of 14 years old to now."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:13",
      "upperBoundTime": "00:07:15",
      "content": "And are they here?"
    },
    {
      "speaker": "Surge",
      "time": "00:07:15",
      "upperBoundTime": "00:07:20",
      "content": "No one stay in Mississippi and the other stay in Atlanta."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:20",
      "upperBoundTime": "00:07:23",
      "content": "Is your fall partner incarcerated?"
    },
    {
      "speaker": "Surge",
      "time": "00:07:23",
      "upperBoundTime": "00:07:33",
      "content": "No sir he received 10 years and was released in the early 90s 2000s."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:33",
      "upperBoundTime": "00:07:36",
      "content": "Who comes up here to visit you?"
    },
    {
      "speaker": "Surge",
      "time": "00:07:36",
      "upperBoundTime": "00:08:03",
      "content": "I have well my family periodically my father stay in Chicago. So every year he come my sisters one stay in Texas the other ones stay in Arizona. So they come mostly to the rodeo. I have a friend she come she stay in California like every six months."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:03",
      "upperBoundTime": "00:08:05",
      "content": "What about school did you ever get kicked out of school"
    },
    {
      "speaker": "Surge",
      "time": "00:08:05",
      "upperBoundTime": "00:08:24",
      "content": "Frequently I had a behavioral problem in most instance had a difficult time with authority. So regularly I would get kicked out"
    },
    {
      "speaker": "Marcus",
      "time": "00:08:24",
      "upperBoundTime": "00:08:27",
      "content": "Have you got kicked out for fighting?"
    },
    {
      "speaker": "Surge",
      "time": "00:08:27",
      "upperBoundTime": "00:08:37",
      "content": "Not that I can recall just not doing what the teacher asked me. Being tardy you now stuff of that nature."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:37",
      "upperBoundTime": "00:08:39",
      "content": "Do you have a specific memory of school?"
    },
    {
      "speaker": "Surge",
      "time": "00:08:39",
      "upperBoundTime": "00:08:41",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:41",
      "upperBoundTime": "00:08:41",
      "content": "Can you tell me."
    },
    {
      "speaker": "Surge",
      "time": "00:08:41",
      "upperBoundTime": "00:09:34",
      "content": "The talent show. I was in elementary and it was actually square dancing and at the time new edition which was a popular RnB so we had to mimic new edition and the teacher had me play Ravi which was the lead singer. So I was excited about that and that would kind of like stuck out and kind of like throughout my life I have always been put in positions of that nature where I have to lead. So that kind of like stimulated me being in a position of directing and leading others"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:34",
      "upperBoundTime": "00:09:38",
      "content": "Yeah. What was the highest grade that you finished in school?"
    },
    {
      "speaker": "Surge",
      "time": "00:09:38",
      "upperBoundTime": "00:09:38",
      "content": "12."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:38",
      "upperBoundTime": "00:09:41",
      "content": "Any college."
    },
    {
      "speaker": "Surge",
      "time": "00:09:41",
      "upperBoundTime": "00:09:47",
      "content": "Post graduate school through correspondence of that nature since I've been here."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:47",
      "upperBoundTime": "00:09:50",
      "content": "But you finished 12th grade before here. What school?"
    },
    {
      "speaker": "Surge",
      "time": "00:09:50",
      "upperBoundTime": "00:09:56",
      "content": "Booker T Washington."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:56",
      "upperBoundTime": "00:10:04",
      "content": "Did you have fights regularly as a kid outside of the house?"
    },
    {
      "speaker": "Surge",
      "time": "00:10:04",
      "upperBoundTime": "00:10:22",
      "content": "Not that I can actually recall that was extensive of course kids going to engage in altercations and have conflict but it was never extensively like repetitiously fighting."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:22",
      "upperBoundTime": "00:10:26",
      "content": "What about girls? You have girlfriends?"
    },
    {
      "speaker": "Surge",
      "time": "00:10:26",
      "upperBoundTime": "00:10:30",
      "content": "I had one girlfriend Laquana."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:30",
      "upperBoundTime": "00:10:34",
      "content": "Tell me about the one that sticks in your mind the most."
    },
    {
      "speaker": "Surge",
      "time": "00:10:34",
      "upperBoundTime": "00:11:08",
      "content": "Laquana London. I would say that was the only one that kind of stick out in my mind because from the age of 14 to 16 we was considered girlfriend and boyfriend. So she kind of stick out. I come to jail when I was 18. So that period of my life really she the only one that I would consider a girlfriend. Of course I had engaged with additional women but as far as a relationship wise? Her."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:08",
      "upperBoundTime": "00:11:12",
      "content": "What's she up to now do you know?"
    },
    {
      "speaker": "Surge",
      "time": "00:11:12",
      "upperBoundTime": "00:11:21",
      "content": "Last time I heard from Laquana she was working at an insurance company she had got married had kids. So she doing relatively well."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:21",
      "upperBoundTime": "00:11:23",
      "content": "Do you have any kids?"
    },
    {
      "speaker": "Surge",
      "time": "00:11:23",
      "upperBoundTime": "00:11:25",
      "content": "Yes sir. 2."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:25",
      "upperBoundTime": "00:11:28",
      "content": "Can you tell me about them?"
    },
    {
      "speaker": "Surge",
      "time": "00:11:28",
      "upperBoundTime": "00:11:58",
      "content": "Jaiquisha is 26 and Brittany was, just had a baby girl she's 25. And both of them every now and then most of them come to the rodeo it's like this event that transpires that goes on like more of a family setting and they attend the rodeo we regularly email receive letters things of that nature and I assist them as much as I can."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:58",
      "upperBoundTime": "00:12:01",
      "content": "How does it feel to be a grandpa?"
    },
    {
      "speaker": "Surge",
      "time": "00:12:01",
      "upperBoundTime": "00:12:41",
      "content": "It's bitter and sweet because I'm not there and my biggest regret that they was born at the time I became incarcerated. So I never had the opportunity to really raise one of my offspring and so that's a hurtful and painful experience at the same time the joy it brings by introducing another life into this world that kin to me. And being just wanting to be able to assist and teach them and depart some life lessons that could contribute to their growth and stability of life."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:41",
      "upperBoundTime": "00:13:07",
      "content": "Sure. So you were so young really a kid when you if you set aside the crime that brought you here would you say that your life had gone down the wrong path already?"
    },
    {
      "speaker": "Surge",
      "time": "00:13:07",
      "upperBoundTime": "00:15:10",
      "content": "Yes and for several reasons. I was introduced to the streets at a younger age and that influence had conditioned me to believe that the American way to succeed in life is by illicit or asocial behavior. And so by me going down the path of crime and illicit activities engaging on a regular basis eventually its only 2 options and alternatives."
    },
    {
      "speaker": "Surge",
      "time": "00:13:07",
      "upperBoundTime": "00:15:10",
      "content": "A life of incarceration or the graveyard. So despite this crime it would've been another crime because a person mentality they outlook on life has to be altered to be traditional such as the American traditional process you go to school you get educated you get a good job you get married."
    },
    {
      "speaker": "Surge",
      "time": "00:13:07",
      "upperBoundTime": "00:15:10",
      "content": "You start a family you get a house a car a boat you take vacation you retire. Whereas in most urban settings and these communities we are taught that the way to succeed in life is by selling drugs robbing or taking what you want. Getting and don't care about the consequences whether you live or die."
    },
    {
      "speaker": "Surge",
      "time": "00:13:07",
      "upperBoundTime": "00:15:10",
      "content": "So that mentality conditions most youth as a byproduct of these poverty restricted areas. That if its not today its tomorrow unless they're able to be reached and because I had no social agent or external individuals to assist me in showing me a better way in order to do better you must first learn better. Then eventually I would've either came back if not for second degree murder but some other nature of charge of offense or wind up dead."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:10",
      "upperBoundTime": "00:15:14",
      "content": "So do you think in all likelihood had you not been incarcerated you probably would have been killed at some point?"
    },
    {
      "speaker": "Surge",
      "time": "00:15:14",
      "upperBoundTime": "00:17:06",
      "content": "Yes most definitely. The path I was on. Not of course now I got associates that I grew up with that still alive today and but they can't break the cycle its as if they stagnated into one stage of life and its usually the lifestyle that we lived at the age of 14 there's no growth there's no development they haven't advanced they're still staying in the same poverty restricted uptown area on Freret and so there's no progress only because they haven't developed or learned skills or acquired knowledge or equipped themselves to be productive and advance."
    },
    {
      "speaker": "Surge",
      "time": "00:15:14",
      "upperBoundTime": "00:17:06",
      "content": "And that's one of the unique characteristics about America there's no social stratification for your success or where you go in life is based on your choices that you making of course some say an agent of luck but in most parts you have a chance and a opportunity to advance yourself based on the choices you make that your level of ambition your determination your skillset and its a variety of different factors that come together that contribute to success."
    },
    {
      "speaker": "Surge",
      "time": "00:15:14",
      "upperBoundTime": "00:17:06",
      "content": "So I can actually say because I know friends I grew up with that still living today."
    },
    {
      "speaker": "Surge",
      "time": "00:15:14",
      "upperBoundTime": "00:17:06",
      "content": "But I do know that path I was on was a destructive path and it's only usually its only two consequences that lead the end result of those paths."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:06",
      "upperBoundTime": "00:17:09",
      "content": "How much time passed between your arrest and your coming to Angola?"
    },
    {
      "speaker": "Surge",
      "time": "00:17:09",
      "upperBoundTime": "00:17:15",
      "content": "My arrest 1991. Approximately July the 6th will be 26 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:15",
      "upperBoundTime": "00:17:20",
      "content": "How old were you?"
    },
    {
      "speaker": "Surge",
      "time": "00:17:20",
      "upperBoundTime": "00:17:24",
      "content": "18."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:24",
      "upperBoundTime": "00:17:25",
      "content": "So you were 18 when you came to Angola?"
    },
    {
      "speaker": "Surge",
      "time": "00:17:25",
      "upperBoundTime": "00:17:30",
      "content": "Well I was actually 19 I stayed like a year and half in the parish."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:30",
      "upperBoundTime": "00:17:33",
      "content": "Parish."
    },
    {
      "speaker": "Surge",
      "time": "00:17:33",
      "upperBoundTime": "00:18:56",
      "content": "I tell guys all the time we do all the wrong in the world to get here but once here we do all the right in the world just to live here. And usually when you begin to recognize the need to change it's derived from a displeasure from how, who you were. And everything in which I done today all I had to do was do that out there as a free man because one of the greatest commodities afforded to man is freedom. The will to do the will to go."
    },
    {
      "speaker": "Surge",
      "time": "00:17:33",
      "upperBoundTime": "00:18:56",
      "content": "So I done all of these things as an incarcerated individual under the condition of being regulated because this is a controlled environment. But all I had to do the same things on my own terms and under my own circumstances and that's what's so ironic about it because everything we should have done we come here and realize we need to do my father put emphasis on education but education wasn't considered of value to me when I was home but as an incarcerated individual education is a priority."
    },
    {
      "speaker": "Surge",
      "time": "00:17:33",
      "upperBoundTime": "00:18:56",
      "content": "So it's sort of ironic."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:56",
      "upperBoundTime": "00:19:28",
      "content": "Let me ask you a difficult question about what you just said. So all these things that are relatable to folks here vocational programs self-help programs I mean so many things educational how do you how do you make sense of all of those things and then make sense of the reality of life a life sentence without the possibility of parole?"
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "Hope. And the interest of knowing that this is not the end. You know George Bernard Shaw which is a famous playwright and poet put it this way he say a lot of time people blame they circumstances for who they are but they don't believe that peoples circumstances should be used as a crutch. For the one that truly gets on in life is the one that is able to pick up the pieces and find the circumstances that they want. And if they can't find them create them."
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "I don't think man should be defined by one mistake he made as an adolescent I think that you should be defined by who you are and where you're going. Sure as a human we make mistakes we subjected to destructive emotional reactions and responses that if not tame can contribute and lead to a mistake and it only take 1 second to ruin your whole life."
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "So my position on that particular question is that when you begin to define yourself and have the energy and drive and ambition to want to do better every man life should be spent pursuing the destiny. And so the question today is not 26 years of incarceration and the perception of I waste my life for this is awful or ill actually is something positive because I'm able to convert a negative situation to something positive. In old Egypt because they didn't have obituaries the high priest when a person died simply asked did a man have substance."
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "So I look at today and my experience my life I could easily dwell and hackle over the fact that I'm here and been here 26 years at the age of 18 or I could pick up the pieces and find something that I want worthy of my life."
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "Khalil a famous philosopher once stated do you make chain and shackle me for my mind remains free and one thing that cannot be restricted or constrained is my ability to dream. To get what I want out of my life despite the circumstances. To pick up the pieces and find the circumstances that I want."
    },
    {
      "speaker": "Surge",
      "time": "00:19:28",
      "upperBoundTime": "00:22:51",
      "content": "So for the vast majority of individuals in Angola which is a unique maximum security facility as you can contest is that you have an influx of individuals that want to be better that want to do better and have the hope of a second chance to be able to show hey this is not going to define who I am as a person I made a mistake but who I am today and where I'm going tomorrow should contribute to my legacy and of course leave a mark on this earth."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:51",
      "upperBoundTime": "00:23:19",
      "content": "I want to ask you about some of the things you've done since you've been here. We're talking to you because you're considered a trusted member of the community who's turned his life around. Can you just take a minute and describe the 19 year old that walked that I guess was driven in those gates."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "Certainly. When I first entered Angola I had a difficult time adjusting and learning and looking back how I was able to advance from that state or that way of thinking my attitude was that I had a difficult time adjusting to authority prison controlled environment it tended to depersonalize you, which is the process of distancing you from any sense of self and its understandable because in order to regulate your behavior they have to break you or distant any association from what you think about yourself such as your identity."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "So I come from an environment where respect and the lifestyle I was living we called it ghetto fabulous where I sold drugs and I was relatively successful at it and so I was used to being treated a certain way so when I come to prison it the reality instantly set in that you're an inmate and you're a convict and I difficult time with that so I spent extensive amount of years like 7 and a half years on extended or camp j for several reasons."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "One I refused to work I felt at that age that I'm not here to work for 4 cents an hour I'm here to do time and since I'm going to be here I'm not going to spend it working your fields and picking your cotton for 4 cents."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "So there's a place there for you learn quickly there's a place for people like you who don't want to work. So I spent extensive period of time at J. but with every negative situation is something that's positive that come from it is how you perceive it and change your perception you change your reaction."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "So my perception despite being the extent of which is a harsher environment than the main prison or population I begin to enroll in correspondent course I begin to engage in self-help studies I begin to have a fascination with reading and learning. So I enrolled in economic course from Bennett school in Virginia a paralegal course from Blackstone law school and taking on independent studies."
    },
    {
      "speaker": "Surge",
      "time": "00:23:19",
      "upperBoundTime": "00:26:17",
      "content": "So it was actually a time for me to use that experience to gain a higher education at the state expense so to speak."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:17",
      "upperBoundTime": "00:26:20",
      "content": "Ok now 7 and a half years."
    },
    {
      "speaker": "Surge",
      "time": "00:26:20",
      "upperBoundTime": "00:26:23",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:23",
      "upperBoundTime": "00:26:51",
      "content": "That's how long it took for you to stop bucking the system and just start so for some people its just some people it takes longer but for some people it can be some kind of light bulb that goes off or some people it could be a mentor or somebody you see and you want to live by example what led to your changing your life around?"
    },
    {
      "speaker": "Surge",
      "time": "00:26:51",
      "upperBoundTime": "00:27:40",
      "content": "Well I begin to analyze my situation once I studied in and completed those correspondent courses I knew because of my family situation that I didn't have they didn't have money to pay for lawyers and when you in those environments such as standard lockdown you have to depend on others to litigate for you."
    },
    {
      "speaker": "Surge",
      "time": "00:26:51",
      "upperBoundTime": "00:27:40",
      "content": "You could write it all out your briefs your motions your post-conviction et cetera but unless you have a more hands on approach this your life and so I know I knew I had to come out extended in order to take advantage of the resources available to help myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:40",
      "upperBoundTime": "00:27:48",
      "content": "Oh ok I got you. So the motivation was I've got to help myself and then once you started helping yourself that was further motivation to keep going in that direction."
    },
    {
      "speaker": "Surge",
      "time": "00:27:48",
      "upperBoundTime": "00:29:07",
      "content": "Right and then you learn also how to for example they have a psychological disorder that we as prisoners tend to incorporate not consciously but it just happened subconsciously its called passive aggressive behavior. Passive aggressive behavior is instead of being direct and confrontational or straight to the point you find manipulative ways of achieving the same thing."
    },
    {
      "speaker": "Surge",
      "time": "00:27:48",
      "upperBoundTime": "00:29:07",
      "content": "So for say for example for security office say hey you get on the right side of the wall you supposed to be and I might say sarcastically well sergeant I apologize but I'm on my right you on your left and its a way to deal with authority to have to retain a sense of your pride and esteem without getting to the point where you're getting locked up or engaging in a confrontation with security."
    },
    {
      "speaker": "Surge",
      "time": "00:27:48",
      "upperBoundTime": "00:29:07",
      "content": "So you learn that throughout the years of living in population that its a certain way you have to behave but its also a certain way that you have to think or condition yourself in order to live in population."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:07",
      "upperBoundTime": "00:29:13",
      "content": "That's a passive aggressive orientation towards security. But not towards each other"
    },
    {
      "speaker": "Surge",
      "time": "00:29:13",
      "upperBoundTime": "00:30:19",
      "content": "No it's more direct and straight to the point. But some people what we call backlog which is another psychological disorder that prison creates and backlogging in a natural setting you want to communication is key and vital and instead of communicating an offense or a disrespect a person will backlog say for example you come in my, which is a tradition like an unwritten rule in prison you supposed to ask permission to come through or say excuse me."
    },
    {
      "speaker": "Surge",
      "time": "00:29:13",
      "upperBoundTime": "00:30:19",
      "content": "So instead of telling that person hey excuse me man let me talk to you for a minute next time you come I'm just letting you backlog. So when that person come again its not going to come out as polite and moderate it be more confrontational because you allow it to sit in and so you built it up and it's going to come out wrong."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:19",
      "upperBoundTime": "00:30:24",
      "content": "Did you get in a lot of fights when you first got here?"
    },
    {
      "speaker": "Surge",
      "time": "00:30:24",
      "upperBoundTime": "00:30:29",
      "content": "Out of 26 years I probably 2 fights."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:29",
      "upperBoundTime": "00:30:32",
      "content": "What were they over?"
    },
    {
      "speaker": "Surge",
      "time": "00:30:32",
      "upperBoundTime": "00:30:52",
      "content": "Let me see, one I was in a cell and me and the guy just didn't get along he was nasty dirty. So I asked him to clean up and he talked to me in a way that I didn't couldn't handle so we got in a fight."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:52",
      "upperBoundTime": "00:30:56",
      "content": "With your cell mate. Yeah you can't avoid that person."
    },
    {
      "speaker": "Surge",
      "time": "00:30:56",
      "upperBoundTime": "00:31:21",
      "content": "Right that's why I one of the things I always tried to do after leaving camp j is to put myself in the environment where security and the inmates is more everybody's seeking the same things seeking to get out rehabilitate themselves. So I always since then been on the east shore."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:21",
      "upperBoundTime": "00:31:25",
      "content": "Can you describe your typical day here now what your routine is?"
    },
    {
      "speaker": "Surge",
      "time": "00:31:25",
      "upperBoundTime": "00:33:08",
      "content": "My typical day is overwhelming I'm a club leader with toastmasters the president of toastmasters so I have a lot of paperwork to do a lot of things to do in terms of the club."
    },
    {
      "speaker": "Surge",
      "time": "00:31:25",
      "upperBoundTime": "00:33:08",
      "content": "But for the most part my day is spent thinking studying and reading I'm extremely interested and involved with business I sit on the board of several corporations on the street and so I spend a lot of time researching strategically thinking and reading I subscribe to 8 magazines entrepreneur so my typical day begin working out I try to spend at least 30 minutes to an hour working out and throughout my workout I'm also meditating."
    },
    {
      "speaker": "Surge",
      "time": "00:31:25",
      "upperBoundTime": "00:33:08",
      "content": "Thinking either taking a test mentally on what I previously learned and studied and from there from Monday through Thursday I'm an editor at the print shop I do all the forms for DOC the documents matter of fact some of the forms the release things I did and so that's that kind of like preoccupy me from the time of 10 to about 3 we leave come home I mean get back to the dormitory after I have to check my emails and send emails and of course deal with club paperwork."
    },
    {
      "speaker": "Surge",
      "time": "00:31:25",
      "upperBoundTime": "00:33:08",
      "content": "So that's primary what I do daily."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:08",
      "upperBoundTime": "00:33:13",
      "content": "Did you ever spend time with inmate counsel? Once you did the paralegal course."
    },
    {
      "speaker": "Surge",
      "time": "00:33:13",
      "upperBoundTime": "00:33:23",
      "content": "Yeah me and Calvin Duncan I had spent I was inmate counsel with the civil litigation team for about 12 years."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:23",
      "upperBoundTime": "00:33:27",
      "content": "Wow."
    },
    {
      "speaker": "Surge",
      "time": "00:33:27",
      "upperBoundTime": "00:34:44",
      "content": "I have grown as a result of my incarceration I have accomplished great things. I'm a published author I cofounded an organization that contribute majorly to Baton Rouge stop the killing Inc. I'm the director of youth programming I've received the key to the city of east Baton Rouge in 2007 for one of my workbooks that's taught in public schools and alternative schools and I would like to prevent others from following my steps to a life of incarceration."
    },
    {
      "speaker": "Surge",
      "time": "00:33:27",
      "upperBoundTime": "00:34:44",
      "content": "I'm displeased with the fact of who I was and I want to prevent others from following in my footsteps by reaching them. By showing them that there's a better way in which they could go about getting at a dollar. To put emphasis on education and to mostly teach them how to value life and to solve their problems without resorting to violence and senseless killing."
    },
    {
      "speaker": "Surge",
      "time": "00:33:27",
      "upperBoundTime": "00:34:44",
      "content": "I can contribute to my community if you notice I've changed and I can't take back what happened but I can be productive to assist society and ridding it of some of the ills that plague our communities."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:44",
      "upperBoundTime": "00:34:51",
      "content": "Tell me more about the book you said you talked about that they use in schools?"
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "Yeah I'm a nationally renowned author I wrote several books one of them is emotional rehabilitation an inmate guide to emotional healing by Trafford publishers and I cofounded an organization called Stopthekilling Inc. in baton rouge a 501c3 organization that's sole mission is to teach youth how to value life and basically how to solve their problems without resorting to violence and senseless killing."
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "We have several books one of them is called effective emotional techniques to avoid violence and senseless killing the other one is reentry 1 is called ganger rap and I'm the director of youth programs and on the board with some prominent individuals my job as the director of youth programming is to basically identify the products the services conduct an analysis and to create the programs."
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "So we have a television radio talk show program we just finished to live and die America 2 I helped produce the first to live and die in America which won all sorts of awards so its a very productive organization that me and a guy met at the rodeos called Arthur reed silky slim and he was doing the stopthekilling rallies in baton rouge because this was the height of violence and senseless killing in baton rouge and I was doing reach one teach one little booklets sent to youth court and me and him just through conversation."
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "I told him what all I seen him on TV the new with the stopthekilling rallies so me and him we started talking about some of the things he wanted to do and I was like man I could help you do it and he was going to Jamaica and he said once I get back I'm going to contact you and he did so I helped him formulate the organization did the articles in corporation the bylaws wrote the programs we newsletters I basically all the products I basically created."
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "But it's a learning experience and that's my goal in life I think when you really look at it the greatest benefit one can provide is the service that they provide to others and I want to contribute to the advancement of my community because I realize that if there are those that could reach the youth and show them a better and a different way at life economically being sound then they would choose that path."
    },
    {
      "speaker": "Surge",
      "time": "00:34:51",
      "upperBoundTime": "00:38:06",
      "content": "Everyone we interview in our documentary that was a thug was always trying to depict something positive to the youth so the kids is my passion."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:06",
      "upperBoundTime": "00:38:33",
      "content": "Yeah so whenever this whenever I talk about this to people outside why I think its important why I'm what motivates me and so forth they always say yeah but what about the victim. So then it becomes a question of well how much punishment is enough punishment. Have you forgiven yourself?"
    },
    {
      "speaker": "Surge",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "Actually no. It's always going to be that thought and you going to reflect and ponder back to the mistake that you made in life and the pain and suffering you caused to somebody else family the victim had a mother or father and I would know how my family would feel if in the event somebody killed me so on occasion you gone revisit those thoughts and be in that grieving stage but I think for the most part its what you do."
    },
    {
      "speaker": "Surge",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "Would that person life be in vain had you would you want that person life to be in vain or would you want that person life to be the fundamental reason you change and can help others? Or can that be used as a vehicle to contribute to humanity? In terms of the way we communicate we interact and one of the things that we tend to focus on is life skills and although there's certain life skills that are essential but there are 3 fundamental life skills that I think every youth should be taught and that's problems solving decision making and communication."
    },
    {
      "speaker": "Surge",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "I think if we perpetuate these life skills we would see a better interaction socially in America but because the majority of households are dysfunctional and obviously the socialization process is broken that outside the household most youths don't know how to socially interact with others."
    },
    {
      "speaker": "Surge",
      "time": "00:38:33",
      "upperBoundTime": "00:41:03",
      "content": "And its because of these life skills and we're totally dependent on social agents like the teacher which is overwhelmed our educational system like but so I would never forget but my motivation is to use that experience and the loss of life to save a life."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:03",
      "upperBoundTime": "00:41:10",
      "content": "What is the worst part about this place for you now?"
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "Incarceration is mostly a mental prison has to modernize and particularly Angola is uniquely situated as you its no place like other. And if you are to do time you preferably want to do it in the confinements of Angola because it is situated for you to live out the rest of your life. And so with that concept in mind we have certain benefits and privileges."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "So it's not the physical condition that you have to withstand or endure it's more of the mental and emotional instabilities that occasionally the ups and downs the fluctuations of emotional such as depression anxiety and knowing how to cope with that kind of gets you through life in Angola."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "Me, prison has been extremely beneficial to me and I know it may sound ironic to some people who hear it but prison has enabled me to identify my strengths my weaknesses who I am my attributes my moods learn more about me introspectively to help me to become a better person."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "And I like the person who I am today I didn't like the person who matter when you begin to rehabilitate yourself and it's a choice it's what I call the prisoner initiative because nothing the state or no one can do that can rehabilitate you have to rehabilitate yourself they can provide you with the tools and the resources to facilitate rehabilitation but rehabilitation is an independent choice."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "So that choice come about when you have to witness that you are displeased with who you was. You begin to hate that person or those part of that subculture for example if I see a person wearing they pants of they butt. It just its ugly it's distasteful. So you become so displeased with it and to the fact that you begin to change and realize that wow that's who I was? I was like that? I said that I talked that way?"
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "And you begin to modify your own behavior the way you react the way you respond and prison has enabled me because I grew up here to understand what manhood represents. Certain virtues like humility and patience Steven jobs put it best in he said that if anything worthy of accomplishment can only be accomplished in increments of time 2, 5, 10 years."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "Benjamin Franklin put it this way he said he who value life will not squander time because it is life and time is one of the most valuable resources known to man and once it cannot be reproduced remanufactured once you expend it its gone."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "I've learned how to take time and convert it to something positive because after all this is my life my life don't stop just because I'm incarcerated what I want out of my life doesn't seize because I'm confined. I still have dreams I still have aspirations I still have a vision and purpose for my life and just being incarcerated."
    },
    {
      "speaker": "Surge",
      "time": "00:41:10",
      "upperBoundTime": "00:45:47",
      "content": "So incarceration I can't really say nothing negative even though occasionally days be you wake up oh man and then with 80 dudes I got to share the toilet I got to share the shower this guy here gets on my nerves. But overall I done conditioned my mind to think so positive to and to well its not negative no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:47",
      "upperBoundTime": "00:46:11",
      "content": "What if you let's say you leave here and you come across a 19 year old whose just been sent here with a life sentence confused it's his first couple of days here and he comes to you and says do you have any advice for me? What would you tell him?"
    },
    {
      "speaker": "Surge",
      "time": "00:46:11",
      "upperBoundTime": "00:48:00",
      "content": "Get in as many positive programs begin to engage in positive activities and because that's the key. And idle mind is the devil workshop and the key is being able to preoccupy your mind to such a degree where you get something out of your day. And the best way to do that is to learn something new a skill read something new think something new anything that will contribute because this is not the end result this is today you're incarcerated but tomorrow you could find yourself back into society and you have to be prepared."
    },
    {
      "speaker": "Surge",
      "time": "00:46:11",
      "upperBoundTime": "00:48:00",
      "content": "80% of ex-offenders state that the major difficulty in their transition is finding a job but also coping with the life pressures because no one exempt from life pressure everybody gone be subjected to problems. Life itself is a problem. How will you cope with them will determine freedom or incarceration. Success or failure."
    },
    {
      "speaker": "Surge",
      "time": "00:46:11",
      "upperBoundTime": "00:48:00",
      "content": "So prepare yourself today for those situations and scenarios that you going to face tomorrow and the only way you could do that is to engage in the self-help programs they have exceptional reentry and trade skills. Learn a skill. Employment meaningful employment is essential in order to be production Karl Marx put it this way he said man first must seek food shelter and clothing before he can pursue any other form of social activity."
    },
    {
      "speaker": "Surge",
      "time": "00:46:11",
      "upperBoundTime": "00:48:00",
      "content": "So acquire skills to ensure that if you don't get, have your options."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:00",
      "upperBoundTime": "00:48:21",
      "content": "Yeah sure that's good advice. You have accomplished an impressive array of things by any standard. If you had to pick something to be most proud of what is it?"
    },
    {
      "speaker": "Surge",
      "time": "00:48:21",
      "upperBoundTime": "00:49:07",
      "content": "Getting the key to the city of east Baton Rouge because I spent like 5 years as a cowriter with the Angolite and I wrote temporarily in the literary course children institutes of literature in Connecticut and so I was learning how to write and also writing on a column with the Angolite magazine and when I created that workbook. It not only was able to reach others and I was receiving the pictures and how the youth was embracing it but to receive that type of award from the city was one of the highlights."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:07",
      "upperBoundTime": "00:49:26",
      "content": "Sure if there's something that legislators should know the public should know something I didn't ask you about that I should have asked you about that I didn't give you an opportunity to talk about what would what would is there something?"
    },
    {
      "speaker": "Surge",
      "time": "00:49:26",
      "upperBoundTime": "00:52:28",
      "content": "Primarily to expand on what you were saying about the data and the research that tend to support that an individual mind is not fully developed until the age of 25 and I think our society holds the youth at a high standard with no consideration to the underdevelopment of them mentally. And I think when we look at parole eligibility we're talking about consideration."
    },
    {
      "speaker": "Surge",
      "time": "00:49:26",
      "upperBoundTime": "00:52:28",
      "content": "To measure a person based on their performance and a criteria that is set forth through their prison life as a way of gauging the opportunity of an individual of having a second change the state of Louisiana is one of the few states that provide parole eligibility for lifters and its not only a cost burden on the state we depriving yourself of being able to advance educationally our Medicare system is failing social security our senior citizens which we are responsible for is also being deprived."
    },
    {
      "speaker": "Surge",
      "time": "00:49:26",
      "upperBoundTime": "00:52:28",
      "content": "So the whole overall condition of the state is subjected because of some personal agenda or a dispute about whether or not lifers or violent offenders should receive parole eligibility and I think sometimes in life in requires a tradeoff sometimes we must make Frederic Nietzsche put it this way he said the value of a thing is not so much what you pay for it but what it cost."
    },
    {
      "speaker": "Surge",
      "time": "00:49:26",
      "upperBoundTime": "00:52:28",
      "content": "And I think the cost towards this state supersedes the penalty of the payment the debt one imposed from inflicting a wrongdoing upon society the cost is now outweighing that debt and we talking about consideration and we talking about individual minds that hasn't fully developed I think personally that we should begin to at least afford individuals the opportunity to review them and then make the assessments on whether or not they will be capable or whether or not we want to take a risk to reintegrate these classes of offenders back into society."
    },
    {
      "speaker": "Surge",
      "time": "00:49:26",
      "upperBoundTime": "00:52:28",
      "content": "But to exclude parole eligibility of an individual who was a child that made on mistake such as a first offender which are say for example an individual who mind is now fully developed I think it hurts us overall as a society and it doesn't better the overall condition of our society."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:28",
      "content": "Yeah very well said. I think that's a good place to end."
    }
  ]
}
