{"name":"","transcript":[{"content":"Terrence Guy REDACTIONS FINAL"},{"speaker":"Terrence","time":"00:00:01-6","content":"My name is Terrence Guy. I'm 44 years old. I was arrested and convicted for second degree murder. I've been locked up 23 years on that sentence. I was 20 years old when I was incarcerated when I was arrested."},{"speaker":"Marcus","time":"00:00:22-5","content":"Right so I'm going to start by asking you a few questions about your life before. You were incarcerated and of course some of the changes that you've gone through tin the last 23 years here. We're actually not particularly- we're not focusing on the crime that you were convicted for its not why we're here but can you tell me a little bit about the folks who raised you what your family was like?"},{"speaker":"Terrence","time":"00:00:52-2","content":"I was raised primarily by my mother. My father was murdered when I was three years old my biological father. So I never really knew him. I can't even draw a faint memory of us having any personal interactions."},{"speaker":"Marcus","time":"00:01:17-4","content":"Were there men in your mother's life?"},{"speaker":"Terrence","time":"00:01:19-0","content":"Yeah she would have partners at points in my life and my childhood sometimes she would be in relationships with a guy and they would be together for a few years of course the guy would probably be living with us in our apartment in the projects in the St. Bernard projects in New Orleans."},{"speaker":"Marcus","time":"00:01:47-4","content":"What was your relationship like with those men?"},{"speaker":"Terrence","time":"00:01:50-8","content":"Not much I basically was in this we were just living under the same roof. They basically were there for my mother besides her my sister my sister's dad he basically was more fatherly in his dealings."},{"speaker":"Marcus","time":"00:02:18-3","content":"Was there a lot of fighting in your household?"},{"speaker":"Terrence","time":"00:02:21-7","content":"There was some there was some there would be fighting between my mother and some of the guys that she dealt with at some time there were it would be very some time it was verbal some time it was very physical meaning that some time that the guy I've even witnessed myself would be very physically abusive towards her. And she tolerated it for in one particular relationship for a long period of time."},{"speaker":"Marcus","time":"00:03:03-5","content":"Did you ever get wrapped up in that?"},{"speaker":"Terrence","time":"00:03:03-5","content":"I was too young I was maybe about, in this particular relationship I'm speaking about 10 11 so I felt kind of helpless"},{"speaker":"Marcus","time":"00:03:20-0","content":"Were they ever violent to you?"},{"speaker":"Terrence","time":"00:03:21-7","content":"Verbally few a few times I was chastised I think mom probably went over the limit sometimes but I didn't know the difference."},{"speaker":"Marcus","time":"00:03:41-3","content":"Would you say you were mistreated as a kid?"},{"speaker":"Terrence","time":"00:03:47-8","content":"I wouldn't say that I was totally mistreated probably the feeling that come to me most of anything would be neglected. I was chastised when I would disobey any type of rule that was set before me."},{"speaker":"Marcus","time":"00:04:19-6","content":"Were drugs and alcohol part of your family life?"},{"speaker":"Terrence","time":"00:04:21-8","content":"That was it was primarily it was prominent it was in the culture in which we came up in. violence and drugs was in our home my mother used alcohol and drugs her partners the same her friends our neighbors you name it just was something that was socially accepted it was just a way of life."},{"speaker":"Marcus","time":"00:05:01-2","content":"Was it a way of Life for you?"},{"speaker":"Terrence","time":"00:05:03-3","content":"It became at one point with something that I turned to outta curiosity and at a young age drugs been in the house just being having access to them I was secretively experimenting with them. Me and a friend of mine was very young too at a very young age 11 12 marijuana cocaine things like that."},{"speaker":"Marcus","time":"00:05:44-5","content":"Did you have some folks that you some friends that you might think of as best friends?"},{"speaker":"Terrence","time":"00:05:53-2","content":"Then or now?"},{"speaker":"Marcus","time":"00:05:54-3","content":"Then as a teenager"},{"speaker":"Terrence","time":"00:05:58-8","content":"Best friends? I had one yeah. I had one."},{"speaker":"Marcus","time":"00:06:04-5","content":"What was his name?"},{"speaker":"Terrence","time":"00:06:05-7","content":"His name was Terrell."},{"speaker":"Marcus","time":"00:06:07-7","content":"Are you still in touch with him at all?"},{"speaker":"Terrence","time":"00:06:09-6","content":"No not right now"},{"speaker":"Marcus","time":"00:06:13-0","content":"Are you in touch with any of your family?"},{"speaker":"Terrence","time":"00:06:15-9","content":"Yeah"},{"speaker":"Marcus","time":"00:06:17-3","content":"Do you have that come visit you?"},{"speaker":"Terrence","time":"00:06:19-1","content":"They haven't been in a while in a few years. Which is something that that I understand for various reasons and once you have did the amount of time that I did- I've done it's something I don't place on them a burden because it is a financial it takes money to come visit to travel and do the things that they wanna do so always leave the door open when they are able to come."},{"speaker":"Marcus","time":"00:07:00-0","content":"If you could sum up in a few words the primary reason behind what got you sent here what would it be?"},{"speaker":"Terrence","time":"00:07:13-7","content":"For me it was anger definitely. Repressed anger that all the things I was dealing with feeling helpless and being in a relationship with a girl I was dealing with and that relationship being rocky and a number of things that was just going on in my world that just felt trapped."},{"speaker":"Marcus","time":"00:07:50-8","content":"What was the highest year of school for you??"},{"speaker":"Terrence","time":"00:07:55-3","content":"The last grade I was in was the 8th grade."},{"speaker":"Marcus","time":"00:07:58-4","content":"The eighth grade. So how did you spend, after 8th grade, so your high school years how did you spend your days?"},{"speaker":"Terrence","time":"00:08:06-6","content":"In the streets."},{"speaker":"Marcus","time":"00:08:11-2","content":"So let me get a close better picture of this so I live in new Orleans I'm very familiar with it so if I was as when you were a teenager if I was standing on the stoop of your door looking out into the neighborhood what would I what would it look like what would I smell hear?"},{"speaker":"Terrence","time":"00:08:35-3","content":"Well I grew up in the projects the St. Bernard projects think that they renamed it now Columbia something after Katrina"},{"speaker":"Marcus","time":"00:08:42-3","content":"Think so"},{"speaker":"Terrence","time":"00:08:43-2","content":"But you would see people just hanging out sometimes you would see drug dealing you probably would see neighbors sitting on their porch it depends."},{"speaker":"Marcus","time":"00:08:59-6","content":"Did you feel safe?"},{"speaker":"Terrence","time":"00:09:03-8","content":"Not all the time not all the time because I think I got involved in the streets and being in the streets there's always that element of danger that exists and when I became addicted to drugs at a very young age I took on a behavior that that required me to do certain things to take care of my habit. Yeah."},{"speaker":"Marcus","time":"00:09:44-5","content":"So let's 23 years it's almost difficult for me to think of spending more time here than you did before"},{"speaker":"Terrence","time":"00:09:51-3","content":"Ya than I'd been alive"},{"speaker":"Marcus","time":"00:09:55-4","content":"It's just so long but if you can take me back to the 20 year old you who was- do you remember coming through the Angola gates and I'm sure you do- what would- can you describe that person for me?"},{"speaker":"Terrence","time":"00:10:12-5","content":"I had mixed feelings. I knew that I was coming to Angola. I knew that it was a place that I didn't want to be. I was gonna be around a lot of people I didn't know some I did know and I guess some of the feelings that was being on guard being prepared for danger paranoid to an extent entering just dealing with uncertainty. Not knowing what to expect and just preparing myself mentally to deal with whatever I had to encounter."},{"speaker":"Marcus","time":"00:11:10-7","content":"What kind of person was that?"},{"speaker":"Terrence","time":"00:11:15-7","content":"It was a person that felt a necessity to survive."},{"speaker":"Marcus","time":"00:11:23-6","content":"So how are you different? We are all different from our younger selves how are you different from that 20 year old?"},{"speaker":"Terrence","time":"00:11:35-5","content":"I would say that the choices that I made then that created all the consequences the negative consequences and that I had to bear in my life I guess at one point I just came to a point I just wanted a different life. Even though this isn't the ideal spot you want to have that life but I had to come to some point where I had to see that that way is the wrong way. And if I ever want a better life I have to start making better choices."},{"speaker":"Terrence","time":"00:11:35-5","content":"I think I got to the point where I just I just hated myself and I just was just broken and I just said this is this isn't and I knew that this wasn't the life that I wanted but it was the life that I have. And I just have to deal with it. And the best way in dealing with it was to just change."},{"speaker":"Marcus","time":"00:12:54-2","content":"Did you have some guidance and mentors someone who maybe took an interest in helping you?"},{"speaker":"Terrence","time":"00:13:00-8","content":"Certainly there were guys like when I first came to Angola there was an orientation that was being conducted for new guys to tell them about Angola which I think was a good program I think they still do it now?"},{"speaker":"Marcus","time":"00:13:22-7","content":"I think I've seen some video footage of Ashanti Witherspoon"},{"speaker":"Terrence","time":"00:13:24-6","content":"Yeah he was the person that oriented me and the group that came when I came and he was such a positive person he shared his life with us and even after orientation he made himself available to me who was a stranger. And that showed me that he genuinely the stuff that he said during the orientation that he genuinely wanted to help people."},{"speaker":"Terrence","time":"00:13:24-6","content":"And this was a man I could see someone ask for advice he would stop, offer advice and help out and it was people like him people like Norris Henderson, Calvin Duncan all of those people were people who taught classes that I attended. Yeah and after getting my GED and things like that I started tutoring myself tutoring literacy and things like that to help other guys learn."},{"speaker":"Marcus","time":"00:14:41-8","content":"Can you tell me a little bit about the organizations that you may be part of here or any of the activities you're involved with? Or have been involved with over the years it's been a long time.-"},{"speaker":"Terrence","time":"00:14:53-3","content":"Well I've over the period of time I've probably been a member of almost every club or any organization up here. Though at this point I'm probably not a member of a lot of them but still associate with them. I've been a member of toastmasters, lifers association and I was vice president of the lifers association for a short period of time a few years back Angola special civics project, literary arts a number of the organizations too."},{"speaker":"Marcus","time":"00:15:39-6","content":"So I have a lot of difficulty wrapping my head around a life without parole sentence for all kinds of reasons. How do you make sense of it?"},{"speaker":"Terrence","time":"00:16:01-6","content":"Well I know that the life without parole primarily is given to guys who have very serious charges like the one I have. But it's not a death sentence like the guys that are placed on death row who are condemned by a in a court of law. But to be sentenced to just do the remainder of your life in prison."},{"speaker":"Terrence","time":"00:16:01-6","content":"And just I really I guess it's some form of retribution involved in that the concept of it but of course I would like to have a chance to present myself before a parole board and let them evaluate me to determine if I'm rehabilitated and have shown that my stay here is has proven me worthy of another chance at society but far as the concept of it when I look at other states and what they're doing and they're having success in their programs."},{"speaker":"Terrence","time":"00:16:01-6","content":"And then I look at the numbers, guys like what my charge who whatever the case may be that committed the charge that it really don't come back to prison like talking about it when they talk about recidivism they talk about facts and things like that but it could be politics involved being Louisiana prides itself on being conservative I think that, that holds that stance with you commit the crime, this is how we punish you? I don't know."},{"speaker":"Marcus","time":"00:18:13-9","content":"And then the question is how much punishment is enough punishment?"},{"speaker":"Terrence","time":"00:18:20-8","content":"That, that's a good question. I told a guy one time when I was in lifers I said to keep a guy locked up for ten years for a serious crime that he's committed isn't unjust or to keep a guy locked up 20 years or 30 years or even 40 years for a crime that he's committed isn't unjust in itself but to keep a rehabilitated man who is who's totally reformed locked up for that long period of time doesn't really meet any, is unreasonable when you dealing with a system that who that that professes to be into corrections I mean when I think about corrections I'm thinking about rehabilitation that's the idea that I get."},{"speaker":"Marcus","time":"00:19:22-8","content":"Yeah. Do you find yourself now mentoring some of the folks who are coming in as young folk with long sentences or life sentences? What kind of advice do you give them?"},{"speaker":"Terrence","time":"00:19:43-5","content":"Well young guys I'm not a mentor hired by the prison"},{"speaker":"Marcus","time":"00:19:51-8","content":"Right but I'm sure there's informal"},{"speaker":"Terrence","time":"00:19:53-8","content":"But I do encounter young guys that come in the dorm guys may see me studying and they may approach me and ask me about certain things."},{"speaker":"Terrence","time":"00:19:53-8","content":"I'll offer advice or we may be at the library and its, I don't often I'm not often intrusive because some young guys are kind of protective and they really so I respect their boundaries but I do offer advice when the opportunity comes presents itself that for one you now that they have- it's their life and if they have children on the street if they wanna see they children again they have to change."},{"speaker":"Terrence","time":"00:19:53-8","content":"They have to do the right do right by them and they have to if you need education if you don't have it because you never gonna understand anything that's going on without education because its so much that's involved if you're working on your case if you have legal issues you may wanna seek certain guys that's in the law library to help you with your case. And things like that."},{"speaker":"Terrence","time":"00:19:53-8","content":"Stay in touch with your family because they're thinking about you they're praying for you and they want you to change and do good and come home and be home with them."},{"speaker":"Marcus","time":"00:21:32-1","content":"Do you have children?"},{"speaker":"Terrence","time":"00:21:33-2","content":"I have a son."},{"speaker":"Marcus","time":"00:21:35-3","content":"Are you in touch with that son?"},{"speaker":"Terrence","time":"00:21:37-6","content":"Yes I am"},{"speaker":"Marcus","time":"00:21:42-7","content":"How would he describe you?"},{"speaker":"Terrence","time":"00:21:46-5","content":"Well my son is incarcerated. He's incarcerated serving 10 years. I was locked up when he was an infant so a lot of my influence even positive influence that I probably could have provided wasn't there. I visited with him over the years a few times we talked, tried to instill some positive stuff in him, teach him about the consequences of his choices, but I encouraged him to make his own choices not to tell him what to do but to offer my life and show him how my life got messed up but to encourage him to make his own choices but to make good choices."},{"speaker":"Marcus","time":"00:22:46-9","content":"What what's the worst thing about this place?"},{"speaker":"Terrence","time":"00:22:54-5","content":"Just that you just have so much time. Do so much time here it's just you've done so much time that the world has just moved like in a whole different era. Like the world that I left on the street is not the same world no more."},{"speaker":"Marcus","time":"00:23:26-3","content":"Is there anything good about this place?"},{"speaker":"Terrence","time":"00:23:31-2","content":"You have some good people here. Guys that I know. I have some friends here that I that I know who are genuine friends. Who I can rely on. And they would be there for me and vice versa."},{"speaker":"Marcus","time":"00:23:51-2","content":"Would you say that this is sort of a family now?"},{"speaker":"Terrence","time":"00:23:56-8","content":"To an extent yeah. It is."},{"speaker":"Marcus","time":"00:24:02-4","content":"So how do you cope with the prospect of never having a second chance?"},{"speaker":"Terrence","time":"00:24:10-5","content":"I don't accept it and because I don't accept it I have hope that I will get a chance to be free on the other side. This time living a more productive life. I love to cook. That's what I've been doing the past few years I've been here. Matter of fact that's where I just came from when they called me and told me that you were ready for me and I try to be try to take that craft seriously. And I think that it is the gift that I found that I can make a good living off."},{"speaker":"Marcus","time":"00:25:03-2","content":"Yes. Is that how you envision your life if you were released?"},{"speaker":"Terrence","time":"00:25:05-4","content":"Yeah I do I see myself entering a good reputable restaurant and getting up under a good chef working under a good chef learning some things broadening my knowledge getting more experience dedicating myself to my craft just saving up money and ultimately starting my own my own eatery."},{"speaker":"Marcus","time":"00:25:44-3","content":"For a parole board if you were before a parole board or a pardon board they would ask you probably how you feel about the crime you committed alright I should say the crime you were convicted for and how you feel about the victim. How do you feel about that?"},{"speaker":"Terrence","time":"00:26:13-8","content":"I feel terrible. Terrible. A person lost their life because of a choice that I made and there's nothing that I can do to affect that. That situation it's, and I feel very remorseful for it and I think about it a lot and it's something I know that I would never do again and it's just horrible. And I think about the family of the victim. What affect that it had on them. Yeah."},{"speaker":"Marcus","time":"00:27:11-6","content":"Have you forgiven yourself?"},{"speaker":"Terrence","time":"00:27:15-9","content":"I think I have. I have. It wasn't always it wasn't easy. I think I have. I think I have to."},{"speaker":"Marcus","time":"00:27:43-0","content":"What's your typical day like now? What's your routine I know with your cooking?"},{"speaker":"Terrence","time":"00:27:43-2","content":"Yeah planning my next planning a menu or studying some cookbooks or recipes things like that. That's what I do. I save a lot of recipes I cut them out the newspapers magazines I cut and paste them and I Xerox copy them and I compile them with pastries over here meats over here seafood beverages. I do that a lot."},{"speaker":"Marcus","time":"00:28:25-7","content":"What's your, what what's your best things that you make? If you had to put your best dish forward what would it be?"},{"speaker":"Terrence","time":"00:28:27-5","content":"Depends on what you want? You want something sweet or something savory?"},{"speaker":"Marcus","time":"00:28:31-4","content":"What do you make the best?"},{"speaker":"Terrence","time":"00:28:33-4","content":"I'm told that my double chocolate cake is awesome. This is something they always request. I always try to encourage to do something else because I like showing some variety but everyone loves that cake. That double chocolate cake."},{"speaker":"Marcus","time":"00:28:55-0","content":"Who are you cooking for?"},{"speaker":"Terrence","time":"00:28:57-5","content":"I'm a cook in the main prison kitchen"},{"speaker":"Marcus","time":"00:28:58-8","content":"So the whole prison"},{"speaker":"Terrence","time":"00:28:59-6","content":"The prison population"},{"speaker":"Marcus","time":"00:29:02-8","content":"What are you what are you most proud of in your life?"},{"speaker":"Terrence","time":"00:29:10-2","content":"That I got my GED. that that I was able before my mother passed because I think I know for a fact that she was she was a motivation for me because I saw her struggles and I felt as though I caused great shame on her as her son by coming to prison and her having to come visit me in this situation and the process that she had to go through just to come see me. And how it always hurt her to leave without me. And so everything I always did was for myself but for a large part for her. I got my GED I went to culinary school I completed culinary school I went to graphic art school I completed that. And I was able to give her these diplomas and she can put them on her wall and say that's my son and things like that."},{"speaker":"Marcus","time":"00:30:41-8","content":"That's great. Do you think that people are more likely to change their lives around the longer their sentences? Do you think there's some truth to that?"},{"speaker":"Terrence","time":"00:30:58-3","content":"Well I think that a person who comes to prison who has a few years its ultimately on the individual but that person already knows that they're going home eventually cause of their sentence whether they come and do good and earn extra good time and have their sentence shortened due to their good behavior or they do the whole length of the sentence but they know that they're going home. But the person with the life sentence such as myself there's nowhere else to turn."},{"speaker":"Terrence","time":"00:30:58-3","content":"You already in the hole. You already at the bottom the only place you can go is up. If you want to but that's a choice in itself. Some like to stay at the bottom and just be hopeless. They say that this is where it ends and accept it. And as a result it shows in their behavior and their walk and their life."},{"speaker":"Terrence","time":"00:30:58-3","content":"The person with hope you see them striving positively and doing the things that are necessary that are necessary to demonstrate not to prove to someone to merit someone someone's approval but to prove to themselves that they are better than what they what some paper said about them."},{"speaker":"Marcus","time":"00:32:56-9","content":"Is there something that I should have asked you about your life about your experience here or about anything that I didn't ask? Something that you might wanna talk about that I didn't give you an opportunity to talk about."},{"speaker":"Terrence","time":"00:33:15-3","content":"I think what society needs to know is that the idea of parole eligibility doesn't automatically mean parole. It just means an opportunity to go before a parole board And present yourself and let the board who are professional in that field determine if this person is ready to be released on parole which is still gonna be under this kind of strict supervision."},{"speaker":"Terrence","time":"00:33:15-3","content":"If it, that there are men here who are ready to be released back into society to show that all the money that's been spent in incarcerating us that the reinvestment can happen now if they're willing to let it happen. Well we can go out and instead of just being a liability sitting in here we can go out there like I mentioned I'm going to cook. It's something I love doing and something I think I could make a decent living at doing and I could be a taxpayer and I can rent and do other things."},{"speaker":"Marcus","time":"00:34:42-4","content":"Yeah and 23 years is also a fair amount of retribution. And one of the things about this of course is how much punishment is enough punishment? It's a difficult question."},{"speaker":"Terrence","time":"00:34:59-5","content":"Yeah because you going to have- how do you debate with people or individuals who say well a person's life was taken. You can never compensate for that. That's a hard debate and that's not one that I'm in position to debate. That's why you have people like yourself and other professionals who would have to be the voice in that situation to try to bring a reasonable discussion and have a reasonable approach at making this work."},{"speaker":"Terrence","time":"00:34:59-5","content":"But if we were to approach it from a restorative justice perspective meaning that we all must be included in the healing process cause often the silent victims my family and things like that I owe them because they've been hurt in the process my community has been hurt in the process all of this stuff was just spawned as a result of one act."},{"speaker":"Marcus","time":"00:36:43-2","content":"That's a good place to stop."}]}