{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Terry West Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Terry",
      "time": "00:00:00",
      "upperBoundTime": "00:00:00",
      "content": "My name is Terry West, I'm convicted for a first degree murder, and I was arrested when I was twenty years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:15",
      "content": "How much time did you serve?"
    },
    {
      "speaker": "Terry",
      "time": "00:00:15",
      "upperBoundTime": "00:00:21",
      "content": "Well I serve on 21 years, about three or four months."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:21",
      "upperBoundTime": "00:00:36",
      "content": "So, one of the things I like to do, just to get a sense of your personal narrative, your story, can you tell me a little bit about the folks who raised you?"
    },
    {
      "speaker": "Terry",
      "time": "00:00:36",
      "upperBoundTime": "00:00:36",
      "content": "Well I was raised by my mother, single parent, kind of off and on with my step father, who was staying with us. And I was real close with my mother and, there was six of us, what, four boys and two girls. We all got along, we was kind of close knit family but my sisters and brothers, my, I have a brother and sister that's right up under me, that's my mama's husband and he kind of like divided us a lot."
    },
    {
      "speaker": "Terry",
      "time": "00:00:36",
      "upperBoundTime": "00:00:36",
      "content": "And I don't know that's kind of what brought conflict amongst us for a lot of years before my mama separated from him but overall we got a along pretty well."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:36",
      "upperBoundTime": "00:01:29",
      "content": "Did you find yourself butting heads with him?"
    },
    {
      "speaker": "Terry",
      "time": "00:01:29",
      "upperBoundTime": "00:03:12",
      "content": "A lot of times. It was, I was more of the one stepped out, I was the middle child and I confronted him most than anybody because what I know now. So I kind of like, didn't understand why he treated my brother and my sister different than me."
    },
    {
      "speaker": "Terry",
      "time": "00:01:29",
      "upperBoundTime": "00:03:12",
      "content": "And I just, I did the same thing he did. So a lot of things he did was unfair, I challenged him. And sometimes, and he was an abusive man, he would pluck a cigarette at us at me and my brother and them, because we from another man, and other that, my sister. My little sister that's under me, she would kind of like, push her daddy to do it more because she thought it was cool."
    },
    {
      "speaker": "Terry",
      "time": "00:01:29",
      "upperBoundTime": "00:03:12",
      "content": "And that kind of like divided me and her up, but as we grew up we were still real close, me and her but that was the only kind of conflict I had with her and her daddy. And it carried on as I got older, I never forgave him for it because it been times where he wanted us, my mama separated from him, my mom would go to work or something and he would feel like we call the fire department."
    },
    {
      "speaker": "Terry",
      "time": "00:01:29",
      "upperBoundTime": "00:03:12",
      "content": "So they could catch us in there by ourselves, so they could take us. Stuff like that, faced with stuff like that, I seen him do that. So, that kind of made me angry, dislike him a lot."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:12",
      "upperBoundTime": "00:03:15",
      "content": "How old were you when they separated?"
    },
    {
      "speaker": "Terry",
      "time": "00:03:15",
      "upperBoundTime": "00:03:21",
      "content": "Well, probably about seven, eight years old, around that time."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:21",
      "upperBoundTime": "00:03:27",
      "content": "Oh okay, so young. And were there any other men in your mother's life that came into your life after that?"
    },
    {
      "speaker": "Terry",
      "time": "00:03:27",
      "upperBoundTime": "00:05:18",
      "content": "Well after that, my mother met another guy named Kenny, that's who I say that's my dad even though I knew my father but, that was the guy, Kenny, he came along, he had a drinking problem. But he was beautiful until you drink. He was the perfect father, get you up in the morning, take you on the side jobs, clean the shades, and painting houses for people, kind of like take me to the barber shop, get my haircut. And when he would introduce us to his friends \"Oh that's my son Terry.\""
    },
    {
      "speaker": "Terry",
      "time": "00:03:27",
      "upperBoundTime": "00:05:18",
      "content": "And that kind of made me feel good. And I'm like, okay, that's what I've been wanting so I kind of like got real, real close to him. But when he drank, he'll jump on my mama, and go to fighting her real bad. And that's where we butt heads at and it came a time where I almost hurt him because he was beating my mama one day and my mama was crying and by the grace of God, I pulled a gun out on him and the gun didn't go off because he was so drunk, so he grabbed the gun, and put it to his chest and clicked the trigger. \"You want to kill me? You want to kill me?\""
    },
    {
      "speaker": "Terry",
      "time": "00:03:27",
      "upperBoundTime": "00:05:18",
      "content": "And I'm like I thought I did but when I see him do that, oh lord he scared all of us. But that was the breaking point when my mama knew she had to separate from him because either he was going to hurt her, or one of us, or one of us was going to hurt him. And I was real protective over my mother because that's all I knew. And her thing was, \"We're all we got\""
    },
    {
      "speaker": "Marcus",
      "time": "00:05:18",
      "upperBoundTime": "00:05:29",
      "content": "So it's fair to say that you were in a household growing up with quite a lot of violence and dysfunction?"
    },
    {
      "speaker": "Terry",
      "time": "00:05:29",
      "upperBoundTime": "00:05:57",
      "content": "Yeah. Because see, I seen a lot of drugs. My step daddy used to shoot drugs and have a lot of guys come over at times. I didn't know at first what they were doing until I went to searching, being curious, going through they're drawers and raising the mattress up, finding syringes, and found out that's what he do. By the grace of God my mother never did any drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:57",
      "upperBoundTime": "00:06:00",
      "content": "Is this the same person who had a drinking problem?"
    },
    {
      "speaker": "Terry",
      "time": "00:06:00",
      "upperBoundTime": "00:06:51",
      "content": "No, this is my first step daddy. My mama husband, the one that I see with the drugs. But the one with the drinking, he just was real abusive. He was so abusive to her, that was the because of his death, him jumping on his mother. And his daddy told him, \"If you ever hit my wife again I'll kill you\" And that's what he did. He hit his mama again. Got drunk and jumped on his mama and his daddy killed him."
    },
    {
      "speaker": "Terry",
      "time": "00:06:00",
      "upperBoundTime": "00:06:51",
      "content": "And I think at that point, that's when my mama, my mother realized that's who had an effect on my because I kind of took it harder than anybody because that was the only one that I looked at as a father. Taught me how to drive and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:51",
      "upperBoundTime": "00:06:54",
      "content": "What about school? How was school for you?"
    },
    {
      "speaker": "Terry",
      "time": "00:06:54",
      "upperBoundTime": "00:07:46",
      "content": "Well school was, it was alright. Mother kind of struggled a lot, but, I learned easy, but I was kind of like, really blinded by women, and watching my mama cry so much. I was a mama's boy, I was always around my mama. And a lot of times she used to tell me a lot of things about why she's crying and, \"Well I ain't going to be able to get you no school clothes this year because, you might have to wear the stuff your brother had last year.\""
    },
    {
      "speaker": "Terry",
      "time": "00:06:54",
      "upperBoundTime": "00:07:46",
      "content": "And this and that so. But it didn't matter as long as I was able to go outside. And school, my learning, with me learning, it was easy if I pay attention, but I was distracted most of the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:46",
      "upperBoundTime": "00:07:49",
      "content": "Where did you grow up?"
    },
    {
      "speaker": "Terry",
      "time": "00:07:49",
      "upperBoundTime": "00:07:53",
      "content": "New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:53",
      "upperBoundTime": "00:07:55",
      "content": "Where about?"
    },
    {
      "speaker": "Terry",
      "time": "00:07:55",
      "upperBoundTime": "00:08:19",
      "content": "In the Desire Projects. So, we went from, I went from school to school, like about three different schools. Dunn elementary, Elwood because I always try to take up for other people that was more or less fortunate than me so I was kind of complex in that. So that's where my fights always started, behind that, or a girl."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:19",
      "upperBoundTime": "00:08:23",
      "content": "What was the highest grade you finished?"
    },
    {
      "speaker": "Terry",
      "time": "00:08:23",
      "upperBoundTime": "00:08:26",
      "content": "Well, during that time, my highest grade was the eighth grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:26",
      "upperBoundTime": "00:08:29",
      "content": "Okay, and then what did you do? So you dropped out of school?"
    },
    {
      "speaker": "Terry",
      "time": "00:08:29",
      "upperBoundTime": "00:09:46",
      "content": "Well, I got kicked out of school. I got kicked out of school because of the violence that I was bringing. The kind of trouble that I was bringing to school. I had got into drugs real young, and I was using drugs in the fifth grade. I got put out of elementary school for smoking on rocks and weed. And so when I carried that on to middle school I always, I was into the streets, I was one of mamas' kids that got away. She always used that phrase, \"You was my only child that got away from me.\""
    },
    {
      "speaker": "Terry",
      "time": "00:08:29",
      "upperBoundTime": "00:09:46",
      "content": "And I felt I had to get away because, nobody wasn't fending for her. And I didn't like that. I got kicked out of school, and I'm going to like a pride school, for bad kids. I didn't stay there long because of the guys that were looking for me to harm me and they found out that's where I was. That school put me out because of the protection of the other kids. So from then I never went back to school until I got here."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:46",
      "upperBoundTime": "00:09:56",
      "content": "What was, do you remember the first time you were arrested?"
    },
    {
      "speaker": "Terry",
      "time": "00:09:56",
      "upperBoundTime": "00:10:02",
      "content": "First time I was arrested? Yeah, I was at K-Mart. I had stolen a kickstand for my bike that was my thing for my bike."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:02",
      "upperBoundTime": "00:10:04",
      "content": "Okay, how old were you?"
    },
    {
      "speaker": "Terry",
      "time": "00:10:04",
      "upperBoundTime": "00:11:36",
      "content": "I had to be like, probably about nine. Nine, ten. Yeah I was into my bike and I got caught stealing a kickstand. And from then, I never really was the type to keep going to jail. I got arrested a few times, but, I kind of learned kind of fast from other people on things like that. That wasn't really deterring me, that wasn't really deterring me. I got shot in my head when I was fourteen years old. And that was like."
    },
    {
      "speaker": "Terry",
      "time": "00:10:04",
      "upperBoundTime": "00:11:36",
      "content": "Like, I got shot, in '90 I got shot in my head, in '91 I got shot again, '92 I got shot again, '93 I got paralyzed from the neck down and I stayed in the hospital like years I had been paralyzed from the neck down. And by the grace of God I come out of that. And in '95 when I started walking again, I end up getting shot up again in '95 and it just, I just didn't know which way to go, I always wanted better, but I just didn't know which way to go because of the life where I was stuck at."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:36",
      "upperBoundTime": "00:11:41",
      "content": "So I noticed the way you're holding your arm, is that because of that's related to that shot?"
    },
    {
      "speaker": "Terry",
      "time": "00:11:41",
      "upperBoundTime": "00:12:16",
      "content": "Yeah, that was the only that didn't come back was my arm. But I call it the worst best thing that ever happened to me because it made me better, it made me treasure life. Because before, it didn't matter whether I live or died, because I was living on the edge so it really didn't matter to me. And I just put it in God's hands and for some reason I still was, had this spiritual thing in my head to leave it in God's hands."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:16",
      "upperBoundTime": "00:12:22",
      "content": "Most people don't survive that many times being shot."
    },
    {
      "speaker": "Terry",
      "time": "00:12:22",
      "upperBoundTime": "00:12:26",
      "content": "Well that's what they say. That's what they say."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:26",
      "upperBoundTime": "00:12:31",
      "content": "Maybe you have nine lives like a cat."
    },
    {
      "speaker": "Terry",
      "time": "00:12:31",
      "upperBoundTime": "00:12:33",
      "content": "Oh I sure hope so, so I have a few more left."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:33",
      "upperBoundTime": "00:12:37",
      "content": "What about girlfriends? Tell me a little bit about girlfriends."
    },
    {
      "speaker": "Terry",
      "time": "00:12:37",
      "upperBoundTime": "00:12:42",
      "content": "Well, I had plenty girlfriends. And I kind of like."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:42",
      "upperBoundTime": "00:12:46",
      "content": "I'm sorry, how old were you when you had this injury that put you in the hospital?"
    },
    {
      "speaker": "Terry",
      "time": "00:12:46",
      "upperBoundTime": "00:12:49",
      "content": "I got paralyzed from the neck down when I was eighteen."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:49",
      "upperBoundTime": "00:12:59",
      "content": "Eighteen years old, okay. Sorry, you were telling me about girlfriends and I interrupted you."
    },
    {
      "speaker": "Terry",
      "time": "00:12:59",
      "upperBoundTime": "00:13:11",
      "content": "Well my girlfriends, I had a lot of girlfriends. I love the women so, I treated all of them fairly. I really do believe that."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:16",
      "content": "Do you have any children?"
    },
    {
      "speaker": "Terry",
      "time": "00:13:16",
      "upperBoundTime": "00:13:18",
      "content": "Yes, sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:18",
      "upperBoundTime": "00:13:20",
      "content": "Tell me about that."
    },
    {
      "speaker": "Terry",
      "time": "00:13:20",
      "upperBoundTime": "00:15:03",
      "content": "I have three boys. Terry, Jeron, and Terrence. Terry is my oldest son and he's incarcerated right now, he in the halfway house. He is serving a ten year sentence. My second oldest son, he dead. He killed himself when he was nine years old. He went in the bathroom and took a coat belt and tied it around his neck and hung himself, he was nine. My youngest boy, Terrence, he in Jackson State right now, he in college, he in Jackson State. Have a relationship with both of them I talk to Terence all the time. Talk to Terry. And the amazing thing that I've been gone all they lives but they still look up to me."
    },
    {
      "speaker": "Terry",
      "time": "00:13:20",
      "upperBoundTime": "00:15:03",
      "content": "And whatever I say they kind of hang on to and I didn't realize that until I talked to one of their little brothers. And they went to telling me about the letters that I wrote. \"You be writing Terence this and that, you always writing Terence,\" And I didn't even thing, he paid attention to it. I have a good relationship with them, strange, it must be the God because I don't think it was much that I did. No more than talking to them because I watched them grow from here. Terence was 10 months when I left, Terry was like three, four years old, Jeron was like two or whatever."
    },
    {
      "speaker": "Terry",
      "time": "00:13:20",
      "upperBoundTime": "00:15:03",
      "content": ""
    },
    {
      "speaker": "Marcus",
      "time": "00:15:03",
      "upperBoundTime": "00:15:05",
      "content": "Who visits you up here?"
    },
    {
      "speaker": "Terry",
      "time": "00:15:05",
      "upperBoundTime": "00:15:41",
      "content": "Well my mama come, my sister come, sometimes my son will come, when he gets a chance to get off from work on the weekends. He'll come time to time but most of the time it be different women. That I'll meet or something. Because I'm real family, I just, I don't just look at the bloodline and say, \"That's my family.\" Family is who you make it, so when I meet people, because I'm always in position trying to put myself out there to meet new people. So I get faces like that every now and then."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:41",
      "upperBoundTime": "00:15:48",
      "content": "Can you tell me a little bit about what led, what got you sent here?"
    },
    {
      "speaker": "Terry",
      "time": "00:15:48",
      "upperBoundTime": "00:16:38",
      "content": "Well it just was the lifestyle that I chose. I chose the lifestyle to sell drugs just to be into the streets because of my mother. And like, I remember it like yesterday, what really made me get into that. She was crying I was like, \"Mama what you crying for?\" She was like, \"My baby, I ain't going to be able to get you all nothing for Christmas\" I know what that meant. That only meant I wasn't getting nothing. Because my older brother and sister and my younger brother and sister, they're going to get there's. I was the one that was always left out, and for a lot of years I kind of resent my mama for that because I felt like I was being left out."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:38",
      "upperBoundTime": "00:16:41",
      "content": "Yeah why do you think that was?"
    },
    {
      "speaker": "Terry",
      "time": "00:16:41",
      "upperBoundTime": "00:19:14",
      "content": "Well, over the years I ended up asking my mama why and she told me, \"Well, you was my strongest child, and that you didn't worry me like the rest of them for Christmas toys or stuff like that\" So she said, \"That's why I knew I could get yours later\" Well, later meant never sometimes, most of the time so. That's just how."
    },
    {
      "speaker": "Terry",
      "time": "00:16:41",
      "upperBoundTime": "00:19:14",
      "content": "And that's where the crime started from and. I went to robbing and like I said in the beginning, I always protected people, I was over protective about people. And once I got shot, it kind of like upset me because it was a friend that shot me in my head. And it was really my best friend that shot me in my head so that kind of like got me."
    },
    {
      "speaker": "Terry",
      "time": "00:16:41",
      "upperBoundTime": "00:19:14",
      "content": "In my mind I felt like where it didn't hurt, it didn't hurt so there's nothing to it. That's in my mind then I'm on rocks, I'm getting loaded, so this I guess, this is what was playing in my head. So from then on I just, I didn't have no support line. I didn't ever have, my mother never was well off. She couldn't buy me the things that I wanted so that's what started me robbing."
    },
    {
      "speaker": "Terry",
      "time": "00:16:41",
      "upperBoundTime": "00:19:14",
      "content": "That's what started me hanging with drug dealers, once I stopped that, once I stopped robbing I felt like I'd made it. I'm like I'm not doing that no more. So I moved from the desire project to the St. Bernard project which was totally different because where I was born and raised, you had to earn your right to go to the store for your mama."
    },
    {
      "speaker": "Terry",
      "time": "00:16:41",
      "upperBoundTime": "00:19:14",
      "content": "If you wasn't tough they gone take your mama money. You couldn't go to the swimming pool unless you had a fight. You had to earn respect just to get in the pool. Even to go to school, you had to fight to go to school. So I had to be tough and my other brothers and sisters they wasn't out there like that so I felt I had to take the lead. So that's what got me in the game and I started, I didn't take nothing off of anybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:14",
      "upperBoundTime": "00:19:19",
      "content": "And it's all around you."
    },
    {
      "speaker": "Terry",
      "time": "00:19:19",
      "upperBoundTime": "00:19:32",
      "content": "Yeah that's all I knew and that's the only way I knew how to respond, and then I'm not in school so I had to do what I had to what I thought was best."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:32",
      "upperBoundTime": "00:19:40",
      "content": "Yeah. At the time of your arrest on this charge, were you using drugs and alcohol?"
    },
    {
      "speaker": "Terry",
      "time": "00:19:40",
      "upperBoundTime": "00:19:42",
      "content": "Yeah I was, heroine was my choice."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:42",
      "upperBoundTime": "00:19:45",
      "content": "Oh, okay."
    },
    {
      "speaker": "Terry",
      "time": "00:19:45",
      "upperBoundTime": "00:20:30",
      "content": "I wasn't much of a drinker, I was a casual drinker maybe holidays. But heroine, that was like a half a bundle a day habit. If I stopped at a stop sign I was snorting a line. I abused drugs since probably fifth grade. Just watching other people doing it, being curious. Probably the only drug I never tried was like shooting any drugs. Smoking a pipe, I never tried that. But like, snorting coke, heroine, smoking weed, smoking rocks in the weed, drank casually, but, it was heavy."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:30",
      "upperBoundTime": "00:20:36",
      "content": "Is it fair to say that if you were not arrested for this charge that you in all likelihood, wouldn't be alive?"
    },
    {
      "speaker": "Terry",
      "time": "00:20:36",
      "upperBoundTime": "00:21:33",
      "content": "Yeah, I could say that. I could say that. I think about that from time to time because of the life that I was living. I even think about when Katrina hit, what my frame of mind was, I probably wouldn't have even been thinking about leaving. I probably would've been thinking about what hustle I can hit because that was my only way of taking care of myself."
    },
    {
      "speaker": "Terry",
      "time": "00:20:36",
      "upperBoundTime": "00:21:33",
      "content": "With the little check I was getting from being disabled couldn't take care of the lifestyle I was living. With the drug habit, the women habit, the clothes habit. A lot of that just happened, I had kids' stuff like that so it was too much, then I didn't know anything else .I didn't have no idea of a job."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:33",
      "upperBoundTime": "00:21:39",
      "content": "So, twenty years ago, you were arrested for this, did you spend some time in the parish jail?"
    },
    {
      "speaker": "Terry",
      "time": "00:21:39",
      "upperBoundTime": "00:21:41",
      "content": "Well I spent two years in the parish."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:41",
      "upperBoundTime": "00:21:48",
      "content": "Okay, two years. So you arrive here at the age of twenty-two, after spending two years in the parish, which I can only imagine is hell."
    },
    {
      "speaker": "Terry",
      "time": "00:21:48",
      "upperBoundTime": "00:21:55",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:55",
      "upperBoundTime": "00:22:03",
      "content": "Can you describe the Terry who was brought to Angola, those first few weeks? What kind of a person are we talking about now?"
    },
    {
      "speaker": "Terry",
      "time": "00:22:03",
      "upperBoundTime": "00:24:20",
      "content": "Wow. The terry that they brought, I was a child. I was a man-child. I felt I had to do what a man had to do at all times. I was always well mannered no matter what. Even when I was in the streets I was well mannered. I'm not going to start anything."
    },
    {
      "speaker": "Terry",
      "time": "00:22:03",
      "upperBoundTime": "00:24:20",
      "content": "But if it gets brought to me I'm going to entertain it real fast cause my feelings get hurt real easy and only when I feel like I'm untreated, like I'm treated unfairly that what will, what made me react to it. But when I came up here I was a young man, I was kind of like curious, but I knew I had to educated myself because I knew that was the one thing that hurt me the most."
    },
    {
      "speaker": "Terry",
      "time": "00:22:03",
      "upperBoundTime": "00:24:20",
      "content": "That's what hurt me the most and I truly believe, even then, that if I would have been educated, if I had went to school, if I would have even knew how to read and write at that time, I know I would have never went down that road at that time because I always wanted better. I just was a young man, curious, and hoping I could make it out of there still."
    },
    {
      "speaker": "Terry",
      "time": "00:22:03",
      "upperBoundTime": "00:24:20",
      "content": "That's all my mind was on, as far as being safe, that kind of like played a little part because of my past. I was wondering, would I bump into somebody that I did wrong prior by me paralyzed. I move way much better now, I was way worse off twenty years ago, but that's, I just was a scared man."
    },
    {
      "speaker": "Terry",
      "time": "00:22:03",
      "upperBoundTime": "00:24:20",
      "content": "I was real scared in a lot of ways because I knew I had to read books and stuff to get out, study my case, and by me not being educated and stuff I couldn't read that well at the time, and I couldn't spell that well. I knew I was stuck. But I also had to think about my life too."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:20",
      "upperBoundTime": "00:24:23",
      "content": "How are you different now, twenty years later?"
    },
    {
      "speaker": "Terry",
      "time": "00:24:23",
      "upperBoundTime": "00:26:17",
      "content": "Well I'm different now because I treasure life better, I treasure life way more now, I know the beauty of it now. I know the importance of it. I know other people need me. Not just my kids, but my mother needs me. Even the people around here need me."
    },
    {
      "speaker": "Terry",
      "time": "00:24:23",
      "upperBoundTime": "00:26:17",
      "content": "And once I, I stayed up, once I was up here for a few years I realized that because every job that I had, I found myself, it was always helping people. I had to be a tier walker to make sure nobody don't die. That's the one job nobody don't want, but it didn't bother me. Then I went to the hospital just to go volunteer on the ward. And this was just my passion because I don't know if it was a light went of but I knew I was here for a reason."
    },
    {
      "speaker": "Terry",
      "time": "00:24:23",
      "upperBoundTime": "00:26:17",
      "content": "And I knew what came easy to me and that was caring about people. So I got into the clubs, club scenes, and I just loved taking care of people and that just was my passion I always wanted to give a person what I have. Meaning the knowledge of even the pain that I went through. I don't want you to go through it. And that's one of my biggest things that I push for, I always wanted, and that's what made me totally different than who I was then. Because I don't think about me, first. I think about everybody around me then I think about me because I know if everything and everybody around me alright I'm alright."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:17",
      "upperBoundTime": "00:26:20",
      "content": "How long have you been sober?"
    },
    {
      "speaker": "Terry",
      "time": "00:26:20",
      "upperBoundTime": "00:26:24",
      "content": "Well, I've been sober for twenty one years."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:24",
      "upperBoundTime": "00:26:26",
      "content": "Oh so it stopped right."
    },
    {
      "speaker": "Terry",
      "time": "00:26:26",
      "upperBoundTime": "00:28:21",
      "content": "It stopped. And that's one of my main things I talk about. That's one of my main things, even in the re-entry program with me being a mentor, I always stress that. Even when I was president of organizations and in the Malachi dads or wherever I'm at. Even no matter where I'm at that was one of my main things that everybody know me for. From the street that I was an addict, I was street, I was in the street, I was gangster or whatever they want to call me, but now, I'm not. And I've been clean for twenty-one years, I remember, getting something in the parish in '96, and got loaded."
    },
    {
      "speaker": "Terry",
      "time": "00:26:26",
      "upperBoundTime": "00:28:21",
      "content": "But when I got off the bus up here, I was sitting out on the yard, and a guy that been up here a long time, and he seen me sitting next to a few of my friends that, getting high. And he said, \"You get high?\" And I said \"No, I used to\" And this is his words to me he said, \"Well little brother let me tell you something, you're already weak, you're already paralyzed, you're already weak, you don't want nothing to make you weaker than you already are\""
    },
    {
      "speaker": "Terry",
      "time": "00:26:26",
      "upperBoundTime": "00:28:21",
      "content": "He said, \"It seems calm right now in Angola, but all it takes is a split second and it'll get rowdy, you don't have no business making yourself weaker than you already are\" And that stuck with me. Even when I do think about it, and that's one of the biggest things I tell people. I've been clean for twenty-one years, but I still think of it every now and then. I still think of it and I didn't understand why. I'm not craving for it, but it crosses my mind in certain situations."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:21",
      "upperBoundTime": "00:28:23",
      "content": "Well it was a major part of your life."
    },
    {
      "speaker": "Terry",
      "time": "00:28:23",
      "upperBoundTime": "00:28:48",
      "content": "Yeah, and I asked her, one of the mentees mother was a drug counselor and I shared what I'm telling you, and she said, \"Well Terry if you don't have the cravings, you miss the relationship with it\" And that made all the sense to me, because that's what it was, I missed the relationship, the good times that I had when I was on it."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:48",
      "upperBoundTime": "00:29:05",
      "content": "What do you think, what do you think it really takes for people who come here to turn their lives around, is it the administration, is it security, is it other mentors? What makes, what is the catalyst for change?"
    },
    {
      "speaker": "Terry",
      "time": "00:29:05",
      "upperBoundTime": "00:30:16",
      "content": "You have to get a mentor, you have to get, surround yourself around people that have been through it already. That they comfortable with who they are. You have get round, you have to educate yourself first because that's the only way you can change the way you think. You got to do that but your also going to need mentors, you need some brothers around you that's not afraid to tell you, you wrong. Then point you in the direction, not just tell you the wrong on or have no answer to it, to show you where you need to be."
    },
    {
      "speaker": "Terry",
      "time": "00:29:05",
      "upperBoundTime": "00:30:16",
      "content": "But they will tell you where you need to be and help you get there so that's the important thing. But what I see, that's just the one thing that that's hurting them up here. They've got a lot of young guys up here that's they don't see it yet, and it's taking some of them too long. It's taking some of them too long and the biggest thing that's hurting the prison is peer pressure. Nobody don't understand what is peer pressure."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:16",
      "upperBoundTime": "00:30:19",
      "content": "Among the younger inmates?"
    },
    {
      "speaker": "Terry",
      "time": "00:30:19",
      "upperBoundTime": "00:30:48",
      "content": "Younger, real younger. They don't understand peer pressure. They think when they hear the word peer pressure they think, a bully, of making you do something. And that's not the case, that's not what's hurting them. It's the views, how their peers may look at them, the peer pressure that be on. And a lot of times, a lot of the stuff that they do here, they don't want to do it. But it's the cool thing to do."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:48",
      "upperBoundTime": "00:30:52",
      "content": "Can you give me an example?"
    },
    {
      "speaker": "Terry",
      "time": "00:30:52",
      "upperBoundTime": "00:32:45",
      "content": "Like someone tell you, like how I faced it in my transformation when I was changing. And this is the hardest, I've been here twenty-one years and this one makes my time so hard. It's one of the things that made my time so hard. From coming from a street person, with street credibility, what they call street credibility, everybody respect you and everything."
    },
    {
      "speaker": "Terry",
      "time": "00:30:52",
      "upperBoundTime": "00:32:45",
      "content": "And to be coming from a dope feeling and all my peers are getting loaded and doing all the wrong things. I don't do it no more, and the peer pressure that you're facing with like, if they have drugs to get loaded to get high with, I don't do it, then I'm a chimp. Man you ain't real no more, you changing. You changing, Cane, you let Burrough Cane brainwash you."
    },
    {
      "speaker": "Terry",
      "time": "00:30:52",
      "upperBoundTime": "00:32:45",
      "content": "And I realized it, bruh they don't even know me. But that was the big old stigma that they would paint on you, to put the peer pressure on you. If they used the word Cane it's make you, \"I ain't no Cane, bring it here\" But I knew better. And I just stood to the said and said, \"Oh you just get mad\" And that's the hardest thing. And that's the kind of peer pressure you face with anything that's not looking cool."
    },
    {
      "speaker": "Terry",
      "time": "00:30:52",
      "upperBoundTime": "00:32:45",
      "content": "If you putting your shirt in your pants or going to school, going to school is here in 2017 considered weak. It's still considered weak, the small guy is considered the weak guy. And it's the other way around. And that's the peer pressure they're under."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:45",
      "upperBoundTime": "00:32:50",
      "content": "Can you just take a minute to describe your typical routine? What's your typical day like today?"
    },
    {
      "speaker": "Terry",
      "time": "00:32:50",
      "upperBoundTime": "00:34:26",
      "content": "Well, my typical day, I get up in the morning. I live in the re-entry dorm. It's like I'm in there with a lot of kids. A lot of them my age but it's like kids because I have to make sure they're out the dorm. I have to make sure that they're not destroying soap and spitting everywhere in the bathroom, I got to get up in the morning, go to a morning motivation. Make sure everybody, make sure the program go on. Talk to a few of them because they always have something for you to do. Then I have to come up here and teach hundred hours."
    },
    {
      "speaker": "Terry",
      "time": "00:32:50",
      "upperBoundTime": "00:34:26",
      "content": "I have to teach hundred hour, right now I don't have a work partner so I have to do them seven days, I mean ten days every five days a week, so. That's my typical day, I might help them make rounds on the compound just to pop up, just to let them know I'm here. And a lot of them, when they see me they straighten up because I'm not just a disciplinary, I understand the meaning of being a mentor. So I'm just not just going to be pounding them I just keep them going and make rounds then sit down and watch T.V. to try to get the stress level back down and then start it all over again."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:26",
      "upperBoundTime": "00:34:36",
      "content": "Do you teach that in the evenings? Evening and morning, morning and evening. Okay, what time? When's your next class?"
    },
    {
      "speaker": "Terry",
      "time": "00:34:36",
      "upperBoundTime": "00:34:45",
      "content": "Well I'm not scheduled for this week because I guy, he decided to take them all this week, and he's been doing them."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:45",
      "upperBoundTime": "00:35:02",
      "content": "Okay. When you think back on the victims, the crime, for this charge, what do you feel twenty-one years later?"
    },
    {
      "speaker": "Terry",
      "time": "00:35:02",
      "upperBoundTime": "00:37:02",
      "content": "Actually a lot of remorse for that. Because he was a good friend of mine. Was a good friend of mine, was a good person, that was, that was my time, I put that with, that's when I started living. When I met them. When I met him, I started living. Before I was trapped. I couldn't be with my children, I couldn't go to clubs, I couldn't hang on the corner, I couldn't be in the public without having a gun on the side of me. When I met him, it was like my life have changed because he was the type of person to say, \"If you have a gun on you, don't get in my car\"."
    },
    {
      "speaker": "Terry",
      "time": "00:35:02",
      "upperBoundTime": "00:37:02",
      "content": "I think about his kids all the time because they was like mine, it was Uncle Terry. And in the beginning I used to always have dreams about and it still haunt me. \"Look at Uncle Terry, he killed daddy\" And pulling his son away from me because his son was so used to me. But his older daughter is pulling him away saying, \"He killed daddy\" That's something that haunts me and it shouldn't have happened it shouldn't have happened. And I think that has a lot to do with why I do what I do. Because, I know that wasn't who I was, and I had to give back what I have to give back."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:02",
      "upperBoundTime": "00:37:19",
      "content": "So one of the difficulties is that when let's say if you're before a parole board, pardon board, some point you. You're going to have a short window of opportunity to tell them who you are now. What would you say? How would you describe that?"
    },
    {
      "speaker": "Terry",
      "time": "00:37:19",
      "upperBoundTime": "00:38:49",
      "content": "Well I would, first of all I would introduce the new Terry to them. And let them know, the young Terry that did that don't even exit no more. And I'd explain to them who that Terry was, I was an illiterate Terry, I was Terry without a father, I was Terry without any guidance, I was a Terry that didn't know anything but defend yourself, hustle, take care of yourself because there's no one to take care of you."
    },
    {
      "speaker": "Terry",
      "time": "00:37:19",
      "upperBoundTime": "00:38:49",
      "content": "But the new Terry I would explain to them how compassionate I am, and I've been that way but I just, I didn't know how to bring it out, I didn't know how to express it. I didn't know how to express it but that's going to be my main thing that I like for them to see and hear and I explain to them the things that I've been doing. I'm not hot headed no more, I'm not selfish. I know how to love on people and I know the importance of life. I know the importance of life, I cherish it, not just mine I cherish other people's lives."
    },
    {
      "speaker": "Terry",
      "time": "00:37:19",
      "upperBoundTime": "00:38:49",
      "content": "I cherish their opinions. And a lot of times you'll hear people say, I don't care what people say, but I do. I do care what people say and think about me because that can hurt you, I understand that now."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:49",
      "upperBoundTime": "00:38:58",
      "content": "Yeah. You, I mean surely you spend some time envisioning what you would do if you were released and given a second chance. What does that vision look like?"
    },
    {
      "speaker": "Terry",
      "time": "00:38:58",
      "upperBoundTime": "00:39:32",
      "content": "Well, I want to stay with my mama for a little while but. The thing that I've been working on, I want a food truck. I want a food truck because I've been messing with organizations up here for a long time and I learned the business aspect of it. And that became my passion because it just comes to me overnight. And I want to like bring my nephews and nieces on board. My son got a culinary degree."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:32",
      "upperBoundTime": "00:39:35",
      "content": "Terence or Terry?"
    },
    {
      "speaker": "Terry",
      "time": "00:39:35",
      "upperBoundTime": "00:39:55",
      "content": "Terry. He got a culinary degree. Terence in school for business. So, and we always talk about it, we be saying TNT, TNT food trucks. And I'm like we gone run the first one together then you gone get one then we always talk about that, but I'm real passionate about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:55",
      "upperBoundTime": "00:39:57",
      "content": "What kind of food would you be selling?"
    },
    {
      "speaker": "Terry",
      "time": "00:39:57",
      "upperBoundTime": "00:40:31",
      "content": "Fast food. Like hamburgers, French fries, chicken, like the stuff they sell up here. But my mama keep telling me about soul food. She said, \"The soul food, you can park in front of warehouses that have hundreds and hundreds of people coming out and you can make money baby\" Stuff like that so, that's basically what I see myself doing. Getting out there and starting my own business."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:31",
      "upperBoundTime": "00:40:35",
      "content": "So this is a strange question to ask somebody in prison, but, what is the worst part for you today about being in prison?"
    },
    {
      "speaker": "Terry",
      "time": "00:40:35",
      "upperBoundTime": "00:42:36",
      "content": "It's being abandoned by your loved ones. By the very people that you put your life on the line, the very people that I turned to the streets for, abandoned me for no reason. Never been arrested, I have other brothers that done time more than once, I have relatives that done time more than once. I never did any time, this is my first time ever doing time. First time ever sitting in front of a judge and got life."
    },
    {
      "speaker": "Terry",
      "time": "00:40:35",
      "upperBoundTime": "00:42:36",
      "content": "And I felt like I sacrificed my life for them because the drug game wasn't what I wanted to do. I loved swimming, I loved drawing, I could draw whatever I see, even to the day for having to go from right hand to left, that's how much I love it. I learned to do the same thing with my left hand and can't feel anything in my hand."
    },
    {
      "speaker": "Terry",
      "time": "00:40:35",
      "upperBoundTime": "00:42:36",
      "content": "And being abandoned by them, wooo, it sometimes I just hope I don't wake up because I feel like I don't deserve it."
    },
    {
      "speaker": "Terry",
      "time": "00:40:35",
      "upperBoundTime": "00:42:36",
      "content": "I don't deserve it and that's the tough part about my incarceration, being abandoned by my family, by the ones that say they love me. The very people that I put my life on the line, the life that I chose to fend for them, to make sure they have clothes on their back, for them to be well off and doing good, and don't even look back. That's hard, that's hard."
    },
    {
      "speaker": "Marcus",
      "time": "00:42:36",
      "upperBoundTime": "00:42:39",
      "content": "When was the last time you were in touch with your siblings?"
    },
    {
      "speaker": "Terry",
      "time": "00:42:39",
      "upperBoundTime": "00:43:03",
      "content": "Well my mother and my sister came by a month ago but that took like about three four years. That took like about three for years. I talk to my mom, I could call my sisters but that's just what it is. I call them like, \"What's up?\" And it's strange because we didn't have no runs in."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:03",
      "upperBoundTime": "00:43:07",
      "content": "Right, so you feel abandoned. I understand."
    },
    {
      "speaker": "Terry",
      "time": "00:43:07",
      "upperBoundTime": "00:43:12",
      "content": "That's the hardest part of my incarceration, being abandoned."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:12",
      "upperBoundTime": "00:43:46",
      "content": "I understand. I'm sorry to have to ask you this question, because it's a difficult question. I know that you spend time envisioning getting out, you keep hope alive that something will move forward and get some relief. But I imagine also that you have long moments when you also confront the reality that you may die here. How do you cope with that?"
    },
    {
      "speaker": "Terry",
      "time": "00:43:46",
      "upperBoundTime": "00:45:19",
      "content": "Well, when I get to that point, I mean that's every now and then I will be faced with that. And I'm supposed to be faced with that every day, but, after being paralyzed from the neck down, that's the worst that I've ever been, I wouldn't wish that on anyone. At all, this nothing, compared to that. By me facing being paralyzed from the neck down all them years, just that time, and being abandoned then, I had to go stay with somebody else, because my family didn't want me."
    },
    {
      "speaker": "Terry",
      "time": "00:43:46",
      "upperBoundTime": "00:45:19",
      "content": "When they thought I was dead, they put the yellow tape around me, they ran instead of coming to the hospital to see if I survived. My siblings went to my house and they split my stuff up before I was pronounced dead. That's the type of stuff. I don't even, when I think about it, I can accept this, I can accept this because it's not that."
    },
    {
      "speaker": "Marcus",
      "time": "00:45:19",
      "upperBoundTime": "00:45:22",
      "content": "I understand."
    },
    {
      "speaker": "Terry",
      "time": "00:45:22",
      "upperBoundTime": "00:46:48",
      "content": "I can accept this because it's not that. But when I'm faced with it, I know, me being shot on five different occasions, I'm still alive for a reason, maybe, this might be the reason God had for me. To be here for the young guys that's coming here. I don't know but if it is, I'm going to embrace it. Because that takes place anywhere. It ain't about where you die at. I want to be out there with my family, but, if I have to die here after being here twenty-one years, I've been here longer than"
    },
    {
      "speaker": "Terry",
      "time": "00:45:22",
      "upperBoundTime": "00:46:48",
      "content": "I've been with my family so, sometimes I question where I'm from. Because I've been here longer, I've been knowing these people longer than I've known my family. So, it wouldn't be all that bad dying with them sometimes. Sometimes I be like, I be tempted to write my mama and say, if I die, leave me here. Don't come get me, don't bury me with them, I don't know them no more. Bury me with my friends. That crossed my mind a lot. But it don't drag me down."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:48",
      "upperBoundTime": "00:46:50",
      "content": "And you've been through a lot."
    },
    {
      "speaker": "Terry",
      "time": "00:46:50",
      "upperBoundTime": "00:46:54",
      "content": "Yeah, I did. Yeah I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:54",
      "upperBoundTime": "00:47:05",
      "content": "What, when you look at the re-entry guys that you're mentoring, what is the difference between the ones that are going to be alright and the ones that are going to be right back here?"
    },
    {
      "speaker": "Terry",
      "time": "00:47:05",
      "upperBoundTime": "00:48:39",
      "content": "The difference between the ones that's going to be alright, they come focused. I notice a lot of them want big brothers, a lot of them missing daddies, a lot of them missing that deep voice, a lot of them missing that role model, that male role model. But what separates the ones that's going to be successful when they go back out there, they come and focus on their education. Their trade, their life skills really."
    },
    {
      "speaker": "Terry",
      "time": "00:47:05",
      "upperBoundTime": "00:48:39",
      "content": "Their life skill classes really changes them, and once they understand a person care about them who teaching them, they tends to listen to you, and value what you say."
    },
    {
      "speaker": "Terry",
      "time": "00:47:05",
      "upperBoundTime": "00:48:39",
      "content": "And when they see that what you say it manifests itself it really works. Ok Terry, you telling the truth, he do mean me well, so now whatever I say is like a sponge to them."
    },
    {
      "speaker": "Terry",
      "time": "00:47:05",
      "upperBoundTime": "00:48:39",
      "content": "But the ones that's going to go back out there and come back, or maybe not going to make it back, is the ones that take education for granted. I'm just doing it just to get by because I need it just to get out. And you basically can see it immediately. Some of them will change in the middle and decide to just do right, but overall the ones that want it gone get it."
    },
    {
      "speaker": "Marcus",
      "time": "00:48:39",
      "upperBoundTime": "00:48:46",
      "content": "Of all the things that you've accomplished since you've been here, what are you the most proud of?"
    },
    {
      "speaker": "Terry",
      "time": "00:48:46",
      "upperBoundTime": "00:49:21",
      "content": "My influence. I have a lot of influence, with security, and with the inmates. A lot of times if I say something, it be face value. The influence and just the guidance that I give others. And I don't, it scared me, it scared me when I realized it. Other people had to point it out to me like, \"Terry, every time you talk they listen to you\""
    },
    {
      "speaker": "Marcus",
      "time": "00:49:21",
      "upperBoundTime": "00:49:23",
      "content": "It's a big responsibility."
    },
    {
      "speaker": "Terry",
      "time": "00:49:23",
      "upperBoundTime": "00:50:00",
      "content": "Yeah. Everybody and once I seen that I was like wow. It was amazing because I thought everybody was against me. Because I'm not the old Terry no more, but they respected it. They respect me from changing into Mr. Everything. I'm real proud of that because I lead them the right way. I lead them the right way and I'm real proud of that. Give them solid advice, the best advice I could give them."
    },
    {
      "speaker": "Marcus",
      "time": "00:50:00",
      "upperBoundTime": "00:50:04",
      "content": "Yeah and you've been there, you've been in their shoes."
    },
    {
      "speaker": "Terry",
      "time": "00:50:04",
      "upperBoundTime": "00:51:10",
      "content": "Yeah, I see it a lot. And I share with them all the time. They look at me being shot up and I got shot in the head, by back, my arm, my stomach, my legs, everywhere. And it's amazing that I felt no physical pain. Still to this day. Everything was mental for me. Maybe, and I think that's why I take everything to heart."
    },
    {
      "speaker": "Terry",
      "time": "00:50:04",
      "upperBoundTime": "00:51:10",
      "content": "That's why I'm always trying to share because it's nothing physical for me."
    },
    {
      "speaker": "Terry",
      "time": "00:50:04",
      "upperBoundTime": "00:51:10",
      "content": "Even in my twenty-one years as long as I've been incarcerated I've never had any confrontation. Physical confrontation. I've been protected. This ain't nothing I did, I ain't never had no knife or try to hurt nobody to get the reputation, it's just, I've been protected. And that's just strange but, that's the way it is"
    },
    {
      "speaker": "Marcus",
      "time": "00:51:10",
      "upperBoundTime": "00:51:19",
      "content": "I've really enjoyed talking with you, I think it's a privilege for me to be sitting here talking with you guys actually."
    },
    {
      "speaker": "Terry",
      "time": "00:51:19",
      "upperBoundTime": "00:51:21",
      "content": "Same here."
    },
    {
      "speaker": "Marcus",
      "time": "00:51:21",
      "upperBoundTime": "00:51:34",
      "content": "Is there a question that I should have asked you that I didn't ask you? Something you would want to have an opportunity to talk about that you didn't get to?"
    },
    {
      "speaker": "Terry",
      "time": "00:51:34",
      "upperBoundTime": "00:53:09",
      "content": "Well the one thing that jumped out to me that a lot of people. Well, the question that you didn't ask was the education of our parents, because that plays a part. And that's where it starts from, because I parent can only give a child what they have. And that was the one thing that my mother couldn't give us. Was an education because she didn't know the value of it because she didn't have it. And that shaped us. Because if she would've had an education, she would've known the importance of it, she would've made sure we just don't drop out of school and all of us, all six of her kids."
    },
    {
      "speaker": "Terry",
      "time": "00:51:34",
      "upperBoundTime": "00:53:09",
      "content": "Stopped. No bad by, no fussing about it or nothing. She may have mentioned it, you gone be sorry later, and that was it. And now, I can hear her now and I know that was from her experience. Because she's sorry. Even though she's taking care real good, her husband left her a lot of good stuff and she's doing good, but I know that's what's still holding her back, she would've went way more farther, and we would've went farther if we done had somebody in the house that would tell us the importance of education."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:09",
      "upperBoundTime": "00:53:30",
      "content": "Yeah I remember you saying earlier, in the last hour here that that was the thing that if you'd felt like if yours somehow kept on that you've gone down the right path. Well your kids, both of your sons are maybe breaking that cycle."
    },
    {
      "speaker": "Terry",
      "time": "00:53:30",
      "upperBoundTime": "00:54:44",
      "content": "Yeah, I sure hope so. I always talk to Terence about that. And he totally the opposite of me, he totally the opposite. Sometimes I get mad because he's so different, because so much of a mama and grandma boy. But, he a good child. Maybe that's why I was here, so he could be a good child and I be telling him how to respect women and how to respect his grandpa that always he looks high up to."
    },
    {
      "speaker": "Terry",
      "time": "00:53:30",
      "upperBoundTime": "00:54:44",
      "content": "Because it's very important to get everything they've got because they're coming from a different background than me. I know everything he hear, he repeats it. And one thing I know about my kids, any kind of information they can get on me, they hold it. Anything they hear somebody say about me, they'll repeat it. And they'll try to duplicate it. That's what Terry did. And I'm the fault for that."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:44",
      "upperBoundTime": "00:54:47",
      "content": "Is he you said he's at a halfway house?"
    },
    {
      "speaker": "Terry",
      "time": "00:54:47",
      "upperBoundTime": "00:54:50",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:50",
      "upperBoundTime": "00:54:52",
      "content": "Which is sort of like a work release?"
    },
    {
      "speaker": "Terry",
      "time": "00:54:52",
      "upperBoundTime": "00:54:55",
      "content": "He in a work release he been there like eight years now."
    },
    {
      "speaker": "Marcus",
      "time": "00:54:55",
      "upperBoundTime": "00:54:58",
      "content": "Oh wow, so when is that going to be over?"
    },
    {
      "speaker": "Terry",
      "time": "00:54:58",
      "upperBoundTime": "00:55:01",
      "content": "In two more years."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:01",
      "upperBoundTime": "00:55:03",
      "content": "Okay."
    },
    {
      "speaker": "Terry",
      "time": "00:55:03",
      "upperBoundTime": "00:55:05",
      "content": "And he got, I got one grandbaby by him."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:05",
      "upperBoundTime": "00:55:08",
      "content": "You're a grandpa."
    },
    {
      "speaker": "Terry",
      "time": "00:55:08",
      "upperBoundTime": "00:55:10",
      "content": "Yeah, she just made eight."
    },
    {
      "speaker": "Marcus",
      "time": "00:55:10",
      "upperBoundTime": "00:55:13",
      "content": "Well, that's a good place to stop. Thank you so much Terry, I really appreciate it, a lot."
    },
    {
      "speaker": "Terry",
      "time": "00:55:13",
      "content": "I appreciate you all."
    }
  ]
}
