{"name":"","transcript":[{"content":"Terry Jones MK REDACTIONS FINAL"},{"speaker":"Marcus","time":"00:00:00-7","content":"Can you start by stating your name, the crime of conviction, how old you were, and how much time you've served."},{"speaker":"Terry","time":"00:00:07-5","content":"How old I am now, or when I got locked up?"},{"speaker":"Marcus","time":"00:00:09-9","content":"So, the crime of conviction, how old you were at the time that it happened, and then how much time you've served."},{"speaker":"Terry","time":"00:00:20-0","content":"My names Terry Jones, I was convicted of 2nd degree murder, I was 21 years old. Now I'm 45 years old."},{"speaker":"Marcus","time":"00:00:30-2","content":"Okay, so 24 years passed. And of those years I assume 22, 23 have been at Angola, is that correct?"},{"speaker":"Terry","time":"00:00:39-2","content":"Yeah, 23."},{"speaker":"Marcus","time":"00:00:44-1","content":"Okay, so the focus of this interview is to try to learn more about your life and your experiences before this happened, but the 23 years at Angola as well. So it makes sense to start with your family, so tell me about the people who raised you."},{"speaker":"Terry","time":"00:01:03-6","content":"My mother raised me, last time I saw my father was about 7 years old. I remember he came to the house, said a few words, left and I ain't seen him again. So my mother, she'd been a mother and a father. It was 4 of us. 3 boys and 1 girl, I'm a twin, 2 minutes apart. His name Kerry, I'm Terry, I'm the oldest."},{"speaker":"Marcus","time":"00:01:32-7","content":"Did you say 2 minutes apart?"},{"speaker":"Terry","time":"00:01:33-9","content":"Yeah, I'm older by 2 minutes."},{"speaker":"Marcus","time":"00:01:37-3","content":"You kept reminding him of that I'm sure."},{"speaker":"Terry","time":"00:01:40-3","content":"So my mom did a good job, try to keep us in shape."},{"speaker":"Marcus","time":"00:01:46-0","content":"So your brother Gary is a year older, so then there's Kerry and Terry, where is your sister in the birth order?"},{"speaker":"Terry","time":"00:01:55-1","content":"What you mean?"},{"speaker":"Marcus","time":"00:01:57-8","content":"Is she the youngest?"},{"speaker":"Terry","time":"00:01:58-9","content":"Yeah she's the youngest. We got Gary, I'm the second oldest, my twin third, my sister."},{"speaker":"Marcus","time":"00:02:05-8","content":"Okay, and what's your sister's name?"},{"speaker":"Terry","time":"00:02:07-2","content":"Samantha."},{"speaker":"Marcus","time":"00:02:08-7","content":"Samantha. So how is Samantha and Kerry doing?"},{"speaker":"Terry","time":"00:02:11-4","content":"They're doing alright. My sister stay in the East. My brother, he stay all over. Me and my brother got locked up, so it's been affecting him too. Twin locked up too, took it hard. Still trying to get his life together, was real hard on him."},{"speaker":"Marcus","time":"00:02:35-2","content":"Sure, sure. And we'll talk a little bit about the impact of all this on your family. So your mother is the main parents figure."},{"speaker":"Terry","time":"00:02:46-7","content":"Yeah."},{"speaker":"Marcus","time":"00:02:47-9","content":"Did you have other folks in your family who took an interest in you, grandparents' maybe?"},{"speaker":"Terry","time":"00:02:52-9","content":"Yeah, grandmother grandfather."},{"speaker":"Marcus","time":"00:02:55-1","content":"Okay tell me about them?"},{"speaker":"Terry","time":"00:02:57-1","content":"Both of them passed away. They were like second parents, they were there for us."},{"speaker":"Marcus","time":"00:03:03-9","content":"Your mother's parents?"},{"speaker":"Terry","time":"00:03:05-2","content":"Yeah, so they were there for us a lot. Love my grandmother, I miss her a lot too."},{"speaker":"Marcus","time":"00:03:11-8","content":"Yeah, do you remember the last interaction that you had with your grandmother?"},{"speaker":"Terry","time":"00:03:19-6","content":"I'm trying to see, she passed away in I say like 1988."},{"speaker":"Marcus","time":"00:03:24-8","content":"Oh a long time ago."},{"speaker":"Terry","time":"00:03:26-2","content":"A long time ago. My grandfather passed away when I was locked up. It's been awhile. I can't remember what the last thing…"},{"speaker":"Marcus","time":"00:03:36-3","content":"Sure, it's been a long time, I didn't realize it was that long-"},{"speaker":"Terry","time":"00:03:42-3","content":"I miss her a lot though."},{"speaker":"Marcus","time":"00:03:43-4","content":"And so she never had to watch you and your brother go through this."},{"speaker":"Terry","time":"00:03:46-1","content":"Yeah."},{"speaker":"Marcus","time":"00:03:48-1","content":"Your grandfather on the other hand, he had to witness all that."},{"speaker":"Terry","time":"00:03:50-5","content":"Yeah."},{"speaker":"Marcus","time":"00:03:55-3","content":"Did he visit you at all when you were up here?"},{"speaker":"Terry","time":"00:03:56-2","content":"No, I think he had caught Alzheimer's, so my mom had to take care of him. So that was hard to because she had to step in to take care of him too."},{"speaker":"Marcus","time":"00:04:06-3","content":"She's taking care of everybody. So were there men in your mother's life, beside your father, who had come into your life?"},{"speaker":"Terry","time":"00:04:17-4","content":"Yeah. She had, like my brother, he was like, we had 3 different dads. Me and my twin got the same dad, my sister has her own dad, and my brother Gary got a dad."},{"speaker":"Marcus","time":"00:04:31-3","content":"Oh, okay."},{"speaker":"Terry","time":"00:04:32-2","content":"So they was in they lives, they wasn't in me and my brother's life. So mama, she had like a friend, he was like a stepdad."},{"speaker":"Marcus","time":"00:04:41-6","content":"To all of y'all?"},{"speaker":"Terry","time":"00:04:42-6","content":"Yeah."},{"speaker":"Marcus","time":"00:04:43-5","content":"Okay, and what was he like?"},{"speaker":"Terry","time":"00:04:45-1","content":"He was pretty cool. He would like, he would tell my mother, we would do something and she'd say whoop them, and he said no I can't put my hand on nobody kid. So he's that type of dad."},{"speaker":"Marcus","time":"00:04:57-6","content":"Okay well, so he didn't bring a lot of conflict in the house?"},{"speaker":"Terry","time":"00:05:02-7","content":"No, he was pretty cool."},{"speaker":"Marcus","time":"00:05:08-0","content":"Yeah okay. Was there a lot of fighting in the house?"},{"speaker":"Terry","time":"00:05:12-0","content":"Yeah you could say that. I got a lot of uncles and aunties, I think my grandmother had like 11, like 12 kids. One got killed and that's it, a long time ago, I think he was 2 weeks old. So I got a lot of uncles and aunties who drink a lot and who fight a lot. Fighting, that was a bad thing. So, I got two uncles who used to fight a lot. And that was bad for a family."},{"speaker":"Marcus","time":"00:05:47-7","content":"And they would get physical?"},{"speaker":"Terry","time":"00:05:49-0","content":"Real physical, sometimes violent, truly. Never did understand that."},{"speaker":"Marcus","time":"00:05:57-1","content":"Sure, and you as a child witnessed a lot of that."},{"speaker":"Terry","time":"00:06:01-7","content":"Yeah, like every day they were drinking a lot."},{"speaker":"Marcus","time":"00:06:07-1","content":"Everyday, gosh. What about your mother, did she get involved in these fights?"},{"speaker":"Terry","time":"00:06:12-4","content":"No, my mother don't drink. She do drink a little but she can control it, she don't get drunk."},{"speaker":"Marcus","time":"00:06:19-1","content":"Okay, but all these other people are coming in and out of your household?"},{"speaker":"Terry","time":"00:06:21-4","content":"Yeah."},{"speaker":"Marcus","time":"00:06:23-8","content":"What about in the neighborhood, was there a lot of fighting in your neighborhood?"},{"speaker":"Terry","time":"00:06:27-4","content":"Oh, on the corner of Canal in the 9th ward in New Orleans. They were pretty good, back then we had chicken and ducks and all that in the neighborhood, kind of strange for a city. But the neighborhood pretty cool, I liked the neighborhood."},{"speaker":"Marcus","time":"00:06:46-9","content":"Did you feel safe in the neighborhood?"},{"speaker":"Terry","time":"00:06:48-1","content":"Yes."},{"speaker":"Marcus","time":"00:06:52-4","content":"Tell me a little bit about- first well I'm going to assume, I was going to ask you if there was one person in your coming up who you consider the closest to you who took the greatest interest in you. I'm assuming that would be your mother, is that right?"},{"speaker":"Terry","time":"00:07:07-7","content":"Yeah that is."},{"speaker":"Marcus","time":"00:07:08-9","content":"Okay. So, is it fair to say that even though there's a little bit of chaos, I'm gathering from your uncles and some of the conflict going on? But is it safe to say you grew up fairly sure you were loved and cared for. Or did you feel that you kind of had to fend for yourself?"},{"speaker":"Terry","time":"00:07:32-1","content":"I felt like I was loved and cared for. They would do that to themselves, but they ain't never hurt the kids, nothing like that. We'd just stay out the way while they'd do these things. They'd never hurt us though."},{"speaker":"Marcus","time":"00:07:47-1","content":"Yeah that's good. So when you have a twin, I assume that you guys were like this, just inseparable. You do everything together. Did they dress you the same?"},{"speaker":"Terry","time":"00:08:00-6","content":"Yeah the same. If he met with a girl, I met with her sister or her cousin, somebody in the family too. So we were still together 24Marcus:7."},{"speaker":"Marcus","time":"00:08:11-9","content":"Did you guys share a bedroom?"},{"speaker":"Terry","time":"00:08:13-3","content":"Yeah we had bunk beds."},{"speaker":"Marcus","time":"00:08:18-5","content":"So I think I have a fairly good sense of your neighborhood too, so I think I can picture that. Tell me a little bit about school, I want to get a sense of that. Where were you in school?"},{"speaker":"Terry","time":"00:08:36-3","content":"School was pretty good. It was at the corner of Canal, I liked school, and it was, pretty cool. I remember going to school, we ended up staying in California for 1 year."},{"speaker":"Marcus","time":"00:08:50-7","content":"Oh, what took you to California?"},{"speaker":"Terry","time":"00:08:52-3","content":"We moved to California, we had kin folks out there too. We stayed for one year, and cried coming back to New Orleans. I don't know if that was a mistake or what. Maybe I probably wouldn't be here. But California was pretty cool, I remember going to school and school sitting on the top of a hill and I remember all that."},{"speaker":"Marcus","time":"00:09:13-9","content":"And so the whole family, your mother and all of your siblings left to go to California? And what does she do out there? What does your mother do out there?"},{"speaker":"Terry","time":"00:09:23-0","content":"I don't remember what she was doing, working. I remember I had some aunties out there, my uncle married somebody from California. I guess she wanted to see how it was out there. But after that one year we got homesick and wanted to come back."},{"speaker":"Marcus","time":"00:09:43-5","content":"That's what New Orleans does to you for sure. So how did your mother support the family?"},{"speaker":"Terry","time":"00:09:50-5","content":"Working, I guess her boyfriend take care of her. She ain't did too much working, but I don't know how she made ends meet, she did a good job."},{"speaker":"Marcus","time":"00:10:02-2","content":"Just with odd jobs, different jobs?"},{"speaker":"Terry","time":"00:10:04-5","content":"Different jobs."},{"speaker":"Marcus","time":"00:10:12-9","content":"So what was the highest year of school you completed?"},{"speaker":"Terry","time":"00:10:13-8","content":"10th."},{"speaker":"Marcus","time":"00:10:14-8","content":"10th alright."},{"speaker":"Terry","time":"00:10:16-0","content":"After that I start having kids so I had to take care of them."},{"speaker":"Marcus","time":"00:10:18-9","content":"Oh okay, alright, so let's backtrack to that. Tell me about your girlfriend."},{"speaker":"Terry","time":"00:10:23-9","content":"Girlfriend, baby mama? Yeah, we got together at a young age, we met up, and we got close and started having kids."},{"speaker":"Marcus","time":"00:10:34-7","content":"When did that happen, when was your first child born?"},{"speaker":"Terry","time":"00:10:39-0","content":"First child? 92'."},{"speaker":"Marcus","time":"00:10:41-4","content":"And you're how old?"},{"speaker":"Terry","time":"00:10:42-5","content":"I think I was about 17."},{"speaker":"Marcus","time":"00:10:45-1","content":"Okay, and so how many children do you have?"},{"speaker":"Terry","time":"00:10:48-6","content":"2."},{"speaker":"Marcus","time":"00:10:48-6","content":"Okay tell me about them."},{"speaker":"Terry","time":"00:10:49-7","content":"I got a daughter, I think she is about, I think she's 26. Sometimes I forget my age. I got a son, 24. They good kids."},{"speaker":"Marcus","time":"00:11:02-6","content":"What are their names?"},{"speaker":"Terry","time":"00:11:03-8","content":"Terian and Corey. They good kids. By me not being out there, it's hard to try to build a relationship is hard. I don't see them on a regular basis, they don't know me that well. I got a grandbaby now."},{"speaker":"Marcus","time":"00:11:27-7","content":"So how do you keep up with what they're doing?"},{"speaker":"Terry","time":"00:11:31-8","content":"Every now and then I call, kiosk machine."},{"speaker":"Marcus","time":"00:11:35-2","content":"Sure, sure."},{"speaker":"Terry","time":"00:11:37-3","content":"Sometimes they visit."},{"speaker":"Marcus","time":"00:11:38-9","content":"And are you still in touch with the baby mama?"},{"speaker":"Terry","time":"00:11:41-2","content":"Yeah, she moved to Florida, she in Florida. She doing good. She started to be a nurse. Proud of her."},{"speaker":"Marcus","time":"00:11:51-1","content":"Did she start another family after you got locked up?"},{"speaker":"Terry","time":"00:11:52-9","content":"Yeah she got married and everything."},{"speaker":"Marcus","time":"00:11:59-2","content":"What about Kerry at this time, is he also having kids?"},{"speaker":"Terry","time":"00:12:06-7","content":"I guess you'd say- they call that, deadbeat dad."},{"speaker":"Marcus","time":"00:12:17-8","content":"Oh, so he has children but he hasn't been a parent."},{"speaker":"Terry","time":"00:12:21-6","content":"I tried to reach out to them and try and be that dad to them but he ain't there for them."},{"speaker":"Marcus","time":"00:12:32-5","content":"You'd mentioned earlier on that your being incarcerated really derailed him, and we'll talk a little bit about that too. But who are the folks that visit you here?"},{"speaker":"Terry","time":"00:12:47-5","content":"My mother."},{"speaker":"Marcus","time":"00:12:53-6","content":"Your mother continues to visit you from New Orleans?"},{"speaker":"Terry","time":"00:12:56-7","content":"She's in old age now so somebody got to bring her, she usually drive on her own. But she in that age that she can't drive."},{"speaker":"Marcus","time":"00:13:04-4","content":"Okay. And when she comes up here do you make sure that you and your brother go to visit shed together?"},{"speaker":"Terry","time":"00:13:09-5","content":"Yeah."},{"speaker":"Marcus","time":"00:13:13-8","content":"When was the last time she was here?"},{"speaker":"Terry","time":"00:13:16-8","content":"I'd say about 2 months."},{"speaker":"Marcus","time":"00:13:19-1","content":"Are those visits difficult for you guys?"},{"speaker":"Terry","time":"00:13:21-4","content":"Yeah, I can tell it's difficult for her too. She really going through a lot. Us men, we try to be strong, but your mom, she don't so. I can tell it took a big toll on her."},{"speaker":"Marcus","time":"00:13:41-0","content":"It's got to be hard watching your mother. And it's 2 of her boys."},{"speaker":"Terry","time":"00:13:48-6","content":"I could see her when she was young, and now old. Walking slow and stuff like that, that's a lot."},{"speaker":"Marcus","time":"00:13:57-4","content":"Yeah, I can imagine. So the 10th grade, why did you stop school?"},{"speaker":"Terry","time":"00:14:06-6","content":"To take care of my kids, it's when my 2nd child was born."},{"speaker":"Marcus","time":"00:14:12-8","content":"So how did you do that?"},{"speaker":"Terry","time":"00:14:14-4","content":"First I had a job, then I got laid off, then I was running the streets."},{"speaker":"Marcus","time":"00:14:20-0","content":"What was the job?"},{"speaker":"Terry","time":"00:14:21-8","content":"I worked on ships, staking ships. And I was working at Rex Seafood, making seasons for different companies. I did that too until I got laid off."},{"speaker":"Marcus","time":"00:14:35-3","content":"What about your brothers, what did they do?"},{"speaker":"Terry","time":"00:14:38-2","content":"My brother Gary, my older brother, I don't know, he's never had a job. My twin brother, he's been working at McDonalds, stuff like that."},{"speaker":"Marcus","time":"00:14:47-9","content":"Okay, so you get laid off from there. And how are you getting by?"},{"speaker":"Terry","time":"00:14:56-5","content":"In the streets."},{"speaker":"Marcus","time":"00:14:58-0","content":"What does that mean?"},{"speaker":"Terry","time":"00:15:00-5","content":"Selling drugs."},{"speaker":"Marcus","time":"00:15:02-0","content":"Okay, hustling."},{"speaker":"Terry","time":"00:15:04-1","content":"Yeah, hustling, taking care of my living."},{"speaker":"Marcus","time":"00:15:06-1","content":"Yeah, I understand. Now if you're selling drugs in New Orleans, I'm assuming it was in your neighborhood. Were you still living at home?"},{"speaker":"Terry","time":"00:15:15-3","content":"Yeah."},{"speaker":"Marcus","time":"00:15:19-8","content":"Okay, so this is in the 9th ward?"},{"speaker":"Terry","time":"00:15:21-1","content":"I moved to the 6th ward."},{"speaker":"Marcus","time":"00:15:23-3","content":"Oh you moved to the 6th ward. Okay, what street?"},{"speaker":"Terry","time":"00:15:26-8","content":"What street in the 6th ward?"},{"speaker":"Marcus","time":"00:15:28-6","content":"Where in the 6th ward?"},{"speaker":"Terry","time":"00:15:29-9","content":"It's like the 6th ward and Tremé housing project."},{"speaker":"Marcus","time":"00:15:32-8","content":"Oh I know exactly where, Tremé. So you're there trying to make ends meet. You're dealing drugs, it's dangerous. So I assume you felt the need to have a firearm?"},{"speaker":"Terry","time":"00:15:52-6","content":"Yeah."},{"speaker":"Marcus","time":"00:15:55-8","content":"If you had to imagine what would've happened, how your life could have been- I'm sure you've spent a lot of time thinking what if this person hadn't identified me- do you think you would've gotten in some kind of different trouble or how do you think the rest of your life would have gone?"},{"speaker":"Terry","time":"00:16:14-5","content":"I think I'd be alright. I would have found work somewhere, I'd probably move somewhere else. I would be thinking about my kids. I got to be out there for them. It's hard living in society right now, it's hard for a black man. So it's kind of hard to picture what your future would have been like, kind of hard."},{"speaker":"Marcus","time":"00:16:46-5","content":"Do you think you would've left that lifestyle?"},{"speaker":"Terry","time":"00:16:49-2","content":"I think I would have. I've always had a business mind, I probably would've invested in a business or something like that."},{"speaker":"Marcus","time":"00:17:00-0","content":"I ask you that because I've talked to quite a few guys, who once they get in that lifestyle, when I ask them about what they think would've happened had they not gotten out of bed that day- and these are situation where they admit to having done whatever they're here for. A lot of them say I'd be dead, because if it wasn't this, it'll be something else. They'd either be dead or in prison. Is that true for you or no?"},{"speaker":"Terry","time":"00:17:36-6","content":"You think about it sometimes. You ain't ever thinking that can happen to you, in reality it could. I'd been in the streets. You can have a good job and come home from work and get robbed get shot. So I get all that too."},{"speaker":"Marcus","time":"00:17:56-9","content":"No one knows what could happen, okay. So I want to, because your case is pending, I want to not go into that too much more. So, I want to start talking about your life since this charge. I know you spent quite a bit of that fighting this situation. But I also want to know just about your experience handling life at Angola and dealing with the whole thing."},{"speaker":"Marcus","time":"00:17:56-9","content":"But before we move to that, is there something about your childhood experiences that I should've asked you about that we didn't talk about? Again, I'm trying to get a sense of who is Terry as this kid before this happened."},{"speaker":"Terry","time":"00:18:46-8","content":"I'm the type of person that, I give people a 2nd chance. No cause I'm in here, but that's how I last so long at Angola. Never had a fight, never been to the blocks, what I'm saying. So that kind of hard."},{"speaker":"Marcus","time":"00:19:04-4","content":"Wow, I don't know many people who can say that."},{"speaker":"Terry","time":"00:19:05-8","content":"It kind of hard. You might have a handful."},{"speaker":"Marcus","time":"00:19:09-3","content":"I haven't met one."},{"speaker":"Terry","time":"00:19:11-1","content":"No I've never been in the blocks. I've been blessed. Been working in the club for 18 years, manage the club situation, management wise and ordering food all that stuff. So I keep myself busy. Before I got locked up, I come from a good home, even though they were drinking. But I come from a good home."},{"speaker":"Marcus","time":"00:19:36-2","content":"Okay. So I can only imagine how confusing and crazy it must have been to wake up 2 months later and be facing a life sentence."},{"speaker":"Terry","time":"00:19:50-9","content":"Yeah, kind of rough, kind of hard."},{"speaker":"Marcus","time":"00:19:53-1","content":"Yeah, and was your family in court with you as you were going through all that?"},{"speaker":"Terry","time":"00:19:57-7","content":"Nah, it was a messed up scene, when I got found guilty everybody broke out crying and left out the courtroom. That was kind of sad, yeah. My mom probably cried about 2 weeks straight. She did more crying than me. It was hard for her to, I understand, I feel for the victim's family cause I can see what my mom went through. In their family I know they're going through the same thing too."},{"speaker":"Marcus","time":"00:20:27-9","content":"Yeah and I think it's possible to feel their pain while also not feeling personally responsible for creating that pain. 2 families are affected when this happens. I'm going to ask a little bit more about that I also want to talk about how Kerry's handled it all as well. So one of the reasons that we're talking to you, is that folks like you, a lot of times you see this complete transformation of a person."},{"speaker":"Marcus","time":"00:20:27-9","content":"They come here as a young man who may have been going down the wrong path, whether they're guilty of the offense or not, and they've spent the time here at Angola to just totally change their lives around, transform themselves. That transformation is part of what we want to make more visible."},{"speaker":"Marcus","time":"00:20:27-9","content":"But, if you go back to the person who was brought here, what kind of a person was that? Are you that different from that person? I don't know that you necessarily are, I'm just trying to get a sense of...what's happened since then?"},{"speaker":"Terry","time":"00:21:39-3","content":"Yeah, I wasn't the type that running the street doing that type of stuff. I wanted to take care of my kids what I'm saying. I didn't have that many fights at school, I'm just a quiet person, stay to myself. So when I came here, the same person, but learning more and getting more mature and you got to think before you do something."},{"speaker":"Terry","time":"00:21:39-3","content":"Back then, when you running the street things move fast, you wasn't thinking. People who commit crimes don't think about the outcome or what they're facing. Some people don't know what the charge carry. My lawyer taught me in the parish, he told me, your charge caries life. I asked him what that was. In the street never heard about it. Because it's my first time being locked up, doing time."},{"speaker":"Marcus","time":"00:22:34-0","content":"I also think that for a lot of folks, when they hear oh you got a life sentence. They don't really- that doesn't sink in either-"},{"speaker":"Terry","time":"00:22:41-3","content":"Yeah I ain't know what that means."},{"speaker":"Marcus","time":"00:22:42-7","content":"So do you remember that bus ride?"},{"speaker":"Terry","time":"00:22:46-7","content":"Yeah I remember like yesterday."},{"speaker":"Marcus","time":"00:22:48-5","content":"Tell me about it, what was going through your mind?"},{"speaker":"Terry","time":"00:22:52-0","content":"I didn't know what to expect, when you're in the parish you hear this and that, stuff like that. So I didn't know what to expect so when the bus pull up, I come down the walkway and some guys go to the cell blocks cause they like young-"},{"speaker":"Marcus","time":"00:23:05-1","content":"Was Kerry on the bus with you?"},{"speaker":"Terry","time":"00:23:06-3","content":"Yeah. So we on the bus together, we pull up, soon as we come right by the gate, everybody on the blocks coming to the gate. I'm like what is this, this looks like they going to throw you to the wolves, know what I'm saying. That was the cellblock, I ain't know nothing about it. So we went on a walk, and it got pretty cool, it was like nighttime about almost 6 o'clock."},{"speaker":"Marcus","time":"00:23:36-0","content":"Did they bring you to the main prison?"},{"speaker":"Terry","time":"00:23:37-1","content":"Yeah, and I know a few guys. They say what's up Terry how you doing. They showed me around, everything cool and stuff like that. I didn't know what to expect at first."},{"speaker":"Marcus","time":"00:23:50-6","content":"And how about Kerry, did he adjust as well as you did?"},{"speaker":"Terry","time":"00:23:55-4","content":"I guess he was used to it, not used to it. He done time before so he knew how to handle it more better than me."},{"speaker":"Marcus","time":"00:24:03-1","content":"Sure. What had he done time before for?"},{"speaker":"Terry","time":"00:24:07-0","content":"Robbery, he did like 2 ½ years."},{"speaker":"Marcus","time":"00:24:09-7","content":"In the parish?"},{"speaker":"Terry","time":"00:24:10-8","content":"Yeah."},{"speaker":"Marcus","time":"00:24:12-5","content":"But not at Angola, he hasn't been up here? It's a whole different-"},{"speaker":"Terry","time":"00:24:16-1","content":"He been to, Cotton pull something like that."},{"speaker":"Marcus","time":"00:24:23-6","content":"Oh okay. If you look back on that person and everything you clearly, as I said, I haven't met very many people who haven't done at least a little bit of time in the cell blocks who didn't butt their heads against something when they first got here. Most of them figure it out, but you seemed to have it figured out right from the get go."},{"speaker":"Terry","time":"00:24:44-6","content":"Stick to yourself, mind your own business that can get you a long way."},{"speaker":"Marcus","time":"00:24:50-6","content":"Although, everybody seems to have an experience when they come here where someone's going to try you. How did you handle those situations, how did you handle that? Cause they say if you don't respond back violently then-"},{"speaker":"Terry","time":"00:25:06-4","content":"Some of the guys you have to tell them, ain't going to happen, don't go my way. So I'm like and they back off."},{"speaker":"Marcus","time":"00:25:16-5","content":"Okay, you just can't get caught up fighting. Alright. So what was your day like when you first got here, what was your routine? Did they put you in the field?"},{"speaker":"Terry","time":"00:25:32-0","content":"They put me in the field. My first day-"},{"speaker":"Marcus","time":"00:25:36-6","content":"Yeah tell me about those first few days."},{"speaker":"Terry","time":"00:25:39-0","content":"So I go to the bay, I'm looking around like losing my travel. I'm kind of paranoid for about a week or 2, then I started seeing people I knew and feeling comfortable a little bit. Going in the field that was rough too."},{"speaker":"Marcus","time":"00:25:58-5","content":"What's that like?"},{"speaker":"Terry","time":"00:25:59-7","content":"It's rough, I have a medical condition, but I still had to go through the process of the field. It took me about 4 months to get out. Rough, rough fields rough. I couldn't handle it, in the sun and all that but I made it through."},{"speaker":"Marcus","time":"00:26:20-4","content":"Right. It's very physically demanding-"},{"speaker":"Terry","time":"00:26:23-9","content":"My hands were free. I been lucky with that. I don't know how I made it through but I made it through."},{"speaker":"Marcus","time":"00:26:35-6","content":"After those 4 months, what was your next assignment?"},{"speaker":"Terry","time":"00:26:39-8","content":"Then I worked in the kitchen. I worked in the kitchen for many years cooking, stuff like that. Then I started to get involved in clubs. Then most of my time went there."},{"speaker":"Marcus","time":"00:26:52-4","content":"And that's what you do now. So what's your typical day like now, what's your routine now today?"},{"speaker":"Terry","time":"00:26:59-6","content":"Come up here make sure everything's clean, check everything out in the clubs and stuff like that."},{"speaker":"Marcus","time":"00:27:04-8","content":"So what's your responsibility with the clubs?"},{"speaker":"Terry","time":"00:27:07-4","content":"Oh, really running it and making orders."},{"speaker":"Marcus","time":"00:27:11-5","content":"For all of them?"},{"speaker":"Terry","time":"00:27:12-5","content":"Yeah. This is for Men of Hope."},{"speaker":"Marcus","time":"00:27:16-5","content":"Oh just for one club."},{"speaker":"Terry","time":"00:27:17-9","content":"Yeah Men of Hope."},{"speaker":"Marcus","time":"00:27:19-3","content":"Men of Hope."},{"speaker":"Terry","time":"00:27:21-2","content":"Yeah on the West Yard. So I make the orders and make sure everything cool and straight, concessions managers good and all that."},{"speaker":"Marcus","time":"00:27:27-8","content":"So what does men of hope do, what's their primary?"},{"speaker":"Terry","time":"00:27:29-0","content":"Generate money and take care of the population. Buy stuff for the TV, stuff they need. Sometimes they feed the whole yard, hot dog, chips, and cola."},{"speaker":"Marcus","time":"00:27:39-0","content":"Okay. How do they raise money?"},{"speaker":"Terry","time":"00:27:40-8","content":"Through stocks club. They buy food drugs for them, and then put it in the club."},{"speaker":"Marcus","time":"00:27:46-8","content":"Okay, alright. And do you all raise money at the Angola rodeo as well?"},{"speaker":"Terry","time":"00:27:54-0","content":"Yeah, That's fun too. I mean Angola, the rodeo is you go out there and you're a little free. It gets you outside."},{"speaker":"Marcus","time":"00:28:14-8","content":"Sure, you get to interact with people."},{"speaker":"Terry","time":"00:28:16-2","content":"Talking and sharing great stuff like that."},{"speaker":"Marcus","time":"00:28:20-3","content":"And it's also a very important time for a lot of folks to make money to do those various things and run the clubs."},{"speaker":"Terry","time":"00:28:26-6","content":"Yep."},{"speaker":"Marcus","time":"00:28:30-7","content":"So is that your main thing? I mean are there other organizations that you've been a part of? What would your list look like?"},{"speaker":"Terry","time":"00:28:36-9","content":"I took a hundred hour class, anger management, stuff like that. But other things, it's kind of hard when you got a life sentence and try to focus on other things, and at that time you don't know if you're getting out or not. So I'm like why put all the focus on this and nobody would know daylight."},{"speaker":"Terry","time":"00:28:36-9","content":"Chances that you're different now. So me I put everything into my case I'll try to go home through the courts. So I put a lot of effort in that. I want be my whole somehow. So I try my best to go through the courts. But you good putting stuff in your jacket. But tis kind of hard to when you look at, you might never get out. That's what the mind goes to a lot."},{"speaker":"Marcus","time":"00:29:34-0","content":"Yeah let's talk a bit about that. One of the things I said earlier is that what this project is doing is exploring the coping mechanisms of the sort of endlessness of a life sentence."},{"speaker":"Terry","time":"00:29:47-8","content":"Yeah it's kind of hard."},{"speaker":"Marcus","time":"00:29:50-0","content":"How do you, how have you been coping with it? Do you distract yourself, or do you, how?"},{"speaker":"Terry","time":"00:29:57-3","content":"It's kind of hard. I try to keep myself busy at the club and working up here. But the reality is when you get to the dorm at night, you might talk to your family, stuff like that. Everything start hitting you cause you got time to think and you ain't doing no work or nothing. And the reality hit you."},{"speaker":"Terry","time":"00:29:57-3","content":"You might have a girlfriend outside of jail, you don't know how long she going to last. It's kind of hard. You not getting younger. Health problems kicking in stuff like that. High blood pressure legs start hurting. So all that's coming forward, that's hard. You don't know the last time you going to talk to your mama. It's kind of hard to live with."},{"speaker":"Terry","time":"00:29:57-3","content":"It kind of hard for me because I think when I put in, I had put in for a pardon. They must have made a mistake or something. So I put in, I'm a first offender, I'm here for 2nd degree murder. I haven't done nothing, I put that down. My risk level is -1 meaning excellent. But I got denied, I didn't even get a hearing. I got denied they said you got to put in 5 more years I haven't done enough time yet."},{"speaker":"Marcus","time":"00:31:18-8","content":"So you think it's just a matter of how many years you've-"},{"speaker":"Terry","time":"00:31:23-6","content":"I think they had too many at that time and I just put it in at the wrong time."},{"speaker":"Marcus","time":"00:31:25-5","content":"Okay, alright. So are you planning on re-submitting?"},{"speaker":"Terry","time":"00:31:33-0","content":"They said I got to wait five years."},{"speaker":"Marcus","time":"00:31:34-4","content":"When did you submit it?"},{"speaker":"Terry","time":"00:31:37-6","content":"Like 2016. So I'm still trying to find ways."},{"speaker":"Marcus","time":"00:31:42-2","content":"Yeah."},{"speaker":"Terry","time":"00:31:43-2","content":"I wrote then three letters never wrote back. I know some kids who been here 15 years same shot I got even worse and they got a date."},{"speaker":"Marcus","time":"00:31:53-1","content":"Okay, yeah. Usually I ask folks when they look back on the victim's family how they feel about it. I don't think I'm going to ask you about that. Other than your ability to emphasize with any family who loses a loved one it doesn't make much sense for me to ask."},{"speaker":"Terry","time":"00:32:18-1","content":"Yeah I can imagine what they go through."},{"speaker":"Marcus","time":"00:32:22-8","content":"Do you find it difficult to deal with the expectations that everybody else has around them to be able to feel all this remorse?"},{"speaker":"Terry","time":"00:32:37-5","content":"You mean like what?"},{"speaker":"Marcus","time":"00:32:41-4","content":"So I mean, most of the guys that you're here with-"},{"speaker":"Terry","time":"00:32:43-7","content":"Like committed-"},{"speaker":"Marcus","time":"00:32:45-6","content":"Yeah and they've come to terms with it and they're like yeah I did this and I feel remorseful for it but I've forgiven myself- and there's a whole story of a that comes with that. But your narrative isn't like that. So when you maintain your innocence, do you feel people accept that?"},{"speaker":"Terry","time":"00:33:11-1","content":"Out there or in here?"},{"speaker":"Marcus","time":"00:33:12-4","content":"Here I mean I feel like it's almost easier just to go ahead with I'm guilty and-"},{"speaker":"Terry","time":"00:33:17-3","content":"Some people probably think oh he's just saying that, some people try to help you, give you their opinion on some things. Or some people be like oh he guilty."},{"speaker":"Marcus","time":"00:33:34-4","content":"Yeah. So now, I want to address what has come up occasionally here, and that is to talk about the impact this has had on your family. Of all the folks in your family, who's been impacted the most?"},{"speaker":"Terry","time":"00:33:56-9","content":"I'd say my mother. Cause I used to help her pay the bills and stuff like that. She really ain't got no help out there now. Her kids, everybody got kids, their own family to take care of. She married now but her husband can't work either. So they really living on check, so it kind of hard for her. Every month she's worried about the bills, I don't know how she gets by."},{"speaker":"Marcus","time":"00:34:27-2","content":"Does she live in New Orleans?"},{"speaker":"Terry","time":"00:34:28-3","content":"Yeah."},{"speaker":"Marcus","time":"00:34:30-3","content":"Okay."},{"speaker":"Terry","time":"00:34:31-8","content":"So she be trying to help me out, get me out so I can take care of her, we were raised in projects, I been through there. You don't get no help. I know they deal with DNA cases, I know they deal with other cases too. So I think I learnt from this project about two weeks ago."},{"speaker":"Marcus","time":"00:34:57-1","content":"And it's not because they don't believe that your case has merit, it's because they don't have any grounds."},{"speaker":"Terry","time":"00:35:02-4","content":"Yeah at the time when I found out of this project I didn't handle this as I have now."},{"speaker":"Marcus","time":"00:35:12-7","content":"I see, yeah. Well, I'm keeping my fingers crossed for you with where it is now. So your mother, and having to watch her go through all of that is another punishment."},{"speaker":"Terry","time":"00:35:26-2","content":"Yeah, she got to take care of somebody's little kid, and hers are locked up."},{"speaker":"Marcus","time":"00:35:33-2","content":"So what about Kerry, what happened to Kerry?"},{"speaker":"Terry","time":"00:35:40-1","content":"He went downhill, so he not in his kids life, he's like, just out there doing nothing."},{"speaker":"Marcus","time":"00:35:55-1","content":"Are you in touch with him fairly regularly?"},{"speaker":"Terry","time":"00:35:57-0","content":"No, I probably saw him 3 times since I been locked up."},{"speaker":"Marcus","time":"00:36:03-4","content":"Oh wow."},{"speaker":"Terry","time":"00:36:07-7","content":"I guess, it's so hard for him to see me in here."},{"speaker":"Marcus","time":"00:36:11-4","content":"Yeah, it's almost easier to just cut it off. Oh god, especially for a twin."},{"speaker":"Terry","time":"00:36:22-0","content":"Yeah. His kids too, he not focused right so he not in they life. So his kids got kids now, I've tried to reach out and talk to them and be there for them until he get right."},{"speaker":"Marcus","time":"00:36:43-0","content":"When was the last time that you had any contact with him?"},{"speaker":"Terry","time":"00:36:48-5","content":"I probably talked to him 2 years ago."},{"speaker":"Marcus","time":"00:36:56-3","content":"And he's just not straight?"},{"speaker":"Terry","time":"00:36:58-9","content":"Yeah he's not straight. He just can't keep his phone on or something."},{"speaker":"Marcus","time":"00:37:11-7","content":"Yeah, so there have to be so many difficult challenges about living here, you seem to have navigated it as best as anybody could. What has been the worst part of this experience for you?"},{"speaker":"Terry","time":"00:37:36-1","content":"Worst part? I think when I first came up and I had to go through the process in the field and stuff like that, with my medical condition. I probably worked for trying to go out there without getting in trouble, that's probably the worst."},{"speaker":"Marcus","time":"00:37:36-1","content":"What about now?"},{"speaker":"Terry","time":"00:38:01-1","content":"Now, pretty much easy right now, laid back, got a job now. Still trying to get out, that's been the roughest thing."},{"speaker":"Marcus","time":"00:38:21-9","content":"You said your brother Gary, he's in exactly the same situation. You said he's kind of given up."},{"speaker":"Terry","time":"00:38:32-2","content":"I guess he's putting everything on me. I'm his brother you know. Do this do that? So he put it all on me. I guess he see me working every day on my bed. Doing my little work so I guess he's just feeling me. He is probably rough. At one time you know. They say two head better than one, not in my case."},{"speaker":"Marcus","time":"00:38:57-6","content":"So you really are shouldering the whole burden"},{"speaker":"Terry","time":"00:38:59-4","content":"Yeah."},{"speaker":"Marcus","time":"00:39:00-3","content":"What's his job?"},{"speaker":"Terry","time":"00:39:02-5","content":"Dorm orders. He usually boxes too. He love to fight he love to box."},{"speaker":"Marcus","time":"00:39:02-5","content":"It's a more constructive thing."},{"speaker":"Marcus","time":"00:39:19-8","content":"Of all the things that you've accomplished here, what are you most proud of?"},{"speaker":"Terry","time":"00:39:29-1","content":"I have a more business mind now, I got a job waiting on me. I'm going to move to Atlanta, got stuff waiting on me out there. Hope I get out soon enough to get the job, they got it on hold for me. Like, work there for a while then start my own business."},{"speaker":"Marcus","time":"00:39:46-4","content":"Okay so actually that was my next question. If you do get some kind of favorable outcome in your case, and you do get a 2nd chance. I'm sure you've spent a lot of time imagining what you'd be doing. Paint that picture for me, what's your vision, what are your plans?"},{"speaker":"Terry","time":"00:40:03-9","content":"Get a job, it would be hard for me, by me moving to Atlanta, I want to be there for my mama too."},{"speaker":"Marcus","time":"00:40:13-7","content":"Why Atlanta?"},{"speaker":"Terry","time":"00:40:17-5","content":"I got a friend out there who got a store, management. I finally contacted her, I ain't talk to her in years. We were childhood friends, she's like a sister. So we get talking, she said she got a job for me when I get out. So I'll work there until I can start my own business. So I guess I'll see how Atlanta is, something different. I got a friend up there who's got everything set out there for Atlanta. Spend time with my kids, grandkids."},{"speaker":"Marcus","time":"00:40:54-0","content":"And that would require you come back to New Orleans quite a bit. Take care of your mom and your grandkids."},{"speaker":"Terry","time":"00:40:59-9","content":"Yeah. Might get a boo with me, if everything work out."},{"speaker":"Marcus","time":"00:41:05-3","content":"Sure, do you have somebody- a woman who's special in your life right now?"},{"speaker":"Terry","time":"00:41:09-4","content":"Yeah I got a friend, her brother's locked up with me too, that's how I got a chance to meet her. We talking off and on, every time I talk to her about Atlanta, she ready to move too."},{"speaker":"Marcus","time":"00:41:22-0","content":"She'd move there with you?"},{"speaker":"Terry","time":"00:41:23-1","content":"Yeah, she pretty cool. She older than me, she 50 but she looks like she 35."},{"speaker":"Marcus","time":"00:41:28-7","content":"That's good. Does she come and visit you up here?"},{"speaker":"Terry","time":"00:41:32-1","content":"Yeah."},{"speaker":"Marcus","time":"00:41:35-0","content":"Do a lot of other folks who are up here who really shouldn't be up here because they weren't guilty?"},{"speaker":"Terry","time":"00:41:42-2","content":"We got a lot of people, like Ryan Hicks a lot of people who deserve a 2nd chance."},{"speaker":"Marcus","time":"00:41:49-6","content":"Oh I think a lot of people deserve a 2nd chance, I'm talking about people who were innocent."},{"speaker":"Terry","time":"00:41:54-9","content":"Yeah, you got a lot of people who innocent, but they can't prove it, they ain't got the resources. If I had the money, I would've been home. That's the biggest thing, they ain't got resources, and family can't help. Some people don't have no family, so it's hard to get everything you need to prove to the district attorney. If you ain't got any help, it be hard to prove."},{"speaker":"Marcus","time":"00:42:28-4","content":"Do you think it's been harder for you to serve this time because you're innocent?"},{"speaker":"Terry","time":"00:42:33-6","content":"Oh yeah."},{"speaker":"Marcus","time":"00:42:34-7","content":"Or is that something that you find this has helped sustain you?"},{"speaker":"Terry","time":"00:42:40-1","content":"It's hard, it's hard for anybody doing time. But it's difficult, you try to find ways, and stay well and speak with your family. Kind of hard, you can never accept it. That's why it's hard for me to get into a lot of programs and stuff like that. It's like, I'm trying to go home, trying to get out."},{"speaker":"Marcus","time":"00:43:08-6","content":"Yeah you don't want to get too invested in stuff here I guess what you're saying."},{"speaker":"Terry","time":"00:43:11-4","content":"They passed some type of law that you might for sure get out, sometime the pardon board can be real hard. Sometimes, you might get denied on something out of your control. Like being with family and stuff like that. Whereas they're playing their part it's hard to do like man I ain't going to make it. At least they have a chance in the back of their mind. Strong by the pillars you know. You might not make bail you know. Kind of hard."},{"speaker":"Marcus","time":"00:43:48-6","content":"All right I think that's probably a good place to stop."}]}