{"name":"","transcript":[{"content":"Terry Pierce_Mix"},{"speaker":"Marcus","time":"00:00:00-0","content":"Would you start by stating your name? The crime that you were convicted of? How old you are and how much time served."},{"speaker":"Terry","time":"00:00:09-8","content":"Okay, my name is Terry Pierce. Being convicted for second degree murder serving a life sentence since September the 12th of 1980 was when I was arrested. I was convicted, or at least proximately, seven months later, and I've been incarcerated ever since. I'm a first offender. And it's been a long journey, man. Very long, journey, I'll come straight out of the military, on some weird circumstances. And it led me to that, really, I mean, at the end of April."},{"speaker":"Terry","time":"00:00:09-8","content":"I came home from Fort Hood, Texas, I was in the military, spend a little time with my oldest brother him and I were real, more than brothers. We were friends. And I go back that Monday after Easter, and on May the seventh, I get a call that my brother and his girl were found shot the dead, in a vehicle. This is in New Orleans. And my discharge date happens to be September. I mean, may the 27th of that same year 1979. And my mom, beg me, please, please, get an extension of stay in service don't come home. So I know y'all need me. I felt like I was strong."},{"speaker":"Terry","time":"00:00:09-8","content":"I've been away three years and whatnot. And I come home and stayed. And it bothered me more than I thought, and I went off into a phone, I mean? I was trying to find out who done it, were done it or whatever, and things got out of hand, and I really didn't care whether I live with that at the time myself, and for, what I got mixed up in this. I didn't last to September, July anyway, was when an incident occurred. It happened July the fifth of 1980s. When me and a guy had an encounter, and this is where it all develop. And here I am,"},{"speaker":"Marcus","time":"00:02:31-5","content":"And it was related to your brother's death?"},{"speaker":"Terry","time":"00:02:34-5","content":"Not necessarily, I wouldn't say it was directly related, but I think it affected me to a point where, it drove me, into drugs and alcohol. And to the point, like I said, my brother and I, we were more than brothers, we were friends, and I thought I was able to handle it. And it couldn't, I was I was 21 years old. Never throughout those 21 years have I ever experienced someone close to me die. Let alone become murdered, and this girl was murdered as well. I mean, I was close to her too. And it it's no excuse for what I done?"},{"speaker":"Marcus","time":"00:03:20-8","content":"Did they ever solve that crime?"},{"speaker":"Terry","time":"00:03:23-3","content":"The guy they found out who've done it, and he was later the police jammed him up in December of 79 and end up killing him, but they've, he was killed by the police. But they found out who done it. And, I kind of like God knows, but"},{"speaker":"Marcus","time":"00:03:54-2","content":"Tell me a little bit about your childhood."},{"speaker":"Terry","time":"00:03:56-9","content":"My childhood?"},{"speaker":"Marcus","time":"00:03:57-7","content":"Before the military?"},{"speaker":"Terry","time":"00:03:59-0","content":"My childhood."},{"speaker":"Marcus","time":"00:04:00-1","content":"Let's talk a little bit about. What about the folks who raised you."},{"speaker":"Terry","time":"00:04:01-8","content":"I was born, I was in the house of five. It was five of us. I was the baby. I had an older sister and for three other brothers, four boys and one girl. We were raised by my mother alone. She was alone. We didn't my father wasn't there, but we knew who we were you come arrive at 9:00am but mom's was great man. She we lived in a low project apartment forever. And we may do what we had. We had love man."},{"speaker":"Terry","time":"00:04:01-8","content":"We had a planet lalalala, we'd get one game for Christmas and play with it together. We wouldn't have all those luxuries that others may have had, but we had love. We had each other. We had each other until, like I said my oldest brother. He went off to the limb and mom's put him out when he was about 17 and he went in his world and resorted to him being murdered. But other than that, we were still a very close knit little group that love,"},{"speaker":"Marcus","time":"00:05:08-7","content":"Would it be fair to say that you grew up knowing that there were others around you who loved you and cared for you."},{"speaker":"Terry","time":"00:05:15-6","content":"Yes, I did. And they still do my sister's still there, my mom's died. But my older sister, she's here with me daily. If I call right now she answers, so me and her. If I don't call in two weeks, she going to call up here when it was wrong and nothing wrong, I just wouldn't feel like saves the money."},{"speaker":"Marcus","time":"00:05:41-3","content":"What's her name?"},{"speaker":"Terry","time":"00:05:41-9","content":"Barbara? Yeah, she's been great."},{"speaker":"Marcus","time":"00:05:48-0","content":"What's your last memory of your mom?"},{"speaker":"Terry","time":"00:05:51-5","content":"My last memory of my mom. I think it must have been the last visit I had with her. And I could tell she died from diabetes, she had a problem, and I could tell her eyesight was leaving her. Because we should sit at the table. And it looks like she was looking clean through me at times, then when my daughter was maybe like, she may have been 12 years old or something like that."},{"speaker":"Terry","time":"00:05:51-5","content":"And when we get up to go to the concessions or take a pitch, I could see my daughter hooking on every time, and I could tell she's gotten up. And I remember that. But I never said anything about it. I just we just talked and had fun and that that was the last visit I had because she went to have an operations, on a foot, things of that nature. She couldn't walk. She died in 92. Matter of fact, her death had happen on the same day I end up making a board out of the cell block."},{"speaker":"Terry","time":"00:05:51-5","content":"Can you believe that? July 1 1992. I get up out of my bed that morning, we get ready to make, go through the reclus board to come out of sales laws to go down, wake up, go down all happy I made a board. Four o'clock that evening they pass meal I'll never forget the meal. It was white lima beans, Spanish and green jelly. And myself, I slide out the cell in my underwear, man, see, go put some clothes on. I tell myself honestly, man, this must be Janet Jackson, I got to get dressed."},{"speaker":"Terry","time":"00:05:51-5","content":"So when I go out the door, I'm going up to all the tier was waiting towards the back. So I'm walking up the tier. And I see this little guy with the white hair. He was a part of the chaplain, when I knew something wasn't right. And I felt myself moving in slow motion towards him. And when I got to him, he just handed me a piece of paper and I read the paper, the first thing I seen was Barbara's name. And it kind of stunned me, like, but then it was she was telling me to call my mom died that same morning. And it just took all my joy away."},{"speaker":"Terry","time":"00:05:51-5","content":"But I kept, I always feel that she would want me to continue to move forward. And from that point on, I mean, I went had a few setbacks. And over the years, it's growing up with me says, man, some of us think drinking and smoking and having women and doing this and that makes you a man it doesn't. You have to grow up and be mature. And that was my problem, throughout the years."},{"speaker":"Terry","time":"00:05:51-5","content":"Well, we're going to change is doing my prison time, but I had a, I think I had fun. Growing up when I was a kid, I was never dumb. I just had a problem with attention. I always strive it on that? And that's what kind of like,"},{"speaker":"Marcus","time":"00:09:10-5","content":"Yeah, let's go back there for a bit. You said you grew up in a project?"},{"speaker":"Terry","time":"00:09:15-9","content":"Yes."},{"speaker":"Marcus","time":"00:09:16-5","content":"Which one?"},{"speaker":"Terry","time":"00:09:17-2","content":"In Calliope projects. I finished in the Calliope project too, just where this incident occurred? Yes."},{"speaker":"Marcus","time":"00:09:30-4","content":"Do you have a specific memory of school?"},{"speaker":"Terry","time":"00:09:32-2","content":"Yes, I have a lot of memories that, believe it or not, I have a great memory. I don't lose that. I tell people that too. All the time. There's a lot of things you don't remember. It's because you don't want to. They weren't great things to remember, but I, I can even remember my first grade teacher's name. Miss Muto, and, we had, we had we had times where we will fight a lot in school, but that was growing up kids, do that good man isn't. But I had a good school."},{"speaker":"Terry","time":"00:09:32-2","content":"I got set back a couple of times, because I was a clown, I will always driving off attention, being a clown. So later told, my mama told keeping back, don't pass. And I had to stay in third grade. And moved on, from my sixth grade teacher, Miss Lee, she did well with me, I went on. It was a junior high school. And it wasn't the middle school game. It was junior high, we all was together and got there and, fell off the track again. Because I had a problem with history."},{"speaker":"Terry","time":"00:09:32-2","content":"That was one of my major subjects that I clicked on this then I didn't like. And I had a challenge with my history teacher now asks him what job that's going to require me to know about Ponce de Leon, other than me being a history teacher. So he said he couldn't think of one. So he said, just sit down in the class and be still. And I'm going to pay you and but I ended up getting kicked out of school for good."},{"speaker":"Terry","time":"00:09:32-2","content":""},{"speaker":"Marcus","time":"00:11:25-6","content":"What was that for?"},{"speaker":"Terry","time":"00:11:27-6","content":"In 7th grade, because a guy, me and a guy had a fight right in front of bad band room. The band teacher runs out, he grabbed me. And a guy still punching on me. So when somebody grabbed him, and then he let me go out, turn around, gets into it with a band teacher and run off and leave the school."},{"speaker":"Terry","time":"00:11:27-6","content":"He told everybody in the school that I was going to get a gun. I don't even know what a gun felt like back then? So when I come back to the school, I got everybody that waiting on me. Police and all. They grabbed me bring me in a principal's office. I say no, I didn't say that. I said I was going to get my mom I was leaving. I just left the school ground. I never said I was going to get no gun from way we didn't even London house. So, I got suspended expelled from school."},{"speaker":"Terry","time":"00:11:27-6","content":"And that was it I was done with so that I had to go through some changes in my life and end up going through some rehabilitation program and went to Delgado junior college rehabilitation program, and those few credits today. And they gave me an opportunity to go into the military. And that's where I got my GED from while I was in the military at the University of Kansas. I couldn't get it from that area, send it back down."},{"speaker":"Terry","time":"00:11:27-6","content":"Because something like you had to have a 4.5 or something up there. Oh, and I ended up no a 45 sub I had a full point which was above average down yeah. But wasn't up there. Put it like that. So I get it from school in my neighborhood. And I got my GED from Booker T. Yeah."},{"speaker":"Marcus","time":"00:13:25-3","content":"What branch of the service were you?"},{"speaker":"Terry","time":"00:13:26-7","content":"Army."},{"speaker":"Marcus","time":"00:13:30-8","content":"If you had to pinpoint a person that you got along best with when you were coming up? Who would that be?"},{"speaker":"Terry","time":"00:13:39-3","content":"A guy that's still my best friend right now. And we kind of like faded off over the years. But I ended up running into him when I took a little trip the Winfield. He was up there. And now we communicate and again and a guy by the name of Kevin is one of my best friends. We've been together since we were like 19 years old. And he used to always try to persuade me to get away from what I was into. When?"},{"speaker":"Marcus","time":"00:14:07-6","content":"Did he end up getting into it too?"},{"speaker":"Terry","time":"00:14:09-0","content":"Yes, and I'm kind of really disturbed with him about that."},{"speaker":"Marcus","time":"00:14:13-8","content":"Is he serving a life sentence?"},{"speaker":"Terry","time":"00:14:15-4","content":"No sir, he's on streets now. He at home now he had home. He's doing okay, right now. He's doing great."},{"speaker":"Marcus","time":"00:14:15-4","content":"That's good. He's back in New Orleans."},{"speaker":"Terry","time":"00:14:26-3","content":"Yes back in New Orleans. He's doing okay, though."},{"speaker":"Marcus","time":"00:14:37-6","content":"So you were kicked out of school in 7th grade?"},{"speaker":"Terry","time":"00:14:40-2","content":"Yes."},{"speaker":"Marcus","time":"00:14:41-1","content":"That's a lot of time on your hands as a teenager."},{"speaker":"Terry","time":"00:14:43-5","content":"Yes, I was. Yeah. Because I was like 1415 years old. By me getting kept back twice. I think I was like 14 or 15. Yeah. Yeah."},{"speaker":"Marcus","time":"00:14:57-2","content":"What about girlfriends?"},{"speaker":"Terry","time":"00:15:01-6","content":"I have quite a few little girlfriends coming up yeah. But my main girl end up being my oldest daughter's mom. And man we were together for many years. And I've met at my brother's wedding."},{"speaker":"Marcus","time":"00:15:26-6","content":"What's her name?"},{"speaker":"Terry","time":"00:15:27-4","content":"Verlaine. We had a good time and things was getting bad there too, because we'd fight a lot too, but and the craziest thing about all that is, when my daughter was born, my mom held my daughter and asked me now what you going to do? Now that you have a doll, and I look there, I say, I'm going to do everything I can, he'll raise my kid, I'm going to take care of, she said."},{"speaker":"Terry","time":"00:15:27-4","content":"That's not what I'm talking about. She said, I'm talking about when somebody put their hand on her, which you're going to do, because she was trying to show me a point and I'm like, Hey, I couldn't even ask her. But I know, I tried the many colors, try to stay well, I'm going to my baby, they put hand on my girl. But talking about it what she was trying to say is that, keep your hand off the women. And Tom grew and I grew."},{"speaker":"Marcus","time":"00:16:29-8","content":"Are you in touch with your daughter."},{"speaker":"Terry","time":"00:16:31-4","content":"Yes. But now I have another daughter by another female as well. My other girl ma I got Yeah, I'm in touch with both of my daughters. One of them is be forty three in November 1. And my other one just turned forty in May. But they simply got different mamas one of them been in California for, I got a grandson this be 16 years old and September. And he's like six, three and 200 some pounds playing football. He's a senior in high school. I don't know what's whether you going to go from there. But he said he wants to go to Oregon."},{"speaker":"Terry","time":"00:16:31-4","content":"Yeah, but I got a little granddaughter up there to Baja, my youngest daughter Tawa, but my oldest daughter got a daughter that's 24 years old. And she's living in Texas working two jobs. She went to the Navy and everything she's doing okay. Yeah. And it's, it's sad, because and I tell guys, this today, no criminal, I got into something and it happened. And there's, I mean, there's nothing I can do about changing what happened, what I'm saying, but we can change."},{"speaker":"Terry","time":"00:16:31-4","content":"And I try to tell these young guys that my biggest thing is that grow up. When you grow up, you understand life better, you get a, you have a better understanding of how to value others as well. You should be more careful and trying to harm someone else to, when I haven't gotten to a point doesn't bother me anymore in terms of getting angry I don't have high blood pressure or any of that. And I'll be 60 years old next month. I find that amazing to considering where I come from, on this journey."},{"speaker":"Terry","time":"00:16:31-4","content":"I was like two weeks from turning 23 when I got arrested, and I'm like, I'm living in God's hand man. And trust me, I'm not religious at all. But I do believe in God. Because there's just some things you can control. As simple as that."},{"speaker":"Marcus","time":"00:19:09-5","content":"You mentioned that in coping with your brother's death?"},{"speaker":"Terry","time":"00:19:15-3","content":"Yes."},{"speaker":"Marcus","time":"00:19:16-9","content":"You also turn to drugs and alcohol."},{"speaker":"Terry","time":"00:19:19-1","content":"Yes, I think this way, I lost myself because I was trying to cope with it. Like I said, I've never experienced anything at all. I don't watch my mom cry over relatives that may have died. And I didn't understand because I didn't even know them people. But when this after my brother, I was 21 years old man. This was the closest thing. And like I say, he wasn't just my brother him and I were closer than the rest of us. I was more closer to him."},{"speaker":"Terry","time":"00:19:19-1","content":"This is one reason why I went in the military because he went in an Air Force himself. When he was young, I'm like. I thought I was able to handle it or I could, keep my family tag, but at the same time I had to go and I was losing it. Bottom line. And that's what kind of like drove me to a point where I really didn't care whether I lived or not. That was a point."},{"speaker":"Marcus","time":"00:20:24-6","content":"Yeah. It has been a journey. Since then. And I want to talk about that."},{"speaker":"Terry","time":"00:20:30-7","content":"Yeah, yeah."},{"speaker":"Marcus","time":"00:20:34-6","content":"One of the reasons that we're wanting to talk to folks like yourself, yeah, you particular are a trusted member of this community. Your inmate,"},{"speaker":"Terry","time":"00:20:43-0","content":"Yes, for 10 years."},{"speaker":"Marcus","time":"00:20:46-6","content":"You're considered by all measures rehabilitated?"},{"speaker":"Terry","time":"00:20:50-2","content":"Yes."},{"speaker":"Marcus","time":"00:20:52-5","content":"But Can you go back and describe for me that person who? That young Terry, who was escorted through the gates of Angola, What was he like?"},{"speaker":"Terry","time":"00:21:06-0","content":"Rotten. Because when I first went into the parish jail, when all these began, the people and I was thrust into were, right. And I promise myself, as well as mama, I'm going to leave out here, the way I came in, as a man. And the people I went around, they didn't care, who you were, what you look like, or where you were from. If you're weak, you fail. And try playing a state of myself game."},{"speaker":"Terry","time":"00:21:06-0","content":"And it was always somebody trying to get in. And it gotten to a point where I went to strike and folks. And like I say, I became rotten, that was my defense, I weighed 130 pounds, when I was arrested. And it was not like, I was a juvenile. I was in a male, we've all grown according to the, the place we would live in here. So I was pretty bad. I developed a reputation back there ways."},{"speaker":"Terry","time":"00:21:06-0","content":"Wherever I went, there was a little dude, watch that little dude. And from that point on, when I come and go, I was probably like, 29 years old, because I stayed in Parish at least seven years. Yeah, they were paying a share of the keeper. So the money was good. He was keeping it. Calvin and tell you about, we went through it back that we had to file lawsuits to get from back there."},{"speaker":"Terry","time":"00:21:06-0","content":"So when I come up here, I was at least 29 years old. And I was sent straight to the big yard, man, it was like freedom from where I left because we stay locked down. And it was kind of grueling for because I've got up here in the month of May and it was man they worked us out there in the field. It was like hell, and I didn't have time to do anything,"},{"speaker":"Terry","time":"00:21:06-0","content":"I'd come in sometime and just pass out go to sleep but we've been a day and he was showered because he was closing the shower at nine o'clock. But, I ended up around guys that Norris Henderson, and other guys that were trying to, reach out to people like myself because they will lose in positions like I'm in right now."},{"speaker":"Terry","time":"00:21:06-0","content":"And it took a while I was bumping my head in that, I had a problem working, I have fights in it, that would happen naturally, but never nothing real vicious? And I think I got tired along the way when you get older."},{"speaker":"Marcus","time":"00:24:24-0","content":"Yeah let's talk about that."},{"speaker":"Terry","time":"00:24:25-7","content":"When you get older I think it took me till I was like forty or I don't I didn't even calculate it yet but I can tell you in 2001 I left the work and cell blocks in April of 2001 and made up my mind from that point on that I had enough. I had enough that. I mean, the cells are way is down. You can't you level stand up as long as these cells stand, that was my point. I'm like, I got to start doing things for better, and I went through just when I started growing, I went from certain low jobs to the next to the next have the tier Walker for a while, three years before I became a counselor. And"},{"speaker":"Marcus","time":"00:25:19-4","content":"What does a tier walker do?"},{"speaker":"Terry","time":"00:25:20-6","content":"Well, we walk the tiers for guys that sometimes we might contemplate suicide, they want us to notify them about whatever. But I develop a point where, right now I call myself that, a social worker, yeah, I do more constantly in that way, then I'll do legal work,? Yeah, because a lot of times you have these guys and need talking to some guys just want you to listen to them. I end up working on just recently working going back to Camp J. Well, that's the punishment happen."},{"speaker":"Terry","time":"00:25:20-6","content":"I go down to tiers, and guys pull you over and you just, they just talk, it just you just got to listen to them. Because if you don't, if you give them a bad response, then you're going to have a problem. When you go back there, they might want to throw something on you or whatever."},{"speaker":"Terry","time":"00:25:20-6","content":"And I've learned that, sometimes people just want you to, to listen to what they have to say, and I actually, okay, now you're going to say it all that what is it that you won't know, I just want you to, let me know what you wish your opinion or whatever, when I tell the man Hey, it's not going to be my opinion."},{"speaker":"Terry","time":"00:25:20-6","content":"When it's all said and done. It's going to be about what the judge think about, what the court stand about. And those are the people we have to persuade, to try to get us going with our legal matters. But when I got those blocks, I said I had enough, and that's when I realized I was growing up, yeah."},{"speaker":"Marcus","time":"00:26:54-1","content":"Would you say that? Your, the changes that you've made in your life were a function of aging out?"},{"speaker":"Terry","time":"00:27:00-1","content":"Yes, it is. Because you can't teach maturity, you can't teach that you can impress that on one. It has to be something that developed within you, and some guys developed early, some guys, a reached that stage in an early 20s, but some of us, we these low days that we allow to distract us, and allow us to, let's say, wants to be a part of something of a certain group to fit in, because that's basically what's about, we just want to be a part of, these are my friends, this is what they do. So I must do to, that's what it all boils down to. And that's how we get confused about. What's great and what's not great for us. What I'm saying?"},{"speaker":"Marcus","time":"00:27:59-9","content":"Can you describe what your typical day your typical routine looks like now?"},{"speaker":"Terry","time":"00:28:07-5","content":"Yes, I the rain been in my business lately. I can't do no running. I usually jog a lot. I end up getting five laps around a big yard at one time, but the rain killing me now. But I'll get up go to work. Go in the law library. I got a couple of cases. I'm working on three. But there's always someone coming behind you. Excuse me I don't mean? Can I bother you for a minute? That's one minute now you're asking for. And I'm like, yeah, what's up. This end up being hours, or even less, but, but you can't just tell a guy Look, man, no, I'm busy. Because then you got a problem."},{"speaker":"Terry","time":"00:28:07-5","content":"Do feel like man, hold up, man. Y'all will help nobody. But I'm like, you pay us three or four councils up to get to me why you come, but and that's what I say about my point of trying to be do a little social work. Because you've got to be mindful that if a guy comes to you and asks you can I bother you for a minute? You would the job that I have? I can't tell him? No, because if I do, it might cause a bad reaction, but my typical day is just read, read, read, read, a lot of reading that takes up my time, and a lot of my mental got to be, because putting a writ together is not easy."},{"speaker":"Terry","time":"00:28:07-5","content":"I have to, and once I do put it together, I have to look at it. Then I'll come back two days later and read it and I'm not satisfied. I'm changing it and flipping it over. And my typical day is a lot of read. And you hear my voice. That's all I do is a lot of talking if I'm not reading I got to talk it. Yeah. But this is, I think it's a lot better than what it was 20 years ago."},{"speaker":"Marcus","time":"00:30:11-0","content":"Yeah. What other, aside from being a counselor, there are other organizations that you're active with here?"},{"speaker":"Terry","time":"00:30:18-1","content":"No."},{"speaker":"Marcus","time":"00:30:18-6","content":"Okay."},{"speaker":"Terry","time":"00:30:19-5","content":"You know."},{"speaker":"Marcus","time":"00:30:20-0","content":"It's a full time job."},{"speaker":"Terry","time":"00:30:21-2","content":"Yes, it is and, and be true for what you when I get around guys that are willing to listen. And I try to reach out to a lot of the younger guys, and try to pull him out of that attitude way. This does right and right. Like I said, I was doing disciplinary for a while. And my main thing was trying to tell these guys, you're not going to win here, you're not going to win. I said, in any game you decided to play, you got to play to win, I played a psychological game with them, I play the game, like they play, you're not going to win in this game."},{"speaker":"Terry","time":"00:30:21-2","content":"So if you're going to get in the game, play the game that you can win. If you were a football player, don't go try and play no basketball. If you're a swimmer, don't try and box, I'm saying, if you want to get out there on the court, you got to have game, you're going to sit at the call table, don't use a transparent deck, at least play with your hands close to the chairs, and know when to hold and fold."},{"speaker":"Terry","time":"00:30:21-2","content":"A lot of guys, it just outdate, so stop playing a game and you're not going to win, you keep grinding out, you keep grinding out, you're going to go further and further and further. You set back, then you got people on the street, you bothered doing that, I sometimes wonder if I didn't drive my mom to where she's at today. Because what I was doing Ronnie, never thinking once about how it's affecting now."},{"speaker":"Terry","time":"00:30:21-2","content":"You have the one loop How is known affect those out there that love you, and we not caring about, the love we supposed to have for them. And that's, a lot of time and a lot of times I try to I'm not what you call a loner. But I like being by myself a lot. I got a lot of friends. I got guys that I grew up with, that I love like my brothers, and they're not doing things bad or whatever, but at the same time, I we stop chat a lot, like these guys in this room right now."},{"speaker":"Terry","time":"00:30:21-2","content":"We all come up in here together, I'm in a dorm with two of them? And we, we get along great. But I like to, I like to read not just lower I got novels I read I got all kinds of books"},{"speaker":"Marcus","time":"00:33:14-1","content":"What are you reading right now?"},{"speaker":"Terry","time":"00:33:16-8","content":"I got a novel I'm read right now called Apache and I'm not, I don't really like it but the guy gave it to me say man it's a good book. It's a good book so I'm reading it but it ain't is not what I think it thought it was? But I also got these two cases I'm dealing with in a like mind boggling one of them anyway, the other one I'm trying to really litigate it because I have read it already. And, but"},{"speaker":"Marcus","time":"00:33:41-6","content":"Yeah, you definitely occupy your mind."},{"speaker":"Terry","time":"00:33:43-7","content":"Yes, I do. I keep my mind functioning. I don't watch much TV. The news, I'd rather read it and watch because I get it better. I get more read and sports. At one point, I loved it. I mean, I could miss it. But now I'm getting to a point where, I don't have very much time left on this planet. When you reach 60 man, and I'm amazed that that how I'm I making 60 man that's a milestone."},{"speaker":"Marcus","time":"00:34:23-4","content":"Yeah."},{"speaker":"Terry","time":"00:34:24-9","content":"Because looking at my life had not been in here. I probably would never saw it coming, speaking on a realistic point, at 23 had I never went through getting arrested. I don't think I would have saw 24 living the way I was living. Because I don't think my life would have changed much. If I would have never got arrest because I was too deep too far gone."},{"speaker":"Marcus","time":"00:35:01-8","content":"So in some way getting arrested may have saved your life?"},{"speaker":"Terry","time":"00:35:04-1","content":"I think So no doubt it has, but I think that, for what I've done, I mean, enough is enough, what is what are we accomplishing?, for me doing being punished for what I done? I have no problem with being punished. But to what extent?"},{"speaker":"Marcus","time":"00:35:30-9","content":"What punishment is enough?"},{"speaker":"Terry","time":"00:35:31-9","content":"That's my point, what I mean, at the same time, I feel like right now, I can be very useful."},{"speaker":"Marcus","time":"00:35:31-9","content":"Let me ask you a question about this. And this is a very difficult question for me. I, I find it difficult to contemplate the reality of life without parole. It's almost inconceivable. There must be times when you confront that, and think about the reality of never leaving here."},{"speaker":"Terry","time":"00:36:08-5","content":"Yes, I do."},{"speaker":"Marcus","time":"00:36:10-0","content":"And how do you cope with that?"},{"speaker":"Terry","time":"00:36:12-0","content":"I keep trying to find a way through the legal system. That's what I'm doing right now, and whether I'll be successful or not, like I say, I'm a firm believer in God. If I die here, so be it. Because I can persuade those who are in control of making it possible for me to have parole eligibility, to understand this fact. That no matter how long you keep us here, and let us die you'll always had plenty more common, crime has not changed. It's not changed."},{"speaker":"Terry","time":"00:36:12-0","content":"In me, you did took it all on me. I don't have anything left in me, you left me earlier today or tomorrow, do you think I'm always one moment in trying to come back or do something to come back? After going through all years for all these years, because I tell you, my early part of this journey was no playground. It wasn't any fun. It wasn't nice, this place and gotten to a point now where it's not as bad as it was when I came. When I came, you had to, face a lot of adversity, and not just from your peers from security as well, I mean, it was a terror, and like I say,"},{"speaker":"Terry","time":"00:36:12-0","content":"I mean, a lot of guys, and I don't mean, just speak for myself, I think I would take 100 guys, and put out before me, that I'm sure will never come back, that I'm sure would be beneficial to the communities then what they doing around here. And that's the biggest problem because with people in society failing to realize those that are out there having problems in the world today are our offspring, they were left without guides."},{"speaker":"Terry","time":"00:36:12-0","content":"Yes, if my daughters would have been men, no telling what role they will have taken without the father day, because that's what's happening. That's what's going on. And I mean, if I could demonstrate to someone now today that I've made a change in my life, then I feel like I should be given an opportunity to demonstrate that Charles Manson goes up for parole. I mean, sure you may not never, you may chose never to let me go. But at least give me some hope. Let me feel that I have a chance."},{"speaker":"Terry","time":"00:36:12-0","content":"Because right now, I read the anger like years ago, they Young guy come up here. And he wrote an article in Angola, where guys were telling him about you better get you GEG get to GED. And he responded by saying for what I have a life sentence, I never gone away. So I can be an educated prisoner and I thought about what he was saying. And it really made sense to be honest with you, because you ain't never going anywhere."},{"speaker":"Terry","time":"00:36:12-0","content":"Why become worried about GED. Because people keep putting in our heads that there's hope somewhere down the line. Today, we've only beginning to see something happen. But like I said, I'll be 60 years old next month, am I going to have an opportunity to see that change the way I get an opportunity? I don't know. All I could do was hope and pray. And I'll tell you, there's nothing going to make me turn back or give up. I'm going to get out of that trying. And if I die trying. I'm going to rest in peace. That's the way I feel"},{"speaker":"Marcus","time":"00:40:16-1","content":"So Terry, one of the things, you know how I feel about a life sentence?"},{"speaker":"Terry","time":"00:40:19-8","content":"Yes, yes."},{"speaker":"Marcus","time":"00:40:22-2","content":"One of the things that people often come back to me when I explain what I'm doing with this project, they'll say, Okay, I understand all that, but what about the victim, victim then get another chance? They always that's usually the response, somebody's given me."},{"speaker":"Terry","time":"00:40:37-8","content":"We understand that. Look and, and that point, like I say, I can't change what happened. People say the victim people say the victim but we can change that, we can only do with what we have now. If we continue to, consider that point when a victim is been deceased, then we should just go on and do away with the perpetrator. This is the accused, I mean, just kill him."},{"speaker":"Terry","time":"00:40:37-8","content":"Because the second degree murder in the state of Louisiana. If you read the law, this should have been man slaughter. A guy in a club fight, break out shooting him. I mean, what, what does provocation mean? What does he do passion me? What can we determine to say that causes an average person to lose their cool? Some take much, some takes little. And every human being has the propensity to commit violence, every human being, so I mean, we can't, we can't keep dwelling on what about the victim? We all are victims."},{"speaker":"Terry","time":"00:40:37-8","content":"I was a victim for being stupid enough to do what I've done to be able to, commit the crime, because it was only done our stupidity, you can say, I didn't know. I knew. It was just something that happened. But two classify us is classify me as a murderer? No, I'm not. Because I think a murderer will just enjoy a killing. I'm one who may have committed a murder or murder. Yes. But the circumstances surrounding it has, you have to look at that, I didn't just put in my mind that I was going out there and kill someone. And I don't think the average person in here did that, because that something happened."},{"speaker":"Terry","time":"00:40:37-8","content":"And things do happen. I don't even believe in it. I don't approve of the death penalty. Because for you to lay and say that when we gone kill him that don't make better than he is. And it's not going to change anything. With I didn't wish that guy was dead when he killed my brother. When a police killed him, I didn't wish that it angered me sure. But I didn't run around with no gun on me every day looking for nobody trying to kill."},{"speaker":"Marcus","time":"00:43:52-0","content":"So the only conclusion that's reasonable, is that it's all about retribution. It's not about rehabilitation."},{"speaker":"Terry","time":"00:44:05-2","content":"No, it's not. Because why would you take a man and lock him up forever and you got to take care of him. And some of us are out live in them. Some of us are living to be seven, eight years old, from 21 years old. I mean, that's a long time to be taking care of a man at the expense of the public, because that's what paying for the taxpayers, behind a crime he committed where you can take and lay it on, and use these resources elsewhere."},{"speaker":"Terry","time":"00:44:05-2","content":"You can get me to go out there and try to help the victim's family somehow, his children, grandchildren or whatnot, or do something worthwhile to help others, prevent them from coming through to see it. And that's the problem, like I said, is our offspring that's left out there doing the things they are doing. Because they lost, like I said, my daughter was five years old when his happened just if she was a man, I mean, a male, no 10 wish he would have been at 12 years old."},{"speaker":"Terry","time":"00:44:05-2","content":"Without me being there, and I couldn't live here and get into visiting Shade. Screaming, how about don't do this? Don't do that. Because they can look at me and say how you going to tell me something? You ain't no better than I am. But I mean, parole eligibility is? I mean, I think we should have and, and not just for my sake, I think of for the sake of taxpayers downs, I think of for the sake of giving a man an opportunity to demonstrate that he's capable of being a productive citizen in society."},{"speaker":"Terry","time":"00:44:05-2","content":"To show that exactly what the Department of Corrections mean, he's been correct. And every one of us, I'm a first offender man. I mean, I don't get a chance. You give guys chances to be moldable offenders? A crime is a crime. But there's no such thing as nonviolent, violent, because most of the non-violence starts from drug, the violence starts from drugs. It will result to violence so I mean, what difference does it make? We all have victims man."},{"speaker":"Marcus","time":"00:46:45-4","content":"You were talking a little earlier about how things have changed here and how very rough it was. And I've had conversations with Calvin about that."},{"speaker":"Terry","time":"00:46:54-0","content":"Yes, it is."},{"speaker":"Marcus","time":"00:46:56-2","content":"At this point, you've found meaningful, a meaningful way to live your life here."},{"speaker":"Terry","time":"00:47:02-8","content":"Yes."},{"speaker":"Marcus","time":"00:47:04-1","content":"What would you say is just the worst part today of being in this prison"},{"speaker":"Terry","time":"00:47:11-4","content":"Today. The conditions we living under 86 people in this dorm when I got here was only 60. We have four showers then they've added another one that's basically irrelevant. And four urinals and six stools, and I'm like, this is difficult trying to live through out there. 86 human beings, men."},{"speaker":"Terry","time":"00:47:11-4","content":"I mean, if this was 20 years ago, they'd be dragging somebody out of there every day. Because it's agitating at time. It's very hard sometimes to get up to 90 degrees at night. We have nothing but fans blowing just twirling the heat around. And I think that's the most difficult part of living that we hate,"},{"speaker":"Marcus","time":"00:48:19-5","content":"And it's daily."},{"speaker":"Terry","time":"00:48:20-5","content":"Daily unless you find a way to get out of it. And I got a, my little sanctuary where I work at my little workstation, I can get away until, but that is the most difficult thing, living under those conditions."},{"speaker":"Marcus","time":"00:48:42-1","content":"If I would ask you may seem strange question what's the best part about this place? What's the best thing this place has to offer?"},{"speaker":"Terry","time":"00:49:00-8","content":"For me I think the best thing I have is my sanity man. I can get away at times, like areas they only do is so large and wide. That's the best thing for me. When I can I don't know what's what one can say that that's good. Communicate with my family is wonderful? And long as they there long as I know I got somebody out there loves me? I'm okay. Because we got some guys here. I'm talking about young cats, man come you don't have anyone. And they say, when? And I'm fortunate after all these years to still have people there. That's behind me."},{"speaker":"Terry","time":"00:49:00-8","content":"And that's the only good thing I have, anything else? I mean? You do. It's so routine every day, you've been doing it over and over again. I mean, to get to a point where. And it's amazing. Like I said that time just went by like it is 60. Man. I can't believe it. Yeah, but it's that is. The good thing I'll tell you about a lot too, is that things have changed to a point where it's not as people don't have that attitude when he was with the way it was when I got here. Because there was always about, dog eat dog, Rotten?"},{"speaker":"Marcus","time":"00:50:48-9","content":"Survival."},{"speaker":"Terry","time":"00:50:49-8","content":"Yeah, survival. Yeah. Somebody's always trying to get a step by step, but it's."},{"speaker":"Marcus","time":"00:50:59-5","content":"Of all the things that you've accomplished. What are you the most proud of?"},{"speaker":"Terry","time":"00:51:10-8","content":"Being able to function like I am today, to think the way I think today, to not allow anything to bother me to a point where it upsets me, I don't even get angry anymore. And I have things that's going on around me on a daily basis where there was a time that I would, but none of that baffles me anymore. I don't like to get upset."},{"speaker":"Terry","time":"00:51:10-8","content":"I enjoy laughing I enjoy being upbeat. I don't want to be around anyone that's mad or angry or talking about something that nature. And, and I'm proud of the fact that I'm not taking any pills that I have to take. I got pain pill medication I get. But that's for my back. When it bothers me. I'll take them. But I don't have to go that little pain I can live with, other than that,"},{"speaker":"Marcus","time":"00:52:05-8","content":"Sure."},{"speaker":"Terry","time":"00:52:07-9","content":"Yeah."},{"speaker":"Marcus","time":"00:52:08-5","content":"It makes sense to me."},{"speaker":"Terry","time":"00:52:09-3","content":"Yeah. I mean, for what? And me and my sister, we talked about it a lot. I mean, if I can't do nothing about it, why let it bother me, if you got a hangnail, you get it pulled, you know? You got a toothache, you get it pulled. But my situation I can't, you know, I can't pull it. So why let it bother me? You know, I just have to make do with what I have."},{"speaker":"Marcus","time":"00:52:36-8","content":"So, part of this project is, as I said, it's about humanizing the numbers."},{"speaker":"Terry","time":"00:52:43-5","content":"Yes, yeah."},{"speaker":"Marcus","time":"00:52:45-2","content":"But it's also to educate people about life without parole as a real thing"},{"speaker":"Terry","time":"00:52:52-7","content":"Man. It's real. And it's tough. To even think about it. That's why I keep is a blessing that I have the job that I because I read a lot of law and I see a lot of things that maybe I've been, you know, but we procedurally ball. I came just get back in court. That's an obstacle. You know, at one point, when I first got here, we were able to cheat, you know, you keep fallings up. But when it culet, nine in 1990, I think 91 we trapped."},{"speaker":"Terry","time":"00:52:52-7","content":"I mean, I'm totally trapped. I'm talking about trying to find a way to get back in court. But I have to have some newly discovered evidence. And I got people out there trying to help me dig that up. And it's not easy. But life without parole is rough man. When you really think about because we're going to die here. And I tell allow these young kids when they come to the library, you're going to die."},{"speaker":"Terry","time":"00:52:52-7","content":"If you don't work hard and diligent now to the legal system, you're going to die, because you don't have no chance for parole, but we don't have any chance of parole. Simple as that clemency Board? That's difficult. You know, I've been somehow, you know, denied here and all that. And it was my first time applying for it after 37 years. I never even try until recently, and was denied because of some institutional disciplinary reports, they allege. And I've only had 61 out of 30 some years. I mean, what you want. When I come here, it was, you know, that's what it was about getting rolled up,"},{"speaker":"Marcus","time":"00:54:46-5","content":"Would you care to share these in a time curve? So my understanding is that it's effective to share these disciplinary write ups in time curve."},{"speaker":"Terry","time":"00:54:59-2","content":"Yeah."},{"speaker":"Marcus","time":"00:54:59-8","content":"So that you can see there."},{"speaker":"Terry","time":"00:55:01-1","content":"Yeah, yeah, they all there. Yeah. Because within the last 10 years, let's see. Oh I go beyond that since 2001. I got to see, I may have had, three write-ups High Court and maybe one low court."},{"speaker":"Marcus","time":"00:55:25-5","content":"Yeah."},{"speaker":"Terry","time":"00:55:26-6","content":"And the last one was like five or six years ago. And that shouldn't even be in my record."},{"speaker":"Marcus","time":"00:55:34-6","content":"Terry. I'm so grateful to have had a chance to talk with you. But if there's, is there a question that I should have asked you that I didn't, or something that you wanted to have an opportunity to talk about, that I didn't give you an opportunity to say,"},{"speaker":"Terry","time":"00:55:49-6","content":"People change. And these prisons, were designed for that these programs we have here, are designed for that. And if you're not going to give a guy an opportunity to take advantage of them for the purpose of regaining his freedom, then I think we shouldn't have them. There's no cause in, you got plenty of guys going through the Bible College, get degrees and ain't going away."},{"speaker":"Terry","time":"00:55:49-6","content":"We are not going anywhere. I spend more time with the law because that's my I really feel as my way out, you know, that right now, as it stands, it is the only way out for me. You know, and I came here with an education. I came here behind mistake I made. I have no problem with living up to that. I mean, I fought my case, self-defense, I couldn't show it. So it is what it is, I got no problem with being punished. But I'm no criminal. I made a mistake. And no doubt."},{"speaker":"Terry","time":"00:55:49-6","content":"And I am the first to say it was stupid. Because a lot of us do things today. We know what we are doing. A lot of things we do and just be honest stupidity but as they say, we should be given a chance. And politics. I look at the papers all the time I read a crime rate, you know, they make nice low scales about distant reason and just decline. But I can't tell from what I'm reading in the paper, because someone always getting murdered. Someone always getting arrested for murder."},{"speaker":"Terry","time":"00:55:49-6","content":"Someone always been convicted for murder indicted for murder. That sentence, I mean, nothing's change. You reinstitute the death penalty to do what you call deter crime. And it didn't, it made it worse. Because a lot of guys have it in a mind they're going to kill me anyway. So they do the things they do. None of that work. Jobs. Education. That's the only thing gone change us up. So, you know, we have to be able to teach, and some of the teachers out there as I'm reading about them, you know, it just is criminal as they students. So, I mean, you know,"},{"speaker":"Terry","time":"00:55:49-6","content":"I think we should really should be parole across the board. That doesn't mean you got to let me go. That means I have to do something to show you that I warrant being released. And that's all it means what I'd be afraid of? Just putting it on the books. You know, we got we got a clemency process on the books. That wasn't happening until this government came in."},{"speaker":"Terry","time":"00:55:49-6","content":"All these years I've been here, I've seen maybe three or four people get time cuts and go home through these other governments."},{"speaker":"Terry","time":"00:55:49-6","content":"And it was one out not at when it was, tomorrow. But I mean, you know people not that that process is more political excuse me than allow a man have parole eligibility, because the government got to put this thing into, which could result into political suicide. You know, so I mean, you know, parole is, is it could be just a mechanism to help those that weren't being released release man. That's all it should be and it should head you know, and like I say, I don't always speak for myself, because I got a lot of guys I got guys here."},{"speaker":"Terry","time":"00:55:49-6","content":"There's blind totally guys here dine on Agha da do Ramadan just last night he took his stuff out of the dome because his liver almost he probably be dead by the time while we talk and who knows. You know? And I'm like, what are you holding him for? He should be immediately released. He's not going to recover. I know we know now why is Dale every day in the dome? And it pains me to see anybody because I don't have any enemies. To watch any man dies suffer light. But politics, it is what it is."},{"speaker":"Terry","time":"00:55:49-6","content":""},{"speaker":"Marcus","time":"01:01:50-9","content":"That's a pretty good place to stop."}]}