{"name":"","transcript":[{"content":"Theortric Givens Transcription REDACTIONS FINAL"},{"speaker":"Theortric","time":"00:00:00-0","content":"My name is Theortric Givens. Some people call me Bojack. I'm originally from St. Louis, Missouri. I'm 66 years old. I was born April 12, 1951. I was born and raised in Missouri. I came in New Orleans, I caught a second degree murder charge in New Orleans. I was extradited from California back to New Orleans. I been confined 41 years, 1 month, and 17 days as we speak now."},{"speaker":"Marcus","time":"00:00:49-1","content":"That's a long time. It's hard for me to imagine that. I'm going to ask you a few questions about your life before that charge. Can you tell me a little bit about your family, the folks who raised you?"},{"speaker":"Theortric","time":"00:01:11-8","content":"My mother, I love her, she love me. My father I mean, let me, I'm in love with my grandmother that was my heart. I mean even though you need your parents and all, I don't have nothing bad to say about them. I got good parents and all. Matter fact how I wound up down the wrong road, it's a great mystery. And the reason why I say that is because my father first black play football at Washington University."},{"speaker":"Theortric","time":"00:01:11-8","content":"My mother taught school at Harris Teachers College. I went to state playing baseball and football. I was in school. But I hadn't graduated and a guy I thought was my best friend was in a crap game, somebody came in there and tried to rob him. I grabbed the gun, discharged got put out all public schools and catholic schools."},{"speaker":"Theortric","time":"00:01:11-8","content":"After that I literally turned into a cheerleader. During the weekday I come up and I sit in the study hall. The weekend I'm rooting the team on. I got tired, I said I got to get a life for myself. And that's what led me from one end of the spectrum to the other end of the spectrum and I wind up with second-degree murder charge."},{"speaker":"Theortric","time":"00:01:11-8","content":"So when you say what was my life like, well everybody I associate with was in school. I pulled away from that particular group because I got bored and tired. So the only other persons I know was the people in the streets. So I gradually started hanging with the wrong crowd and that's I think that's the biggest thing. I mean, people not in school what is they doing?"},{"speaker":"Theortric","time":"00:01:11-8","content":"The wrong thing. I mean if you see a young guy walking the street at 8:30, 9 o'clock in the morning, if he's not at school he got to be doing something wrong. So there I was."},{"speaker":"Marcus","time":"00:03:06-1","content":"So would you say it's fair to say that when you were growing up there were some adults who loved you and cared for you and took an interest in you?"},{"speaker":"Theortric","time":"00:03:14-5","content":"Oh yeah my mother, my father, my grandmother, I mean my grandma anything I wanted. I'd go stay with her on the weekend, I'd go take her to the markets and all. I used to love to hear her fuss. And yeah I mean it's just, it's plenty of love there. Let me say back one second, I think one of the greatest mistake I made not so much is that about being head strong and caught myself taking up my friend. I learned a lot in that process of that and that I'm not connected to hip with nobody."},{"speaker":"Theortric","time":"00:03:14-5","content":"That you can't be a people pleaser, and the same guy he went on with his life and mine was shattered. Ok, so I ask myself now, was that really my friend? So then you look back and you reflect. You say well if a guy's not motivating you, inspiring you, encourage you, why do you have him on your list, say that's your friend. If you get sidetracked from your goals you through. But getting back again, what I want to say, the biggest thing mistake I think I made is that I felt I was a disappointment to my parents."},{"speaker":"Theortric","time":"00:03:14-5","content":"So when you sit down, when I sat down at the dinner table I looked at my dad looked at my mom and I'm out of school. It just seem like I hurt them so bad and I pulled away from them to the street. And I didn't understand the significance of a family and love then. I didn't know that they was going to love me regardless and help me work through my problem. I just thought I had been a disappointment and I said well I'm feeling uncomfortable and I pulled away."},{"speaker":"Theortric","time":"00:03:14-5","content":"So it wasn't them, it was me. For not having the understanding and mentality at that time to understand the whole meaning of what a family mean beside 4 walls and a roof over your head. I didn't know that's where you go when you're battered and against the world and what have you."},{"speaker":"Marcus","time":"00:05:31-4","content":"So if I'm standing right outside your grandmother's house, looking out into the neighborhood, what would I see and what would I smell, what would I hear?"},{"speaker":"Theortric","time":"00:05:46-5","content":"Well at my grandmother's house, when you sit on the porch across from you'll see the school. In the school you going to see the kids playing, whatever season. You going to see them playing softball, you going to see them playing basketball. You going to hear the neighbors talking. You might see somebody with a barbecue pit on. It was a good atmosphere a very good atmosphere."},{"speaker":"Marcus","time":"00:06:14-2","content":"Do you have a specific memory of the last time you saw your grandmother?"},{"speaker":"Theortric","time":"00:06:22-8","content":"Yes, I carried her to the market on a Saturday morning. And after I brought her back home, she talk crazy to me. But that's, see any time I brought a friend over, if she cursed them out, she liked them. If she didn't curse them out, she didn't want anything to do with them. That's the kind of woman she was, but she would feed them, take care of them just like they was her own."},{"speaker":"Marcus","time":"00:06:52-3","content":"Do you have a recollection of some best friends?"},{"speaker":"Theortric","time":"00:06:52-3","content":"Well."},{"speaker":"Marcus","time":"00:06:59-2","content":"You mentioned this other friend earlier"},{"speaker":"Theortric","time":"00:07:02-6","content":"All my best friends, that they went on with they life and it was mostly it's like you heard people talk about gangs on the street the Crips, the Bloods, etc. Well when you're in school, they don't label the gang, but the football team hang together, the baseball team hang together, the wrestling team hang together."},{"speaker":"Theortric","time":"00:07:02-6","content":"And really, that's a gang, but they don't label it as a gang. And just like I playing football, this girl I was crazy about, Valerie, but my pulling guard was in love with her. If I pursue my love affair with her then he ain't going to block for me. So I step back to allow him to go and have his thing and me and her just become friends. But all the time I'm loving her, but I need him to block for me. So we it was a trade off."},{"speaker":"Marcus","time":"00:08:06-7","content":"Did you ever get kicked out of school?"},{"speaker":"Theortric","time":"00:08:08-3","content":"Well that's my, that's the only time I had got kicked out of school was when I discharged the gun"},{"speaker":"Marcus","time":"00:08:13-6","content":"How old were you?"},{"speaker":"Theortric","time":"00:08:17-5","content":"I was a juvenile, 17, 18 something. I was a juvenile, it was in sophomore year."},{"speaker":"Marcus","time":"00:08:28-1","content":"Do you have any children?"},{"speaker":"Theortric","time":"00:08:30-3","content":"No that I know of. But I believe Barbara, I believe that she conceived a daughter named Katina by me but she wouldn't tell me. But she send me pictures up here and if you look at the little girl, identical, identical like. And my mother used to always tell me say that was my daughter. But by me getting in trouble and out of school, she hid that they won't so would no harm would come to her. But since I been confined, she send me all the pictures all the pictures when she was a baby between my legs, pictures when I'm laying in the bed with her."},{"speaker":"Theortric","time":"00:08:30-3","content":"And then the like question am I taking care of somebody else baby but all the time, this is my baby. I go by on Christmas, the night before Christmas put the toys together. Scared take the baby with me. But as the baby got older, she kept sending me the pictures of her and all when she went to college. She moved and went to Atlanta to go to school and all. And she still, her mama still would send me the pictures of her but she never would tell me that that was my daughter. But you look at the picture and it look just like me so."},{"speaker":"Marcus","time":"00:09:38-2","content":"Do you have anyone who visits you regularly here?"},{"speaker":"Theortric","time":"00:09:41-3","content":"Well all my family had passed since I been confined but my first visit was from a lady named Molly. Molly Blackwell out of Baton Rouge where I went on the street and to talk with at risk group and went to St. James Episcopal Church. And there was a group of kids in there that came in and looked like a cult, had their hair up in a spike, black lipsticks, black fingernail polish. And I got a chance and I talk with them about choices in life. And one of the little girls turn around, got back in church, got a GED and all. And the mother wanted to meet me."},{"speaker":"Theortric","time":"00:09:41-3","content":"So the warden gave me a special visit with her. And I sit down and talk with them. Then another lady out of Lafayette, really Youngsville, Louisiana; she was a principal of St. Cecelia Middle School. Her and her family come visit me. So it's different people, the people that come visit me, they haven't really adopted me, but they part of my transition team, if I, when I get out."},{"speaker":"Marcus","time":"00:10:53-1","content":"Ok yeah let's talk a little bit about that. One of the reasons we wanted to learn more about your experience specifically is that you're a trusted member of this community and recognized for that. But let's go back before you turned your life around and look at that man who was driven through the gates of Angola. How would you describe that person?"},{"speaker":"Theortric","time":"00:11:20-9","content":"Very selfish. It was me, myself, and I. I mean you take a guy even though a charge happen in Orleans parish, I didn't know anybody from Orleans parish. Only guys that I knew is the few guy that was in the cell with me and on the tier with me. So when I come here I'm looking at everybody grouping up together so I'm like the lone wolf. So I didn't want to be in no gang or be with no particular group, so everything I did was me, myself and I, real selfish. And that's why I used to fight quickly, I didn't know it was a game or what."},{"speaker":"Theortric","time":"00:11:20-9","content":"So when I first come here the way this institution was, if you weren't a man, you had to get a man. You had to get in where you fit in. There wasn't no security officers in the dormitory, anything. And through a blessing, we wind up getting a court order from E- Guard West. And they changed institution, came up with security, came up with shake downs, making it more bearable to live. Then through the course of year, each one that came in did a little bit more to make it more bearable. But when I first come in, you just, you just had to get in where you fit in at."},{"speaker":"Theortric","time":"00:11:20-9","content":"Other than that if you weren't a man you had to get you a man. That was life. Then as times change, then I think that's when I began to change. Because I used to fight a lot because I had a complex. I mean Ill be honest with you, when I came my hair, you talking about a bush, my hair grew for years and I used to put it in full plats. And I didn't know how to braid my hair or plat my hair. And I paid a guy one day to plat my hair. I'm sitting in the chair, he platting my hair."},{"speaker":"Theortric","time":"00:11:20-9","content":"And when I spin around for him to catch the other side, he rocked up, he got a hard-on. We went to fighting. He getting affection in my hair. So a lot of little changes that I went though. That's when I try to learn how to plat my own hair and after awhile I just cut it off."},{"speaker":"Theortric","time":"00:11:20-9","content":"I mean so these are the changes but I was in the cellblock and locked down. And I just asked myself is this what my life consists of? In and out of the blocks. So I started focusing on the parasites that was eating me up instead of pointing to different external things. And I think that's when I gradually went to making little change. Because it was strange the mystery about change is that people could talk to you till you're blue in the face. But until you see the need to change you not going to change."},{"speaker":"Theortric","time":"00:11:20-9","content":"And its no different than when a man get up in the morning put his suit and tie on. If the tie don't match up with the suit, what did he do? He change. A woman get up in the morning she put her dress and blouse and everything on. If she put on a hat or either bow ribbon in her hair, if it don't match what she do? She change it."},{"speaker":"Theortric","time":"00:11:20-9","content":"So until the person see the need the change, he's not going to change and people can talk to him till they blue. But when you look at the change it come on gradually and it's like an evolutionary effect. But the net effect of it is revolutionary. That's when you get a distaste in your mouth for injustice and wrongdoing. So I think it's just a gradually process."},{"speaker":"Marcus","time":"00:14:55-2","content":"Well sometimes people can look back on their own transformation and identify a person who was very influential or a specific event or a light bulb going off. But for you, I understand it was more of a gradual realization."},{"speaker":"Theortric","time":"00:15:11-8","content":"It's gradually because I'm trying to you caught up in an environment where everybody's doing wrong. You really don't know nobody. You don't have no income or nothing coming in so you scared of doing wrong. Okay course this is a world inside of a world. It is I'm trying to get a lawyer to get out of here."},{"speaker":"Theortric","time":"00:15:11-8","content":"Okay so I don't have no money so what is I'm going to do? So I open me a store. First I went to the plasma and I bled. Bled every week twice a week, that's where these holes, I don't shoot no drugs and I've never shot no drugs. But see these holes right there, look like snake holes in my arm."},{"speaker":"Theortric","time":"00:15:11-8","content":"That's from bleeding at the plasma, laying on the table bleeding in order to get income. Four dollars. Four dollars fifty cents. Take that little money there, go buy some soups, go buy some chips, some cookies, some cigarettes, things that people use and need. And you loan them out 2 for 1 and you get your income coming in. After you get so much, so many cigarettes you turn them in for cash money. And then you look at your people, say put that in my account. So you build up your bankroll."},{"speaker":"Theortric","time":"00:15:11-8","content":"But the side effect is that and you learn. That's how a lot of fights I got into. Come time to pay and I'm looking and he's sitting over at the crap game and I'm waiting on him to go to the store and pay me my money. Store close, he give me excuse, next thing I know we get to fighting. So I learned, excuse the expression, but you don't give no five dollar person ten dollars, you going to have problems out of it. Ok so like I says, you start, when I laying in the cell, say you got to do something better than this. Why you going to keep getting fighting. You making a bad choice loaning people stuff. You can only take so much collateral from them."},{"speaker":"Theortric","time":"00:15:11-8","content":"So I said well let me try, what legitly can I do? And that's what made me start getting in to the hobby shop. I learned about the hobby shop. When I learn the hobby shop I say oh ok, I can make a legit money without getting into a fight with anybody. So then that's that's why I say everything come to you gradually, you stay, everything's a learning process."},{"speaker":"Marcus","time":"00:17:30-9","content":"What is it about this place that makes that process hard and what is it about this place that makes that process easy?"},{"speaker":"Theortric","time":"00:17:40-7","content":"Well what makes it hard is because the population is so large and you only got so many boxes in the hobby shop for instance. Take see I want to get in the hobby shop. Well I got to wait on a long waiting list. So what I'm I going to do in the mean time? Now they start allowing a box owner to have a helper. So you can get on as a helper with a guy. What'd you say, did you say, ok that was the hard part."},{"speaker":"Marcus","time":"00:18:15-1","content":"The hard, when we're talking about changing and transforming life around. There's some things in prison that maybe make that very difficult and there might be some things that make that process easy, that helps with that."},{"speaker":"Theortric","time":"00:18:26-3","content":"Well, I think it's you and your life, your lifestyle. I mean it's your choice again. For instance, you take society, say they call it the ghettos, then you got middle class, then you got upper class. Well it's the same way here. You got a group of people that's all in the field, they all live together, they might break in your box or whatever. But you got the choice to move, to put in for a dorm change or a custody change."},{"speaker":"Theortric","time":"00:18:26-3","content":"When you put in for that custody change, you become a Class C trustee, a Class B trustee, a Class A trustee. And move from out of that environment to another environment where they not breaking into your boxes. So it boil down to you where you want to leave that group alone and move over to this particular group over here. You look at majority on the west yard, here right now, the wars on the west yard, that's predominately people in the field."},{"speaker":"Theortric","time":"00:18:26-3","content":"You got a few of them that got jobs now. The east yard, everything's educational. People going get a trade, people going school whatever. So the environment is different the mentality is different. So it's on you, which road do you want to take and travel."},{"speaker":"Marcus","time":"00:19:55-9","content":"What organizations are you involved with here at Angola? Or have you been involved with over the years?"},{"speaker":"Theortric","time":"00:20:00-5","content":"Well, I joined the CPR team way back and I worked my way up to instructor. Then I worked my way all the way up far as I could go, instructor trainer. And by that I train people to become instructors, teach classes. Through that I went out in society to train firemen's, bus drivers, school teachers. Went all of the state Louisiana teaching CPR, that's with that organization."},{"speaker":"Theortric","time":"00:20:00-5","content":"I joined a Toastmaster group here at the main prison, I was living at Camp L. Their names was the Forgotten Voices and I learned the ropes and everything and when the election time came, I became a sergeant arms to learn a lot of things, and how to meet people, and I kept reading the bylaws."},{"speaker":"Theortric","time":"00:20:00-5","content":"So then when I brought different ideas to them, they got rejected. So I went back and started my own Toastmaster club and named them the Voices to Be Heard. Formed my own group and I excelled with it till they wound up making me Midwestern Division Governor and put me over the institution clubs and so many free world clubs in district 68."},{"speaker":"Theortric","time":"00:20:00-5","content":"And it was a good group and you watched, we can't perfect ourselves but when you watch the change in the people that was in the group in the club, you see progress. I mean you see them come to a meeting they had to have they shirts and they pants, they had to be groomed, they person they couldn't use no profanity. When you see that progress in them it inspire you and you feel good because you helping people change and you seen that. And we had a chance to invite different people from society come."},{"speaker":"Theortric","time":"00:20:00-5","content":"And there wasn't no show because I never would let them know when somebody was coming. Then they got a chance to compete in different speaking competitions. And when I used to sit down and tell them I'm not competing against you I'm trying to help you."},{"speaker":"Theortric","time":"00:20:00-5","content":"So you train speakers I used to tell them stand up, speak up, and shut up. People don't have time for you to give them a long drawn conversation. And it gave a chance to work on different mock program because it make them stay focus on what they primary goal was and that's getting out of here. But I told them you got to prepare yourself for getting out of here. And so we just set up different mock boards and I mean tell a person, convince me that I should let you out of prison. Why should I let you move in my neighborhood and live next to me?"},{"speaker":"Marcus","time":"00:22:47-5","content":"Let me ask you that, if a parole board were to ask you for specific examples of rehabilitation in your case, what would you want them to know?"},{"speaker":"Theortric","time":"00:22:55-7","content":"Define rehabilitation for me."},{"speaker":"Marcus","time":"00:22:59-9","content":"Change for the better. And that you would be unlikely to commit another crime."},{"speaker":"Theortric","time":"00:23:09-8","content":"Well ok. Why I've tried to prepare myself as to this date to whether if you, Marcus 1 and Marcus 2, had applied for a job they'd hired me before they hired you, or either one of y'all. This is why I took up sign language, went through a sign language class, graduated from 3 different levels. I could walk into a silkscreen shop, do the layout, draft, and film cutting. The only thing I hadn't did was operate the camera. Went to the mattress factory, learned everything about it."},{"speaker":"Theortric","time":"00:23:09-8","content":"I went to the library when I first come up here and I asked the librarian would he order a typing manual from LSU for me. And he ordered for me, I wanted to teach myself how to type. And my goal was to be able to out type any woman. Okay that's how I wind up getting different clerks job. Because through the process of it, I quickly became different clerks. And they had me take their inventory from the old work off the boxes of paperwork and put them on computers and everything for them. I was inmate counselor like a paralegal, helped people regain they freedom."},{"speaker":"Theortric","time":"00:23:09-8","content":"I went to so many classes, taught so many classes. And I enjoyed that, trying to help people get they freedom. I tried to get into carpenter school, they told me I had a life sentence so I couldn't get, I couldn't attend the school, so I ordered me different books and taught myself. And now I'm teaching people about carpentry."},{"speaker":"Theortric","time":"00:23:09-8","content":"I'm supervisor, well I'm the coordinator of the carpenter shop at the main prison now. And I build everything for everybody. Stuff for the museum where they put people, I have to do they work. Whatever need to be built, I build it. When they built the chapel, my work partner and I, we did all the pews and all the picture frames and everything in there."},{"speaker":"Theortric","time":"00:23:09-8","content":"So I mean, and then I have people bring stuff to me in a sheet, say different shops on the street couldn't fix it, could you put it back together and build the parts? And I look at it, lay it on the floor, take a couple days to study it, and put it back together. Guy, lady brought me a German wine cabinet, I didn't know what a German wine cabinet was. Once you lay all the pieces down like a puzzle, it become intriguing, you put it back together and whatever pieces wasn't there, you build it."},{"speaker":"Theortric","time":"00:23:09-8","content":"So now I have a trade with that and it's something I enjoy. So I think about, even if I, had I been on the street for the sad situation of Katrina and all the other hurricanes and all, I would have token, paid down and got me one of them houses. And let it dry out, I'd have gutted it out, five feet up, and Id have remodeled that house myself. So, and that's one of my goals, one of my own. The same way the reentry program, I go out and get certified, hire me a carpenter to work with me."},{"speaker":"Theortric","time":"00:23:09-8","content":"Then go out and talk to them judges and all with the reentry program, they don't have to bring them all to Angola, bring them to my shop right there. So that's it's different, different things. Yeah I'm going to be working with a guy that's a carpenter, I'm blessed that he going to hire me, but my intention not really to stay there with him because I got my own. I got some things that I want to do."},{"speaker":"Marcus","time":"00:27:02-6","content":"Let's talk about that. So, you now have this glimmer of hope and I imagine that you have spent some time envisioning your life after Angola."},{"speaker":"Theortric","time":"00:27:16-5","content":"Oh yes indeed."},{"speaker":"Marcus","time":"00:27:18-5","content":"Can you tell me what it looks like? How do you envision that?"},{"speaker":"Theortric","time":"00:27:22-0","content":"Ah, me doing well. I mean, see that's the thing. See here teach you the difference between your wants and your needs. You don't let your wants overrule your need. And I understand that far as financially, I could, see really I could sleep on a park bench and cover with a newspaper and be happy, wake up in the morning and feed the pigeons, and I'm ok."},{"speaker":"Theortric","time":"00:27:22-0","content":"So I wouldn't want to pay $700-$800 for an apartment and pay that for a whole year and then at the end of the year I could get evicted and have nothing. Why when I take and wait, and wait to catch a little house, sale or whatever, and pay down on that and at the end of the year, that's my still mine. I can add and build on to it. See even the job I'm going to, I'm going to ask the guy, can I sleep in there? Even though I'm trying to find me a place close by."},{"speaker":"Theortric","time":"00:27:22-0","content":"But I can get one of them rolling cots and sleep in that, go out to Goodwill, get me a pillow and a blanket, and I'm, I'll be content and save my money. Because I got things I want to do. I'm not in a hurry. I'm not worried about automobile. Wherever the job is, I'm going to try to find somewhere. If I can't live there on the job, I'm going to try to live in the neighborhood where I can ride a bicycle or catch one bus to get there. I ain't thought about a lot of things. I know it's going to take, Rome wasn't built in a day. So it's going to take a little time. But it ain't going to take as long as a lot of people thing."},{"speaker":"Marcus","time":"00:28:50-6","content":"When you look at a life sentence without parole, how do you make sense of that in the context of rehabilitation? What does rehabilitation mean with a life sentence without the possibility of parole?"},{"speaker":"Theortric","time":"00:29:04-4","content":"Well, I think this is why they don't use the word rehabilitation too much. Because once, if you determine that I'm rehabilitated, then why you keeping me confined? Wouldn't that be cruel and unusual punishment in another form? So I don't think they use the word rehabilitate too much. And this thing is just, I don't know, it's just, when is enough? You never, it's so unpredictable. I mean it's the mood swing of the state. We just blessed now that we have a governor is takin a chance with long terms. It's, you ask about the victims."},{"speaker":"Theortric","time":"00:29:04-4","content":"Well no matter, we can't undo what's been done. And they have a rule here in the rulebook, you can't contact your victim to try to express you're remorseful or ask for forgiveness of anything like that. So a person be kind of at odds, the victim will say well he never contact me nothing like that, that don't mean that you didn't want to do this. I knew that only time would kind of let them heal a little bit. They'll never forget I mean, just even if they forgave me, that don't mean that they forget."},{"speaker":"Theortric","time":"00:29:04-4","content":"I mean every time they sit down at dinner and there's a empty chair, it hurts because they lost a loved one. Every time they walked through they living room and on the mantle and they see a photograph of they son or they daughter and they miss them, that hurt. So it's something that time, only God can intervene on that, to ease that. And I equate that with, if you was a prisoner and you and I got into it, we got into a fist fight or whatever. As long as we see each other, we at odds, a lot of tension. Oh I'm going to get him or he's going to get me."},{"speaker":"Theortric","time":"00:29:04-4","content":"But if I man up and come to you and say man look, I'm sorry, I apologize, I was. You don't have to worry about no trouble coming from me. I did something stupid ok. You just look at me, you may not even say nothing. As time go on, you going might be watching me every time I come around and then you begin to kind of relax some, say he was sincere. Next thing you come in the area where I'm at. But only team can heal that. And this is really speaking for our victims."},{"speaker":"Theortric","time":"00:29:04-4","content":"See every time a person's forgive, there's a wound there, so there's hurt there. So I understand, I can understand that. I mean you would like to sit down and talk with them face to face, and express it, and ask them for they forgiveness. But the institution never would allow that. I don't know if they do it now, but in our rulebook it says any unwanted communication with a victim now is prohibited. So a lot of people, they may want to express their, don't have the opportunity to."},{"speaker":"Marcus","time":"00:32:29-5","content":"How much punishment is enough punishment? I mean it's a political question."},{"speaker":"Theortric","time":"00:32:38-9","content":"Right I mean you hear some say well you didn't allow this person here to live for more years. Ok, you understand, we understand that ok. But at the same time, only thing I ask for is mercy. I can't undo that. I'm sorry for that. I feel your pain on that. I'm not demanding that. Only thing I'm just asking for some mercy."},{"speaker":"Marcus","time":"00:33:12-6","content":"Well you've served 41 years of your life"},{"speaker":"Theortric","time":"00:33:15-3","content":"They ask the difference between the 24 year old and the 66 year old now. I understand that everything that I do, it don't just affect me. It has a side effect to everybody around me. I didn't understand that getting in trouble was going to affect my parents as well as it did the victim's parents. So you see, everybody be affected by my particular action."},{"speaker":"Marcus","time":"00:33:42-3","content":"How do people here cope with life sentences? So many men here are serving life, and so many of them are confronted with the fact that they will probably die here."},{"speaker":"Theortric","time":"00:33:55-4","content":"And that's what you try to forget about, that's what you try not to think about, dying here. You wake up and you just have a hole. When you see someone else go, that give you hope. I mean, it may be unrelated to you. I mean, you see there's a lot of things is dealt around non-violent, non-violent, non-violent. And you ask yourself, ok you glad non-violence is going out. But the thing is, are the non-violent making it difficult for the lifers without parole coming out?"},{"speaker":"Theortric","time":"00:33:55-4","content":"Because I been here 41 years, 1 month, 17 days. Here's a guy that you say is non-violent. But I watch them come back through that door three times on the recidivism. So is the violent people that's going out recidivism committing a harsher crime or the non-violent ones? You know that, working in the library, I watch guys out of everybody that got a pardon that was fortunate that was blessed to get out, I haven't seen no recidivism, they haven't come back through this place."},{"speaker":"Theortric","time":"00:33:55-4","content":"None, not a one. Even with the drug lifers, I watch that when they had they had that talking? When they scooped them all up, I only watched one guy come back and the only reason why he came back is because he took a charge for his son. He didn't want his son have to go through what he went through in the early '70s. That's the only reason why that man came back to prison. So when you speak about recidivism, and you crying about the crime rate."},{"speaker":"Theortric","time":"00:33:55-4","content":"I was just looking at the news yesterday and the district attorney out of Baton Rouge say that at this point now the crime rate now in Baton Rouge has doubled what it was last year this time. The guys that's been with me, we been locked up 41 years, we didn't have nothing to do with that. I mean if you look at the ones up here now, it mostly family disputes or somebody new, it's not that senseless killing or nothing. I mean there wasn't all these drive by shooting."},{"speaker":"Theortric","time":"00:33:55-4","content":"I mean I read in a Jet magazine, a guy's family was sitting down eating dinner and they was all at the table blessing the food and they slept under a pool and the guys in the pool was on some kind of drug and they dance and shooting they guns up like that. They come up through the floor and kill them people sitting around their table. That's senseless. But we ride the slack on that. We, they use the word violent. To me, they don't individualize things. They lump everybody together like cattle."},{"speaker":"Theortric","time":"00:33:55-4","content":"And what I mean by that because like I said I worked in the library and I worked on a lot of guy's cases. And first take this here for instance, I think they overwork the word violent. And the reason why I say that, say you took your wife to dinner. And you and your wife coming out of the restaurant and there's two guys, they might have been drinking or what have you, and they get all belligerent and boisterous and get up in your face \"Oh mama you look good, hey baby\""},{"speaker":"Theortric","time":"00:33:55-4","content":"You say excuse me man move out the way on with that foolishness. \"Ah man we don't care what you, say girl you look good won't you come on\" And you \"Man get on out of my wife face\" Ok. And this guy, he slips and he hit his head on the bumper of a car and he dies a result. Now the judge hands is tied, you charged with second degree murder. They don't take in account that you a pillar of the community. That you patriotic and served in the military anything. Only thing you charge with second-degree murder. You going to get a life without parole."},{"speaker":"Theortric","time":"00:33:55-4","content":"Now that circumstance, does that make you a violent person? That's just a circumstance that became violent. So I think that the word violent criminal violent, I think it's over-emphasized on that word. You got to look at circumstances. I mean you got guys up here, I worked on guys' cases. And they charge them as a principal. This guy was a look-out man, was a driver. He never had the heart, didn't have the heart, he's not a criminal. And you look at it and he got a life sentence. He doing a whole lifetime."},{"speaker":"Theortric","time":"00:33:55-4","content":"He want to be with the fellas. He ain't no killer. I mean but he doing a life sentence. And they keep him locked up because of the word violent crime. He just went along with the people, he wasn't a triggerman. I mean it's, you learn that even a robber sometime, they agree to go rob this store."},{"speaker":"Theortric","time":"00:33:55-4","content":"And go in and the man spooking you, they got old fault and the gun go off and kill the person. But they ain't had no intent to kill that person. They might have had a drug habit what have, they just wanted the money. But now they stuck as a violent offender, got a life sentence for murder. But it's circumstances."},{"speaker":"Marcus","time":"00:39:45-5","content":"Violent acts as opposed to violent people"},{"speaker":"Theortric","time":"00:39:47-5","content":"Right, that's, but they lump everything together instead of individualizing. In my experience with people up here too, that's another thing, even though you got a lot of people here, I mean. When you remove the drugs and alcohol from people, they basically good people. I mean that's, I mean I work with a lot of people and when they don't have drugs and alcohol in them, they basically good people. I mean, like say everybody mature if you give them time."},{"speaker":"Theortric","time":"00:39:47-5","content":"But once they do get they act together, I mean for instance I had a guy ask me one day, from the street. He said Bojack, he said look, he said lot of guys done graduated from that bible college and they be walking round with that bible and all. He said you think they faking? I said well let me explain two things to you. First of all, he said do you think they found God, do you think they, I said first of all, I've never known God to be lost. I said number two, only God can read another man heart."},{"speaker":"Theortric","time":"00:39:47-5","content":"I said now they got a bunch of lifers over in this hospital, this hospice program, this is not a regular job, they volunteer for this. Now excuse the expression, but they wash all up the crack of another man's ass, all up under his nuts and all, it doesn't care what nationality or race he is. Is that man faking? Have that man changed?"},{"speaker":"Theortric","time":"00:39:47-5","content":"He might have been a character when he got here, but this man has developed character. This man developed compassion. He might never had that when he first come here. But you look at him now and you ask yourself, is he faking? How you going to fake that? You don't even know this guy."},{"speaker":"Theortric","time":"00:39:47-5","content":"It doesn't matter what nationality he is, what color he is. And he over there washing all up your crack this man, all up his behind, all up under his nut sack, come on man. I mean just because he because he walk with a bible, I mean, don't pre-judge him man, I mean. But the public don't see that. You have a lot of lifers that take it turn around and guys that's hungry and don't have anything. They put together, give this guy a toothbrush, toothpaste, deodorant, soup, give him a snack. They don't see that. They don't come interview him."},{"speaker":"Theortric","time":"00:39:47-5","content":"You got lifers, see one of them schools over there on that compound, that's lifers teaching them classes. That ain't know free personnel teaching them class. Them lifers teaching that. But nobody interview them on that. They don't get a chance, they don't get a chance to come up on a parole board and put out a resume and let people see what they accomplished since they been there. It comes down to not so much what you'd have done but what have you become?"},{"speaker":"Theortric","time":"00:39:47-5","content":"What have you become since you been there? But nobody get a chance to see that. You don't have the opportunity to let nobody see that. You ask yourself, when you was 17, 16, 17 years old, are you the same person? Do you even think the same way you did now? No. As human nature, people change. I mean, some for the worse and some for the betterment. But you got to individualize. It's just like, for instance, then how we come talk about these new laws, this that and other. Say that they had one law on the books, the 20, 45."},{"speaker":"Theortric","time":"00:39:47-5","content":"If you been confined 20 years and you reached age 45, yours up for parole. That covered everybody but excluded lifers. Abiding men get together and ask for that bill to be amended to include all lifers. And then sit on his own bible. If you run a little out of the cellblock, throwing food and stuff, when you come up you expecting to be told no. At least that give other people hope, say look I been down 20 years, I'm over 45 years of age, let me get ready to go on this board. That's what my focus is. Not what do over there, not what he doing, I've got to."},{"speaker":"Theortric","time":"00:39:47-5","content":"See, you learn, just like I had to learn, you got to set goals for yourself just like you on the street. Here, in here you got to set goals. So when you set goals for yourself, goals determine your decision. Goals dictate your plans, goals predict the choice that you make. Everything you do is towards your goals, whether it's tentative or not. And it's what you strive toward, everything else doesn't matter to you. Everything you get involved is toward your goal of getting out of here."},{"speaker":"Theortric","time":"00:39:47-5","content":"Every school you go to, every class you. Right now if you turn around we'd have met and everything, you say well what do you think I can do for you? Send me a book, send me a good book to help me become a better person. No finance, I don't want know money or nothing like that. Send me a book to help me become a better person. That's all I'm asking for. That's all I want."},{"speaker":"Marcus","time":"00:44:56-5","content":"Is there something I should've asked you that I didn't? Something that you would like?"},{"speaker":"Theortric","time":"00:45:04-9","content":"I would like to know, I think more exposure, more exposure to the lifers, to really see how they living, really see how they actin, and what they involved in. And I think that that would help. I mean because if you don't know, if you don't know what I'm doing inside the prison walls, only thing a crime happened, a guy got locked up, he got sentenced to life. Out of sight, out of mind. You don't know nothing else about it."},{"speaker":"Theortric","time":"00:45:04-9","content":"So how can you see the changes in it? How can it whether or not they change. In other words like right now, they come ask you, give you the option. A family member died, it mean a family member died in your family. They give you the option, do you want to go to the funeral or to the wake, okay? What a lot of people say, I want to see them how I last seen them. Remember them how I last seen them. So you take society, it's that last memory how they seen it. It's the only thing that they really wanted. A young, violent person, as they use the word violent. A young Dennis the Menace."},{"speaker":"Marcus","time":"00:46:31-3","content":"They don't see anything else."},{"speaker":"Theortric","time":"00:46:33-9","content":"They don't see nothing else. Because they haven't been exposed to it. For us to take Katrina, as sad as it is. When it tore up the ninth ward and everything, look how many people got a chance to go to Atlanta, go to Georgia, go to New York, go to Chicago. They had never been outside that neighborhood. They didn't even know that other things exist. And you take the young guys, they get caught up in they neighborhood whirlpool which is nothing but a cesspool but they don't know it because they haven't been exposed to nothing else."},{"speaker":"Theortric","time":"00:46:33-9","content":"They don't take a lot of field trips no more and go places and all. It take a tragedy through nature in order to allow people to go out and see other things exist in the world. It's more than that. And that's why people, I think everybody's born with dreams. To be able to dream and the want to have a desire for different things."},{"speaker":"Theortric","time":"00:46:33-9","content":"But if you ain't ever been exposed to nothing, you don't know nothing exists. What if I'm in the neighborhood and all I see is drugs and alcohol, dope fiends. Well this is, I want to be the best dope fiend. I guess I want to be the best pool shark. Because I don't know nothing else. You come in my neighborhood and you ask me say, you use drugs? But you don't? It's a social norm for me."},{"speaker":"Theortric","time":"00:46:33-9","content":"You see what I'm saying? Cause I haven't been exposed to nothing else. Then you got the few that excel from out of that neighborhood. You ask them why, because they had dreams, they had aspirations. Some kind of way they got off to themselves. Oh man, I want to be this, I want to be that. And somebody encourage them, and they leave. And that's, that's same about prison. I mean, people like water, they seek their own level."},{"speaker":"Theortric","time":"00:46:33-9","content":"You say well what's the difficult of doing right and doing wrong in there. It's the choice you make, point blank. Ain't no middle way in? It's the choice you make, you got to make that decision. And I speak to a lot of youth now and I tell them life is very simple. Man complicate things. And I tell them, I say picture a railroad track."},{"speaker":"Theortric","time":"00:46:33-9","content":"On this side of the railroad track, you got God in your life, you got good family ties, you getting a good education. See on this other side of the track, you got drugs, alcohol, graveyard, penitentiary. When you try to straddle that track, the train run right over you. I said if you don't set no goals for yourself, it'll be just like a rocking horse. Making a lot of motion but you ain't going nowhere."},{"speaker":"Theortric","time":"00:46:33-9","content":"I said or you'll be out in the park, we just had the 4th of July, and you eating some barbecue how them nets be fighting around, it'll be just like a net moving nowhere fast. So it's important to set some goals for yourself. And that's what I express to people. The choice is on you. Life is not difficult, it's what you want, point blank. People don't come here because of being black or being white or coming out the ghetto or come from one parent, it's the choice you made."},{"speaker":"Theortric","time":"00:46:33-9","content":"That's what lead people to prison. And now that I mention that, I ask them all the time, what is a citizen? And I talk to them, I said what is a citizen? I say if you not a citizen, you don't belongs out there. I say you got to find out what is a citizen. I said if you not contribute to that neighborhood, you not building that neighborhood up, you don't belongs there. If you tearing it up, you don't belongs there. I said how everybody neighborhood can have a dog, but when the dog jump the fence and scare her mother from going to church at night, or scare mother from going to PTA meeting, whatever."},{"speaker":"Theortric","time":"00:46:33-9","content":"The dogcatcher come, pick that dog up, bring it to the pound, make soap out of it. You don't see that dog no more. That's what they do to human beings. They bring them, lock them up, you don't see them no more. Because they not a citizen, they not contributing. And this is what people have to be educated towards, the youth have to."},{"speaker":"Marcus","time":"00:50:50-1","content":"Sure. That's a good place to stop."}]}