{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:04",
      "content": "Tommy Floyd Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:04",
      "upperBoundTime": "00:00:14",
      "content": "My name is Tommy Floyd. I'm 42 years old been convicted of second degree murder and I've been down for 23 years. I was 19 years old when the crime happened."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:14",
      "upperBoundTime": "00:00:20",
      "content": "Okay thanks. So I'm going to start by asking a few question about you coming up growing up"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:20",
      "upperBoundTime": "00:00:22",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:22",
      "upperBoundTime": "00:00:24",
      "content": "Did you where did you grow up?"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:24",
      "upperBoundTime": "00:00:27",
      "content": "Iberville parish in a little place called bayou pigeon"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:27",
      "upperBoundTime": "00:00:32",
      "content": "Ok. Which is a rural area of Louisiana then."
    },
    {
      "speaker": "Tommy",
      "time": "00:00:32",
      "upperBoundTime": "00:00:38",
      "content": "Yeah a small plan mostly all commercial fishermen."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:38",
      "upperBoundTime": "00:00:42",
      "content": "So tell me a little bit about your family and the folks who raised you were close to you?"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:42",
      "upperBoundTime": "00:01:01",
      "content": "My mom and dad one thing I said them, probably the best 2 parents in the world anyone can ask for they always made sure we had enough made sure we had clothes roof food plenty of love had a great childhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:01",
      "upperBoundTime": "00:01:03",
      "content": "That's great did your parents get along?"
    },
    {
      "speaker": "Tommy",
      "time": "00:01:03",
      "upperBoundTime": "00:01:12",
      "content": "Yes sir. Very much they were together till my dad died in 97. 30 something years."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:12",
      "upperBoundTime": "00:01:18",
      "content": "Were you able to stay as close as you could to them?"
    },
    {
      "speaker": "Tommy",
      "time": "00:01:18",
      "upperBoundTime": "00:01:21",
      "content": "Oh yes sir. Me and my dad was like best friends and he was also my dad."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:21",
      "upperBoundTime": "00:01:22",
      "content": "Right."
    },
    {
      "speaker": "Tommy",
      "time": "00:01:22",
      "upperBoundTime": "00:01:26",
      "content": "We hunted fished we competed in everything."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:26",
      "upperBoundTime": "00:01:32",
      "content": "Did you after you were convicted were you able to continue visitation."
    },
    {
      "speaker": "Tommy",
      "time": "00:01:32",
      "upperBoundTime": "00:01:58",
      "content": "My mom comes up at least once a month she wanted to come up more often than that but with the ride and all I told her ma as long as I see you once a month that's fine. Right before I got convicted the day that I went to trial well went to court my dad passed away that Sunday and I got- we buried him that Wednesday and I got life that Friday."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:58",
      "upperBoundTime": "00:02:00",
      "content": "Oh that sounds like a terrible week."
    },
    {
      "speaker": "Tommy",
      "time": "00:02:00",
      "upperBoundTime": "00:02:02",
      "content": "My mom lost everything at one time."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:02",
      "upperBoundTime": "00:02:06",
      "content": "Yeah. What how did your father die?"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:06",
      "upperBoundTime": "00:02:13",
      "content": "Cancer. Runs real bad on both sides of my family."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:13",
      "upperBoundTime": "00:02:19",
      "content": "Okay. How about your relationship with your siblings how was that growing up?"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:19",
      "upperBoundTime": "00:03:01",
      "content": "I got three sisters and two brothers, three sisters and a brother from my dad's first wife. I had a brother from my first my mom's first husband and I'm the only one from both of those together. As of growing up we never seen much most of the girls and one of the boys stayed with their mom in Alexandria and we seen each other in the summertimes and vacations and stuff like that."
    },
    {
      "speaker": "Tommy",
      "time": "00:02:19",
      "upperBoundTime": "00:03:01",
      "content": "Me and my brother Joe we stayed at home and we had a pretty good relationship growing up just that when we reached that teenagers we started falling apart a little bit. Little brother want to follow big brother don't want him to follow him. So I mean we had typical brother relationship."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:01",
      "upperBoundTime": "00:03:05",
      "content": "Was what was school like for you?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:05",
      "upperBoundTime": "00:03:16",
      "content": "School was great I was into sports and football was my thing that and track and I enjoyed school and when I got up in high school that's when things started changing a little bit."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:16",
      "upperBoundTime": "00:03:18",
      "content": "Okay how so?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:18",
      "upperBoundTime": "00:03:29",
      "content": "Drugs. Played a big influence in my life that and friends and following the wrong crowd and after that things started turning downhill a little bit."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:29",
      "upperBoundTime": "00:03:31",
      "content": "Did you finish high school?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:31",
      "upperBoundTime": "00:03:34",
      "content": "No sir the last grade I finished was the 10th grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:34",
      "upperBoundTime": "00:03:35",
      "content": "Did you ever get kicked out of school?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:35",
      "upperBoundTime": "00:03:36",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:36",
      "upperBoundTime": "00:03:37",
      "content": "What for?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:37",
      "upperBoundTime": "00:03:38",
      "content": "Drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:38",
      "upperBoundTime": "00:03:39",
      "content": "What drugs?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:39",
      "upperBoundTime": "00:03:47",
      "content": "Marijuana."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:47",
      "upperBoundTime": "00:03:49",
      "content": "Okay. Did you find yourself getting into fights?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:49",
      "upperBoundTime": "00:04:11",
      "content": "Not much. I was an easy going fella I mean I never ran from trouble but I didn't go looking for it. My dad taught us to stand up for ourself and stuff like that but we had typical teenage kids, you fight here and there and yonder but nothing really out there."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:11",
      "upperBoundTime": "00:04:24",
      "content": "So I want to try to imagine you're where you lived so if I was if I opened you front door and looked out what would I see what would I hear?"
    },
    {
      "speaker": "Tommy",
      "time": "00:04:24",
      "upperBoundTime": "00:04:46",
      "content": "If you go out the back door you would see nothing but woods and swamp land there's a bayou in the front that we grew up swimming in and skiing and playing and fishing. I mean you hear all the animals that deer squirrels rabbits all up in the backyard we got a little horse pasture back there I mean its just quiet country surroundings."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:46",
      "upperBoundTime": "00:04:49",
      "content": "Right. Neighbors nearby or no?"
    },
    {
      "speaker": "Tommy",
      "time": "00:04:49",
      "upperBoundTime": "00:05:02",
      "content": "We a had a few neighbors kinda like down the road a little bit but mostly everybody down that way was campers so we was kinda isolated but there was a few families that lived back there with other kids that we played with and stuff."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:02",
      "upperBoundTime": "00:05:05",
      "content": "What did your parents do for a living?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:05",
      "upperBoundTime": "00:05:09",
      "content": "My dad was a commercial fisherman and heavy equipment operator and mechanic."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:09",
      "upperBoundTime": "00:05:19",
      "content": "Ok. Yeah I think I can picture it pretty well. Who did you get along best with when you were coming up did you have a best friend?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:19",
      "upperBoundTime": "00:05:29",
      "content": "Johnny Thibodaux. Me and him grew up together from far back as I can remember all the way up until probably the day I came to prison."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:29",
      "upperBoundTime": "00:05:31",
      "content": "What was he like?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:31",
      "upperBoundTime": "00:05:48",
      "content": "Oh he was great I mean we went everywhere together did everything slept at each others house wore each others clothes I mean we went to school together. He had a little sister that I loved. But I never he was more or less like a brother to me than a friend."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:48",
      "upperBoundTime": "00:05:51",
      "content": "Yeah. Are you still in touch with him at all?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:51",
      "upperBoundTime": "00:06:06",
      "content": "Not as much. I mean we might speak every couple years but I mean after so many years have passed by he's went on with his life got married had kids of his own and all."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:06",
      "upperBoundTime": "00:06:09",
      "content": "Sure. Who do you remain in contact with?"
    },
    {
      "speaker": "Tommy",
      "time": "00:06:09",
      "upperBoundTime": "00:06:19",
      "content": "Mostly my mom my nieces and my cousins all that little kids that I make sure they bring them up here where I could stay part of their lives and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:19",
      "upperBoundTime": "00:06:20",
      "content": "Do you have any kids?"
    },
    {
      "speaker": "Tommy",
      "time": "00:06:20",
      "upperBoundTime": "00:06:28",
      "content": "No sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:28",
      "upperBoundTime": "00:06:29",
      "content": "Did you have a girlfriend before you came here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:06:29",
      "upperBoundTime": "00:06:32",
      "content": "Yes sir. If I wouldn't've come to prison I probably would've got married"
    },
    {
      "speaker": "Marcus",
      "time": "00:06:32",
      "upperBoundTime": "00:06:34",
      "content": "Tell me about her."
    },
    {
      "speaker": "Tommy",
      "time": "00:06:34",
      "upperBoundTime": "00:06:47",
      "content": "I proposed and she told me to ask her again in six months if I still felt the same she would marry me. And six months later it was too late."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:47",
      "upperBoundTime": "00:06:51",
      "content": "Well what led you down that road?"
    },
    {
      "speaker": "Tommy",
      "time": "00:06:51",
      "upperBoundTime": "00:07:24",
      "content": "As far as coming here? A big influence for it was mostly the drugs alcohol and just peer pressure by friends. Being a young stupid kid and made a decision that I had no no right in the world to make. I mean it's something I didn't have to do because I had everything going for me and just made one stupid decision as a kid and messed the rest of your life up."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:24",
      "upperBoundTime": "00:07:26",
      "content": "Do you remember the first time you got arrested?"
    },
    {
      "speaker": "Tommy",
      "time": "00:07:26",
      "upperBoundTime": "00:08:05",
      "content": "Yes sir it was probably about two weeks after I turned 18. It was a simple burglary charge we went camping one weekend out in the grand lake and the boat broke down so common code out there is nobody locks their cabs in case you get caught in a storm or anything we broke down."
    },
    {
      "speaker": "Tommy",
      "time": "00:07:26",
      "upperBoundTime": "00:08:05",
      "content": "We went by this one camp and we took the motor off the back of the boat and we went in and we was fixing working on the motor and just so happened it was appointed judges and sheriffs camp and they raised a big stink out of it and they prosecuted us for breaking into the camp"
    },
    {
      "speaker": "Marcus",
      "time": "00:08:05",
      "upperBoundTime": "00:08:07",
      "content": "Even though you didn't take anything."
    },
    {
      "speaker": "Tommy",
      "time": "00:08:07",
      "upperBoundTime": "00:08:24",
      "content": "Didn't take anything didn't mess nothing up really didn't go inside stayed outside under the carport. And they made a big stink out of it and I got six months and six months parole."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:24",
      "upperBoundTime": "00:08:26",
      "content": "Wow and that where did you serve that time?"
    },
    {
      "speaker": "Tommy",
      "time": "00:08:26",
      "upperBoundTime": "00:08:35",
      "content": "Iberville I mean Iberia Parish."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:35",
      "upperBoundTime": "00:08:37",
      "content": "Ok. Can you tell me a little bit about being in the parish jail?"
    },
    {
      "speaker": "Tommy",
      "time": "00:08:37",
      "upperBoundTime": "00:09:17",
      "content": "Parish jails on that charge it was a new experience. And it was rough back in those days good thing I had growed up knowing how to take care of myself because any time you go to a new place there's always gone be somebody that wants to try you."
    },
    {
      "speaker": "Tommy",
      "time": "00:08:37",
      "upperBoundTime": "00:09:17",
      "content": "Make a point or make a statement or something so you got to show them you a man too. And after you do that everything else pretty much falls in line of just stay with what's going on do what you're supposed to do and get out of there as fast as you can."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:17",
      "upperBoundTime": "00:09:19",
      "content": "So by that you mean did you get into a fight?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:19",
      "upperBoundTime": "00:09:20",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:20",
      "upperBoundTime": "00:09:22",
      "content": "Alright."
    },
    {
      "speaker": "Tommy",
      "time": "00:09:22",
      "upperBoundTime": "00:09:29",
      "content": "Any time you go to a new place get into a fight."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:29",
      "upperBoundTime": "00:09:43",
      "content": "So tell me about the 19 year old who came to Angola what would that what was that person like what was that 19 year old Tommy like?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:43",
      "upperBoundTime": "00:10:53",
      "content": "Stupid. Ignorant. Didn't know the meaning of life. Just lost really. I mean probably the best way to describe him is lost. Reality never set in. until one day it did. I mean for the first year I just walked around here like a zombie. Do what you told do this looking at him like it don't make no sense don't ask questions just do it we know it don't make sense. Do your 8 hours."
    },
    {
      "speaker": "Tommy",
      "time": "00:09:43",
      "upperBoundTime": "00:10:53",
      "content": "Other guys I used to sit down and try to figure out what they mean they say look at him he don't even know and he don't even realize it yet. And I'd sit there for hours and be like what are they talking about? 10 15 years down the road then I said now I know exactly what they talking about. Reality is setting in now you look at other young kids and you're like man please don't go down that road I've been there. Let's do it this way. I tried it that way that way don't work"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:53",
      "upperBoundTime": "00:10:54",
      "content": "What's that way?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:54",
      "upperBoundTime": "00:11:02",
      "content": "Trying to do it on your own bucking the system whatever."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:02",
      "upperBoundTime": "00:11:09",
      "content": "So when you say I'm assuming that you were sort of in denial that you're serving a life sentence."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:09",
      "upperBoundTime": "00:11:46",
      "content": "Oh yeah I mean growing up poor and everything and being ignorant to a law is not an excuse for the law. And when we went to court the lawyer's telling us you won't be there no more than 15 20 years that's a life sentence. And when you get up here and you see guys who have been here 30 40 50 years and they said man I don't know who told you that."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:09",
      "upperBoundTime": "00:11:46",
      "content": "They said man we got the same life sentence you got we been here 40 50 years. I'm like what? I said I ain't gone be here that long man. I said I gotta go they said yeah we got one too."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:46",
      "upperBoundTime": "00:11:48",
      "content": "So when did it settle in?"
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "Probably. It didn't take me as long as it takes most folks. I got here at Angola in 97, I got convicted in 94. In 99, I got diagnosed with germ cell cancer. They gave me 6 months to live. I went through three doses of chemo and before I took another dose I told the doctor I said I'll die first. I said it's that bad. So he agreed ok we going to stop the treatments and everything said your body better than I do he said we'll let it go it looks pretty good we shrunk the tumors."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "It stayed gone 42 months and when it came back it came back with a vengeance. It was in every major organ in my body. Liver lungs spleen pancreas and he told me I give you 9 days he said we gone call your family in they can stay with you I was in the hospice program he said they can stay with you until you pass. He said there's not much I can do for you. And I said well you can't give up on me doc. Its the same doctor my dad has when he was fighting cancer on the street and he said well there is one thing we can try and I said well lets shoot for it."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "So we did it's going to be five treatments he said and they gone be extensive. I said I'm game. So we went through the five treatments and let me tell you that's as close as you ever gone be to hell without going there its rough. And I had blood transfusions and everything and it stayed gone that time it went in remission it stayed gone probably about 3 years."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "And when it come back the third time he said there's nothing, even I can experiment with you this time it's between you and God. And he said we gone call your family in again he said I don't know what to tell you, but its been nice working with you."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "He said you always had a smile on your face he said you've been a fighter. So about- during that time one of my goals was become a hospice volunteer. I was a hospice patient and just to be able to give back to other people. The love and respect and dignity that they showed me when I was dying I said that's one of the things I gotta do while I'm here. And I can relate to the people that's got this type of disease because I've been through it."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "So that way I did that I made that happen and that last time I went through I called mom and I said look ma I ain't giving up I said I've been a fighter all my life I said but they said there ain't nothing else they can do for me. She said I'm on my way. Because she was a nurse and she took care of the whole family every time they get sick she is a nurse. And we went through that there and I guess about a year went by and I called the hospice lady in there I said look I said I think you need to send me back to Baton Rouge."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "I said I need some tests done. I said I really think I'm getting better instead of worse. And she said Tommy I don't think cancer goes away just like talking about she said but you've defied odds so many times she said she said we gone send you back. So they sent me back and I was supposed to take a CAT scan and I'm usually in and outta there in bout a hour"
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "The doctor he stayed there and he said man get comfortable we gone be here a while. I said what's going on? He says i'ma talk to you in a little bit. And he kept talking over my head and calling other doctors in I said doc I said you told me you'd never do that to me. I said sit down and explain to me what's going on he said just give me a few minutes. He said we're gone run one more test. I said alright. Well he ran another test so then he come in, he talk to me he said look I had to make sure."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "He said I ran so many tests today he said of the same test make sure I don't' have your records messed up with nobody else's record he said here's all the similarities he said so I know I don't have you your scans messed up he said this is you he said I can't only not find cancer he said I cant find scar tissue or nothing else."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:48",
      "upperBoundTime": "00:16:45",
      "content": "He said it looks like you just completely healed he said but I gotta find it. And I said doc wherever it's at leave it alone. I said let it alone. I said am I good to go? He said yeah i'ma see you every six months I said alright. So I came back it's a slow battle fighting back up after your body's been tore down that far and but I still have good days and bad days but way more good than bad. It's been a blessing so every day now is something to live for"
    },
    {
      "speaker": "Marcus",
      "time": "00:16:45",
      "upperBoundTime": "00:16:47",
      "content": "Yeah. So now you're cancer free?"
    },
    {
      "speaker": "Tommy",
      "time": "00:16:47",
      "upperBoundTime": "00:16:48",
      "content": "Cancer free."
    },
    {
      "speaker": "Marcus",
      "time": "00:16:48",
      "upperBoundTime": "00:16:52",
      "content": "That's remarkable."
    },
    {
      "speaker": "Tommy",
      "time": "00:16:52",
      "upperBoundTime": "00:17:32",
      "content": "Yep. And I guess one of the biggest changes that went through me during that time too is when you laying there with days and hours left to live you go ahead and face all your demons there. You leave them there. You don't bring em with you. And it's probably something I did laying on the deathbed but a lot of people even in what we call the free world today has not done and that's find peace within theirself and learn to live with peace. And until you find that to me I we just all walking around pretty much in darkness."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:32",
      "upperBoundTime": "00:17:33",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "Tommy",
      "time": "00:17:33",
      "upperBoundTime": "00:17:40",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:40",
      "upperBoundTime": "00:17:55",
      "content": "So would you say that your change your transformation is really closely tied to your experience with cancer?"
    },
    {
      "speaker": "Tommy",
      "time": "00:17:55",
      "upperBoundTime": "00:18:07",
      "content": "I say yes sir one of the biggest things growing up getting older and maturing learning studying reading."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:07",
      "upperBoundTime": "00:18:09",
      "content": "Do you still work with the hospice at all?"
    },
    {
      "speaker": "Tommy",
      "time": "00:18:09",
      "upperBoundTime": "00:19:10",
      "content": "I go from time to time and I spend a lot of time with my friends and stuff that's over there but during the 8 years that I did hospice work I probably held 140 hands while they took their last breath. And after a while it takes a toll on you especially when them personally and you're friends with them and you been here with them so long because guys here are more than just your neighbor or whatever they be they become your new family."
    },
    {
      "speaker": "Tommy",
      "time": "00:18:09",
      "upperBoundTime": "00:19:10",
      "content": "Because I mean they know us better than we know our family on the street we're here for each other when we're down we help each other up we keep each other up when we're down. So this is your family so we do have bonds with em and after a while it takes a toll so I just asked them to step back for a while and I finally just got out of it but now I just go back and I visit here and there and yonder"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:10",
      "upperBoundTime": "00:19:35",
      "content": "So you go from hearing that you've got a few days to live with a serious cancer diagnosis so maybe my question seems odd but after going through that how do you deal on a daily basis with the fact that you have a life sentence without the possibility for parole?"
    },
    {
      "speaker": "Tommy",
      "time": "00:19:35",
      "upperBoundTime": "00:20:29",
      "content": "One of the main things I said once I got convicted I mean I was mad enough that I took my charge I did the crime I tried not to complain about it cause back then I didn't understand what life and death and all that was."
    },
    {
      "speaker": "Tommy",
      "time": "00:19:35",
      "upperBoundTime": "00:20:29",
      "content": "As I grew up I started losing people that I loved through the hospice program learning the true meaning of life and everything. I realized the seriousness of what I had done. And to me no one or nothing can be harder on me than me. And I punished myself in my own way for what I did. But as far as just dealing with the life sentence in general I just take it day by day and try to keep a positive outlook. It's not over as long as I'm drawing breath I got a chance to get back out there to my family."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:29",
      "upperBoundTime": "00:20:40",
      "content": "Yeah. How do you make sense of rehabilitation? In the context of life without parole?"
    },
    {
      "speaker": "Tommy",
      "time": "00:20:40",
      "upperBoundTime": "00:22:04",
      "content": "When I first got here I never understood it. I said there should be no schools oughta be no programs ought to be nothing because they don't use it. What's the sense in rehabilitating us and giving us a trade and getting your GED or going to college or whatever if you're never going to give us a chance to reapply?"
    },
    {
      "speaker": "Tommy",
      "time": "00:20:40",
      "upperBoundTime": "00:22:04",
      "content": "So to me I felt like you oughta take everybody and put them in the field and just work us to death and bring us in let us shower and go to bed. And dudes like man that's crazy they said you just said you got hope I said yeah I said but way its going I said look you been here 50 years.. And I mean we still have the hope and wanna go and now understand why the programs are here because probably in the last couple years we've seen more people getting parole and pardons and stuff than we ever have since I've been here."
    },
    {
      "speaker": "Tommy",
      "time": "00:20:40",
      "upperBoundTime": "00:22:04",
      "content": "And it gives more and more people help and the ones that was straying outta line are getting back in line like I want my chance too. So everybody's getting in line and staying on board and they really pushing for their goals now."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:04",
      "upperBoundTime": "00:22:15",
      "content": "Some people I imagine just accept that they're never going to get out?"
    },
    {
      "speaker": "Tommy",
      "time": "00:22:15",
      "upperBoundTime": "00:22:17",
      "content": "Some people have given up."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:17",
      "upperBoundTime": "00:22:21",
      "content": "And how. How what are their lives like?"
    },
    {
      "speaker": "Tommy",
      "time": "00:22:21",
      "upperBoundTime": "00:23:21",
      "content": "To me misery loves company. When you see them coming go another way. I hate being around negative people because if you're around them long enough it will rub off. So I try to stay away from them. There's so many guys on earth involved in positive things I mean there's programs around here that are very good programs so we try to involve ourselves in that and you pretty much after a while you can spot the negative so you stay away from that area cause one thing it's going to lead to trouble."
    },
    {
      "speaker": "Tommy",
      "time": "00:22:21",
      "upperBoundTime": "00:23:21",
      "content": "So stay away from it stay with positive people and the way we are now is if one of us slip and fall there's always somebody there saying come on brother get back in line that's not us. That was us when we got here we through with that. Let's get back and straight. And that's how we all pretty much maintain now."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:21",
      "upperBoundTime": "00:23:27",
      "content": "Can you describe your typical day here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:23:27",
      "upperBoundTime": "00:24:48",
      "content": "Oh usually get up about 5 o'clock I got a little special room project I do a lot of special projects for the warden or governor whoever whatever kinda job comes up I do a lot of wood work and I get up I got a little puppy a little Australian shepherd and Chihuahua I get up and go feed him play with him probably about 5 or 6 in the morning I head out to work and mostly its bush or hauling stuff or go to the governor's mansion or guard or all over the state we do jobs all over the state we're working."
    },
    {
      "speaker": "Tommy",
      "time": "00:23:27",
      "upperBoundTime": "00:24:48",
      "content": "And sometimes we come back sometimes we'll stay gone a week or two at a time we'll pack bags and I didn't realize then kinda what of an honor it was to be on that work detail and one day one of the wardens stopped me and he said man he said you ought to feel privileged to be on this crew. I said why man you work us to death. He said outta 7000 inmates he said there's 40 of yall approved to go out that gate. He said that oughta tell you something about yourself. And after I sat down and thought about it I said that does it must it does make me feel good, so"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:48",
      "upperBoundTime": "00:24:52",
      "content": "Yeah you're one of the most trusted members of this community."
    },
    {
      "speaker": "Tommy",
      "time": "00:24:52",
      "upperBoundTime": "00:25:33",
      "content": "That and it means a lot and it it may not mean a lot to a lot of people but when people look at it and say that convict there you can trust him. He's a man of his word. It means a lot. Not just coming from an inmate or another fellow convict for security to say it too cause we still got our fences and our barriers."
    },
    {
      "speaker": "Tommy",
      "time": "00:24:52",
      "upperBoundTime": "00:25:33",
      "content": "And we try not to cross each others but when you working for the same guy for so many years it's hard to you gone build a relationship with security too. Now I don't mean go tell him every little thing you see and this and that but you build relationships with them too."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:33",
      "upperBoundTime": "00:25:34",
      "content": "I understand."
    },
    {
      "speaker": "Tommy",
      "time": "00:25:34",
      "upperBoundTime": "00:25:36",
      "content": "There's good on both sides of the fence."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:36",
      "upperBoundTime": "00:25:40",
      "content": "Yeah. What's the worst thing about being here, in prison?"
    },
    {
      "speaker": "Tommy",
      "time": "00:25:40",
      "upperBoundTime": "00:26:24",
      "content": "Believe it or not it's the little small things that everybody takes for granted. I mean that's what it is the most. Staying away from your family getting in your vehicle and just taking a ride eating what you want crawling around on the floor with some kids or just the little small things of life that we always take for granted it to me personally is one of the hardest things to get over."
    },
    {
      "speaker": "Tommy",
      "time": "00:25:40",
      "upperBoundTime": "00:26:24",
      "content": "It's not the big things I mean yes I love being with my family and this and that but just the little small things."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:24",
      "upperBoundTime": "00:26:28",
      "content": "Is there anything good about Angola?"
    },
    {
      "speaker": "Tommy",
      "time": "00:26:28",
      "upperBoundTime": "00:27:19",
      "content": "There are there is I mean like the reentry program they brought it in here it is a very good program it gives people another chance wish they'd had something like that for us when we was out there and they bring a lot of tours in we're able to speak to tours. And if you maybe touch or change one person out of maybe 100 or 1000 to me we did a good job."
    },
    {
      "speaker": "Tommy",
      "time": "00:26:28",
      "upperBoundTime": "00:27:19",
      "content": "If you keep one person from coming down the road that we've came I feel like we've done something we made a change and to some people it might be that one word from us that changes them. They may not listen to nobody else in the world. They may listen to what one of us have to say."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:19",
      "upperBoundTime": "00:27:37",
      "content": "Yeah. I know you'd mentioned the hospice program and I know that you're on all kinds of work details that takes you out for your- are there other organizations that you've dedicated your life to here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:27:37",
      "upperBoundTime": "00:27:59",
      "content": "We have dale Carnegie freedom through speech expression I'm involved in that probably or about 20 years now. AA alcohol anonymous, 12 step program. Louisiana juvenile young adult program. Those are the 3 main clubs that I'm affiliated with."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:59",
      "upperBoundTime": "00:28:02",
      "content": "What are you proudest of?"
    },
    {
      "speaker": "Tommy",
      "time": "00:28:02",
      "upperBoundTime": "00:28:05",
      "content": "Of being since I've been incarcerated?"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:05",
      "upperBoundTime": "00:28:08",
      "content": "What are you proudest of in your life?"
    },
    {
      "speaker": "Tommy",
      "time": "00:28:08",
      "upperBoundTime": "00:28:27",
      "content": "Getting my GED. Graduating from the hospice program. And basically just growing up. Not being a dumb kid any more."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:27",
      "upperBoundTime": "00:28:41",
      "content": "So this is a difficult question I'm not sure I can answer it myself but so you're in your own words you were a dumb kid."
    },
    {
      "speaker": "Tommy",
      "time": "00:28:41",
      "upperBoundTime": "00:28:45",
      "content": "Yes sir"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:45",
      "upperBoundTime": "00:28:46",
      "content": "And you took someone's life."
    },
    {
      "speaker": "Tommy",
      "time": "00:28:46",
      "upperBoundTime": "00:28:48",
      "content": "Yes sir"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:48",
      "upperBoundTime": "00:28:53",
      "content": "How much punishment is enough punishment?"
    },
    {
      "speaker": "Tommy",
      "time": "00:28:53",
      "upperBoundTime": "00:30:12",
      "content": "I ask myself that a lot. I personally I feel like everyone deserves a second chance. If you get that second chance and you mess it up then it's on you. But I feel like after a certain amount of time you look at what a man has done and there oughta be some type of mercy. Or not so much mercy as just a chance. Say, okay you've done this you've done this you've done this I believe you. But you can't fool the man that you work for every day. If I work for the same man for 20 years that man going to know me."
    },
    {
      "speaker": "Tommy",
      "time": "00:28:53",
      "upperBoundTime": "00:30:12",
      "content": "He's going to know me just like family knows me he's going to know when I'm having good days bad days he's going to know when I'm not feeling right he's going to know when I'm not looking right going to say what's wrong? You're not yourself today. You can't fool him because you been around him so long To me that's the people they oughta talk to for when you go up in front of parole or anything. Okay you've been working with that man for 20, okay tell me about him. Do you believe that he deserves another chance? Because it's hard to fool that man"
    },
    {
      "speaker": "Marcus",
      "time": "00:30:12",
      "upperBoundTime": "00:30:20",
      "content": "Yeah. Is life without parole appropriate for anyone?"
    },
    {
      "speaker": "Tommy",
      "time": "00:30:20",
      "upperBoundTime": "00:31:15",
      "content": "That's a rough one… I mean that's kind of a catch 22, I would say yeah. I believe there are certain instances that you should be locked up for the rest of your life and I mean that just goes to say that would I want some of the guys that's in here right now living to me living next door to me when I got out?"
    },
    {
      "speaker": "Tommy",
      "time": "00:30:20",
      "upperBoundTime": "00:31:15",
      "content": "No because I know them. The ones that's made changes and deserve it and they've shown better yeah I mean but there are some guys that you just don't want in your neighborhood. I mean its hard facts and it might go against what we trying to do but there's truth."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:15",
      "upperBoundTime": "00:31:33",
      "content": "So do you think that. I mean one of the things that I find confusing looking at it is that you have people who commit all kind of different offenses from being a principal to second degree to doing some of the worst things imaginable"
    },
    {
      "speaker": "Tommy",
      "time": "00:31:33",
      "upperBoundTime": "00:31:35",
      "content": "Right."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:35",
      "upperBoundTime": "00:31:50",
      "content": "All serving the same sentence. All being promised we're never going to look at you again. What I'm hearing you say is that it's not so much the crime you commit but rather whether you change or not that should determine whether or not you spend the rest of your life"
    },
    {
      "speaker": "Tommy",
      "time": "00:31:50",
      "upperBoundTime": "00:31:52",
      "content": "Whether you get a chance right."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:52",
      "upperBoundTime": "00:31:53",
      "content": "Okay."
    },
    {
      "speaker": "Tommy",
      "time": "00:31:53",
      "upperBoundTime": "00:32:47",
      "content": "Because if I was the same person right now that I was when I walked into that gate I'd tell you I straight up I don't want another chance. Because I haven't changed or anything. But if you come here and you make that personal change and you make the programs work for you and you really do rehabilitate yourself."
    },
    {
      "speaker": "Tommy",
      "time": "00:31:53",
      "upperBoundTime": "00:32:47",
      "content": "Because rehabilitation is only yourself they gone offer you the programs they not going to make you do em."
    },
    {
      "speaker": "Tommy",
      "time": "00:31:53",
      "upperBoundTime": "00:32:47",
      "content": "That's a personal choice you have to make. And if you make that choice to rehabilitate yourself they need to quit looking at what you done before you got here and start looking at it from the day you got convicted to now. Is he rehabilitated? The nature of our crime is never going to change. That's something we gotta live with the rest of our life. But what have we done since then? That's our decision."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:47",
      "upperBoundTime": "00:33:07",
      "content": "The Supreme Court guidelines recommendations for juvenile violent offenders who are serving a life sentence is to reduce it to 25 years before they become parole eligible. Does that seem like a reasonable starting place?"
    },
    {
      "speaker": "Tommy",
      "time": "00:33:07",
      "upperBoundTime": "00:34:00",
      "content": "It's hard to say. To me, 20, 25 years after a man has done that much time he's not the same person. I would say. Pretty much after 20 25 years everybody should look be looked at. That's not guarantee that they'll go or anything like that its just possibility. What has he done? Has he made the changes? Do you think he's ready? Everybody's not going to fit the criteria. Everybody that does fit it is not going to get out but at least there is that chance. And I really believe 20 25 years is shoulda been enough time."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:00",
      "upperBoundTime": "00:34:06",
      "content": "How long into your sentence did the kind of change happen did the light bulb go off?"
    },
    {
      "speaker": "Tommy",
      "time": "00:34:06",
      "upperBoundTime": "00:34:08",
      "content": "Mine?"
    },
    {
      "speaker": "Marcus",
      "time": "00:34:08",
      "upperBoundTime": "00:34:10",
      "content": "Yeah. How far were you in?"
    },
    {
      "speaker": "Tommy",
      "time": "00:34:10",
      "upperBoundTime": "00:34:13",
      "content": "Probably is."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:13",
      "upperBoundTime": "00:34:17",
      "content": "From the from the arrest"
    },
    {
      "speaker": "Tommy",
      "time": "00:34:17",
      "upperBoundTime": "00:34:28",
      "content": "Probably about 8 or 10 years. And I said I can't do it this way no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:28",
      "upperBoundTime": "00:34:31",
      "content": "That actually is the- something of a common theme."
    },
    {
      "speaker": "Tommy",
      "time": "00:34:31",
      "upperBoundTime": "00:35:39",
      "content": "It is it's like when you first get here it's like a transition. You going to be wild you going to fall in with this you going to fall in with that and you gone get write up after write up and disciplinary here and disciplinary there and then things after you adjust in start smoothing out. You understand which way to go ok I don't wanna go that way that was struggle I don't wanna go this way I'm not ready for that yet. I'm going to stay right in between them and see how this goes and then sooner or later ok I'm going all the way straight now."
    },
    {
      "speaker": "Tommy",
      "time": "00:34:31",
      "upperBoundTime": "00:35:39",
      "content": "So I mean it's just a transition period and most of the time after 10, 12 years everybody is done transitioned. And they're looking for the something better. They want to go they want another chance and they know the only way they going to get it is by getting in line doing the programs making a self change."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:39",
      "upperBoundTime": "00:35:41",
      "content": "What are your goals for the future?"
    },
    {
      "speaker": "Tommy",
      "time": "00:35:41",
      "upperBoundTime": "00:36:05",
      "content": "If I was to get out tomorrow. A good job or a decent job spend time with my family meet a nice girl and do some kind of volunteer work with cancer patients young and old."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:05",
      "upperBoundTime": "00:36:13",
      "content": "If you don't get out soon what are your goals for the future?"
    },
    {
      "speaker": "Tommy",
      "time": "00:36:13",
      "upperBoundTime": "00:36:48",
      "content": "Pretty much as I'm doing now. Help the ones I can be kind of like a role model to the younger guys that's coming in and talk with them. Stay doing little hospice work and my woodworking crafts and stuff like that right there and just keep struggling for that chance and that way if it does happen I can say hey I'm ready."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:48",
      "upperBoundTime": "00:37:24",
      "content": "When I'm talking to guys about this about trying to understand the reality of living with a life without parole sentence in the context where they can so clearly see themselves as different human beings than the human being that came here I want to make sure I'm not missing an important question. Is there a question that I should have asked you that I didn't ask something you want people to know about this experience? That I didn't give you the chance to talk about"
    },
    {
      "speaker": "Tommy",
      "time": "00:37:24",
      "upperBoundTime": "00:38:38",
      "content": "Don't come experience it for yourself. Stay out. I guess the biggest thing I that any of us could do is I mean mostly all of us was in a spur of a moment thing. If we'd had the time to stop or really think about it or I don't know I guess peer pressure or something that just be man enough or stand on your own two feet at all time it's hard to do when you're a kid the biggest point in my life where I started going wrong is when I stopped listening to mom and dad."
    },
    {
      "speaker": "Tommy",
      "time": "00:37:24",
      "upperBoundTime": "00:38:38",
      "content": "When you go through them teenage years and it all? That's where I messed up. As a kid I had no worries. I mean I had nothing and I was like when I quit listening to them and said ok I can do this on my own I'm a big boy now it got messed up. It really did. Take the time and enjoy life."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:38",
      "upperBoundTime": "00:38:41",
      "content": "Yeah it's hard to persuade an impulsive kid."
    },
    {
      "speaker": "Tommy",
      "time": "00:38:41",
      "upperBoundTime": "00:38:47",
      "content": "Oh yeah"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:47",
      "content": "Oh yeah. I think we're good. Thank you so much Tommy."
    }
  ]
}
