{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:01",
      "content": "Tommy Cage Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:01",
      "upperBoundTime": "00:00:16",
      "content": "My name is tommy cage. I was convicted of first degree murder I have done I have served so far 31 years on this charged"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:16",
      "upperBoundTime": "00:00:18",
      "content": "How old were you when you were arrested"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:18",
      "upperBoundTime": "00:00:21",
      "content": "I was 19"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:21",
      "upperBoundTime": "00:00:39",
      "content": "So I am going to ask you some questions about your time before that and then obviously I want to ask you some questions about what you been up to for the last 30 odd years since you been here I want to get to know a little bit about your childhood and about you being raised. Were you raised in New Orleans?"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:39",
      "upperBoundTime": "00:00:40",
      "content": "Yes sir"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:40",
      "upperBoundTime": "00:00:46",
      "content": "Ok so tell me a little bit about the folks who raised you"
    },
    {
      "speaker": "Tommy",
      "time": "00:00:46",
      "upperBoundTime": "00:01:30",
      "content": "Well I was raised by practically by my mother and let's say my oldest sister. But she did everything- I come from a [inaudible] [00:00:57] family. My mother did everything she probably could to raise me right she basically raised me without a male focus in the home so like I- so my mother and my older sister they were the two that's raised me from a kid she basically did everything a mother could do to try to basically keep me out of trouble make sure I went to school and make sure I had everything that I needed but as a kid coming up"
    },
    {
      "speaker": "Marcus",
      "time": "00:01:30",
      "upperBoundTime": "00:01:31",
      "content": "Where did you live?"
    },
    {
      "speaker": "Tommy",
      "time": "00:01:31",
      "upperBoundTime": "00:01:36",
      "content": "Where I was living at? We were in New Orleans in the ninth ward in the New Orleans area"
    },
    {
      "speaker": "Marcus",
      "time": "00:01:36",
      "upperBoundTime": "00:01:44",
      "content": "Ok was your home a peaceful place or was there a lot of fighting in the home?"
    },
    {
      "speaker": "Tommy",
      "time": "00:01:44",
      "upperBoundTime": "00:01:55",
      "content": "Well sometimes you had fights in my house but most of the time maybe it was peaceful. We got along pretty good"
    },
    {
      "speaker": "Marcus",
      "time": "00:01:55",
      "upperBoundTime": "00:01:57",
      "content": "What about school"
    },
    {
      "speaker": "Tommy",
      "time": "00:01:57",
      "upperBoundTime": "00:02:07",
      "content": "School was ok. School was ok coming up as a kid school was great."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:07",
      "upperBoundTime": "00:02:10",
      "content": "What was the what did you like about it"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:10",
      "upperBoundTime": "00:02:30",
      "content": "Well getting the chance to really try to learn learned a lot of the things that I needed to learn in life coming up as a kid getting to meet other people getting to communicate with other people that you didn't that didn't stay around the area that you grew up in."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:30",
      "upperBoundTime": "00:02:31",
      "content": "Sure which school did you go to?"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:31",
      "upperBoundTime": "00:02:36",
      "content": "I went to George Washington Carver elementary."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:36",
      "upperBoundTime": "00:02:40",
      "content": "Okay, what was the highest year of school that you completed?"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:40",
      "upperBoundTime": "00:02:42",
      "content": "11th grade."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:42",
      "upperBoundTime": "00:02:44",
      "content": "Okay why did you stop?"
    },
    {
      "speaker": "Tommy",
      "time": "00:02:44",
      "upperBoundTime": "00:02:55",
      "content": "Well I got I guess I lost focus and went to getting off into a lot of different things and really just lost focus about school"
    },
    {
      "speaker": "Marcus",
      "time": "00:02:55",
      "upperBoundTime": "00:03:12",
      "content": "Alright so I want to try to get a little bit of a better picture I'm familiar with the ninth ward so if I'm standing on the stoop of your front door were you still living in in that house when you were arrested?"
    },
    {
      "speaker": "Tommy",
      "time": "00:03:12",
      "upperBoundTime": "00:03:14",
      "content": "Yes I was."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:14",
      "upperBoundTime": "00:03:27",
      "content": "Ok so let's go back to that 18 year old tommy cage sitting there if I'm sitting right next to you looking out into the neighborhood what am I hearing, smelling, seeing."
    },
    {
      "speaker": "Tommy",
      "time": "00:03:27",
      "upperBoundTime": "00:03:55",
      "content": "Well you probably see a lot of a lot of people kids playing football several activities sports activities you'd probably see you might see a lot of people probably sitting on the outside of their porches listens to music you might smell smoke actually all different kinds of smoke."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:55",
      "upperBoundTime": "00:04:00",
      "content": "Was it relatively peaceful or was there a lot of fighting and carrying on going on in the neighborhood too."
    },
    {
      "speaker": "Tommy",
      "time": "00:04:00",
      "upperBoundTime": "00:04:21",
      "content": "Well when I was younger it was pretty much people you'd hear fights every night and you might see fights but it wasn't like when I got older you started to see more it's getting the areas getting worse or more fights and stuff like that things of that nature."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:21",
      "upperBoundTime": "00:04:28",
      "content": "Let me ask you something why did you feel the need to have a weapon?"
    },
    {
      "speaker": "Tommy",
      "time": "00:04:28",
      "upperBoundTime": "00:05:00",
      "content": "Well as I got older a lot of people was I guess I was doing a lot of more hanging out with going to different clubs or just trying to have a good time and the older I got the worse it got the neighborhood. So most people are going to feel like they need to carry some type of weapon some form of weapon but if you didn't and you get caught without a weapon you never know what might happen so most people they might feel the need to carry a weapon"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:00",
      "upperBoundTime": "00:05:06",
      "content": "Okay do you remember the first time you ever got arrested?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:06",
      "upperBoundTime": "00:05:14",
      "content": "The first time I ever got arrested? I guess probably 10 or 11 probably years old 10 or 11"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:14",
      "upperBoundTime": "00:05:16",
      "content": "What was that about?"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:16",
      "upperBoundTime": "00:05:53",
      "content": "So it was some kind of we was I guess it's it had a situation in the neighborhood where people would come and collect cans and stuff like that and a few people I was hanging out with they was stealing something out the office and I guess the person that was in the offices was doing the work she recognized me as one of the faces being with the crowd of people that I was with so I was arrested with them"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:53",
      "upperBoundTime": "00:05:57",
      "content": "Oh. What about other brushes with the law after that"
    },
    {
      "speaker": "Tommy",
      "time": "00:05:57",
      "upperBoundTime": "00:06:57",
      "content": "Yeah as I got older I had a few other brushes with the law far as hanging out with the wrong type of people and just went all different types of little sprees like little out the store and few other times I probably got arrested but basically for the same thing."
    },
    {
      "speaker": "Tommy",
      "time": "00:05:57",
      "upperBoundTime": "00:06:57",
      "content": "And I guess me hanging with those type of people it just led me the wrong way I just continued to just do the same things they did just I mean a lot of times we'd do things just to fit in and thinking that we need those type of friends and not knowing any better and over the period of years once you realize that it wasn't your friends at all it be too late. They got you in a heap of trouble that you can't get out of"
    },
    {
      "speaker": "Marcus",
      "time": "00:06:57",
      "upperBoundTime": "00:07:08",
      "content": "Inside the home is it fair and accurate to say that you grew up in a loving nurturing home where you knew that there were adults who cared for you?"
    },
    {
      "speaker": "Tommy",
      "time": "00:07:08",
      "upperBoundTime": "00:07:30",
      "content": "Yes I can. I can honestly say they did my family did care about my, I can honestly say my family cared about and we loved each other. I grew up in a nurturing and loving home but like I said sometimes we have disagreements family have disagreements but that don't mean we don't care or love each other so I can honestly say I grew up in a home that I was cared about"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:30",
      "upperBoundTime": "00:07:34",
      "content": "What about a best friend did you have somebody you were particularly close to outside?"
    },
    {
      "speaker": "Tommy",
      "time": "00:07:34",
      "upperBoundTime": "00:07:36",
      "content": "Somebody I was particularly close to outside my family?"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:36",
      "upperBoundTime": "00:07:39",
      "content": "Yeah."
    },
    {
      "speaker": "Tommy",
      "time": "00:07:39",
      "upperBoundTime": "00:08:05",
      "content": "Yeah, a couple of people I was kind of close to grew up in school went to school with but after a period of years we kind of like grew apart not far as not wanting to hang out or nothing like that but some would move have a tendency to move out cause like I said it was the projects that I grew up in so some people as they get older they go to move in different places so like that"
    },
    {
      "speaker": "Marcus",
      "time": "00:08:05",
      "upperBoundTime": "00:08:06",
      "content": "What was the project name?"
    },
    {
      "speaker": "Tommy",
      "time": "00:08:06",
      "upperBoundTime": "00:08:07",
      "content": "Desire project."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:07",
      "upperBoundTime": "00:08:09",
      "content": "Right thought so."
    },
    {
      "speaker": "Tommy",
      "time": "00:08:09",
      "upperBoundTime": "00:08:14",
      "content": "It's a literally got two different projects and canal split between desire and Florida projects."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:14",
      "upperBoundTime": "00:08:16",
      "content": "Yeah they're no longer there."
    },
    {
      "speaker": "Tommy",
      "time": "00:08:16",
      "upperBoundTime": "00:08:26",
      "content": "Yeah I know. And it's probably a good thing too."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:26",
      "upperBoundTime": "00:08:39",
      "content": "Yeah. So I from what you've said is it fair to say that before this particular charge that you're serving this life sentence for it would it be fair to say that your life had gone down the wrong road"
    },
    {
      "speaker": "Tommy",
      "time": "00:08:39",
      "upperBoundTime": "00:08:41",
      "content": "Yes most definitely."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:41",
      "upperBoundTime": "00:08:43",
      "content": "Ok were drugs and alcohol part of your life at that point?"
    },
    {
      "speaker": "Tommy",
      "time": "00:08:43",
      "upperBoundTime": "00:09:21",
      "content": "Yes it was. Yes it was not at first but as I guess I got older you some weird reason some people have a tendency of wanting to try different things wanting to experiment different things I would say not just out of peer pressure but some people just there's a, those want to experience different things in life and once you tried it you might get addicted to it and some people luckily don't get addicted to it just don't like it and just get away from it?"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:21",
      "upperBoundTime": "00:09:23",
      "content": "What were you addicted to?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:23",
      "upperBoundTime": "00:09:33",
      "content": "I was addicted to a really marijuana really that was our choice of drugs really coming up going up growing up as a kid."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:33",
      "upperBoundTime": "00:09:38",
      "content": "Sure did you find yourself dealing drugs?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:38",
      "upperBoundTime": "00:09:41",
      "content": "Yeah I have a few times I have yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:41",
      "upperBoundTime": "00:09:44",
      "content": "Is that how you were primarily supporting yourself at the time of this charge?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:44",
      "upperBoundTime": "00:09:48",
      "content": "Yes yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:48",
      "upperBoundTime": "00:09:49",
      "content": "Ok were you ever kicked out of school?"
    },
    {
      "speaker": "Tommy",
      "time": "00:09:49",
      "upperBoundTime": "00:09:58",
      "content": "Yeah one time I got kicked out of school out of elementary school when I was like I guess probably maybe 7,8 yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:58",
      "upperBoundTime": "00:10:00",
      "content": "Ok what was that about?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:00",
      "upperBoundTime": "00:10:00",
      "content": "Being hard headed. Not wanting to listen not wanting to listen"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:00",
      "upperBoundTime": "00:10:06",
      "content": "Ok what about intimate relationships?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:06",
      "upperBoundTime": "00:10:15",
      "content": "Intimate relationships? I had a few girlfriends. Yeah a few girlfriends"
    },
    {
      "speaker": "Marcus",
      "time": "00:10:15",
      "upperBoundTime": "00:10:17",
      "content": "You have any children?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:17",
      "upperBoundTime": "00:10:20",
      "content": "No kids. No kids no."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:20",
      "upperBoundTime": "00:10:37",
      "content": "Okay, so if you had to summarize one factor that led you to the place that you're on that particular charge what would it be?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:37",
      "upperBoundTime": "00:10:48",
      "content": "Not taking advice from my mother. Not taking advice from my mom. If I'd took at least half of the advice that my mother give me as a kid I probably wouldn't be here."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:48",
      "upperBoundTime": "00:10:53",
      "content": "Yeah. Yeah who visits you here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:10:53",
      "upperBoundTime": "00:11:06",
      "content": "my oldest sister her husband I have a nephew a brother and a niece that normally come visit me. Them 4 or 5."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:06",
      "upperBoundTime": "00:11:08",
      "content": "Ok what about your mom."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:08",
      "upperBoundTime": "00:11:14",
      "content": "My mom was deceased in 2013 Alzheimer's."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:14",
      "upperBoundTime": "00:11:15",
      "content": "Sorry."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:15",
      "upperBoundTime": "00:11:16",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:16",
      "upperBoundTime": "00:11:20",
      "content": "Can you tell me do remember the last time you saw her?"
    },
    {
      "speaker": "Tommy",
      "time": "00:11:20",
      "upperBoundTime": "00:11:27",
      "content": "The last time I seen my mom, 2012."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:27",
      "upperBoundTime": "00:11:30",
      "content": "Can you tell me about that?"
    },
    {
      "speaker": "Tommy",
      "time": "00:11:30",
      "upperBoundTime": "00:13:23",
      "content": "As she come see me in 2012, I was like at this time I hadn't seen her maybe it was like a 3 years I guess yeah but the last time I seen her 2012 and it was a wonderful visit and man she talks to me like I can tell that something was wrong with her because she was just set there like she didn't recognize me."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:30",
      "upperBoundTime": "00:13:23",
      "content": "And after a while she would kind of like talk to me ask me how I'm doing and when I'm coming home and things of that nature and it was like it really was real emotional to me not to not to be able to tell my mom when I was going to be able to come home or something things like that but the following year 2013, I didn't know because all of us have to go one way."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:30",
      "upperBoundTime": "00:13:23",
      "content": "Some day we have to go we can't stay here I know that but just losing her like that being in here it kind of like really just took a toll on me and right now today I just still can't believe that she's it's still hurts. It really have took a toll on me losing her like that but after a while I realized that it's she in a better place because me being here over the number of years that I've been here I know it took a toll on her too."
    },
    {
      "speaker": "Tommy",
      "time": "00:11:30",
      "upperBoundTime": "00:13:23",
      "content": "That's why she always comes and asks me when I'm coming home that's, that's common for her to ask those type of questions because she's really concerned and I always used to tell her don't worry I mean you got my back at all times so"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:23",
      "upperBoundTime": "00:13:30",
      "content": "I understand that I do understand that it's particularly difficult to deal with family members passing on when you're in here"
    },
    {
      "speaker": "Tommy",
      "time": "00:13:30",
      "upperBoundTime": "00:13:32",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:32",
      "upperBoundTime": "00:13:33",
      "content": "Were you able to go to her funeral?"
    },
    {
      "speaker": "Tommy",
      "time": "00:13:33",
      "upperBoundTime": "00:14:05",
      "content": "Yeah I was blessed to go to her funeral I was blessed to go to her funeral and I was so tore up I couldn't stop crying at all knowing that then after a while like I said after a while I realized she was going in a better place but then after a few I guess after a few weeks or so man but I realized I mean those things happen."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:05",
      "upperBoundTime": "00:14:06",
      "content": "Yeah sure"
    },
    {
      "speaker": "Tommy",
      "time": "00:14:06",
      "upperBoundTime": "00:14:16",
      "content": "Those things does happen and it just [inaudible] [00:14:07]but."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:16",
      "upperBoundTime": "00:14:19",
      "content": "Sure were you ever abused as a kid?"
    },
    {
      "speaker": "Tommy",
      "time": "00:14:19",
      "upperBoundTime": "00:14:22",
      "content": "Abused no not that I know of not that I know of."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:22",
      "upperBoundTime": "00:15:00",
      "content": "Okay good. So one of the reasons that we wanted to talk with you is that you were identified and widely regarded as a trusted member of the community who's you now you've been here for 3 decades you have rehabilitated and I wanted to talk with you about that transformation right? But first can you think back to the tommy cage who was brought here to Angola"
    },
    {
      "speaker": "Tommy",
      "time": "00:15:00",
      "upperBoundTime": "00:15:01",
      "content": "Wow."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:01",
      "upperBoundTime": "00:15:04",
      "content": "It was a 19 did you spend some time in the parish before you came here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:15:04",
      "upperBoundTime": "00:15:05",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:05",
      "upperBoundTime": "00:15:10",
      "content": "So how old were you when you came through those gates?"
    },
    {
      "speaker": "Tommy",
      "time": "00:15:10",
      "upperBoundTime": "00:15:12",
      "content": "I probably 22 probably."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:12",
      "upperBoundTime": "00:15:15",
      "content": "Ok what was the parish like?"
    },
    {
      "speaker": "Tommy",
      "time": "00:15:15",
      "upperBoundTime": "00:16:09",
      "content": "The parish kind of its kind of rough in the parish because the parish is now Its like it's really a tore up all the when as is cause whatever cause whatever's outside the building you got to shove it inside the building that's how tough the parish was only in the parish was all the winters and stuff."
    },
    {
      "speaker": "Tommy",
      "time": "00:15:15",
      "upperBoundTime": "00:16:09",
      "content": "None of the wardens was working I mean you had, it was just totally different the heaters you had one of them I guess it had heaters in the inside this inside the cell and you really couldn't get too close to the heaters cause if you didn't know what you was doing you could basically it would blow up in the in the cell that's how worse the parish was"
    },
    {
      "speaker": "Marcus",
      "time": "00:16:09",
      "upperBoundTime": "00:16:14",
      "content": "Yeah. Were you worried for your safety the first time you were in there?"
    },
    {
      "speaker": "Tommy",
      "time": "00:16:14",
      "upperBoundTime": "00:17:03",
      "content": "Really I kind of didn't know what to expect but at the same time I tried to not to mingle with anybody and try to respect everybody and give them they space or whatever but the parish was worser then than it is now. But it probably flipped but"
    },
    {
      "speaker": "Tommy",
      "time": "00:16:14",
      "upperBoundTime": "00:17:03",
      "content": "I guess in so many ways by me being young like I was and you have all different types of person from all different types of reason so you meeting all these different type of personalities so you really have to be constant with what you doing or who you talking to no matter what you in there for or what you accused of being there for you really have to watch who you talk to watch the people you hang out with."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:03",
      "upperBoundTime": "00:17:07",
      "content": "Was Angola like that too?"
    },
    {
      "speaker": "Tommy",
      "time": "00:17:07",
      "upperBoundTime": "00:17:13",
      "content": "Yeah very much when I first came here very much."
    },
    {
      "speaker": "Marcus",
      "time": "00:17:13",
      "upperBoundTime": "00:17:18",
      "content": "So describe tommy cage coming through the gates there what kind of person is that?"
    },
    {
      "speaker": "Tommy",
      "time": "00:17:18",
      "upperBoundTime": "00:19:22",
      "content": "The guy that I was then coming up here I was like my mind was pretty much like made up I'm not taking no BS I'm straight up cause I heard so much about Angola and now my mind was like my mentality was like first one is the first one to get it that's what my mentality was but after a while I'm kind of like just stay to yourself don't get off into alternate type of Angola stuff type stuff hanging out with the wrong people just try to do what you need to do to try to get yourself out work on your case whatever things of that nature."
    },
    {
      "speaker": "Tommy",
      "time": "00:17:18",
      "upperBoundTime": "00:19:22",
      "content": "That's how I was when I first came Angola have, even then and now Angola have a way of if you don't know how to think have a way of pulling you in and taking you the wrong way its life if you, a wave if you a surfer on the wave and if you don't know what you doing it can kind of like pull you clean under so you have to know how. to think and decide what you want to do in life."
    },
    {
      "speaker": "Tommy",
      "time": "00:17:18",
      "upperBoundTime": "00:19:22",
      "content": "Or what it's like coming to school like you coming to Angola any type of activities you want to be involved in you have to choose the right one it could easily just take you sideways and just be stuck in that cycle a long period of time just being cycle and don't realize you in the cycle just going the opposite way."
    },
    {
      "speaker": "Tommy",
      "time": "00:17:18",
      "upperBoundTime": "00:19:22",
      "content": "No way you supposed to be going so you have to realize that if you make that decision in life let it be a good one let it be something positive something you talk to somebody you giving advice and be something positive because you either get caught up in taking backwards instead of forwards."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:22",
      "upperBoundTime": "00:19:28",
      "content": "Yeah. What was your typical day like what was your typical routine when you first got here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:19:28",
      "upperBoundTime": "00:20:15",
      "content": "When I first got here I tried to map out my day far as whatever I had to do whatever job I had I had it signed back to wherever make sure my job is completed so I don't don't nobody have to tell me to do the job twice."
    },
    {
      "speaker": "Tommy",
      "time": "00:19:28",
      "upperBoundTime": "00:20:15",
      "content": "After my job is completed I usually probably go work out read, try to do something to occupy my mind because sometimes it could get pretty boring and being bored you can get caught up in the wrong different things because you don't have nothing mapped out or planned so I always tried to do something that could occupy my mind and just stay out of everybody else way"
    },
    {
      "speaker": "Marcus",
      "time": "00:20:15",
      "upperBoundTime": "00:20:19",
      "content": "Right. What's your disciplinary record been like since you've been here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:20:19",
      "upperBoundTime": "00:21:11",
      "content": "Kind of wild. I have had some run ins with security when I first came that I mean I'm like pretty wild so after a while I kind of settled down doing those type of things because it just hinders me from accomplishing my goal."
    },
    {
      "speaker": "Tommy",
      "time": "00:20:19",
      "upperBoundTime": "00:21:11",
      "content": "So after a while I kind of calmed down after a few years I calmed down a lot and so security often probably see me say well this good say he's not one particular he's not here he don't work here no more he said man it's good."
    },
    {
      "speaker": "Tommy",
      "time": "00:20:19",
      "upperBoundTime": "00:21:11",
      "content": "And said I'm proud of you he said, man I've seen you when you first came here you was kind of wild and now you've settled down seem like you do what you want. He used to always he was always telling me that he said man I'm glad you kind of calmed down."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:11",
      "upperBoundTime": "00:21:17",
      "content": "Yeah. So what do you think led you to calm down?"
    },
    {
      "speaker": "Tommy",
      "time": "00:21:17",
      "upperBoundTime": "00:21:43",
      "content": "Knowing that I had to change. Knowing I didn't like the person that I was. Cause I feel like if I come here and have the mentality stay with the mentality I came here with let's say god blessed me to get out of here and I leave with that same mentality it's either get killed or coming back so I took it on myself so I said I asked god to help me change because I couldn't do it myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:43",
      "upperBoundTime": "00:21:52",
      "content": "So how long into your sentence do you think that that change happened how many years into the sentence at Angola"
    },
    {
      "speaker": "Tommy",
      "time": "00:21:52",
      "upperBoundTime": "00:21:57",
      "content": "Probably too many probably at least 10 years probably 10 11 years after I first"
    },
    {
      "speaker": "Marcus",
      "time": "00:21:57",
      "upperBoundTime": "00:21:59",
      "content": "In your 30s"
    },
    {
      "speaker": "Tommy",
      "time": "00:21:59",
      "upperBoundTime": "00:22:05",
      "content": "Yeah in my 30s yeah yep in my 30s yep"
    },
    {
      "speaker": "Marcus",
      "time": "00:22:05",
      "upperBoundTime": "00:22:18",
      "content": "So let's say if you do get a chance to get out of here so if you do come up for pardon board parole board. What would you tell them?"
    },
    {
      "speaker": "Tommy",
      "time": "00:22:18",
      "upperBoundTime": "00:24:01",
      "content": "Well for one thing I would like them to know that I'm not the same Tommy Cage that I was before I came. And this Tommy Cage he wants something outta life he want he tried to get with a lot of different people that he's seen that to be going down the same road that he was going down and be able to tell them that it's not good it's not good at all. Nothing good can come out of it, nothing at all good is going to come out of it. so take that chance that you have now while you still on the other side of the wall and make the best for it make the best of it."
    },
    {
      "speaker": "Tommy",
      "time": "00:22:18",
      "upperBoundTime": "00:24:01",
      "content": "Meaning accomplish all the goals that you want to meet in life and while you're on the side try to tell people try to get with people that is doing the same thing you doing before that doors even open take the time try to just let them know going down the wrong road either you going to end up one or the other dead or in prison for the rest of their life. And neither one of them good."
    },
    {
      "speaker": "Tommy",
      "time": "00:22:18",
      "upperBoundTime": "00:24:01",
      "content": "Try to get with some kids they don't even necessarily have to be kids I mean you have a lot of grown people that get off into the wrong things and if you can reach them I mean at least try to reach them at least you can say you tried and that's what the difference between this Tommy Cage and the Tommy Cage I used to be, I wasn't trying to reach nobody I wasn't concerned about nobody coming here and making the wrong choices but like now I am."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:01",
      "upperBoundTime": "00:24:10",
      "content": "So can you describe your typical day now I know you had when you started here you had a job you probably still have a job what's your routine."
    },
    {
      "speaker": "Tommy",
      "time": "00:24:10",
      "upperBoundTime": "00:24:20",
      "content": "My routine now? My routine now on the days I work I usually do what I have to do as far as my job is concerned."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:20",
      "upperBoundTime": "00:24:21",
      "content": "What is that?"
    },
    {
      "speaker": "Tommy",
      "time": "00:24:21",
      "upperBoundTime": "00:24:22",
      "content": "I work in the hospital."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:22",
      "upperBoundTime": "00:24:25",
      "content": "Okay."
    },
    {
      "speaker": "Tommy",
      "time": "00:24:25",
      "upperBoundTime": "00:24:47",
      "content": "Normally I go in the ward and see certain people in the wards ward 1, ward 2 whichever one I prefer that day cause I try to switch up by going ward one today and tomorrow I might have go in ward 2 talk to a lot of different people cause you have on ward 2 you have terminally ill patients in ward 2 in the hospital"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:47",
      "upperBoundTime": "00:24:49",
      "content": "In the hospice?"
    },
    {
      "speaker": "Tommy",
      "time": "00:24:49",
      "upperBoundTime": "00:25:49",
      "content": "The hospice program and I always try to at least take some time out do the job on my on a break because I work in the kitchen area but I always goes on the ward and talk to all the different people and at least talk to them because a lot of people just because they don't seem like they don't want to talk, that don't mean they don't want to talk. They're just in a position where a lot of people don't talk to them."
    },
    {
      "speaker": "Tommy",
      "time": "00:24:49",
      "upperBoundTime": "00:25:49",
      "content": "So I always go to try to talk to them to help the guys, bathe them and do the certain things that they can't do for themself and it really had me on an emotional rollercoaster when I always go there because I hate to see them in that position. And I feel like if I was excuse me."
    },
    {
      "speaker": "Marcus",
      "time": "00:25:49",
      "upperBoundTime": "00:25:50",
      "content": "Take your time"
    },
    {
      "speaker": "Tommy",
      "time": "00:25:50",
      "upperBoundTime": "00:26:14",
      "content": "If I was in their position I would want somebody to care for me. Being in that position, I just try to go talk to them."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:14",
      "upperBoundTime": "00:26:18",
      "content": "So you were with the hospice program you're officially a volunteer there."
    },
    {
      "speaker": "Tommy",
      "time": "00:26:18",
      "upperBoundTime": "00:26:27",
      "content": "Well I started off doing hospice work but I first went there but my assigned job was in the kitchen."
    },
    {
      "speaker": "Marcus",
      "time": "00:26:27",
      "upperBoundTime": "00:26:29",
      "content": "Okay all right."
    },
    {
      "speaker": "Tommy",
      "time": "00:26:29",
      "upperBoundTime": "00:27:10",
      "content": "But by me being able to get familiar with it needed to be done someone needed to be fed like I said someone need to be bathed and things of that nature or changed. And I tried to and it's hard to hold your emotions back seeing those people like that."
    },
    {
      "speaker": "Tommy",
      "time": "00:26:29",
      "upperBoundTime": "00:27:10",
      "content": "Not just because they're in prison but just seeing people like that in general I did and it was it's one of those type of jobs that I wouldn't mind having that type of job on the street because those people need somebody to care for them too"
    },
    {
      "speaker": "Marcus",
      "time": "00:27:10",
      "upperBoundTime": "00:27:12",
      "content": "I think it takes a very special person to do hospice work"
    },
    {
      "speaker": "Tommy",
      "time": "00:27:12",
      "upperBoundTime": "00:28:42",
      "content": "Yes it's a job that everybody can't do that job because not everybody's cut out for that type of work just seeing it and knowing that you what you might have to do kind of like push it back not being afraid to do it but just not having many that can't handle it just seeing them in that position so I try to whenever go holler to talk to a few of them. Outside the job have to do in the kitchen. I don't know just going through the experience"
    },
    {
      "speaker": "Tommy",
      "time": "00:27:12",
      "upperBoundTime": "00:28:42",
      "content": "I knew everybody can't have that type of job but so I try to somebody have to do it like I said everybody's not cut out for doing it but somebody have to do it and they have guys over there that care about them and do what they need to do to help them keep they day going cause basically most of them you can't really be do it."
    },
    {
      "speaker": "Tommy",
      "time": "00:27:12",
      "upperBoundTime": "00:28:42",
      "content": "But later because you got paralyzed guys that can't really do nothing for thyself you got to bathe them and feed them and change them and stuff like that. They you have the type of guys that you have to feed them and you have to feed them they can't really use none of their hands and some of the guys that might want to go outside from time to time you might have to put them in a wheelchair and roll them outside."
    },
    {
      "speaker": "Marcus",
      "time": "00:28:42",
      "upperBoundTime": "00:28:43",
      "content": "Sure. Yeah takes a lot of compassion"
    },
    {
      "speaker": "Tommy",
      "time": "00:28:43",
      "upperBoundTime": "00:28:55",
      "content": "Yeah it does it does me seeing that I'm glad I got that experience because it help you refocus that you realize that you think you have it bad,"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:55",
      "upperBoundTime": "00:28:56",
      "content": "Yeah,"
    },
    {
      "speaker": "Tommy",
      "time": "00:28:56",
      "upperBoundTime": "00:29:11",
      "content": "You have some people worse so you have to thank god every day that you you're being able to do what you do It help somebody."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:11",
      "upperBoundTime": "00:29:30",
      "content": "Tommy I'm going to this is a kind of difficult question there are there must be times when you're trying to keep hope alive that you might get out of here."
    },
    {
      "speaker": "Tommy",
      "time": "00:29:30",
      "upperBoundTime": "00:29:31",
      "content": "Oh yeah yes indeed."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:31",
      "upperBoundTime": "00:29:39",
      "content": "But having said that you surely have thought about the possibility that you may never leave here."
    },
    {
      "speaker": "Tommy",
      "time": "00:29:39",
      "upperBoundTime": "00:29:41",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:41",
      "upperBoundTime": "00:29:49",
      "content": "And it's hard for me to wrap my head around life without parole to be honest with you how do you how do you deal with that how do you make sense of that?"
    },
    {
      "speaker": "Tommy",
      "time": "00:29:49",
      "upperBoundTime": "00:30:33",
      "content": "Well at one time I used to kind of like mentally bug out about that and then at the same time I just pray and just give it to him because I already know that what's impossible to us is always possible to him and so I just pray and just give it to him."
    },
    {
      "speaker": "Tommy",
      "time": "00:29:49",
      "upperBoundTime": "00:30:33",
      "content": "Let him have it he said cast all our burdens to him so I just pray and just give it to him. I feel always my prayers has always been this for the last 4 or 5 years if he's ready for me then I'm ready and whenever gods ready I'm ready so outside of that I mean I just constantly just pray and just give it to him?"
    },
    {
      "speaker": "Marcus",
      "time": "00:30:33",
      "upperBoundTime": "00:30:38",
      "content": "Sure good. Are you active with other organizations so I see you got your job and you do work with hospice are there other things"
    },
    {
      "speaker": "Tommy",
      "time": "00:30:38",
      "upperBoundTime": "00:31:47",
      "content": "Yes I go to church on the regular I'm a member of this church called this club called the philanthropy club and it's a good club because it reaches out not just to the members but to each individual that want to be reached that want to be reached. And we talk to a lot of different people that a lot of invite a lot of people to come see movies and stuff, because we have good Christian movies on every last Thursday of the month."
    },
    {
      "speaker": "Tommy",
      "time": "00:30:38",
      "upperBoundTime": "00:31:47",
      "content": "We have Christian movies so it's an open call out to the house saying and then we have a matter of fact we had a call out tonight matter of fact we have a chaplain, he's really good guy he's been coming up here for I guess 35 years it's been yeah he's been there for a while so and I was kind of like man you to have that much spirit to come up here in Angola for 35 years some odd years yeah that's good."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:47",
      "upperBoundTime": "00:32:21",
      "content": "Let's talk about those 30 years a little bit. So when you look back on the crime and the victims perhaps the victim's family it's been 31 years and how I mean it's first of all it's so long ago and you've been punished every day for 31 years for it. How do you feel about it when you look back on that now?"
    },
    {
      "speaker": "Tommy",
      "time": "00:32:21",
      "upperBoundTime": "00:34:57",
      "content": "Well it's funny that you asked that because before you came in the room that's exactly what I was thinking about. Their family and its bad because it been so many years ago but I know 9 out of 10 it's probably still fresh in their minds because that's their still with the people, so and you can't blame them for how they feel."
    },
    {
      "speaker": "Tommy",
      "time": "00:32:21",
      "upperBoundTime": "00:34:57",
      "content": "I can't blame them for how they feel because it's like forgiveness is a hard thing for anybody especially when something like that happens it's real hard for them and then he or she still have to forgive each other and said let us be forgiven it's still hard to do and that is somebody I've been focusing on for a long period of time but once I have once I have asked him to forgive me then that meant I had to let it go."
    },
    {
      "speaker": "Tommy",
      "time": "00:32:21",
      "upperBoundTime": "00:34:57",
      "content": "I had to let it go. And it might be hard for those people to forgive me but once I asked god to forgive me I mean he tells me to let it go and that was a part of my journey that I am continuing and just try to make a positive impact on not just myself but on other people on everybody that I meet in general."
    },
    {
      "speaker": "Tommy",
      "time": "00:32:21",
      "upperBoundTime": "00:34:57",
      "content": "You have a lot of people knows- knew the Tommy Cage then, and people that know the tommy cage now and they could see the difference I always try to at least try to be a positive example of a person that been here a long time. And show them that if I can change you can too. You can too. If you really want to. If you want to some people don't want to change."
    },
    {
      "speaker": "Tommy",
      "time": "00:32:21",
      "upperBoundTime": "00:34:57",
      "content": "But if you really want to change you can but you can't do it by can't basically do it by yourself you got to have people and ask them to help you because it's impossible to do it by yourself. It's not going to happen."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:57",
      "upperBoundTime": "00:35:10",
      "content": "Are there certain things that prison administrators and security could do to help and encourage folks to turn their lives around?"
    },
    {
      "speaker": "Tommy",
      "time": "00:35:10",
      "upperBoundTime": "00:36:45",
      "content": "Outside of what they're doing now they can, we have a lot of different classes and stuff that they give but they can really they could get involved themselves because you have the people that's doing time that basically do the callouts security so they can get involved more they can get involved and let them know that it's not us against it's not us against y'all think it's you all think."
    },
    {
      "speaker": "Tommy",
      "time": "00:35:10",
      "upperBoundTime": "00:36:45",
      "content": "I would like to see you out and show them that you want to see that change by getting involved with what we get involved just being there not to necessarily take any tests that we take but just being involved being more involved letting them know it's just us against y'all thing it's we trying to get it to where y'all will realize that we want to see y'all home."
    },
    {
      "speaker": "Tommy",
      "time": "00:35:10",
      "upperBoundTime": "00:36:45",
      "content": "I mean them getting involved would let them guys know I mean it's a motivate to me it would motivate more guys to be like man security getting involved these people they just work here they don't live here like we do and that would yeah it would boost their confidence up high their confidence of being able to accomplish anything they want to accomplish in life it would go sky high. Just by seeing them doing just seeing that they care that we want to see y'all guys home."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:45",
      "upperBoundTime": "00:36:47",
      "content": "Sure."
    },
    {
      "speaker": "Tommy",
      "time": "00:36:47",
      "upperBoundTime": "00:36:50",
      "content": "We want to see y'all guys be able to do what y'all do go home and accomplish y'all goals."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:50",
      "upperBoundTime": "00:37:02",
      "content": "Yeah. This may be an odd question to ask somebody in prison but what is the worst part about being here?"
    },
    {
      "speaker": "Tommy",
      "time": "00:37:02",
      "upperBoundTime": "00:37:08",
      "content": "The worst part about being in prison, the worst part about being in prison to me is being separated from the loved ones."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:08",
      "upperBoundTime": "00:37:12",
      "content": "Yeah what about the best part about Angola?"
    },
    {
      "speaker": "Tommy",
      "time": "00:37:12",
      "upperBoundTime": "00:37:41",
      "content": "The best part about Angola? you could pretty much accomplish anything if you want to there are it's out there I mean the classes I mean it's out there if you want to learn you want to change there's things that you can start there's people that you can talk to that can help you if you want to be helped. That's the best things about Angola to me you got opportunities to accomplish pretty much everything"
    },
    {
      "speaker": "Marcus",
      "time": "00:37:41",
      "upperBoundTime": "00:37:42",
      "content": "That wasn't the way it was when you came here"
    },
    {
      "speaker": "Tommy",
      "time": "00:37:42",
      "upperBoundTime": "00:38:53",
      "content": "No not at all not up until like I guess you could say like 20 years ago probably cause you have you never heard if you had you never had such thing as reentry. I think they pretty much accomplished their mission for the reentry programs because it takes reentry you said reentry smack dab in the middle of everything that's already going on and has been happening since before reentry sit it right there in the middle of it everything's still rotating everything's still going like they expected."
    },
    {
      "speaker": "Tommy",
      "time": "00:37:42",
      "upperBoundTime": "00:38:53",
      "content": "I think they pretty much accomplished their mission for seeing how the reaction from lifers mixed with guys for reentry that short timers maybe 10 20 maybe 30 years and you sit them right there in the middle of everything that already going on and to me that's really the work of him basically because you didn't know what to expect when you set reentry right in the middle of everything else that's already going on"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:53",
      "upperBoundTime": "00:38:56",
      "content": "Yeah and the whole things being run by lifers."
    },
    {
      "speaker": "Tommy",
      "time": "00:38:56",
      "upperBoundTime": "00:39:20",
      "content": "Exactly it. I think they accomplished their mission though pretty much and it's a lot of work need to be done here as far as but it's one step at a time one foot in front of the other and to me that's how I'm looking at it so like I said my prayers always if gods ready I'm ready"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:20",
      "upperBoundTime": "00:39:27",
      "content": "What of all the things you've accomplished since you've been here what are you most proud of?"
    },
    {
      "speaker": "Tommy",
      "time": "00:39:27",
      "upperBoundTime": "00:40:29",
      "content": "Most proud of? I would say 100 hours. To release prerelease 100 hours I think that the reason I think that I'm mostly proud of that one is everything is together, I mean anger management, GED everything as a whole, everything because if you ghost through all of that."
    },
    {
      "speaker": "Tommy",
      "time": "00:39:27",
      "upperBoundTime": "00:40:29",
      "content": "But then the number of weeks that you go through it teach you all that it teach you how to conduct yourself it educates you highly educates you the guys that do the 100 hours they give it to you as is they don't cut no corners there it is right there if you want to learn it learn it it's up to you can make you learn it can't force you to learn it if you are here evidently you want to learn so I think that's have to be one of the most things I'm proud of completing 100 hours pre release"
    },
    {
      "speaker": "Marcus",
      "time": "00:40:29",
      "upperBoundTime": "00:40:52",
      "content": "That's great. You've shared a lot of really cool information with me and I'm grateful for your time is there something that I should have asked you that I didn't ask you? Something you wanted to talk about or maybe if something that you would like legislatures and people on the outside about what it is to serve life without parole."
    },
    {
      "speaker": "Tommy",
      "time": "00:40:52",
      "upperBoundTime": "00:41:36",
      "content": "To serve life without parole is very challenging because you can easily just say well give up I'm not going to make it but serving life without parole and it opens it opened up a lot of different thoughts in your mind at the same time it helps you realize that you have to change if you want to be if you want to go out society with a different mentality you have to change. You have to be willing to change."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:36",
      "upperBoundTime": "00:41:37",
      "content": "All right thanks thank you very much Tommy"
    },
    { "speaker": "Tommy", "time": "00:41:37", "content": "You're welcome" }
  ]
}
