{"name":"","transcript":[{"content":"Troy Andrews REDACTIONS FINAL"},{"speaker":"Walter","time":"00:00:01-3","content":"My name is Troy Andrews, I'm 44, I'm from New Orleans, caught a charge in 1995, for first degree murder. And, I been out 21 going on 22 years at the end of this month."},{"speaker":"Marcus","time":"00:00:18-2","content":"Okay."},{"speaker":"Walter","time":"00:00:19-0","content":"My sentence is this year."},{"speaker":"Marcus","time":"00:00:20-8","content":"Okay."},{"speaker":"Walter","time":"00:00:22-3","content":"Yeah."},{"speaker":"Marcus","time":"00:00:24-5","content":"Okay. And thank you for doing this, and happy birthday again."},{"speaker":"Walter","time":"00:00:27-3","content":"Thank you."},{"speaker":"Marcus","time":"00:00:28-5","content":"I want to start by leaning a little bit about your early life."},{"speaker":"Walter","time":"00:00:33-7","content":"Okay."},{"speaker":"Marcus","time":"00:00:35-1","content":"The point of this interview is to learn about who you are and so makes sense to start with the folks who raised you. So tell me about your family."},{"speaker":"Walter","time":"00:00:43-6","content":"Okay, my grandmother, Lorene Greene, she raised me. Always had a connection with my mother, but I had a thing for my grandmother cause that's who raised me. I never had a problem with my mother, but my grandmother, she's...she was everything I wanted in a mother. And she, she been there for me through everything."},{"speaker":"Marcus","time":"00:01:06-9","content":"Did you have brothers and sisters?"},{"speaker":"Walter","time":"00:01:08-3","content":"Yeah I got a brother and a sister."},{"speaker":"Marcus","time":"00:01:11-1","content":"Tell me about them."},{"speaker":"Walter","time":"00:01:12-7","content":"I got a brother name Gary Andrews, Shanika Andrews."},{"speaker":"Marcus","time":"00:01:14-6","content":"Okay. Where are you in the birth order?"},{"speaker":"Walter","time":"00:01:17-9","content":"I'm the oldest."},{"speaker":"Marcus","time":"00:01:19-5","content":"Oldest, okay."},{"speaker":"Walter","time":"00:01:20-8","content":"Yeah I'm the oldest."},{"speaker":"Marcus","time":"00:01:22-2","content":"And did you live in your grandmother's house for the most part coming up?"},{"speaker":"Walter","time":"00:01:26-1","content":"Yes. Since I was 5."},{"speaker":"Marcus","time":"00:01:28-1","content":"Since you were 5. Were there men who came into either your mother's life or your grandmother's life, who then came into your life?"},{"speaker":"Walter","time":"00:01:35-3","content":"Well, me and my brothers' father, we never really got along, and that played a big part in me going to my grandmothers. So when I went there, I still was in contact with my brothers and sisters. I ain't had no problem with them. But my uncle and my grandfather played a major part in my life. He just recently died a few months ago. And, my uncles, I'm very close with all my uncles, I'm close with all my aunties. I come from a pretty good family."},{"speaker":"Marcus","time":"00:02:12-2","content":"Sure. So of the 3 siblings, were you the only one who lived with your grandmother?"},{"speaker":"Walter","time":"00:02:17-5","content":"Yeah I was the only one."},{"speaker":"Marcus","time":"00:02:19-2","content":"Okay. And is it safe then for me to say that, for the most part, living at your grandmother's house, you were made well aware that there were adults who cared for you and were interested in you and loved you?"},{"speaker":"Walter","time":"00:02:35-3","content":"That's right."},{"speaker":"Marcus","time":"00:02:36-5","content":"As opposed to kind of having to make it on your own."},{"speaker":"Walter","time":"00:02:37-6","content":"That's right."},{"speaker":"Marcus","time":"00:02:41-7","content":"If you had to pick one of those folks, one of those uncles, grandpa, grandma, as the truly special one who."},{"speaker":"Walter","time":"00:02:52-0","content":"That would be my grandmother."},{"speaker":"Marcus","time":"00:02:53-6","content":"Okay. So tell me a little bit more about her, I want to know a little bit more about this person."},{"speaker":"Walter","time":"00:03:02-3","content":"Well, she worked in a cleaners for like 47 years. She was really quiet, she work a lot and she don't say much. She taught me how to play cards, how to cook. She always been the one that kind of like tried to keep me in line. She did everything she can to try and keep me in line."},{"speaker":"Walter","time":"00:03:02-3","content":"Got me up to date clothes, and make sure I studied school. She tried, she did all she could. But she couldn't do nothing with me. She never gave up on me. But she always said look you got to do better than what you can, what it is, you got to get it together."},{"speaker":"Marcus","time":"00:03:44-4","content":"Sure, sure. And from what I gather, she's stayed in your life all the way through your incarceration."},{"speaker":"Walter","time":"00:03:50-1","content":"All the way through."},{"speaker":"Marcus","time":"00:03:51-3","content":"Is she still alive?"},{"speaker":"Walter","time":"00:03:52-5","content":"Yes she's still alive"},{"speaker":"Marcus","time":"00:03:53-9","content":"Okay great. Does she come to visit you here?"},{"speaker":"Walter","time":"00:03:56-3","content":"No, because she had a stroke years ago and, she still focusing, she still remember who I am. They have another Troy in the house, and sometime they get, what Troy this is? I said which Troy this is right? She'll say this my Troy. That means she understand the difference between what Troy it is."},{"speaker":"Marcus","time":"00:04:20-6","content":"Sure. Do you remember the last time you saw her?"},{"speaker":"Walter","time":"00:04:23-9","content":"It been a few years ago, yeah I remember the last time she come visit me. And a matter of fact, that was 2007 was the last time I seen her"},{"speaker":"Marcus","time":"00:04:40-0","content":"Okay, alright, but she seems to be doing well?"},{"speaker":"Walter","time":"00:04:42-5","content":"Yeah she's doing pretty good."},{"speaker":"Marcus","time":"00:04:46-6","content":"All right, good. So where exactly did you grow up in New Orleans?"},{"speaker":"Walter","time":"00:04:49-5","content":"The desire housing project in the 9th ward."},{"speaker":"Marcus","time":"00:04:53-9","content":"Sure. Could you, I know that area very well. But for folks who may not know, could you paint me a picture. If we were both, let's say during your teen years, if we were both sitting on the stop of the front of your house. What would we be seeing on a typical day in the middle of the day, what would be seeing, hearing?"},{"speaker":"Walter","time":"00:05:21-1","content":"You'd probably be seeing some kids playing ball over here, you'd probably see somebody selling drugs over there. You'd see all kinds of stuff going on, especially during the day time. You wouldn't see much killing or nothing like that. But you'd see a lot of kids playing, this and that, a lot of families hanging together sometimes."},{"speaker":"Marcus","time":"00:05:42-5","content":"What about at night?"},{"speaker":"Walter","time":"00:05:43-6","content":"At night its terrifying, cause you don't know what to expect. It's dark, things happen, a lot of things happen at night so you got to be careful where you going at."},{"speaker":"Marcus","time":"00:05:58-9","content":"Did you feel safe?"},{"speaker":"Walter","time":"00:06:00-9","content":"I felt safe because my whole family was in there. And where I go people know me so. But it's always some mischief going on there."},{"speaker":"Marcus","time":"00:06:13-4","content":"Sure. What about school, what was school like for you?"},{"speaker":"Walter","time":"00:06:16-5","content":"I love school, to this day."},{"speaker":"Marcus","time":"00:06:20-0","content":"Where did you go for elementary, middle, and high school? Which schools?"},{"speaker":"Walter","time":"00:06:22-5","content":"I went to Dan school for elementary, I left Dan went to Lockhart, I went to Carver, Carver Middle, Carver Senior. I got expelled once for a fight."},{"speaker":"Marcus","time":"00:06:37-5","content":"How old were you when that happened?"},{"speaker":"Walter","time":"00:06:38-9","content":"Like 17."},{"speaker":"Marcus","time":"00:06:41-8","content":"Okay, so late."},{"speaker":"Walter","time":"00:06:43-9","content":"Yeah."},{"speaker":"Marcus","time":"00:06:44-9","content":"Did you manage to go back and finish?"},{"speaker":"Walter","time":"00:06:45-8","content":"Yeah I finished, yeah I graduated."},{"speaker":"Marcus","time":"00:06:51-1","content":"A lot of fighting in your neighborhood as well as school?"},{"speaker":"Walter","time":"00:06:54-2","content":"Pretty much, pretty much. You always got this one kid that's always the Tasmanian devil, you wish you don't run into him. But yeah there was a lot of fights."},{"speaker":"Marcus","time":"00:07:06-0","content":"And what's the fighting about, generally?"},{"speaker":"Walter","time":"00:07:10-5","content":"Fighting could be about anything, they try to steal your bike, stuff like that. Fight about what happened to this and that. Or somebody biff with somebody, turning it into something other than what it is."},{"speaker":"Marcus","time":"00:07:25-6","content":"So you graduated from high school, did you ever have a job?"},{"speaker":"Walter","time":"00:07:30-8","content":"Never had a job."},{"speaker":"Marcus","time":"00:07:31-9","content":"Okay. Any history of abuse in your childhood? It doesn't sound like it but I just want to check."},{"speaker":"Walter","time":"00:07:35-9","content":"No, no. No abuse."},{"speaker":"Marcus","time":"00:07:44-9","content":"Is it accurate to say that most of your friends who graduated from school with you, who lived in the neighborhood, were doing the same things you were doing? Or did you find yourself going off in this direction and they all went off in another direction?"},{"speaker":"Walter","time":"00:08:01-9","content":"Well, when I finished High School, I started going to Southern University. And a lot of things changed for me, because I felt myself getting a little older, but at the same time I had an Aunt who was in my ear. She was really in my ear; and when one thing went wrong it took me from my path. One mistake took me from my path. And I think that changed my life completely."},{"speaker":"Marcus","time":"00:08:32-2","content":"This charge?"},{"speaker":"Walter","time":"00:08:34-4","content":"That's right."},{"speaker":"Marcus","time":"00:08:36-4","content":"Okay. Sure. So I wasn't aware of that. You attended Southern, for a year?"},{"speaker":"Walter","time":"00:08:42-8","content":"For two semesters. Jones hall, room 211, second floor."},{"speaker":"Marcus","time":"00:08:48-9","content":"Wow. And that's when you caught the charge."},{"speaker":"Walter","time":"00:08:54-5","content":"Right after that. Right. In the middle of my possibly going to school."},{"speaker":"Marcus","time":"00:08:57-8","content":"So you're in school, yet are you coming back to the neighborhood?"},{"speaker":"Walter","time":"00:09:01-8","content":"Yeah I'm coming back."},{"speaker":"Marcus","time":"00:09:04-9","content":"But are you living?"},{"speaker":"Walter","time":"00:09:06-4","content":"I'm living on campus. My class was like, Monday, Wednesday, and Friday. So I got pretty much the weekend to myself. So I go down and spend time with the family, hang out with some of the fellas."},{"speaker":"Marcus","time":"00:09:20-1","content":"And that's where the trouble started."},{"speaker":"Walter","time":"00:09:21-4","content":"That's right."},{"speaker":"Marcus","time":"00:09:29-0","content":"Tell me a little bit about intimate relationships you might have had with girls."},{"speaker":"Walter","time":"00:09:30-9","content":"Oh yeah, I had a few girls. But I had this one girl in particular, we went to school together. And we always got in trouble. Matter of fact I got caught with her kid, when I got arrested. Her kid, her little baby was with me. And I felt so bad because I ain't never want it to end up like that. But me and her had a good relationship."},{"speaker":"Marcus","time":"00:09:57-7","content":"What was her name?"},{"speaker":"Walter","time":"00:09:58-6","content":"Michelle White."},{"speaker":"Marcus","time":"00:10:00-5","content":"Are you still in touch with her at all after all these years?"},{"speaker":"Walter","time":"00:10:01-7","content":"No, no. I talked to her a few times, but not often."},{"speaker":"Marcus","time":"00:10:06-1","content":"Yeah, time has a way of doing that. Any children?"},{"speaker":"Walter","time":"00:10:11-5","content":"No children."},{"speaker":"Marcus","time":"00:10:19-0","content":"So, tell me about the first time you got arrested; and then we'll work up to this charge, you spent some time in, what was it, LTI?"},{"speaker":"Walter","time":"00:10:22-5","content":"Yeah, LTI."},{"speaker":"Marcus","time":"00:10:25-2","content":"How was that for you?"},{"speaker":"Walter","time":"00:10:27-1","content":"I was so young at this time, I didn't really know what to expect. I was wild, but I always managed to stay in some type of education no matter where I was at."},{"speaker":"Marcus","time":"00:10:42-2","content":"It sounds like it, yeah. I mean to me it's amazing that you would've been able to keep on track and get into college after a stint at LTI."},{"speaker":"Walter","time":"00:10:49-4","content":"Yeah, cause I had a lot of teachers that were pulling for me. Go home, stay in school, do this, do that. Her name was Johnson, Miss Johnson, she was one of the teachers that was really supporting me, \"when you go home you need to do this and do that\"."},{"speaker":"Marcus","time":"00:11:06-4","content":"And that was a teacher at LTI?"},{"speaker":"Walter","time":"00:11:07-9","content":"Yeah. So when I did go, it turned out pretty good for me. Until I ran into the wrong people."},{"speaker":"Marcus","time":"00:11:17-6","content":"So LTI, from my understanding of folks who've spent time there. They always talk about fights every day."},{"speaker":"Walter","time":"00:11:29-4","content":"It's a lot of fights."},{"speaker":"Marcus","time":"00:11:30-1","content":"Did you find yourself fighting quite a bit there?"},{"speaker":"Walter","time":"00:11:32-0","content":"Yeah. And it wasn't because I under no type of pressure or nothing like that, nobody was fooling me or nothing. I just had that kind of mindset at that time."},{"speaker":"Marcus","time":"00:11:43-7","content":"Right. So, when you say you started getting in with the wrong people, can you elaborate more on that?"},{"speaker":"Walter","time":"00:11:54-8","content":"Yeah. When I started going to school, everything was going great. I was connected with the right people, I ain't had no trouble. I wasn't thinking about getting in no trouble, that was my mindset. Every time I go home the teachers always like why you going home cause you going to run across the wrong people."},{"speaker":"Walter","time":"00:11:54-8","content":"And I'm like that's my friends, I grew up with them, so that's why I go down. I recognized the different atmosphere. And I'm like nay, how you wound up like, I'm not getting into none of this. But greed, greed had a way of taking over me. And that's what caused everything."},{"speaker":"Marcus","time":"00:12:34-6","content":"Getting in to the money side."},{"speaker":"Walter","time":"00:12:35-5","content":"Right, right. They were made at."},{"speaker":"Marcus","time":"00:12:38-6","content":"Sure. If you, maybe you can't do this, it's too simple a question maybe. If you had to identify the main reason why you went down this path instead of following a more conventional path and staying out of trouble. What do you think it would be now that you've had all these years to put it in perspective?"},{"speaker":"Walter","time":"00:13:04-8","content":"I would say bad influence."},{"speaker":"Marcus","time":"00:13:07-4","content":"Okay, from peers?"},{"speaker":"Walter","time":"00:13:08-7","content":"Yeah, bad influence."},{"speaker":"Marcus","time":"00:13:10-3","content":"Sure. And I assuming that you role models growing up were also people who were getting into trouble?"},{"speaker":"Walter","time":"00:13:17-3","content":"Yeah."},{"speaker":"Marcus","time":"00:13:18-3","content":"What about drugs and alcohol. Was that a part of your lifestyle or just something you-"},{"speaker":"Walter","time":"00:13:24-9","content":"I never used alcohol a day of my life. I don't even know how beer tastes. But I've used drugs. I caught an infection from using heroin. And I caught kidney failure, when I caught kidney failure in the process of me having kidney failure caused by pituitary to start acting up. I have lymphoma, blood cancer. In the process of my having kidney failure, I went through chemo with the blood cancer. I went through radiation, I went through everything. Yeah but that was probably true."},{"speaker":"Marcus","time":"00:14:06-3","content":"Wow, my goodness. How old were you when that was going on?"},{"speaker":"Walter","time":"00:14:08-7","content":"I was 42. 42, just recently happened."},{"speaker":"Marcus","time":"00:14:16-2","content":"Okay. So heroin has been your drug of choice?"},{"speaker":"Walter","time":"00:14:20-2","content":"Yeah my drug of choice."},{"speaker":"Marcus","time":"00:14:25-2","content":"And how long have you been clean?"},{"speaker":"Walter","time":"00:14:27-2","content":"I've been clean ever since, ever since. I ain't made no effort to even go back and try to mess with it because it's the same thing that almost took my life. I'd be a fool to go back and use something that will cause problems."},{"speaker":"Marcus","time":"00:14:45-3","content":"And were you using pretty much all the way up until that point?"},{"speaker":"Walter","time":"00:14:48-5","content":"I'd been using since I was like 14."},{"speaker":"Marcus","time":"00:14:52-2","content":"And prison and LTI, none of that stopped it?"},{"speaker":"Walter","time":"00:14:55-8","content":"I ain't ever really use it in LTI. That was the only time that I gave it up. Like I said the bad influences, them forces always there."},{"speaker":"Marcus","time":"00:15:07-8","content":"Yeah, sure, and now when you look back on it. Why do you think it took you so long to stop doing it once you were here?"},{"speaker":"Walter","time":"00:15:19-3","content":"When something happened."},{"speaker":"Marcus","time":"00:15:20-8","content":"When something happened, yeah- You needed to hit a wall."},{"speaker":"Walter","time":"00:15:24-3","content":"Right. And that pretty much happens with a lot of guys. Like when something really happen, you think oh man this is it for me. It always takes something to happen."},{"speaker":"Walter","time":"00:15:24-3","content":""},{"speaker":"Marcus","time":"00:15:35-5","content":"Sure., so let me ask you a question then, cause now it's complicating my thought process a little bit, but, let's say that this particular charge that you're here for, this first degree murder charge, let's say for some reason or other, you were in a different place at a different time, or this didn't happen. How do you image the rest of your life would have trodden out?"},{"speaker":"Walter","time":"00:16:06-0","content":"Oh I probably would've been an engineer somewhere, I love engineering. That was one of my majors that I wanted to go for. I think I would have a pretty good life."},{"speaker":"Marcus","time":"00:16:19-5","content":"Okay. And so can I then assume that your continued use of heroin was because you're here and not, and you think that would have stopped…"},{"speaker":"Walter","time":"00:16:28-1","content":"Yeah it was because I was here, its stressful here."},{"speaker":"Marcus","time":"00:16:31-3","content":"Yeah, oh god yeah. I understand. And that makes sense to me. If you were going down the path of engineering, heroin would not have been part of your life, I get that. Before I move on to Angola, can you tell me, is there something about your childhood or your experience coming up that I didn't ask you about that's kind of important to who you are as a man today? Or did we cover everything?"},{"speaker":"Walter","time":"00:16:59-1","content":"Well, coming to Angola, a lot of people knew me. I always had a little popularity, and I don't ever felt like I was having no problems. And I felt like if I did I knew how to deal with it. You have a lot of guys when they come, they don't know what going on through they minds. Some scared, some not, some hoping that this guy won't mess with me."},{"speaker":"Walter","time":"00:16:59-1","content":"So I wasn't really one of the ones who was thinking like that. I hoped that I won't have to hurt nobody, get another charge, something like that. So when I come I was probably debriefed by a lot of guys that knew me. Because I'd been able to tell a lot of people that was pretty much here. So I pretty much was accepted."},{"speaker":"Marcus","time":"00:17:44-2","content":"How long did you spend in the parish before coming here?"},{"speaker":"Walter","time":"00:17:46-8","content":"About 3 years."},{"speaker":"Marcus","time":"00:17:47-6","content":"3 years? Tell me about that."},{"speaker":"Walter","time":"00:17:51-1","content":"I don't know what the holdup was for. I don't know why they- I don't know the reason. I don't know maybe they was trying to let me go, I don't know."},{"speaker":"Marcus","time":"00:18:04-1","content":"Okay. Tell me something, 3 years in the parish, now all these years here in Angola. Which would you say is worse?"},{"speaker":"Walter","time":"00:18:15-2","content":"I would say here."},{"speaker":"Marcus","time":"00:18:17-1","content":"Okay, and why is that?"},{"speaker":"Walter","time":"00:18:19-0","content":"Because you got so many restrictions here."},{"speaker":"Marcus","time":"00:18:22-8","content":"That you didn't have in OPP?"},{"speaker":"Walter","time":"00:18:24-6","content":"Yeah."},{"speaker":"Marcus","time":"00:18:25-6","content":"Oh, okay."},{"speaker":"Walter","time":"00:18:26-5","content":"In OPP it's just- they got this thing on the wall, saying now you're in to a real jail. And it's true to what it mean. Ain't no guidelines, whatever happens, happens. Here you got some restrictions. Because if you do something, they going to lose you and you in your cell for a while. But at the same time, being here is a lot more miserable. In the parish you still fighting for something. Once you get here you ain't got no fight."},{"speaker":"Marcus","time":"00:19:02-2","content":"Because you've been convicted, you feel like it's over"},{"speaker":"Walter","time":"00:19:03-7","content":"It's over with, you got to do everything you can to try to fight. You only got so many years before people give up on you. You got no lawyer money, your people they ain't financially, stable to try and provide you with the right assistance-"},{"speaker":"Marcus","time":"00:19:22-2","content":"And then the clock runs out."},{"speaker":"Walter","time":"00:19:24-1","content":"The clock runs out. Now you wonder what your next step is. You hope that somebody comes into your life that might be able to help you out."},{"speaker":"Marcus","time":"00:19:35-9","content":"Sure. So let me go back and rephrase my question earlier, before coming to Angola, was there something that we should've talked about that we didn't about something that is important to shaping the person you've become?"},{"speaker":"Walter","time":"00:19:57-5","content":"I don't know, I can't think of nothing at the time that shaped my life."},{"speaker":"Marcus","time":"00:20:04-7","content":"Okay, that's fine. I just wanted to make sure we covered the main things. So one of the reasons that- are you a trustee?"},{"speaker":"Walter","time":"00:20:13-1","content":"I'm class C so far."},{"speaker":"Marcus","time":"00:20:15-1","content":"Class C, okay. So what's the difference between class C, B, and A?"},{"speaker":"Walter","time":"00:20:20-7","content":"Class C is just like a test, given the opportunity to prove yourself to go to the next level to be in B. In B you pretty much get a little more leeway to move around more. You can get a better job, do more things to prove yourself in areas. But A, A pretty much puts you out there, move around more, more flexible."},{"speaker":"Walter","time":"00:20:20-7","content":"Matter of fact I got class C when I was in the ward. I got it through the mail and I really didn't know what it was. Until a guy said what is this, read that, it say they made you class C. I said okay, alright."},{"speaker":"Marcus","time":"00:21:06-3","content":"Okay. So look if you could go back to the young Troy Andrews who come through the gates of Angola. Could you describe that person and tell me what advice you might give him at this point?"},{"speaker":"Walter","time":"00:21:22-9","content":"Yeah, Troy Andrew, at that time, I was young, I was naive to a lot of things. Especially about my case, because I didn't understand the law. I didn't know which way to go, and I didn't really trust nobody with my case so I'm like man. As soon as I got here, I pretty much got to I ain't really fight. Got shifted to camp C, and from that point on I saw a little progress in what I was trying to accomplish for myself; but there's always something coming in this place."},{"speaker":"Walter","time":"00:21:22-9","content":"Got a lot of negative forces around you, so you have to be careful. I would tell old Troy now that look man you need to get out of this place, I'm more focused now, so that's where I'm at. That's the only thing that matter to me, I don't do nothing else, nothing, but try to figure a way out of this prison."},{"speaker":"Marcus","time":"00:22:31-3","content":"Which for you at this point, is through the pardon process, right?"},{"speaker":"Walter","time":"00:22:36-6","content":"Well, I ain't ever felt like that."},{"speaker":"Marcus","time":"00:22:39-8","content":"So you started to get into this. Can you tell me a little bit more about how you're a different person from how you came in here?"},{"speaker":"Walter","time":"00:22:48-3","content":"Yeah. When I come here, I'm using drugs, I'm getting into a lot of fights too. But, I always was trying to find a way to better myself. In the process of me trying to better myself, a lot of things always coming to you to get you back into who you don't really want to be. So in the process of me doing that I was trying to grow out of it. Hope that some kind of way I could just find peace within myself. What the old Troy did if I found a lot of peace within myself."},{"speaker":"Marcus","time":"00:23:35-3","content":"And how does that happen?"},{"speaker":"Walter","time":"00:23:37-9","content":"When I took sick cause I got a pituitary issue in my brain and I got something in my brain it was staying over like sixty years that made me start thinking about my life more. That made me change completely."},{"speaker":"Marcus","time":"00:23:57-5","content":"In terms of valuing the time you have left?"},{"speaker":"Walter","time":"00:24:00-0","content":"Yeah, like last week I went to the hospital to get my eyes checked to make sure the tumor wasn't affecting my eyes. So yeah I'm trying to get it together before I get out of here before something really go wrong with me."},{"speaker":"Marcus","time":"00:24:21-3","content":"Are you pretty much cancer free at this point?"},{"speaker":"Walter","time":"00:24:24-6","content":"So far, yeah."},{"speaker":"Marcus","time":"00:24:26-6","content":"Yeah, that's great. Why don't you tell me what your typical day looks like? When you get out of bed, what's your routine, what's your job, how you end up in bed again?"},{"speaker":"Walter","time":"00:24:36-4","content":"My routine waking up is first, give these guys the time- I don't really want to talk to nobody, nobody want to talk to me. So I just want to focus on brush my teeth, get ready for the- I'm a dorm orderly so my job really is to clean the dorm. So I'm going to focus on that when everybody no their way to work. I make sure I get breakfast, come back, fix my bed, get my pants together because I know them going to be hollering about that."},{"speaker":"Walter","time":"00:24:36-4","content":"So these guys can get adjusted back to reality, they start mingling and everything. Because in the morning it ain't good to be talking to nobody, because you ain't really know what's going on in the guy's mind. So that's how my day starts. So through the course of the day, I'm reading, I'm reading. Everyday."},{"speaker":"Marcus","time":"00:25:30-3","content":"What are you reading?"},{"speaker":"Walter","time":"00:25:32-2","content":"Law, every day."},{"speaker":"Marcus","time":"00:25:35-6","content":"Is that primarily through materials from the law library?"},{"speaker":"Walter","time":"00:25:36-8","content":"Yeah."},{"speaker":"Marcus","time":"00:25:38-2","content":"Okay, because you're in the main prison right?"},{"speaker":"Walter","time":"00:25:39-4","content":"Yes, sir."},{"speaker":"Marcus","time":"00:25:43-5","content":"So you read after you've finished the duties of being the orderly in the dorm, and then what happens?"},{"speaker":"Walter","time":"00:25:50-9","content":"Well, I might go watch a little TV and get away from it a little bit. Cause every time you got away from it you go back and rejuvenate yourself. So I watch a little TV sometimes, I play a little chess. Chess my game, that's one of my favorite games?"},{"speaker":"Marcus","time":"00:26:08-2","content":"Do you find yourself playing against the same people?"},{"speaker":"Walter","time":"00:26:11-7","content":"Pretty much, but I like going outside of the dorm. I have a saying that saying we'll take my shot at roe. Yeah so that's my thing."},{"speaker":"Marcus","time":"00:26:23-7","content":"Do you have your own chess set?"},{"speaker":"Walter","time":"00:26:25-2","content":"I had it. But they broke it out and somebody used it and they'll never take care of stuff like you'll do yours. But I'm trying to get me a new set."},{"speaker":"Marcus","time":"00:26:37-9","content":"Okay. Are there some organizations that you've been part of since you've been here, like clubs?"},{"speaker":"Walter","time":"00:26:50-3","content":"Yeah I've been in a few. I've been in, speak up dynamics, JCs. I've been in the lifers organizations. I've been in CPR organizations. Yeah, I've been through a few. I've been thinking my game while this that's what I've been thinking about."},{"speaker":"Marcus","time":"00:27:11-5","content":"But one of the things you can definitely speak to is the effect it's had on your family."},{"speaker":"Walter","time":"00:27:16-0","content":"Yes it's had a serious effect on my family."},{"speaker":"Marcus","time":"00:27:18-0","content":"Let's talk about that for a bit."},{"speaker":"Walter","time":"00:27:19-7","content":"They'll be stressing, I got to get you out of there, I don't know what I can do, who can I talk to? I say let me do it, let me take care, I'm putting that burden on myself. Because I got people coming from out of state to visit me, so it's stressful on them. It's hard, it's real hard."},{"speaker":"Marcus","time":"00:27:44-9","content":"That was all through those years in OPP when you were going through the trial."},{"speaker":"Walter","time":"00:27:46-7","content":"Yes."},{"speaker":"Marcus","time":"00:27:52-5","content":"Who do you think dealt with it the hardest?"},{"speaker":"Walter","time":"00:27:59-6","content":"As far as families?"},{"speaker":"Marcus","time":"00:28:01-4","content":"Yeah, your family, who in your family."},{"speaker":"Walter","time":"00:28:04-3","content":"I can only speak for my family, because."},{"speaker":"Marcus","time":"00:28:06-8","content":"No, no I'm asking you about your family, who in your family had the hardest time-"},{"speaker":"Walter","time":"00:28:11-2","content":"My mom and my grandmothers took it hardest, and my aunts, because I grew up with all them."},{"speaker":"Marcus","time":"00:28:17-3","content":"And how did that affect them?"},{"speaker":"Walter","time":"00:28:19-5","content":"It affects them to the point where every time they visit, they cry. It's hard, that's how hard it is."},{"speaker":"Marcus","time":"00:28:27-4","content":"At OPP?"},{"speaker":"Walter","time":"00:28:28-4","content":"OPP, up here. And even for today or tomorrow or whatever. We talk, it's so sensitive about the whole situation with them. They cry it makes me cry. So I'm like I don't want y'all to start that because it's an emotional situation."},{"speaker":"Marcus","time":"00:28:49-3","content":"Was your mother and grandmother in the courtroom when they read the verdict?"},{"speaker":"Walter","time":"00:28:54-6","content":"Yeah."},{"speaker":"Marcus","time":"00:28:57-6","content":"I can only imagine. So I know that you have said already to me that you would like to go out of here the same way you came in, through a legal avenue. But I want to ask you a little bit about coping, okay. So the fact of the matter is you've been here for over 20 years."},{"speaker":"Marcus","time":"00:28:57-6","content":""},{"speaker":"Marcus","time":"00:28:57-6","content":"And the clock, for all intents and purposes has run out. When you see people growing old and people who've spent more than 40, 50 years here, and who are probably going to die here. What do you think? And how does that make you think about your own future and how do you cope with all of that?"},{"speaker":"Walter","time":"00:30:01-3","content":"That's a good question. It's hard to cope, it's hard. To be in this prison for that long, something wrong, something wrong somewhere. They got out of prison where I'll be seeing the guys who have 25 to life, 15 to life. Otherwise a lot of guys have been here a long time."},{"speaker":"Walter","time":"00:30:01-3","content":"I watched a lot of guys suffer. I always say I hope I don't have to be going through that, but I'm pretty much a reflection of that. And time will come. So I'm going to do everything I can to really get out there. And for people to cope: drugs, drugs, exercising, reading, they got some guys studying law, and really before it here guys lose their mind."},{"speaker":"Walter","time":"00:30:01-3","content":"He really don't even know what he's doing, what I'm saying. He that caught up in trying to find some issues. And he just start everything he doing is done, everything he doing look fabulous, I think there's a lot of guys who go through that. These guys are like me for instance, I used drugs to try to cope. It ain't easy."},{"speaker":"Walter","time":"00:30:01-3","content":"You got so many different personalities, guys from all over the states, all over the country. You got Arabs, you got Mexicans, you got people from Guatemala, all over, in this prison- and they all got different personalities. So it's hard to deal with."},{"speaker":"Marcus","time":"00:31:50-7","content":"Yeah, yeah. I'm just thinking, I interviewed somebody just this morning who spent 41 years here. And they will probably get out, going through the pardon process, in the next month or so. But part of me feels like, is it too late? To let somebody out after 40 years?"},{"speaker":"Walter","time":"00:32:17-2","content":"It's never too late."},{"speaker":"Marcus","time":"00:32:18-5","content":"Yeah okay."},{"speaker":"Walter","time":"00:32:19-4","content":"Me, personally. I live around a lot of these guys who don't come back. If they come back, that mean they don't have nobody out there, they don't know what to do, they don't have no guidance."},{"speaker":"Marcus","time":"00:32:31-2","content":"Oh I can't see some of those old guys coming back here."},{"speaker":"Walter","time":"00:32:33-6","content":"Oh old those guys ain't coming back here-"},{"speaker":"Marcus","time":"00:32:37-6","content":"Definitely not. But again I guess I just start thinking like, at some point, if you're going to keep a person here for so long, is it may be cruel to let them out?"},{"speaker":"Walter","time":"00:32:48-5","content":"Not cruel to let them out, it's cruel to keep them in. How could you even put that in your mind? You got people that go to church and they're all friendly people. You got people that want to be caring people. For you to put a man in prison for that many years, that says a lot about that person. You got all these churches you going to come up here but they are never going to the capital, to be some type of support for the inmates."},{"speaker":"Walter","time":"00:32:48-5","content":"You get here a part of the system, you bring soap, you bring clothes, you bring all this. But I thought the church was for the community. I don't see why nobody is going up to the capital and trying to get some relief for these guys that been out here 40, 50 years. I think that's the right thing to do. You what a man to suffer his whole life, that ain't good. That's not a good look."},{"speaker":"Marcus","time":"00:34:04-5","content":"Do you see some people who just give up and spiral down into depression?"},{"speaker":"Walter","time":"00:34:11-2","content":"Yeah, I seen a lot of them lose they minds. I saw some of the strongest guys. They would share their day with you."},{"speaker":"Marcus","time":"00:34:23-9","content":"What are they like?"},{"speaker":"Walter","time":"00:34:26-4","content":"They ain't nothing like they were when they came here. It's not even close to what they look like when they came here. They got so small, smoking cigarettes, they'll smoke anything, smoking butts off the ground. Not even the same person. I remember those guys family."},{"speaker":"Walter","time":"00:34:26-4","content":"They do all kind of sexual favors, they wouldn't ever do at first. What happened to him? They ain't themselves all of them years. Nobody don't care for them anymore. That's the thing they put in the mind. So it's hard."},{"speaker":"Marcus","time":"00:35:16-9","content":"What's the worst thing that you deal with here? And I ask that, I think when you first come here there are certain things that are the most challenging; and then as you're here over time, different things become more- sometimes it's a mental thing. For you, what's the worst part?"},{"speaker":"Walter","time":"00:35:30-7","content":"For me, the worst thing was trying to everything in perspective, for me. Because I ain't really have no problems with no inmates, that wasn't really my issue. Unless it was something I felt like I needed to just take care of. But for the most part, I never really had that kind of problem."},{"speaker":"Walter","time":"00:35:30-7","content":"My problem was always me, getting me together, that's always been my problem. Trying to focus on getting myself together. That's where my stress come in, getting myself together. Been trying to figure out how to put this all together, and it was hard. Kind of putting it together, using drugs, stressing."},{"speaker":"Walter","time":"00:35:30-7","content":"It be times when you can't get your own phone and can't get in contact with people sometimes. You got so many guys in the dorm, people all on the phone sometimes that can be stressful too. Trying to get on the phone for a certain time, I got to call from there I won't give you the phone."},{"speaker":"Walter","time":"00:35:30-7","content":"You get on the phone, you can't. Yeah it's all kind of stuff. My coping was trying to really stay out of trouble. And for the most part that's what I did. I ain't got no bad disciplinary stuff. So that pretty much explain that. That's why I'm waiting for trustee status."},{"speaker":"Marcus","time":"00:36:56-1","content":"Right, right. So if you go before a pardon board, you'll have a small window to tell them who Troy Andrews now is. What would you tell them?"},{"speaker":"Walter","time":"00:37:07-7","content":"I'm not sure, I'm not sure. I've never been in a situation where I even have to give that a thought. Cause I've never seen myself in that position."},{"speaker":"Marcus","time":"00:37:16-3","content":"Okay. So of the various things you've done in your life, Troy, what are you most proud of?"},{"speaker":"Walter","time":"00:37:25-2","content":"Well, going to school. Being about to talk to my grandmother, we have some good conversations, we can laugh about a lot of things. So that's one of the things I'm proud of. I ain't never got a chance to be a brother to my sister and my brother. That's one of the things I didn't have a chance to do, so. But going to school is one of the main things I was proud of. I'm the only one on my mother's side of the family that really went to school."},{"speaker":"Marcus","time":"00:37:25-2","content":"So of the things you've done since you've been at Angola, what would stand out as the thing you're really proud of?"},{"speaker":"Walter","time":"00:38:15-2","content":"Staying out of trouble."},{"speaker":"Marcus","time":"00:38:17-7","content":"So let's say you get released from prison, either through the same way you came in or though the pardon process, whatever it is- you must have thought about what that's going to look like. What would that chapter of your life look like? What would you do?"},{"speaker":"Walter","time":"00:38:34-6","content":"Oh man. Well, I pretty much got a place already, I got an aunt out of state that got a little business and everything. An entrepreneur class, and she...she self-employed and she got a little business thing going on. Matter of fact she just came to see me about 2 weeks ago. She said when you get out of here, I got a nice job for you. Keep you out of trouble."},{"speaker":"Marcus","time":"00:39:14-4","content":"What state is that?"},{"speaker":"Walter","time":"00:39:16-0","content":"California. Yeah, I could go to various states. I could go to Detroit, I could go to Cincinnati, I could go to New York. But my aunt in California, she own me, she own me."},{"speaker":"Marcus","time":"00:39:31-5","content":"So you wouldn't go back to New Orleans?"},{"speaker":"Walter","time":"00:39:32-8","content":"No, no indeed, she is in charge of me. She says, \"When you get out of here, you've got to come straight here. I want you to know what I deal with.\""},{"speaker":"Marcus","time":"00:39:48-0","content":"Yeah, that's good advice you think."},{"speaker":"Walter","time":"00:39:52-7","content":"Yeah."},{"speaker":"Marcus","time":"00:39:54-0","content":"Alright, well, that pretty much ties things up for me. Is there something else I should've asked you about?"},{"speaker":"Walter","time":"00:40:00-8","content":"I'm not sure."},{"speaker":"Marcus","time":"00:40:02-2","content":"Is there something you would want the legislature to know about what your experience is, and the experience of so many serving life without parole?"},{"speaker":"Walter","time":"00:40:14-2","content":"Yeah, I'm just hoping the legislature can find it in their heart to really consider these guys. Because you ain't never stop crying. But you can put in place some type of mechanism, some type of revolving door for these guys. That have been here all their time."},{"speaker":"Walter","time":"00:40:14-2","content":"These guys are done, they've been here since the 70s and ain't nothing the same since then. Know what I'm saying, these guys ain't got the opportunity to learn and get no education. They ain't got nothing in place to get no education. They got guys helping guys try to t learn. I just hope that they find it in their heart to give these guys some relief."},{"speaker":"Marcus","time":"00:41:13-5","content":"How much time do you think should be enough time for a thing like this?"},{"speaker":"Walter","time":"00:41:15-3","content":"20, 25 at the most, no further than that. It don't take 40, 50 years for you to try to get somebody mind right. It don't take that long to try to establish your point, your point made, your point made man."},{"speaker":"Marcus","time":"00:41:41-2","content":"Okay, that's a good place to stop."}]}