{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Troy West Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:00",
      "upperBoundTime": "00:00:00",
      "content": "Would you mind stating your name?"
    },
    {
      "speaker": "Troy",
      "time": "00:00:00",
      "upperBoundTime": "00:00:08",
      "content": "My name is troy west and a lot of family and friends know me as nokie"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:08",
      "upperBoundTime": "00:00:10",
      "content": "And what were you convicted for"
    },
    {
      "speaker": "Troy",
      "time": "00:00:10",
      "upperBoundTime": "00:00:14",
      "content": "I was convicted of second degree murder"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:14",
      "upperBoundTime": "00:00:15",
      "content": "How old were you?"
    },
    {
      "speaker": "Troy",
      "time": "00:00:15",
      "upperBoundTime": "00:00:18",
      "content": "I was 19 years old"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:18",
      "upperBoundTime": "00:00:20",
      "content": "Ok and how long have you served?"
    },
    {
      "speaker": "Troy",
      "time": "00:00:20",
      "upperBoundTime": "00:00:25",
      "content": "I've been here in Angola for 24 years"
    },
    {
      "speaker": "Marcus",
      "time": "00:00:25",
      "upperBoundTime": "00:00:42",
      "content": "So I'm going to ask you some questions about your childhood and then focus on some of things you've done since you've been here. We were talking earlier a little bit about it but can you tell me a little bit about the folks who raised you your family?"
    },
    {
      "speaker": "Troy",
      "time": "00:00:42",
      "upperBoundTime": "00:02:04",
      "content": "Well my mom she has three boys I have a older brother I have a younger brother I'm the middle boy it was all boys and raising up we had a pretty have my step dad he was present in my life my dad I didn't meet him until maybe like when I was maybe 14 or 13 years old was my first time ever meeting him."
    },
    {
      "speaker": "Troy",
      "time": "00:00:42",
      "upperBoundTime": "00:02:04",
      "content": "I always thought that the man that was in the house that was raising me I always thought that he was my dad and he treated me no different than his other two sons I mean he disciplined us all the same pretty much so and my mom and my dad they both worked and so at times because of they schedule we were we were home sometimes by ourselves."
    },
    {
      "speaker": "Troy",
      "time": "00:00:42",
      "upperBoundTime": "00:02:04",
      "content": "My older brother which is maybe 2 years older than me he would he would monitor he was over me and my younger brother look after us and we pretty much got along. Here and there we would have our little falling outs but for the most part we were pretty close growing up"
    },
    {
      "speaker": "Marcus",
      "time": "00:02:04",
      "upperBoundTime": "00:02:06",
      "content": "Where did you grow up?"
    },
    {
      "speaker": "Troy",
      "time": "00:02:06",
      "upperBoundTime": "00:02:12",
      "content": "I grew up in St. Thomas housing development. Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:12",
      "upperBoundTime": "00:02:13",
      "content": "Its no longer there"
    },
    {
      "speaker": "Troy",
      "time": "00:02:13",
      "upperBoundTime": "00:02:19",
      "content": "Yeah I hear. Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:19",
      "upperBoundTime": "00:02:26",
      "content": "Would it be accurate to say that you grew up feeling cared for and loved? As a boy"
    },
    {
      "speaker": "Troy",
      "time": "00:02:26",
      "upperBoundTime": "00:03:21",
      "content": "Well I remember I remember growing up. I remember we having a lot of family outings we would all for holidays we would meet up at my aunt Shirley house this is the oldest person in my family that's alive right now today god bless her she's 84 going on 25 she yeah and we would all meet up by her house and we the family would meet up there and we would they would cook and it would be drinking and for the nights out."
    },
    {
      "speaker": "Troy",
      "time": "00:02:26",
      "upperBoundTime": "00:03:21",
      "content": "I have 2 cousins they I don't know what it was they would always fight them two there they would they were for the night out they were two sisters they would always fight but for the most part yeah I did feel loved man I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:21",
      "upperBoundTime": "00:03:29",
      "content": "Was, what was the relationship like, between your stepdad and your mom? Did they get along?"
    },
    {
      "speaker": "Troy",
      "time": "00:03:29",
      "upperBoundTime": "00:04:54",
      "content": "Well, I want to believe that they did. I mean they my mom, she, my mom, she's a character. I love her, but my mom she was she was sometimes be unfaithful to my stepdad. I think that had a lot to do with our family splitting up and my mom she would, she would go out on these on these outings with these men, and she would take us along with her, and we kids, we knew it was wrong."
    },
    {
      "speaker": "Troy",
      "time": "00:03:29",
      "upperBoundTime": "00:04:54",
      "content": "I mean we knew who my dad was and we knew that this man wasn't supposed to be with my mom, and, we were kids we didn't mind it any, but after these outings the, the thing that was funny to me, I think about it now is that we'd make it to the door my mom would jack us up, and say you better not tell your daddy where it is we've been, and we'd be like aaaa alright we don't want to.."
    },
    {
      "speaker": "Troy",
      "time": "00:03:29",
      "upperBoundTime": "00:04:54",
      "content": "And she would do it to each one of us, and we never told, I know I never did in fear of breaking the family up. I never, I always wanted my dad around even though he wasn't actually my dad. I always wanted to have this family, together."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:54",
      "upperBoundTime": "00:04:57",
      "content": "How old were you when they split up?"
    },
    {
      "speaker": "Troy",
      "time": "00:04:57",
      "upperBoundTime": "00:05:07",
      "content": "Oh man I had to be maybe I think maybe I was like 12 years old 11 or 12 I couldn't've been no older than 12."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:07",
      "upperBoundTime": "00:05:08",
      "content": "Ok"
    },
    {
      "speaker": "Troy",
      "time": "00:05:08",
      "upperBoundTime": "00:05:53",
      "content": "Yeah because my dad he was he was kinda like real strict as far as disciplining us and for the most part up until that point I Grew up not getting in any trouble I did pretty well in school and my dad he would he was real demanding that we do good in school and we had curfews."
    },
    {
      "speaker": "Troy",
      "time": "00:05:08",
      "upperBoundTime": "00:05:53",
      "content": "My mom she would step out on the porch and no matter where it was she would holler each one of our names one time and we heard her we would come running because we had a set time before the time that she called us to make it to the house and"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:53",
      "upperBoundTime": "00:06:05",
      "content": "Let me ask I'm trying to get a picture of it I know where it is if we were did you have a front porch?"
    },
    {
      "speaker": "Troy",
      "time": "00:06:05",
      "upperBoundTime": "00:06:05",
      "content": "Yes we did"
    },
    {
      "speaker": "Marcus",
      "time": "00:06:05",
      "upperBoundTime": "00:06:19",
      "content": "Ok let's say you and I were sitting on the front porch together looking out at the neighborhood can you describe like when you were 12 years old can you describe what we would be looking at and seeing?"
    },
    {
      "speaker": "Troy",
      "time": "00:06:19",
      "upperBoundTime": "00:06:21",
      "content": "Man"
    },
    {
      "speaker": "Marcus",
      "time": "00:06:21",
      "upperBoundTime": "00:06:22",
      "content": "What would we be hearing?"
    },
    {
      "speaker": "Troy",
      "time": "00:06:22",
      "upperBoundTime": "00:08:31",
      "content": "In our front court I remember us having a toy swings they were made of wood and we had sliding boards and it was just a whole little toy setup right there and we would me and my friends we would always play on there we'd play we would watch kung Fu theater on Saturdays and we'd come out after the show go off and we come out kicking and chopping at each other and."
    },
    {
      "speaker": "Troy",
      "time": "00:06:22",
      "upperBoundTime": "00:08:31",
      "content": "I remember this lady who stood up under us man she wasn't from I don't think she was from the united states her name was miss Bernice real short lady and I remember coming home from school maybe sitting out on the porch and miss Bernice she liked to bake and she would always bake cakes and she would always give us a piece of cake mainly catching me going up coming from school."
    },
    {
      "speaker": "Troy",
      "time": "00:06:22",
      "upperBoundTime": "00:08:31",
      "content": "She would have the door open so like she was waiting on us and she would beckon for us to come here come come come and she would give us a piece of cake and miss Bernice she died man she in the projects."
    },
    {
      "speaker": "Troy",
      "time": "00:06:22",
      "upperBoundTime": "00:08:31",
      "content": "I'm not sure if everybody did it but I know we used to do it we would leave the stove open and it would heat the rest of the house and Miss Bernice I guess maybe she did it also and her she had a little dog named shorty and Miss Bernice and shorty they died from carbon monoxide yeah I remember that miss Bernice she would come out there with us."
    },
    {
      "speaker": "Troy",
      "time": "00:06:22",
      "upperBoundTime": "00:08:31",
      "content": "And she would shoot marbles with us she would actually get down and she would shoot little short lady and you would think maybe she would give us our marbles back because we were kids no she kept our marbles we played for keeps and she would she would keep our marbles she would."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:31",
      "upperBoundTime": "00:08:33",
      "content": "Did she have children?"
    },
    {
      "speaker": "Troy",
      "time": "00:08:33",
      "upperBoundTime": "00:09:04",
      "content": "I remember meeting her son. She had a son. I'm not sure if she had more kids but I remember meeting her son, because the day that she died, he was knocking on the door, and I remember as a kid he couldn't get her to open the door, so he come upstairs and wanted to use the phone, and I remember him rolling back on our sofa crying because he found out that his mom was dead in the house yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:04",
      "upperBoundTime": "00:09:06",
      "content": "What about school? Where were you in school?"
    },
    {
      "speaker": "Troy",
      "time": "00:09:06",
      "upperBoundTime": "00:09:12",
      "content": "Oh I went to several schools"
    },
    {
      "speaker": "Marcus",
      "time": "00:09:12",
      "upperBoundTime": "00:09:14",
      "content": "What was your highest grade that you completed?"
    },
    {
      "speaker": "Troy",
      "time": "00:09:14",
      "upperBoundTime": "00:11:02",
      "content": "I completed 8th grade man I was going to Etna Carr. I went to Etna Carr and it was my first time ever being in the school to where it was they had white kids and black kids there and I'd never been to a school to where it had mixed racial people there they had a lot of Vietnamese people there and I'd never been to a school like that and I remember wanting to play on the football team there and Etna Carr they were well known for having a pretty good football team."
    },
    {
      "speaker": "Troy",
      "time": "00:09:14",
      "upperBoundTime": "00:11:02",
      "content": "I remember coach Ott and I remember wanting to go out for the team and it was after school and it come on the PA system that anyone that's interested in joining the football team show up in the gym and man I was so excited and I went to go in the gym well they had some guys that were there on the team"
    },
    {
      "speaker": "Troy",
      "time": "00:09:14",
      "upperBoundTime": "00:11:02",
      "content": "The previous year and I see them and they're hitting them weights and stuff and I'm like oh man yeah and I went to try and go in the weight room which was caged off and coach Ott was standing there and I remember him putting his arm up like where you going? Ai said I'm going to hit some weights coach and he was like nope and he pointed me to the pull-up bar I was like really?"
    },
    {
      "speaker": "Troy",
      "time": "00:09:14",
      "upperBoundTime": "00:11:02",
      "content": "Yeah but after that I, I never made, I never got a chance to really try out for the team. I winded up getting in trouble as a juvenile and getting sent away to LTI Scotland yeah so I never got a chance to play for Etna Carr"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:02",
      "upperBoundTime": "00:11:05",
      "content": "Right. So what was it that you got arrested for?"
    },
    {
      "speaker": "Troy",
      "time": "00:11:05",
      "upperBoundTime": "00:11:07",
      "content": "Auto theft"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:07",
      "upperBoundTime": "00:11:11",
      "content": "How old were you?"
    },
    {
      "speaker": "Troy",
      "time": "00:11:11",
      "upperBoundTime": "00:11:21",
      "content": "The first time I got arrested. It was definitely after my dad and my mom split I had to be maybe 13 years old"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:21",
      "upperBoundTime": "00:11:28",
      "content": "Ok. And so you had to drop out of school? You end up going to like a juvenile facility?"
    },
    {
      "speaker": "Troy",
      "time": "00:11:28",
      "upperBoundTime": "00:11:30",
      "content": "Yes sir yes sir"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:30",
      "upperBoundTime": "00:11:32",
      "content": "How long do you spend there"
    },
    {
      "speaker": "Troy",
      "time": "00:11:32",
      "upperBoundTime": "00:11:34",
      "content": "I was sentenced to two years there"
    },
    {
      "speaker": "Marcus",
      "time": "00:11:34",
      "upperBoundTime": "00:11:36",
      "content": "Ok they had school there I'm assuming"
    },
    {
      "speaker": "Troy",
      "time": "00:11:36",
      "upperBoundTime": "00:11:39",
      "content": "Yes they did. They did."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:39",
      "upperBoundTime": "00:11:40",
      "content": "So were you able to continue on with school?"
    },
    {
      "speaker": "Troy",
      "time": "00:11:40",
      "upperBoundTime": "00:12:54",
      "content": "Yes I was and believe it or not I actually learned a lot in LTI than I learned in school itself. Going to public school I learned a lot because the teachers were there they were real dedicated they wanted to see you improve and so they would take they time with you and it was a lot of one on one time that really helped me but I wind up getting out before I can take my GED. I wind up when I got short I got like 6 months short and they sent me to Bridge city it was the stock program it was called the short term offender program and I went there."
    },
    {
      "speaker": "Troy",
      "time": "00:11:40",
      "upperBoundTime": "00:12:54",
      "content": "And I was taking GED classes there again preparing to take my GED they had this big guy by the name of big scrub oh man you sit in that class man there was no talking man he would put the music on real low and he was real demanding he wanted you to get them books man and like I say it was in LTI that I actually learned a lot as far as school"
    },
    {
      "speaker": "Marcus",
      "time": "00:12:54",
      "upperBoundTime": "00:12:57",
      "content": "Was there a lot of fighting there?"
    },
    {
      "speaker": "Troy",
      "time": "00:12:57",
      "upperBoundTime": "00:13:15",
      "content": "Very little I mean maybe in LTI Scotland there was more fighting but when I got to Bridge city man big scrub man big old guy he held it down man he was the disciplinarian"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:15",
      "upperBoundTime": "00:13:20",
      "content": "Sure. So now when you're done with that. How old are you then?"
    },
    {
      "speaker": "Troy",
      "time": "00:13:20",
      "upperBoundTime": "00:13:31",
      "content": "When I was done with Scotland I want to say maybe I was 16, 17 years old somewhere in that range"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:31",
      "upperBoundTime": "00:13:32",
      "content": "So then you said Bridge"
    },
    {
      "speaker": "Troy",
      "time": "00:13:32",
      "upperBoundTime": "00:13:35",
      "content": "Bridge city"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:35",
      "upperBoundTime": "00:13:37",
      "content": "So then do you end up coming back to New Orleans?"
    },
    {
      "speaker": "Troy",
      "time": "00:13:37",
      "upperBoundTime": "00:13:38",
      "content": "Yes I did"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:38",
      "upperBoundTime": "00:13:41",
      "content": "So around 17 16 17"
    },
    {
      "speaker": "Troy",
      "time": "00:13:41",
      "upperBoundTime": "00:13:42",
      "content": "Somewhere yes in that area"
    },
    {
      "speaker": "Marcus",
      "time": "00:13:42",
      "upperBoundTime": "00:13:46",
      "content": "And then did you get back into school or was that it"
    },
    {
      "speaker": "Troy",
      "time": "00:13:46",
      "upperBoundTime": "00:14:43",
      "content": "No actually I wanted to get back in school I asked my mom about getting back in school and they made a big issue well not my mom but I was told I went to this school I was trying to further my trying to get my GED and it was the school on St. Claude. I want to say it was MacDonald 28. I'm not sure it was adult school, and I went there to try to apply to get into this school, and they told me that I would have to go and go to the last school that I went to to get my records and so I went to my mom to try to get her to help me but she wasn't really she wasn't really too eager to try and help me get that done so I just said forget it"
    },
    {
      "speaker": "Marcus",
      "time": "00:14:43",
      "upperBoundTime": "00:14:47",
      "content": "Did you have a person you were particularly close to coming up like a best friend?"
    },
    {
      "speaker": "Troy",
      "time": "00:14:47",
      "upperBoundTime": "00:16:03",
      "content": "Yeah man I have a little cousin man his name Kareem Collins and he was the we were like brothers man he was the person that I mean I would tell whatever it was I- he was maybe I think Kareem maybe 2 or 3 years younger than me but man we come up together man we were like brothers man and whenever I was dealing with an issue man I always felt comfort in telling him man and talking to him about it."
    },
    {
      "speaker": "Troy",
      "time": "00:14:47",
      "upperBoundTime": "00:16:03",
      "content": "And he was younger than me and he would he would offer opinion maybe what it is I should do. Offered advice man maybe you should do this and we was like that with each other but now he's suffering with a mental issue now yeah he's they says it's that he's schizophrenic and I never seen this coming about yeah and so a lot of times I always call ask about him he's always in the mental hospital yeah"
    },
    {
      "speaker": "Marcus",
      "time": "00:16:03",
      "upperBoundTime": "00:16:14",
      "content": "So after the first sort of brush with the law with the auto theft when was the next time you were arrested?"
    },
    {
      "speaker": "Troy",
      "time": "00:16:14",
      "upperBoundTime": "00:16:18",
      "content": "Oh well I got arrested several times for auto theft"
    },
    {
      "speaker": "Marcus",
      "time": "00:16:18",
      "upperBoundTime": "00:16:20",
      "content": "Was it joyriding?"
    },
    {
      "speaker": "Troy",
      "time": "00:16:20",
      "upperBoundTime": "00:18:28",
      "content": "It was yeah it was definitely joyriding yeah it was joyriding I actually learned how to drive in stealing cars it was and it wasn't so much me wanting to take the car to sell it or parts I was just enjoying the fact that I was learning how to drive and really I was really trying to fit in I was when I got introduced to auto theft it was some guys that I had grown up with."
    },
    {
      "speaker": "Troy",
      "time": "00:16:20",
      "upperBoundTime": "00:18:28",
      "content": "And I never had done anything like it before never even imagined even doing anything like it and once we had moved out the st Thomas project these same guys that I sued to play we used to play hound dog we used to run behind each other and play hound dog its almost like playing it we used to call I hound dog and when we moved out we moved out the project and"
    },
    {
      "speaker": "Troy",
      "time": "00:16:20",
      "upperBoundTime": "00:18:28",
      "content": "I I missed my old friends and so I convinced my dad to let me go and stay by this lady that he knew and I was happy to see my old friends but these guys they had moved on to something beyond playing it they were stealing cars and they introduced me to it and they was like man you coming with us? And I was like coming where?"
    },
    {
      "speaker": "Troy",
      "time": "00:16:20",
      "upperBoundTime": "00:18:28",
      "content": "They said come on we going to hit a hustle man I said a hustle what is that man? Said just come on with us and I was more cautious than I was really more than anything and I went with them and they had me as the lookout man and I stood there and they stole a guy car popped the car up and we all jumped in and went joyriding later on at night we wind up getting into a high speed chase and got arrested"
    },
    {
      "speaker": "Marcus",
      "time": "00:18:28",
      "upperBoundTime": "00:18:31",
      "content": "Yeah. Were drugs and alcohol part of your life at that time?"
    },
    {
      "speaker": "Troy",
      "time": "00:18:31",
      "upperBoundTime": "00:19:10",
      "content": "No not at that time but later on in life I had a experience using drugs I've tried I've tried several drugs I wasn't really big on drugs nothing big like cocaine or heroin or anything like that that it just wasn't my thing I've smoked marijuana and that was mainly my choice of drug I smoked marijuana yeah but drinking I wasn't real big on that either"
    },
    {
      "speaker": "Marcus",
      "time": "00:19:10",
      "upperBoundTime": "00:19:22",
      "content": "So now you're getting closer to like 18, 19 at this time? Still getting in trouble with the cars"
    },
    {
      "speaker": "Troy",
      "time": "00:19:22",
      "upperBoundTime": "00:20:00",
      "content": "Well no, I was introduced to bigger things then I mean it was true me wanting to be be in with the fellas wanting to be accepted I was introduced to selling crack cocaine man I had no idea how it should be broke down or how it should be distributed and I remember this guy name weeby he introduced me to it yeah"
    },
    {
      "speaker": "Marcus",
      "time": "00:20:00",
      "upperBoundTime": "00:20:07",
      "content": "And so was it in that context that the crime that you're convicted of now. Was it in the context of dealing crack cocaine?"
    },
    {
      "speaker": "Troy",
      "time": "00:20:07",
      "upperBoundTime": "00:20:23",
      "content": "Oh man yes it was definitely it was yeah it was it had it had its parts played in it yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:23",
      "upperBoundTime": "00:20:32",
      "content": "Sure what about girls did you have tell me a little bit about the girls in your life at that point around when you're 19 years old"
    },
    {
      "speaker": "Troy",
      "time": "00:20:32",
      "upperBoundTime": "00:21:33",
      "content": "God man I mean with the drugs man it was that was a thing that come along with it I mean for a long time I was I was shy for for a good part of my life and at a young age I had quite a few girlfriends but I was always how would I say I was I would reject the girl that was aggressive toward me I didn't really like that I would more like less like to chase her and but for the most part I want to believe that I was I was a gentleman I never believed in hitting any girls I never believed in just disrespecting them I mean a lot of girls that I come up with I'm now even today after 24 years I'm still in touch with a lot of them"
    },
    {
      "speaker": "Marcus",
      "time": "00:21:33",
      "upperBoundTime": "00:21:33",
      "content": "Do you have any children?"
    },
    {
      "speaker": "Troy",
      "time": "00:21:33",
      "upperBoundTime": "00:21:34",
      "content": "Yes I have yes"
    },
    {
      "speaker": "Marcus",
      "time": "00:21:34",
      "upperBoundTime": "00:21:36",
      "content": "Tell me about them"
    },
    {
      "speaker": "Troy",
      "time": "00:21:36",
      "upperBoundTime": "00:21:57",
      "content": "Oh man Tranoka, yeah that's my daughter Tranoka I never I never been on the street with her man when her mom was pregnant man I was here on this charge here I was I was I was …"
    },
    {
      "speaker": "Marcus",
      "time": "00:21:57",
      "upperBoundTime": "00:21:59",
      "content": "When was the last time you saw her?"
    },
    {
      "speaker": "Troy",
      "time": "00:21:59",
      "upperBoundTime": "00:23:02",
      "content": "Oh, I want to say man maybe it's been it's been almost a year now close to a year I want to say but I talk to her regularly I talk to yeah I talk to her over the phone regular she just recently got married man yeah she just recently got married and I always tell her man. She does she do her best I always tell her never expect somebody to do for you what you can do for yourself."
    },
    {
      "speaker": "Troy",
      "time": "00:21:59",
      "upperBoundTime": "00:23:02",
      "content": "And she always tell me how hard it is and it hurt me because I really want to I really want that responsibility of being a parent to be able to help her to and its really my fault that she's going through and have been through the things that she's been through and I always tell her I'm sorry its really my fault"
    },
    {
      "speaker": "Marcus",
      "time": "00:23:02",
      "upperBoundTime": "00:23:15",
      "content": "Is there, over the years if you could point to one person who's kind of always been there for you on the outside who would that one person be?"
    },
    {
      "speaker": "Troy",
      "time": "00:23:15",
      "upperBoundTime": "00:23:21",
      "content": "Shirley my aunt Shirley"
    },
    {
      "speaker": "Marcus",
      "time": "00:23:21",
      "upperBoundTime": "00:23:24",
      "content": "And when was the last time you talked to her"
    },
    {
      "speaker": "Troy",
      "time": "00:23:24",
      "upperBoundTime": "00:23:31",
      "content": "Oh man I talk to her regularly man I talk to my aunt Shirley more than I do my mom"
    },
    {
      "speaker": "Marcus",
      "time": "00:23:31",
      "upperBoundTime": "00:23:35",
      "content": "What's your memory of the most recent time you were together physically?"
    },
    {
      "speaker": "Troy",
      "time": "00:23:35",
      "upperBoundTime": "00:24:03",
      "content": "My aunt Shirley? She used to come man she used to come every month man I would always tell her say ma you don't have to come up here and she made it clear you don't tell me what to do and so I never told her that again and so she would come every month and her health's going bad and so I think that's maybe a big part that she"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:03",
      "upperBoundTime": "00:24:03",
      "content": "She's in her 80s right"
    },
    {
      "speaker": "Troy",
      "time": "00:24:03",
      "upperBoundTime": "00:24:23",
      "content": "Yeah she like I say she's 84 I want to say going on 25 yeah"
    },
    {
      "speaker": "Marcus",
      "time": "00:24:23",
      "upperBoundTime": "00:24:46",
      "content": "If you could point to one thing that kinda led you down the wrong path sometimes its more than one thing is there something that stands out an experience of being exposed to certain things so what do you chalk it up to when you have to say what got me down that path what would it be?"
    },
    {
      "speaker": "Troy",
      "time": "00:24:46",
      "upperBoundTime": "00:25:37",
      "content": "I just I don't know I ask myself that question a lot I mean its I want to believe that I had a normal upbringing like everyone else did outside of certain things that happened in my childhood but for the most part I want to believe I had a normal upbringing."
    },
    {
      "speaker": "Troy",
      "time": "00:24:46",
      "upperBoundTime": "00:25:37",
      "content": "And I just when my I really think maybe when my dad and my mom split that that man figure in the house it kind of like let me run wild I didn't have anybody there to really to hold me down and I kind of like got a little loose man"
    },
    {
      "speaker": "Marcus",
      "time": "00:25:37",
      "upperBoundTime": "00:25:40",
      "content": "Sure so where does the name nokie come from"
    },
    {
      "speaker": "Troy",
      "time": "00:25:40",
      "upperBoundTime": "00:25:53",
      "content": "Oh man it's a family name man I want to say it had a lot to do with the doll the doll Pinocchio I think man maybe it come from that"
    },
    {
      "speaker": "Marcus",
      "time": "00:25:53",
      "upperBoundTime": "00:26:08",
      "content": "Oh Nokie from Pinocchio. So nokie lets go back to the day you first got here tell me about that day"
    },
    {
      "speaker": "Troy",
      "time": "00:26:08",
      "upperBoundTime": "00:26:43",
      "content": "Oh man, I was scared, that's for sure. I was definitely scared. I don't think I was scared of anybody like any individual I don't think I was scared I was really scared of the unknown. I mean I've heard a lot about Angola and I felt like I was prepared to look after myself but all the things that I've heard I was like I was mainly scared of the unknown yeah"
    },
    {
      "speaker": "Marcus",
      "time": "00:26:43",
      "upperBoundTime": "00:26:54",
      "content": "If you could describe that person you see young guys coming in here all the time with certain life sentences it must when you see them so young it must take you back to your own self"
    },
    {
      "speaker": "Troy",
      "time": "00:26:54",
      "upperBoundTime": "00:28:07",
      "content": "Yeah man I was I look at my rap sheet I just looked at it just recently man I had to get some information off of there I look at it man I was 5'3\" 130 lbs. man and I mean in Angola man and I wanted to believe I was tough that I that I could've maybe handled myself but when I first come here the classification people they bring you through the process of where it is they going to house you at and I remember miss Anthony and Mr. Williams when they seen me and I walked in the office they was like whoa they was like thrown back they was like she was like Mr. Williams no."
    },
    {
      "speaker": "Troy",
      "time": "00:26:54",
      "upperBoundTime": "00:28:07",
      "content": "And he was like I already know I already know so they sent me to camp j bus it was during the time it was more like a protection camp and I guess maybe because of my age and my size and had a lot to do with it I guess they thought maybe they were I stood a better chance of making it in prison"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:07",
      "upperBoundTime": "00:28:16",
      "content": "Sure. 24 years later you're like anybody you're a different person"
    },
    {
      "speaker": "Troy",
      "time": "00:28:16",
      "upperBoundTime": "00:28:19",
      "content": "Oh man"
    },
    {
      "speaker": "Marcus",
      "time": "00:28:19",
      "upperBoundTime": "00:28:43",
      "content": "One of the reasons we wanted to talk with you is you are considered a trusted member of this community somebody who's turned their life around for the better. If you were to come before a pardon board parole board all they would have is your rap sheet. What would you like them to know about you?"
    },
    {
      "speaker": "Troy",
      "time": "00:28:43",
      "upperBoundTime": "00:29:33",
      "content": "I would want them to know that I'm real sorry for what happened and I'm I mean I think about it every day the thing that I did learn is that nobody wins with murder nobody wins I mean look at all the people that's affected by by a decision a bad decision a mistake I mean I mean here it is the victim his mother she's lost her son I and the list goes on I mean even for me my mom she's lost her son my daughter she lost her dad and just nobody wins everybody lose."
    },
    {
      "speaker": "Marcus",
      "time": "00:29:33",
      "upperBoundTime": "00:29:37",
      "content": "Yeah. What would you want them to know about you?"
    },
    {
      "speaker": "Troy",
      "time": "00:29:37",
      "upperBoundTime": "00:31:21",
      "content": "Oh man that definitely through maturity man I want to put it on that I mean and god's blessing man that I was able to come here and get involved in a lot of positive programs man I'm a I've completed my GED studies I've completed a lot of self help programs anger management substance abuse 1 and 2 I've even graduated just recently from votech school I've graduated in HVAC."
    },
    {
      "speaker": "Troy",
      "time": "00:29:37",
      "upperBoundTime": "00:31:21",
      "content": "I've received one of the most recognized certifications in the trade which is called HVAC excellence and I'm scheduled to take I've received the electrical part of it and I'm scheduled to take the test for residential and like commercial also and I'm also scheduled to become a mentor yes."
    },
    {
      "speaker": "Troy",
      "time": "00:29:37",
      "upperBoundTime": "00:31:21",
      "content": "And that's something I really have a passion for because I really think that I can relate to younger guys that's come up the same way that I have I mean I just want to let em know man that life is alive man I mean you see all these shiny things man and its a price you pay for that man its a price you pay it may be your life I mean you may not be fortunate enough to come to prison to try and better yourself you may lose your life man and once that's done its over man"
    },
    {
      "speaker": "Marcus",
      "time": "00:31:21",
      "upperBoundTime": "00:31:29",
      "content": "Do you think it's likely that had you not been arrested on this charge that you could well have been killed?"
    },
    {
      "speaker": "Troy",
      "time": "00:31:29",
      "upperBoundTime": "00:32:47",
      "content": "Very well possible very well possible. I what I used to do I used to I used to get the times picayune and a lot of the guys that I've grown up with man I used to always cut the obituary out the paper man I actually have a scrapbook man of a lot of guys that I've grown up with man that I remember we being kids man playing in the park man and I come up through the calliope project as well that's where my aunt Shirley stayed."
    },
    {
      "speaker": "Troy",
      "time": "00:31:29",
      "upperBoundTime": "00:32:47",
      "content": "So I come up between staying with my mom in the st Thomas and my aunt Shirley in the calliope and they had this park named rosemore park and man some of the guys man I seen come through that park as far as I thought that was going to be real good athletes maybe I be watching on TV these same guys man they moved on man to make bad decisions and start living the life of crime man and I'm cutting these dudes out the paper man they lost their life man and yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:47",
      "upperBoundTime": "00:33:08",
      "content": "What's when people turn their lives around sometimes it's because they can point to one experience or a mentor for example and for others it's a sort of gradual process. What made you turn your life around for the better?"
    },
    {
      "speaker": "Troy",
      "time": "00:33:08",
      "upperBoundTime": "00:35:13",
      "content": "I just wanted to to do better man I just always felt that I was a better person than I was I always felt like I can do better I mean it was definitely it definitely gave me confidence when I passed my GED because I never thought maybe that I can actually do that and once I'm done that I was like well man lets see how far you can go man and I went on to graduate from Votech school man I was like that and I want to say man that this guy by the name of guy that slept right on the side of me this dude here man he so smart man he really inspired me a lot too a guy by the name of Alex henders man this dude here he would always tell me man you smart man why don't you try and get back in school man."
    },
    {
      "speaker": "Troy",
      "time": "00:33:08",
      "upperBoundTime": "00:35:13",
      "content": "And it was kinda like a tough decision to make because I was working a job in administration building and its more or less like in prison looked at as being like a what you want to say a layout job well I had to make that decision did I want to better myself or did I want to continue on just working this job that really it had its advantages but do you want to educate yourself, if you get out of here my question to myself that made me make the move was that if you get out here right now today troy what is it that how to do?"
    },
    {
      "speaker": "Troy",
      "time": "00:33:08",
      "upperBoundTime": "00:35:13",
      "content": "And I was like whoa. And so that was the question that I asked myself that made me want to further my education yeah that that was the questions that I asked myself that made me really want to get after my education"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:13",
      "upperBoundTime": "00:35:34",
      "content": "Sure yeah makes sense. So this is a difficult question but it's something that we have to talk about in this project and that is from time to time I'm sure you consider that give your sentence life without parole that you may never leave here"
    },
    {
      "speaker": "Troy",
      "time": "00:35:34",
      "upperBoundTime": "00:35:36",
      "content": "True"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:36",
      "upperBoundTime": "00:35:40",
      "content": "Which is almost unimaginable to me when I think about that how do you cope with that possibility?"
    },
    {
      "speaker": "Troy",
      "time": "00:35:40",
      "upperBoundTime": "00:36:31",
      "content": "Hope. Hope. hope man I'm just livin day by day through hope man hope that hope that it's a better tomorrow man day to day its hope man I know that its very well its possible that I may die here but I mean I just want to do the best that I can while I'm still here and the best that I can do is to try and better my self while I'm here to not wait until if I do get an opportunity to get out here to try and better myself I want to do that now I want to start that now and that's always been my thought so I mean"
    },
    {
      "speaker": "Marcus",
      "time": "00:36:31",
      "upperBoundTime": "00:36:42",
      "content": "Yeah what do you think is the worst part of being here what's the worst part about Angola and prison"
    },
    {
      "speaker": "Troy",
      "time": "00:36:42",
      "upperBoundTime": "00:37:42",
      "content": "I mean being the worst part is being away from your family man I mean when you hear things over the phone you feel like if you were there that you can fix these things and by you not being present it's like it's how would I say is it's frustrating and you really want to you want to be this man that that god had intended you to be you want to be there for your family you want to I want that responsibility of people depending on me I want this? And me being here is frustrating that I'm not able to aid my family?"
    },
    {
      "speaker": "Marcus",
      "time": "00:37:42",
      "upperBoundTime": "00:37:44",
      "content": "Sure if there's a good thing about Angola what do you think the best thing about your experience has been?"
    },
    {
      "speaker": "Troy",
      "time": "00:37:44",
      "upperBoundTime": "00:39:10",
      "content": "The best thing about my experience here is that it preserved me I want to believe that it preserved me because and it may have saved my life as well because it gave me time to mature to understand to understand what life is about and now that I do understand it it's like I then lost my life now? Its through growing up through maturity I mean as you get older you its, you just don't you think differently you want to see people do good."
    },
    {
      "speaker": "Troy",
      "time": "00:37:44",
      "upperBoundTime": "00:39:10",
      "content": "You don't want to see nobody get hurt and when you get older when you were younger you would maybe if somebody's about to get into a little dispute you would maybe stand to the side and maybe cheer it on. But now that you're older now you more like don't want to see this happen, and you would go there and maybe just man now cool it out man and maybe that's all it takes for guys just to snap back and be like man you right and I think maybe its through maturity that you don't want to see these things happen now"
    },
    {
      "speaker": "Marcus",
      "time": "00:39:10",
      "upperBoundTime": "00:39:22",
      "content": "Sure. I'm sure you've spent quite a bit of time imagining what you would do if you were released tomorrow. What do you envision for your life?"
    },
    {
      "speaker": "Troy",
      "time": "00:39:22",
      "upperBoundTime": "00:40:49",
      "content": "Oh man I definitely want to pursue the trade that I've that I've graduated in HVAC man I love it man I love it I never thought that I remember when I first got in the class this guy Chester sneider he was the instructor and he was using all these different all these different terms votech terms all these different terms and he was talking about the different components about the evaporator the condenser the compressor the TXVN and I was like what are you talking about dude."
    },
    {
      "speaker": "Troy",
      "time": "00:39:22",
      "upperBoundTime": "00:40:49",
      "content": "And I went to him and I told him I said man I pulled him to the side I said man I think I bit off a little more than I can chew and he laughed and he said man just give it time he said everyone that comes here man he said man its it takes a little time he said but read this here module which he directed me to module 7 and he said read this module he said and I promise you once you understand this module man he said everything's going to come to you man and he was right and I'm glad that he did Man and I love it man I really do and I do man"
    },
    {
      "speaker": "Marcus",
      "time": "00:40:49",
      "upperBoundTime": "00:40:52",
      "content": "That's great and it's a very marketable skill"
    },
    {
      "speaker": "Troy",
      "time": "00:40:52",
      "upperBoundTime": "00:41:20",
      "content": "Yes it is I love it man I do. I never thought I can actually do this I never had a job before in my life man and I'm really I'm really eager man I'm excited man that I've learned this and I really, really want to put this into practice man because I mean not only could it change my life but I can possibly help change my family's life as well"
    },
    {
      "speaker": "Marcus",
      "time": "00:41:20",
      "upperBoundTime": "00:41:27",
      "content": "Sure. You've given me a lot of really useful information and I appreciate you taking the time today"
    },
    {
      "speaker": "Troy",
      "time": "00:41:27",
      "upperBoundTime": "00:41:29",
      "content": "I appreciate you coming out man"
    },
    {
      "speaker": "Marcus",
      "time": "00:41:29",
      "upperBoundTime": "00:41:41",
      "content": "Is there a question that I should have asked you that I didn't or something that you wanted an opportunity to talk about that you didn't get a chance to?"
    },
    {
      "speaker": "Troy",
      "time": "00:41:41",
      "upperBoundTime": "00:41:41",
      "content": "Man."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:41",
      "upperBoundTime": "00:42:02",
      "content": "Maybe I should have asked you this. We had the conversation earlier about the fact that what's happening in prison is invisible the good the bad the ugly it's all invisible to people on the outside. What do you want people to know about the experience of serving life without parole?"
    },
    {
      "speaker": "Troy",
      "time": "00:42:02",
      "upperBoundTime": "00:43:12",
      "content": "That people can change man. That if I mean if not me I mean I knew a lot of guys that deserve a second chance I mean yeah I've met they have a lot of guys here that really deserve a second chance and I would I would like to see those guys at least get a parole hearing."
    },
    {
      "speaker": "Troy",
      "time": "00:42:02",
      "upperBoundTime": "00:43:12",
      "content": "I mean not the necessarily say that these guys should be cut loose but just to be able to go up and talk for they self and maybe they get a chance to actually see the change in these guys from the time that they got here up until the point to the time that they've served these guys have really really made a big turnaround and I would want society to know that I don't think these guys are a threat."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:12",
      "upperBoundTime": "00:43:13",
      "content": "Right"
    },
    {
      "speaker": "Troy",
      "time": "00:43:13",
      "upperBoundTime": "00:43:22",
      "content": "Because they experienced the same thing that I have maturity. Maturity it took time but we reached that point."
    },
    {
      "speaker": "Marcus",
      "time": "00:43:22",
      "content": "That's a very good point to end it on."
    }
  ]
}
