{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:00",
      "content": "Vashon Kelly Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Vashon",
      "time": "00:00:00",
      "upperBoundTime": "00:00:22",
      "content": "My name is Vashon Kelly. I've been in Angola for twenty-three years for the crime of second-degree murder."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:22",
      "upperBoundTime": "00:00:23",
      "content": "How old were you?"
    },
    {
      "speaker": "Vashon",
      "time": "00:00:23",
      "upperBoundTime": "00:00:28",
      "content": "I was 20 years old when I came to Angola, when I caught this charge."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:28",
      "upperBoundTime": "00:00:51",
      "content": "Okay, I'm going to ask you some questions about your life before this charge and then I'm going to ask you personal questions about your life since the charge. So first of all, I want to learn a little bit more about your childhood. So tell me a little bit about the folks who raised you."
    },
    {
      "speaker": "Vashon",
      "time": "00:00:51",
      "upperBoundTime": "00:01:05",
      "content": "Well, I was raised in a pretty good family – two parent home, I have six other siblings, three brothers and three sisters."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:05",
      "upperBoundTime": "00:01:07",
      "content": "Where are you in the birth order?"
    },
    {
      "speaker": "Vashon",
      "time": "00:01:07",
      "upperBoundTime": "00:01:18",
      "content": "Third, I was the third boy. Church-oriented."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:18",
      "upperBoundTime": "00:01:19",
      "content": "Where?"
    },
    {
      "speaker": "Vashon",
      "time": "00:01:19",
      "upperBoundTime": "00:01:31",
      "content": "In New Orleans, the Carrolton area. Pretty good neighborhood, I had a pretty decent childhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:31",
      "upperBoundTime": "00:01:33",
      "content": "Your parents, do they get along well?"
    },
    {
      "speaker": "Vashon",
      "time": "00:01:33",
      "upperBoundTime": "00:01:41",
      "content": "Of course they did. I mean, the ups and downs of being married and having children, but it was real nice."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:41",
      "upperBoundTime": "00:01:45",
      "content": "How about school? How was school for you?"
    },
    {
      "speaker": "Vashon",
      "time": "00:01:45",
      "upperBoundTime": "00:02:09",
      "content": "Wonderful. An average public school that went through the Uptown area. School started at Robert E. Lee elementary, ended in Alcee Fortier high school, which is where I graduated at."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:09",
      "upperBoundTime": "00:02:20",
      "content": "Do you have someone particularly close to you coming up, like a best friend, a close friend you can think of?"
    },
    {
      "speaker": "Vashon",
      "time": "00:02:20",
      "upperBoundTime": "00:02:49",
      "content": "Well, I think I had a – I didn't have time for an actual one friend or two friends. We went to church so we had friends there, we went to different functions and had friends there so. It was like a community-oriented life in my childhood."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:49",
      "upperBoundTime": "00:02:58",
      "content": "Sure. I want to get a picture, I know the Carrolton area but I want to get a picture in my mind. Do you have a front porch?"
    },
    {
      "speaker": "Vashon",
      "time": "00:02:58",
      "upperBoundTime": "00:03:00",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:00",
      "upperBoundTime": "00:03:13",
      "content": "Let's say, let's go back – we're eighteen years old sitting on your front porch, an afternoon in the summertime. What would we see?"
    },
    {
      "speaker": "Vashon",
      "time": "00:03:13",
      "upperBoundTime": "00:03:53",
      "content": "Well, if you look at my porch, you must look at everyone's porch on the block because everybody would be out at that time. Most of the people on that block, that one particular block from one corner to another, they were homeowners so we were probably congregating on that street from one porch to the next."
    },
    {
      "speaker": "Vashon",
      "time": "00:03:13",
      "upperBoundTime": "00:03:53",
      "content": "You'd see five children on this porch, and ten children on the other so you can't have one without the other. And that was just growing up like that, that's how we grew up."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:53",
      "upperBoundTime": "00:03:55",
      "content": "What do your parents do for a living?"
    },
    {
      "speaker": "Vashon",
      "time": "00:03:55",
      "upperBoundTime": "00:04:20",
      "content": "My father was a truck driver, he did truck driving for A & P for quite some time and my mother, she was a homemaker for most of my childhood and then she started nursing in maybe my high school years, she started nursing on her own."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:20",
      "upperBoundTime": "00:04:28",
      "content": "So would it be accurate for me to say that for the most part your childhood was characterized by being in a loving, nurturing family?"
    },
    {
      "speaker": "Vashon",
      "time": "00:04:28",
      "upperBoundTime": "00:04:30",
      "content": "Oh for sure."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:30",
      "upperBoundTime": "00:04:32",
      "content": "Did you play sports in school?"
    },
    {
      "speaker": "Vashon",
      "time": "00:04:32",
      "upperBoundTime": "00:04:34",
      "content": "No, I didn't."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:34",
      "upperBoundTime": "00:04:37",
      "content": "What did you do for fun?"
    },
    {
      "speaker": "Vashon",
      "time": "00:04:37",
      "upperBoundTime": "00:04:40",
      "content": "Play with girls."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:40",
      "upperBoundTime": "00:04:45",
      "content": "All right, well tell me about that; was there one person who was particularly close to you?"
    },
    {
      "speaker": "Vashon",
      "time": "00:04:45",
      "upperBoundTime": "00:05:11",
      "content": "Yes there was. She was a young lady who caught my eye very early in age and this girl in particular; I had a kid with very early in my teenage years. Actually, I was sixteen. So, we had a kid at that age which was very, very hard."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:11",
      "upperBoundTime": "00:05:13",
      "content": "Tell me about that kid."
    },
    {
      "speaker": "Vashon",
      "time": "00:05:13",
      "upperBoundTime": "00:06:01",
      "content": "My son is a bright young man. He's the love of my life, I love him very much. He changed my life dramatically because I was a kid in an adult world so I had to grow up real fast. Because with my upbringing, you weren't leaving that kid without anything. So it was a real experience for me, but it was all love."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:01",
      "upperBoundTime": "00:06:04",
      "content": "Did you stay at home and did your girlfriend stay at her home?"
    },
    {
      "speaker": "Vashon",
      "time": "00:06:04",
      "upperBoundTime": "00:06:40",
      "content": "Yeah, we never joined ourselves as a relationship. I mean, when you look at two kids that are having a baby, then you have two sets of parents that's not in agreement with a family at that age. I'm more than sure that my parents wanted me to go to college and have an easier life than having a kid."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:40",
      "upperBoundTime": "00:06:49",
      "content": "Right, sure. So your son was four when this happened?"
    },
    {
      "speaker": "Vashon",
      "time": "00:06:49",
      "upperBoundTime": "00:06:58",
      "content": "Right, well, he was two, going on three years old."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:58",
      "upperBoundTime": "00:07:04",
      "content": "I say that because you said you had a son at sixteen and you caught this charge at twenty."
    },
    {
      "speaker": "Vashon",
      "time": "00:07:04",
      "upperBoundTime": "00:07:14",
      "content": "Right, I'm saying sixteen going on seventeen, eighteen, those years."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:14",
      "upperBoundTime": "00:07:16",
      "content": "Sure, I'm just trying to do the math–"
    },
    {
      "speaker": "Vashon",
      "time": "00:07:16",
      "upperBoundTime": "00:07:20",
      "content": "Oh, no, you're good, you're good."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:20",
      "upperBoundTime": "00:07:25",
      "content": "So did you try to go to college or is that something that your son coming into your life kind of derailed?"
    },
    {
      "speaker": "Vashon",
      "time": "00:07:25",
      "upperBoundTime": "00:07:43",
      "content": "Well, he did derail it for a minute but it was always on my mind. At the opportunity to go to college, I did but it was here at the penitentiary."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:43",
      "upperBoundTime": "00:07:50",
      "content": "Was there any fighting in your adolescence? Did you fight a lot?"
    },
    {
      "speaker": "Vashon",
      "time": "00:07:50",
      "upperBoundTime": "00:08:18",
      "content": "We had boy fights, just doing boy things. We had our swings and our disagreements, never nothing violent or anything where we couldn't make up before we left that group of boys."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:18",
      "upperBoundTime": "00:08:22",
      "content": "Did you ever feel the need to carry a weapon?"
    },
    {
      "speaker": "Vashon",
      "time": "00:08:22",
      "upperBoundTime": "00:08:37",
      "content": "Yes, when I got on my own, started living on my own outside of my normal neighborhood I had been growing up in, yes, I did."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:37",
      "upperBoundTime": "00:08:40",
      "content": "And what were you doing to support yourself?"
    },
    {
      "speaker": "Vashon",
      "time": "00:08:40",
      "upperBoundTime": "00:09:09",
      "content": "I catered, I did a lot of catering which was pretty good money for me at the time. Did little in and out jobs, carpentry with people that I knew and that had known me and knew that I was a teen father. I helped out doing a little carpentry work like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:09",
      "upperBoundTime": "00:09:23",
      "content": "Sure. Do you remember the first time you were arrested for anything?"
    },
    {
      "speaker": "Vashon",
      "time": "00:09:23",
      "upperBoundTime": "00:10:00",
      "content": "Yes, I do remember the first time I was arrested. It was a battery charge, maybe I was seventeen or so, I had a fight, a dispute. I was cited and let out the next morning under my parents' signature. A hundred-dollar bail, I think it was. And I got out like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:00",
      "upperBoundTime": "00:10:02",
      "content": "Who was the fight with?"
    },
    {
      "speaker": "Vashon",
      "time": "00:10:02",
      "upperBoundTime": "00:10:12",
      "content": "A guy and another girl, how it goes. Just feeling things out, I guess."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:12",
      "upperBoundTime": "00:10:18",
      "content": "Sure. So other than the battery charge, did you have any other brushes with the law before this charge that –"
    },
    {
      "speaker": "Vashon",
      "time": "00:10:18",
      "upperBoundTime": "00:10:20",
      "content": "No, no."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:20",
      "upperBoundTime": "00:10:22",
      "content": "So, you weren't convicted of anything before this?"
    },
    {
      "speaker": "Vashon",
      "time": "00:10:22",
      "upperBoundTime": "00:10:25",
      "content": "No."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:25",
      "upperBoundTime": "00:10:40",
      "content": "Okay. Sometimes, it's very clear that before the charge with some of the other guys I've been talking with, that it's accurate to say that their lives had already gone way down the wrong path before that. It doesn't sound like that for you."
    },
    {
      "speaker": "Vashon",
      "time": "00:10:40",
      "upperBoundTime": "00:11:46",
      "content": "No, I mean, I wasn't raised in that type of environment. Don't get me wrong, the outskirts of people I went to high school with or junior high with, I saw that it was mandated that their neighborhood was in the arena of maybe drug, or some type of I don't want to say \"gang.\""
    },
    {
      "speaker": "Vashon",
      "time": "00:10:40",
      "upperBoundTime": "00:11:46",
      "content": "I never saw gangs in my neighborhood, but into wrongdoings before you do something right… I never was raised like that. Like I said, we were always in a position that when we were out of school, we were in vacation bible school or summer camp. So we didn't have the chance to delve off into the streets like in the definition that we know it now."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:46",
      "upperBoundTime": "00:11:49",
      "content": "So what led you down this path that you're on now?"
    },
    {
      "speaker": "Vashon",
      "time": "00:11:49",
      "upperBoundTime": "00:12:48",
      "content": "Wrong decisions. My charge in itself is second-degree murder, as I stated. I'm convicted of aiding and abetting. In so many words, this is a job related incident. I helped a guy get on at a job and he's kin to me and he committed a crime and I made the wrong decision of helping him get away from it."
    },
    {
      "speaker": "Vashon",
      "time": "00:11:49",
      "upperBoundTime": "00:12:48",
      "content": "And under Louisiana law, you can be convicted for aiding and abetting or being principle to the charge that actually happened and that's why I'm here."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:48",
      "upperBoundTime": "00:12:58",
      "content": "A lot of people, I think, don't understand that in Louisiana, there are many people serving life without parole for first or second-degree murder that didn't actually kill anybody."
    },
    {
      "speaker": "Vashon",
      "time": "00:12:58",
      "upperBoundTime": "00:13:24",
      "content": "Yeah, so that's what I'm here for. And that was my lesson learned, I had to learn that – just wrong decisions. I mean, it was real ignorant of me. I knew better, but at the time, I didn't think it was a bad idea but it was."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:24",
      "upperBoundTime": "00:13:26",
      "content": "Is that person serving a life sentence?"
    },
    {
      "speaker": "Vashon",
      "time": "00:13:26",
      "upperBoundTime": "00:13:27",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:27",
      "upperBoundTime": "00:13:27",
      "content": "Here?"
    },
    {
      "speaker": "Vashon",
      "time": "00:13:27",
      "upperBoundTime": "00:13:29",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:29",
      "upperBoundTime": "00:13:32",
      "content": "What's your relationship like with him?"
    },
    {
      "speaker": "Vashon",
      "time": "00:13:32",
      "upperBoundTime": "00:13:44",
      "content": "I don't have one with him. It's just… I don't have one with him."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:44",
      "upperBoundTime": "00:13:46",
      "content": "Were drugs and alcohol a part of your life at that time?"
    },
    {
      "speaker": "Vashon",
      "time": "00:13:46",
      "upperBoundTime": "00:14:02",
      "content": "No. I mean, drugs or alcohol, I drank alcohol but is it the underlying reason why I'm here? No."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:02",
      "upperBoundTime": "00:15:02",
      "content": "So one of the reasons we've been talking with people like yourself is that you were convicted when you were very, very young. You were still a kid essentially. You've already served twenty-plus years and you are widely considered to be a trusted member of this community, somebody who has rehabilitated at least from what the crime of conviction suggests what they were at the time."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:02",
      "upperBoundTime": "00:15:02",
      "content": "But can you just take a minute to describe the twenty-year old man, the twenty-year old Vashon who… I see you went to the parish prison for a bit, and then coming through the Angola gates, can you describe him?"
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "First, very confusing, when you are who I was at the time, just the first time ever going through the prison population like that, you go through a culture shock. I mean, that's what I did, I didn't know anything about prison or how to live, what I should be doing at certain times."
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "So I was very confused and attentive at the time of going through the parish prison and trying to, what they call \"fighting the charge.\" Real shortly, I realized I needed to know the law; I needed to start understanding what the law was. Which is like learning a whole other language all over again."
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "But it wasn't enough time to learn the law in its language with the time that I had before I went to trial. And because I didn't understand, I believe, I was convicted for the crime. Because all in my mind, I'm saying, \"Well, I didn't kill anybody! Once they see that I didn't kill anybody,\" and that thought went all the way to trial. \"Well, they going to see, the jury gonna see that I didn't kill anybody,\" so I just didn't pay attention."
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "But when it was handed down, \"Guilty!\" I'm saying, \"For what? Because I didn't call the police or act upon the situation like I was supposed to?\" So when I came to Angola, just to move forward with it, I realized that, \"Okay, under the law, I did do something wrong. I aided and abetted somebody. That's what the charges of second-degree murder carries, that's one of the elements."
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "I actually was thought of to have planned and helped a guy commit murder, which was hard to swallow because I had my own protections against myself of things I just won't do in my life and murder was not one of them. In that thought, I became very angry at the system, at myself for making such a bad decision because I left a lot of things out there, I left a lot of hopes and dreams, not only for myself but for people who helped me in my upbringing, my son."
    },
    {
      "speaker": "Vashon",
      "time": "00:15:02",
      "upperBoundTime": "00:18:42",
      "content": "So I became a very angry person at the time but I learned to suck it up. I learned to be a man about it. I learned that my life wasn't over and I also learned to be who I was. Who I was designed to be and I started doing things for myself that would help me grow."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:42",
      "upperBoundTime": "00:18:46",
      "content": "What kinds of things?"
    },
    {
      "speaker": "Vashon",
      "time": "00:18:46",
      "upperBoundTime": "00:21:27",
      "content": "First, I started just volunteering my time. I would volunteer my time with a couple of guys that were older than me, they would actually do small things like bring toiletries to the dorms to the guys that need it, who don't have anything. Host Christmas parties or make sure a guy had a birthday cake, small things like that."
    },
    {
      "speaker": "Vashon",
      "time": "00:18:46",
      "upperBoundTime": "00:21:27",
      "content": "Being with me, I experienced it every birthday, I had coming up, I had a party, But these guys they didn't, I said well I'll do that. After that, this one guy, he's gone home now, he was a good friend of mine, he started telling maybe two or three times out of the year, \"Come over here,\" and we'd go to the hospital and we will volunteer our time."
    },
    {
      "speaker": "Vashon",
      "time": "00:18:46",
      "upperBoundTime": "00:21:27",
      "content": "On certain banquet days, the lifers Association would bring the second chance to these banquets. So we would usher these guys over to the banquet and have a good time with them. And that led to my hospice volunteer status. So I did hospice and I learned how to, I learned compassion."
    },
    {
      "speaker": "Vashon",
      "time": "00:18:46",
      "upperBoundTime": "00:21:27",
      "content": "And I think that was something that I needed, because I look back at the actual crime and I put myself in a community of people and I see that I handled myself totally wrong. I mean, in a real community, why would I walk away from someone that had just been shot and not alarm any authority about it? I think that I was wrong. I think that was very wrong for me to do. But because of circumstances, I didn't."
    },
    {
      "speaker": "Marcus",
      "time": "00:21:27",
      "upperBoundTime": "00:21:34",
      "content": "It takes a special kind of person to work in hospice. Tell me a little more about that."
    },
    {
      "speaker": "Vashon",
      "time": "00:21:34",
      "upperBoundTime": "00:22:59",
      "content": "Well, like I said it's an organization that helps people die comfortably. And with that organization inside a prison, it's warranted even more because a lot of guys don't have family, they don't have anyone to share their life with, especially the end of life."
    },
    {
      "speaker": "Vashon",
      "time": "00:21:34",
      "upperBoundTime": "00:22:59",
      "content": "So when you become what I became, a hospice volunteer I saw the need to become what we define as inmate family. We would actually become that person's brother, uncle, father, anything that we needed to do to make sure that person was loved before they left this world."
    },
    {
      "speaker": "Vashon",
      "time": "00:21:34",
      "upperBoundTime": "00:22:59",
      "content": "` So the compassion part, I keep speaking about compassion because it's key. That was something that I enjoyed doing for somebody especially when they entrust me with the end of their life."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:59",
      "upperBoundTime": "00:23:03",
      "content": "Are you still doing that kind of work?"
    },
    {
      "speaker": "Vashon",
      "time": "00:23:03",
      "upperBoundTime": "00:23:15",
      "content": "No, I stopped maybe two years ago but I still affiliate with the organization. They'll always be a part of my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:15",
      "upperBoundTime": "00:23:20",
      "content": "Can you tell me a little bit about your daily routine now and what kinds of organizations you might be a part of?"
    },
    {
      "speaker": "Vashon",
      "time": "00:23:20",
      "upperBoundTime": "00:24:54",
      "content": "Yeah, well, the reason why I stopped hospice was because I got into college, I got into the seminary here and I graduated from the seminary here in Angola in 2015 so what I did was – my understanding of ministry became a broader definition so what I did was, I affiliated with hospice in another way. Instead of actually being a volunteer, I learned minister by counseling."
    },
    {
      "speaker": "Vashon",
      "time": "00:23:20",
      "upperBoundTime": "00:24:54",
      "content": "Using Christian counseling to touch not only guys that are dying but guys that have mental health problems or live in medical dormitories, but I live in there just to be a presence to guys that I've already been around since my hospice days and I do that because that's my ministry."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:54",
      "upperBoundTime": "00:25:34",
      "content": "Let me ask you a difficult question – your work with hospice must also bring the thought to your mind that its possible that you may never leave here and you may be one of those patients one day? That's the concept of life without parole that I find difficult to wrap my mind around that, so I can only imagine how you can. How do you cope with it?"
    },
    {
      "speaker": "Vashon",
      "time": "00:25:34",
      "upperBoundTime": "00:27:56",
      "content": "I don't cope with it, I let it be. And the reason why I let it be is because I believe in the Great Writ. You have to if you believe that one day you will walk out the gates. Understanding the thought that the law evolves and the thought of man helps it evolve keeps me going, that's where my fight is. It's also my hope that people like you and others will find the right language to say to the legislators, it's wrong."
    },
    {
      "speaker": "Vashon",
      "time": "00:25:34",
      "upperBoundTime": "00:27:56",
      "content": "Especially when a man or people have rehabilitated themselves to a degree where they can integrate back into society. Of course I've cried one time thinking about it, I've cried many a time watching a guy die in front of my eyes because so many of those guys, you live with them and then you watch them die, that they are good guys despite what charge they're here for."
    },
    {
      "speaker": "Vashon",
      "time": "00:25:34",
      "upperBoundTime": "00:27:56",
      "content": "They're good men but they died in prison so when I look at them, of course I see me but that's where I'm living right now and I just let it be. I mean, if I take it negative, I'd be fighting a lost cause. Who would be my enemy? If I look at it any other way, I don't have enemies. My being here is from my actions so I have to let it be."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:56",
      "upperBoundTime": "00:28:18",
      "content": "Let's say when you come before a parole board, you'll have a short window of opportunity who Vashon Kelly is today and why they should give you a second chance. What would you tell them?"
    },
    {
      "speaker": "Vashon",
      "time": "00:28:18",
      "upperBoundTime": "00:31:24",
      "content": "Wow. Well, first I could say a whole lot of things but when I, if I would have something to say, it's that my time here has been a lesson learned. I can't, I don't know what I would say to tell you the truth because the questions you've been asking have brought about a whole lot of feelings here, just to be truthful with you, not to tell a lie, twenty-three years is a very long time for any man to be in prison, especially in the position that I'm in."
    },
    {
      "speaker": "Vashon",
      "time": "00:28:18",
      "upperBoundTime": "00:31:24",
      "content": "I've lost a lot and I'm more than sure the victims in this case have lost a lot as well, there's no sorry or apology that can change a wrong. All we can do is move forward with what we've done."
    },
    {
      "speaker": "Vashon",
      "time": "00:28:18",
      "upperBoundTime": "00:31:24",
      "content": "My being here in prison is something that – the department of corrections already sees through my conduct. Once I changed my mindset about being angry, I continued to be the person that I am. Society had benefited from me being in prison because I gave myself, I gave who I really am to Angola, I didn't give it to its penitentiary, I gave it to its community."
    },
    {
      "speaker": "Vashon",
      "time": "00:28:18",
      "upperBoundTime": "00:31:24",
      "content": "By me serving genuinely and everything that I've been in, what I surround myself with, I think that's good enough and what to actually say in that small window you're talking about, I guess it has to be said in that moment. Because I don't think about what to say to help me get out, I just be who I am in hopes that would please the state of Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:31:24",
      "upperBoundTime": "00:31:26",
      "content": "Actions speak louder than words?"
    },
    {
      "speaker": "Vashon",
      "time": "00:31:26",
      "upperBoundTime": "00:31:29",
      "content": "Of course"
    },
    {
      "speaker": "Marcus",
      "time": "00:31:29",
      "upperBoundTime": "00:31:36",
      "content": "It becomes a question of how much punishment is enough punishment. Have you been punished enough?"
    },
    {
      "speaker": "Vashon",
      "time": "00:31:36",
      "upperBoundTime": "00:32:51",
      "content": "Of course. Not only have I been punished enough, if I can say or do anything in that regard, being punished enough in that regard. If I could be hung or die right now, I think I could say that my family has been punished enough because there the ones, if you do get a life sentence and if your family loves you, they do day for day, financially, spiritually, lovingly, they're doing it with you and my family had and I suffer from that. Like I said, if I could change that, excuse me…"
    },
    {
      "speaker": "Marcus",
      "time": "00:32:51",
      "upperBoundTime": "00:33:08",
      "content": "Take your time."
    },
    {
      "speaker": "Vashon",
      "time": "00:33:08",
      "upperBoundTime": "00:33:14",
      "content": "If I could change that for my family, I wouldn't worry about myself."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:14",
      "upperBoundTime": "00:33:41",
      "content": "I understand. I'm sorry. I think people don't recognize that its more than one person getting punished, it's affecting a whole community of people. Tell me about who visits you here."
    },
    {
      "speaker": "Vashon",
      "time": "00:33:41",
      "upperBoundTime": "00:33:44",
      "content": "Family."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:44",
      "upperBoundTime": "00:33:45",
      "content": "Does your son come up here?"
    },
    {
      "speaker": "Vashon",
      "time": "00:33:45",
      "upperBoundTime": "00:34:29",
      "content": "Yeah, he comes periodically since Katrina. I have a lot, in life in particular, I have a lot of brothers and sisters all over the nation so they take their turns. I have a brother in Atlanta, he and his wife come twice a year. They love coming to the rodeo to see me in another setting. I have a brother in Washington, he comes once a year. Sisters pop in as they come and go, I mean, I've been here twenty-three years so they have family. So they come and they go."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:29",
      "upperBoundTime": "00:34:40",
      "content": "Sure. It seems like people get kind of hopeful and happier around the time of the rodeo. Do you sell things at rodeo?"
    },
    {
      "speaker": "Vashon",
      "time": "00:34:40",
      "upperBoundTime": "00:34:42",
      "content": "Yeah, I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:34:42",
      "upperBoundTime": "00:34:43",
      "content": "What do you make and sell?"
    },
    {
      "speaker": "Vashon",
      "time": "00:34:43",
      "upperBoundTime": "00:35:17",
      "content": "I learned the art of jewelry making since I've been here. I'm a lover of the monogram so I make little sets of earrings and bracelets and I give them in a script way to let us – I know how to make letters in eighty three different styles, script, right script, left script, so – floral, leaves, whatever comes to my mind. I'll bring them out."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:17",
      "upperBoundTime": "00:35:19",
      "content": "And this is work you do in the hobby shop?"
    },
    {
      "speaker": "Vashon",
      "time": "00:35:19",
      "upperBoundTime": "00:35:23",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:23",
      "upperBoundTime": "00:35:45",
      "content": "I think I know the answer to this question 'cause you've talked about it, I think the worst thing for you about being in prison is what you've just been telling me about. What's the good part? What's good about Angola?"
    },
    {
      "speaker": "Marcus",
      "time": "00:35:23",
      "upperBoundTime": "00:35:45",
      "content": ""
    },
    {
      "speaker": "Vashon",
      "time": "00:35:45",
      "upperBoundTime": "00:36:58",
      "content": "I think the best thing is for me, I could probably say that I used this time to just rehabilitate myself, to grow, to continue to grow, to not look at it as this place of punishment but look at it as a place of learning. There are lots of good things in here; you just have to look for them. There's a lot of bad things here too, you just have to participate in it. But I think the good thing about Angola was the learning part."
    },
    {
      "speaker": "Vashon",
      "time": "00:35:45",
      "upperBoundTime": "00:36:58",
      "content": ""
    },
    {
      "speaker": "Marcus",
      "time": "00:36:58",
      "upperBoundTime": "00:37:09",
      "content": "Of all the things that you've accomplished in your life, what are you the most proud of?"
    },
    {
      "speaker": "Vashon",
      "time": "00:37:09",
      "upperBoundTime": "00:37:52",
      "content": "I think I'm most proud of me actually going through college and graduating. That was a goal on the street. That was a goal I set when I had my kid as a teenager, I was still – even though the degree probably wouldn't have been in seminary, it probably would have been in business, I still would have got a higher learning. I'm most proud of that, it was hard."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:52",
      "upperBoundTime": "00:37:55",
      "content": "I just heard they're starting a Master's Degree."
    },
    {
      "speaker": "Vashon",
      "time": "00:37:55",
      "upperBoundTime": "00:38:02",
      "content": "Yeah, they are. I wish those brothers luck."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:02",
      "upperBoundTime": "00:38:08",
      "content": "So, tell me about your goals for the future."
    },
    {
      "speaker": "Vashon",
      "time": "00:38:08",
      "upperBoundTime": "00:38:27",
      "content": "Well, my goals for the future, for sure is not centered around Angola. It's centered on me getting out and experiencing the new New Orleans."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:27",
      "upperBoundTime": "00:38:34",
      "content": "Okay, let's go there. You must envision your life getting out of here –"
    },
    {
      "speaker": "Vashon",
      "time": "00:38:34",
      "upperBoundTime": "00:38:37",
      "content": "Always."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:37",
      "upperBoundTime": "00:38:39",
      "content": "What does that vision look like? What would you be doing?"
    },
    {
      "speaker": "Vashon",
      "time": "00:38:39",
      "upperBoundTime": "00:39:37",
      "content": "I would probably have ready a nice business plan to help jumpstart a business for me and my brothers to actually – just to actually not only make money but to make it somewhat of a community project. I mean, when you understand a community then you understand what businesses do inside a community. They help in all sorts of ways so I have visions of working in a community with my business and helping, just helping families, that's what it's about."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:37",
      "upperBoundTime": "00:39:38",
      "content": "Through employing people?"
    },
    {
      "speaker": "Vashon",
      "time": "00:39:38",
      "upperBoundTime": "00:40:24",
      "content": "Yeah, employing people, employing families. That's what it's about so I envision that. I most definitely envision bringing my family together. I think I'm the missing link. I think nobody in my family would ever do the prison thing, I'm just the person who connects my family to prison. Just to put that link back in and move this behind us would be a beautiful thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:40:24",
      "upperBoundTime": "00:41:00",
      "content": "Yeah. Mr. Kelly, I consider it a real privilege to be able to talk with you and I'm very grateful that you are willing to share this because this is what it is."
    },
    {
      "speaker": "Vashon",
      "time": "00:41:00",
      "upperBoundTime": "00:41:34",
      "content": "Well, I appreciate – I didn't know that talking with you would actually fulfill me the way it did. It allowed me to look back and look within and see some things that I haven't saw in a while. My day won't be the same. It's a beautiful thing."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:34",
      "upperBoundTime": "00:41:54",
      "content": "My day won't be the same either but is there a question I should've asked you that I didn't, something I didn't give you the opportunity to talk about that you might want other people to know about what it is to serve life without parole? Or anything else?"
    },
    {
      "speaker": "Vashon",
      "time": "00:41:54",
      "upperBoundTime": "00:44:36",
      "content": "Well, if I do have the opportunity to say anything other than what we've been talking about, I would have to talk about the whole – I know a lot of people don't actually get to see the annals of prison life or prison in Angola, period. I would want them to know they have hundreds of hundreds of good men here."
    },
    {
      "speaker": "Vashon",
      "time": "00:41:54",
      "upperBoundTime": "00:44:36",
      "content": "And I'm more than sure that there's hundreds and hundreds of bad men here but if society could understand that error is a part of everyone's life and to look at that error after a time to see if it has been rehabilitated that person, needs to be reviewed by society on a regular basis. Life without parole is a huge, huge mistake."
    },
    {
      "speaker": "Vashon",
      "time": "00:41:54",
      "upperBoundTime": "00:44:36",
      "content": "It's a huge mistake and a train of thought that only serves to kill people on the end of justice, and I don't think that's right even if I have to say so myself as a convicted criminal. So if I had to say anything, I would have to say we need a change and it needs to be talked about and it needs to be corrected. I think everyone knows it's a problem, but we let time correct things we can correct our own selves."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:36",
      "content": "Right, I think that's a good place to stop."
    }
  ]
}
