{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:01:18",
      "content": "Walter Reed Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Walter",
      "time": "00:01:18",
      "upperBoundTime": "00:01:34",
      "content": "Okay, my name Walter Reed. I was convicted of first degree murder. I have served 43 years, going on 44 years. And I was 21 going on 22."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:34",
      "upperBoundTime": "00:01:59",
      "content": "Mr. Reed, I'm going to ask you a few questions about your life before being arrested for this charge. And then I also want to talk to you about the last 42, 43 years as well. But first I just want to ask you about your cancer diagnosis. Mr. Dixon told me that you had chemotherapy today."
    },
    {
      "speaker": "Walter",
      "time": "00:01:59",
      "upperBoundTime": "00:02:03",
      "content": "Yes sir."
    },
    {
      "speaker": "Marcus",
      "time": "00:02:03",
      "upperBoundTime": "00:02:04",
      "content": "Where are you in that fight?"
    },
    {
      "speaker": "Walter",
      "time": "00:02:04",
      "upperBoundTime": "00:03:17",
      "content": "Well, well, when I first found out I had it, I had few lesions on my liver, and I took a tease is the procedure you go through. Something like an operation to cut it out. And it was, it was zapped out but then, going back to University Medical Center in New Orleans, they seen another spot so I went to an ablation, which is another procedure with a laser and they cut it out."
    },
    {
      "speaker": "Walter",
      "time": "00:02:04",
      "upperBoundTime": "00:03:17",
      "content": "And they say they seen some small spots, but they recommend that I take the pills, the chemo pills. I've been taking them for about a year and a month. And I haven't been feeling anything, but you can't really know unless I take another MRI so they probably got me scheduled for a MRI sometime this month. And I'll know for sure where I'm at with the cancer. But I have, I have a cirrhosis as well."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:17",
      "upperBoundTime": "00:03:33",
      "content": "Well, I'm sorry that you're feeling uncomfortable and I really appreciate that you're going to talk with us anyway. So, let's go way back and talk a little bit about the folks who raised you? Were you raised in New Orleans?"
    },
    {
      "speaker": "Walter",
      "time": "00:03:33",
      "upperBoundTime": "00:03:45",
      "content": "Outside New Orleans. In the small, rural area called Avondale, Louisiana."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:45",
      "upperBoundTime": "00:03:45",
      "content": "I'm familiar with it. Tell me about the folks who raised you?"
    },
    {
      "speaker": "Walter",
      "time": "00:03:45",
      "upperBoundTime": "00:04:10",
      "content": "My mother and father. My father worked as a longshoreman. My mother did domestic work. They were bringing in money. Saving money for our college, for us to go to college and stuff like that. And we ate good, we lived a good life, both parents working, and we went to school."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:10",
      "upperBoundTime": "00:04:14",
      "content": "Was there any fighting in the house?"
    },
    {
      "speaker": "Walter",
      "time": "00:04:14",
      "upperBoundTime": "00:04:40",
      "content": "Yeah, yeah there was some fighting. There was a lot of misunderstanding with my sisters and me, or my brothers and me, over certain things that kids fight over like TV, or like, she drank too much juice, or he drank too much juice. And we would start fighting or something like that. But wasn't an ongoing thing. It was [inaudible] [00:04:34] it was something like that, we loved each other."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:40",
      "upperBoundTime": "00:04:41",
      "content": "Sure."
    },
    {
      "speaker": "Walter",
      "time": "00:04:41",
      "upperBoundTime": "00:04:44",
      "content": "But just that, at times."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:44",
      "upperBoundTime": "00:04:49",
      "content": "Of course. Would you say it's accurate to say that you grew up in a loving, caring...?"
    },
    {
      "speaker": "Walter",
      "time": "00:04:49",
      "upperBoundTime": "00:04:50",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:04:50",
      "upperBoundTime": "00:04:53",
      "content": "Caring, family?"
    },
    {
      "speaker": "Walter",
      "time": "00:04:53",
      "upperBoundTime": "00:05:02",
      "content": "Yes. I grew up in a loving and caring. We all went to church. We was raised to love each other and respect each other, and respect other people as well."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:02",
      "upperBoundTime": "00:05:05",
      "content": "Sure. I'm familiar with Avondale."
    },
    {
      "speaker": "Walter",
      "time": "00:05:05",
      "upperBoundTime": "00:05:11",
      "content": "Oh yeah?"
    },
    {
      "speaker": "Marcus",
      "time": "00:05:11",
      "upperBoundTime": "00:05:22",
      "content": "But only from a sign on Highway 10. Can you paint a picture for me, if I was, if you go back to your childhood home and I'm sitting on your front porch, what would I be hearing and seeing?"
    },
    {
      "speaker": "Walter",
      "time": "00:05:22",
      "upperBoundTime": "00:06:10",
      "content": "Well, on the front porch, you would see our neighbors because they lived on the opposite side. You would see their home. They was nice people. Further down the street, you might hear some noise from another family, who they like, they were eradiate, fight all the time, fuss all the time, cuss all the time. Stuff like that. But, right in the immediate area of my neighborhood, people was just like us. Caring people. Caring, loving people. Church-going people. But further down the street, it's like in the ghetto."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:10",
      "upperBoundTime": "00:06:13",
      "content": "Okay. What about school? Did you like school?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:13",
      "upperBoundTime": "00:06:26",
      "content": "I went to school, but I didn't particularly like school. I played hooky from school and stuff like that. Sometimes I'd go to school, sometimes I don't."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:26",
      "upperBoundTime": "00:06:27",
      "content": "Did you ever get kicked out of school?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:27",
      "upperBoundTime": "00:06:31",
      "content": "No, I never got kicked out of school."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:31",
      "upperBoundTime": "00:06:34",
      "content": "What was the highest grade that you completed?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:34",
      "upperBoundTime": "00:07:09",
      "content": "The highest grade I completed was 7th. And I didn't go back to school. I started working after that. Started cleaning barges. I was at a young age. Started cleaning barges, start making money like that. And then I decided to go to Job Corp."
    },
    {
      "speaker": "Walter",
      "time": "00:06:34",
      "upperBoundTime": "00:07:09",
      "content": "And I went to Job Corp and took up trading in bricking and brick mason and also, I'm a mechanic. So, I took up a trade in mechanic. I wasn't certified in neither one of them though."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:09",
      "upperBoundTime": "00:07:12",
      "content": "Is that how you supported yourself?"
    },
    {
      "speaker": "Walter",
      "time": "00:07:12",
      "upperBoundTime": "00:07:16",
      "content": "Yes sir, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:16",
      "upperBoundTime": "00:07:21",
      "content": "Do you remember the first time you were arrested?"
    },
    {
      "speaker": "Walter",
      "time": "00:07:21",
      "upperBoundTime": "00:07:22",
      "content": "As an adult or juvenile?"
    },
    {
      "speaker": "Marcus",
      "time": "00:07:22",
      "upperBoundTime": "00:07:24",
      "content": "Either one."
    },
    {
      "speaker": "Walter",
      "time": "00:07:24",
      "upperBoundTime": "00:07:42",
      "content": "Yeah, I was a juvenile. I was with some guys, they put, they, let's see if I remember it correctly, they stole some money out of a teacher's purse and we all got locked up for it. That was my first time getting arrested."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:42",
      "upperBoundTime": "00:07:44",
      "content": "What about after that?"
    },
    {
      "speaker": "Walter",
      "time": "00:07:44",
      "upperBoundTime": "00:07:54",
      "content": "After that? I didn't get any arrests."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:54",
      "upperBoundTime": "00:08:00",
      "content": "Can you tell me a little bit about relationships you had with girlfriends? Was there a special somebody?"
    },
    {
      "speaker": "Walter",
      "time": "00:08:00",
      "upperBoundTime": "00:08:31",
      "content": "Yeah, they were. I had a friend named Sherie and, she and I, we were about to get married one time. Well, when you're young, you decide, you let that love, that emotion, take over your better judgement and you really think you're in love and you really think you want to get married. But it fades out. We loved each other at that point and then, later on in life we just separated."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:31",
      "upperBoundTime": "00:08:32",
      "content": "Do you have any children?"
    },
    {
      "speaker": "Walter",
      "time": "00:08:32",
      "upperBoundTime": "00:08:34",
      "content": "I have two."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:34",
      "upperBoundTime": "00:08:35",
      "content": "Tell me about them."
    },
    {
      "speaker": "Walter",
      "time": "00:08:35",
      "upperBoundTime": "00:08:50",
      "content": "I have a son who has a job. He's married, he has a family. And I have another son who is incarcerated here in Angola, in fact. He's on his way back."
    },
    {
      "speaker": "Marcus",
      "time": "00:08:50",
      "upperBoundTime": "00:08:52",
      "content": "He's going to get out?"
    },
    {
      "speaker": "Walter",
      "time": "00:08:52",
      "upperBoundTime": "00:09:08",
      "content": "I don't know. I can't, he's coming back. He has a murder charge. Yeah, he has a murder charge. Well, he allegedly has a murder charge. I don't know for definite whether he did this. But a guy got killed."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:08",
      "upperBoundTime": "00:09:10",
      "content": "Sure"
    },
    {
      "speaker": "Walter",
      "time": "00:09:10",
      "upperBoundTime": "00:09:15",
      "content": "They putting it all on him though. He the one that used to fall for the guy being dead."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:15",
      "upperBoundTime": "00:09:17",
      "content": "Do you see him quite often?"
    },
    {
      "speaker": "Walter",
      "time": "00:09:17",
      "upperBoundTime": "00:09:47",
      "content": "No. he left here three years ago. He was going to box and train in boxing with Roy Jones, but that didn't turn out good. He went to Texas and one thing lead to another and he abandoned that. And he could have been a good trainer for Roy Jones. But however, he got in other stuff. Drugs and stuff like that."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:47",
      "upperBoundTime": "00:09:48",
      "content": "Right, where is he now?"
    },
    {
      "speaker": "Walter",
      "time": "00:09:48",
      "upperBoundTime": "00:09:50",
      "content": "In jail."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:50",
      "upperBoundTime": "00:09:52",
      "content": "Do you know which jail?"
    },
    {
      "speaker": "Walter",
      "time": "00:09:52",
      "upperBoundTime": "00:09:58",
      "content": "Jefferson Parish."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:58",
      "upperBoundTime": "00:10:00",
      "content": "Were drugs and alcohol apart of your life at a young age?"
    },
    {
      "speaker": "Walter",
      "time": "00:10:00",
      "upperBoundTime": "00:10:29",
      "content": "I would say more alcohol than drugs, because I drank a lot. I used to like to drink. I'd smoke a little weed too. No other drugs other than that. I mean I'd smoke a little weed and got fast cars and stuff like that. And that lasted so long, until 1974 when I got popped on this charge here. I've been down since then."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:29",
      "upperBoundTime": "00:10:36",
      "content": "Can you tell me a little bit about that? How did that, what ending up getting you down that road that such you are here?"
    },
    {
      "speaker": "Walter",
      "time": "00:10:36",
      "upperBoundTime": "00:11:44",
      "content": "Well, there was a guy that I come up in childhood, I come up with, further down the road. He and I befriended each other when we were about 7 years old. One thing led to another and we started liking each other and doing different things together. One day a guy comes up and propositions us for a woman, says she wants a husband killed."
    },
    {
      "speaker": "Walter",
      "time": "00:10:36",
      "upperBoundTime": "00:11:44",
      "content": "And he said well alright, this the truth too, and I went in there and I hit the guy in the shoulder. I couldn't do it. And the other guy, the one I come up with, he killed him. And from that point on, things started getting bad. The helicopters come. Police came around my house and got me and later on, they got him. Another guy who was involved got less time. He got away, so I been down ever since then."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:44",
      "upperBoundTime": "00:11:56",
      "content": "If you had to isolate one reason that that happened, some people say I was addicted to drugs, or it was this, or I lost my temper. What was it for you?"
    },
    {
      "speaker": "Walter",
      "time": "00:11:56",
      "upperBoundTime": "00:12:21",
      "content": "Well, I was drinking that night and, I was drinking and I smoked some weed that night. But, I should've had a better judgement though. That played a little role in it though. It's hard to say, it's inexplicable. It's kind of hard to tell the details about that."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:21",
      "upperBoundTime": "00:12:24",
      "content": "Sure, we don't have to."
    },
    {
      "speaker": "Walter",
      "time": "00:12:24",
      "upperBoundTime": "00:12:53",
      "content": "Yeah, but that's the way it happened. And I've been down since. I can't really say that the drugs and alcohol played a major part. Maybe it did. If you look at it psychologically, it may have done something and I'm not cognizant of that fact that this is what caused it. But I do know it happened. So, it's hard for me to say."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:53",
      "upperBoundTime": "00:12:55",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "Walter",
      "time": "00:12:55",
      "upperBoundTime": "00:12:58",
      "content": "Oh yes, over and over again."
    },
    {
      "speaker": "Marcus",
      "time": "00:12:58",
      "upperBoundTime": "00:13:01",
      "content": "42 years is a lifetime."
    },
    {
      "speaker": "Walter",
      "time": "00:13:01",
      "upperBoundTime": "00:13:11",
      "content": "Yes, that's what the lawyers say. In fact. That's [inaudible] [00:13:04] he said."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:34",
      "content": "One of the reasons we wanted to talk with folks like you is that you are considered to be a trusted, rehabilitated member of this community."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:11",
      "upperBoundTime": "00:13:34",
      "content": "But could you take a minute and describe the Walter Reed that was escorted through those gates of Angola?"
    },
    {
      "speaker": "Walter",
      "time": "00:13:34",
      "upperBoundTime": "00:13:35",
      "content": "Oh yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:35",
      "upperBoundTime": "00:13:36",
      "content": "What was he like?"
    },
    {
      "speaker": "Walter",
      "time": "00:13:36",
      "upperBoundTime": "00:15:30",
      "content": "Oh, he was, he was gullible. I can say I was gullible. Because I was easily persuaded, but I never really was a real violent person. But I was a gullible person. You could persuade me to do something. And my education was limited. That's a big difference. That my education plays a major role in this, and I begin to educate myself. My eyes begin to open wider and I started seeing things. Perspective, and compassion come in."
    },
    {
      "speaker": "Walter",
      "time": "00:13:36",
      "upperBoundTime": "00:15:30",
      "content": "And different things come in when you're educated. Certain things you don't do. And time and education erased those things though. Because one time, I remember, if a guy would say something to me negative, I'd respond to that in a negative way. However, I didn't. I would talk it over to him, and try to solve that problem, we have that difference, that guy and I have or something like that. I think, to be very candid about it, total 186 degrees turn from the person I was when I got here. Certain activities."
    },
    {
      "speaker": "Walter",
      "time": "00:13:36",
      "upperBoundTime": "00:15:30",
      "content": "And, I went to school, educated myself. I got in certain programs, stuff like this. Self-help programs that enhances my ability to see things from different perspective. And I would say that's what made me different from the Reed I was when I come here."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:30",
      "upperBoundTime": "00:15:37",
      "content": "Sure. What was Angola like 40 years ago? What was your day like?"
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "It was like hell. It was like hell. I mean, it was rough. You see a guy getting chocked up with a knife actually in front you. That was nothing nice, wasn't nice at all. It kind of made you take precautionary measures, and it makes you paranoid too. Because you don't know what going to happen, what to expect from these people. They were barbaric."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "They had a book one time on Angola saying it was the bloodiest prison in the United States, and it was. And I'd seen that it was from my own experience, looking at guys actually with the knife, choking guys. That's like a horror flick. But it's the reality. Those are things that be in your mind, and stick in your mind and make you paranoid and that paranoia kind of psychologically infects your mind. Man. It's kind of hard to really describe it like. Because I was never put in this type of position before in my life."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "Where I can see people actually getting choked up and die as a result. These the things, I seen when I come here. I see people uneducated, because that plays the major part in it, that they weren't educated. And I got to know a lot of these guys, and as I got to know them, I tried to help them working in the field. It's hot in the field, we had swing this blunt blades and do a lot of work in the field. And a lot of guys would say, \"Man, I got to get out this field!\" But see, I applied to get into school, to get my GED."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "Once I got my GED, I got close to getting my GED, I started getting phones. You got a phone assigned to get in a GED class. And, I'd give it to a lot of guys, and the guys I'd give it to are the guys who's running this walk. The 'Big Daddy' this, or fishes this. The guys who take control of petitionary. And I'd give it to them, because they in the fields too, and they want some release out of that sun. So, they answer the school and got in school."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "A lot of them went to sleep when they were learning, but they wanted to be out the field. As a result of that, things start changing, down the walk. Because they start getting educated. It's like, once they got school, they start learning things. They say, it says in the Bible, it says \"Faith come by hearing.\" And education come by hearing too. I can take a dummy off the street and put him on a college campus, and he'd end up being smart just by hanging around certain people. You learn. As people talk, you'll learn."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "And that's what happened with them. And I knew in a sense, that this was to happen, and as the years go on, because it took a few years before they got their GED. They was learning, they was going through a learning process. There were going to sleep or going through a learning process. And it helped change the walk."
    },
    {
      "speaker": "Walter",
      "time": "00:15:37",
      "upperBoundTime": "00:19:35",
      "content": "And a lot of guys who were known to be vicious or outrageous, it changed them and it changed the people around them. People be saying, \"Man, Joe blow, he's going to school and he's learning, and he's not into that foolishness anymore.\" That he's trying to educate himself. And this the way life went."
    },
    {
      "speaker": "Marcus",
      "time": "00:19:35",
      "upperBoundTime": "00:19:42",
      "content": "Did you think that one of the major difference between Angola then and Angola now is that more people take advantage of education?"
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "Oh yeah. Yeah. Education play a major role in Angola. It does because they come willingly to college. Northwest Community College. A lot of them enroll in it. And computer programming and paralegal."
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "And then, we study, but we went so far with that because I never finished computer programming because our Pell Grants was cut off, because Jessie Himes, one of the majority whip for the Republican Party, said that one of his constituents said his son couldn't get an education because all the money was going to inmates."
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "So, they cut our Pell Grant off. So, that kind of stuck us out. I couldn't finish my computer programing. But, however in another two years, they come with the Bible College and the lady who, Ms. White, that's her name. She gave me some entry forms, and I pass them out. She said, \"Reed, pass these out for me,\" and I pass them out, and guys sign them and they put them on call-out and they went to their building and took testers and roll, that's how the Bible College started. From that point on. I was fortunate with that. I got to mention this because I got into a fight. I was supposed to mention that at first. I got into a fight. I didn't provoke the fight however."
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "But I was instrumental in initiating the fight because they had some more of our guys who were watching TV, and they had a game come on that night, a basketball game. And I like basketball. And the guy who I got into a fight with, he like basketball. So, he and I wanted to watch the basketball game. We asked the old guys, \"Can we watch this game?\" They said, \"They got a movie on that we want to watch though.\" So, they had about 5 or 6 of them and 2 of us, so they won. Democratically is how we do this."
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "The majority win. So, I left out the TV room and said, \"Well, you got that man. Go ahead and watch your movie.\" Well I passed by the TV room and I noticed there was a fuss, an argument. And this guy done turned the TV on I said, \"Hold on man.\" I said, \"No, those guys voted on it, all of them. Leave them people to watch their movie.\""
    },
    {
      "speaker": "Walter",
      "time": "00:19:42",
      "upperBoundTime": "00:22:56",
      "content": "And he started talking smart and he took his hand and pushed me in the face, and that lead, that went off to the fight. I had to respond, I didn't have to respond to it, but when he put his hands on me, he made me respond to it and that's when the fight started. That was the last fight I had."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:56",
      "upperBoundTime": "00:22:57",
      "content": "When was that?"
    },
    {
      "speaker": "Walter",
      "time": "00:22:57",
      "upperBoundTime": "00:23:09",
      "content": "That was in, let me be precise now, that was 96. That was in 1996."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:09",
      "upperBoundTime": "00:23:10",
      "content": "That's a long time ago."
    },
    {
      "speaker": "Walter",
      "time": "00:23:10",
      "upperBoundTime": "00:23:18",
      "content": "Yeah, I didn't have a fight since then."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:18",
      "upperBoundTime": "00:23:25",
      "content": "Who do, who are close with still on the outside?"
    },
    {
      "speaker": "Walter",
      "time": "00:23:25",
      "upperBoundTime": "00:24:10",
      "content": "I have a brother. I have a friend in Madisons, Mississippi. I have a friend, a professor at Michigan University I'm close with too. Her name Ashley Lucas. And I got friends in Mississippi, her, and I got a brother in Texas that I'm real close too. He's has a financial service, but he's been here lately. And I haven't responded to Ashley yet."
    },
    {
      "speaker": "Walter",
      "time": "00:23:25",
      "upperBoundTime": "00:24:10",
      "content": "I have to get her address from a guy who works in the Angolite down here. He has her address and I need to get in touch with her. Ashley, him, and my friend from Mississippi. She going through what I'm going through. She got cancer. Those are the ones I'm really close with."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:10",
      "upperBoundTime": "00:24:29",
      "content": "Yeah. You were saying that you were gullible when you came here and that you just kind of had to go through surviving every day here. Can you point to a turning point in your life where you just decided you were going to do things to improve your life?"
    },
    {
      "speaker": "Walter",
      "time": "00:24:29",
      "upperBoundTime": "00:24:31",
      "content": "Well, yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:24:31",
      "upperBoundTime": "00:24:34",
      "content": "What was it? What lead to that?"
    },
    {
      "speaker": "Walter",
      "time": "00:24:34",
      "upperBoundTime": "00:27:24",
      "content": "Well, the way I see people. The way I view people. Ignorance. Ignorance really motivated me to change because I was looking at other people. The ignorance of them kind of made me say, \"I don't want to be like that.\" I wanted to be a mirror reflection of me. So, I need to change. I need to find myself. I kept looking for myself. I finally found myself after looking so long. And the movie come on one time I watch."
    },
    {
      "speaker": "Walter",
      "time": "00:24:34",
      "upperBoundTime": "00:27:24",
      "content": "And I thought about that movie too. He's looking for Nathan. See, Nathan was a person, real smart and didn't respond to negative things. And this guy, he's on a journey, looking for Nathan. So, what he did, he fought the monkey that knew karate. He fought the soldiers and he said, because Nathan would change his whole life, and he fought all that and he ran to this, monk, priest. He said if he want to find Nathan, he would have to go to this garden. And, in this garden, there's a book, and the book is going to tell you how to release the Nathan. So, he looked and looked, and finally got to that garden."
    },
    {
      "speaker": "Walter",
      "time": "00:24:34",
      "upperBoundTime": "00:27:24",
      "content": "And he opened the book. When he opened the book, he seen a mirror. Ain't nothing but a mirror? He was looking for something to read. They had a mirror in the book. He said, \"This isn't Nathan. Where's Nathan?\" And he come to realize that the reflection he was seeing was himself and he still couldn't understand right then. Because, when he was looking for Nathan, he had found Nathan, but didn't know it. Because the mirror reflection was of him."
    },
    {
      "speaker": "Walter",
      "time": "00:24:34",
      "upperBoundTime": "00:27:24",
      "content": "He was Nathan. He finally found himself. That's how he found himself, when he was looking for Nathan. And they told him, they said, \"That's him there.\" And that's how he realized it was him. I found myself the same way. I was looking for myself for a long time and understand that I can overcome barriers and whatever impediments in my life that I can surmount. It's surmountable."
    },
    {
      "speaker": "Walter",
      "time": "00:24:34",
      "upperBoundTime": "00:27:24",
      "content": "And that's what I did. I kept working that education and I changed myself. And that's what really motivated me to change. Looking at the ignorance of other people caused me to really search myself, and I found myself. And I'm still on the journey."
    },
    {
      "speaker": "Marcus",
      "time": "00:27:24",
      "upperBoundTime": "00:27:54",
      "content": "Sure. Let me ask you a difficult question. You've served 42 years. When you think about your future, you are surely aware of the fact there's a very good likelihood that you will never leave here. That's what a life sentence without parole means in Louisiana. And I want to ask you, how you cope with that?"
    },
    {
      "speaker": "Walter",
      "time": "00:27:54",
      "upperBoundTime": "00:30:07",
      "content": "I guess it's just the way I've been coping with a whole lot of things. See, one time, I didn't see any daylight, I mean, any at all with this life sentence. But, I had no polyandrous illusion about getting out. I mean, I didn't see it. But now, with the laws changing, I can see a little daylight. So, now I feel a little comfortable. But not saying I will get out, but I do feel good in knowing that these laws are passing that there is possibility I might get out. I'm kind of doubtful. Doing as ask whether they are going to do anything for me."
    },
    {
      "speaker": "Walter",
      "time": "00:27:54",
      "upperBoundTime": "00:30:07",
      "content": "I don't want to die or whatever because I got cancer. As long as it's good for those coming in and who can change their lives. And be productive member of society with the programs and things they're all figuring out. Because I helped open the reentry because I helped open the reentry. That's another thing. I did cleaned up. I taught prates over there as a mechanic. Stuff like that. Trying to help those youngsters when they come in. Help give them a second chance. So, it really don't matter."
    },
    {
      "speaker": "Walter",
      "time": "00:27:54",
      "upperBoundTime": "00:30:07",
      "content": "See, I might die today or tomorrow. I thought about that often. In fact, I went to sleep the other night and I thought about it. I might be dead and gone. I said, to myself, I said, we weren't put here to live forever. I accept this. And I accept it, and I accept it now. If I die today or tomorrow, I'm gone. Lights out. No emotion, nothing. Just dead. All my memories in other peoples' minds might live, but I'll be dead and gone. I would like to be out now, because I got grandchildren, and I want to help them lead a better life."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:07",
      "upperBoundTime": "00:30:09",
      "content": "Sure."
    },
    {
      "speaker": "Walter",
      "time": "00:30:09",
      "upperBoundTime": "00:30:10",
      "content": "Yeah man."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:10",
      "upperBoundTime": "00:30:12",
      "content": "Do you ever visit with your grandchildren?"
    },
    {
      "speaker": "Walter",
      "time": "00:30:12",
      "upperBoundTime": "00:30:18",
      "content": "Once. Once. Once. I was glad to see them. Once."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:18",
      "upperBoundTime": "00:30:55",
      "content": "Tell me about that memory."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:18",
      "upperBoundTime": "00:30:55",
      "content": "Walter: Oh, that was a good memory. I talked with my little grandson. I see that, he's kind of shy. Like I was when I was young, kind of shy. I called him over and talked to him, asked him what did he want to be, what did he want to do. He said he want to play basketball. I said, \"Well, you can't rely only on basketball. You got to get your education, and then focus on basketball.\" He said, \"I'm going to get an education.\" And I said, \"That's what I'm talking about. That's what I want to see you do. Get your education.\" That was it. We didn't talk much because the visit wouldn't let me talk much before."
    },
    {
      "speaker": "Marcus",
      "time": "00:30:55",
      "upperBoundTime": "00:31:10",
      "content": "Sure. What's the worst thing that you deal with here in Angola? I know Angola has changed a lot today, but what's the thing, what's the worst part of your experience here?"
    },
    {
      "speaker": "Walter",
      "time": "00:31:10",
      "upperBoundTime": "00:31:11",
      "content": "Contemporary?"
    },
    {
      "speaker": "Marcus",
      "time": "00:31:11",
      "upperBoundTime": "00:31:16",
      "content": "Yes."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "You got so many, various things. But man, some of the people too. Some of the people haven't learned anything. I got, I have got to stop focusing on that because people are going to be people. They're going to do what they want to do. And I see things that people do, that they don't need to do to improve themselves. It's kind of difficult explaining, without you seeing the scenario. But, I see grown men act like small children, and it kind of hurts in a sense."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "I be wanting to give them direction but they be like, \"Oh, you can't tell me! I'm a grown man!\" I understand, but sometimes other people can tell you certain things that are going to help you. \"Yeah, but I can take care of my own!\" People don't want you to think for them in penitentiary because that's the way life is here. They figure if you think for them, or try to help them like that that they weak. And, that's one of the things, I'm just saying."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "There's many other things. Many other factors come in play dealing with this. I see, sometimes I see some security acting certain ways. I think there's a relationship between security and inmate should be on the better scale, then what it's on now. That they should communicate from the mind and not negatively."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "Respond positively with each other and reach an understanding but it's not that way all the time. And it leads up to altercations and one things leads to another and somebody on the ground with their foot on your neck and putting some handcuffs on you. And that could've been avoided."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "There many things that I really don't like here. I mean if I was running it, it would be a different place. But education play a part in that too. Because in Texas, you go to school first. They teach you how to deal with inmates, and they got better relationships, than here."
    },
    {
      "speaker": "Walter",
      "time": "00:31:16",
      "upperBoundTime": "00:33:54",
      "content": "Like going to college in Texas to get a job at an institution. And here, all the requirements you need are a high school diploma. That's it. It's the opposite. So, that's something else I don't like. There's many other things I could come up with."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:54",
      "upperBoundTime": "00:34:03",
      "content": "Sure, so how about something good? What would be the best thing, if there is such a thing, about Angola?"
    },
    {
      "speaker": "Walter",
      "time": "00:34:03",
      "upperBoundTime": "00:35:15",
      "content": "Good? Well the good comes, the good is, the education really is good. They got good people here too now. Don't get me wrong. Everybody not the same way. Just like out there in the world. Everybody not good. I mean, you got good people, you got bad people."
    },
    {
      "speaker": "Walter",
      "time": "00:34:03",
      "upperBoundTime": "00:35:15",
      "content": "Then you got people that's going to help you and you got people that's not going to help you. You go, you see somebody fall out on the street in New York City and you just pass them by. You just keep walking."
    },
    {
      "speaker": "Walter",
      "time": "00:34:03",
      "upperBoundTime": "00:35:15",
      "content": "See, somebody in New Orleans fall on the streets, you're trying to help them up, find out what's happening with them. So, you got some people on wheel. They nurture up. They don't care about you. They don't got people caring. They going to be helpful, and show compassion. Empathize with you. But, there's different things man. I would really have to sit down and think certain things over because my mind is not responsive like it used to be. I could just come up with a whole lot of things."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:15",
      "upperBoundTime": "00:35:16",
      "content": "That's okay. Those are all."
    },
    {
      "speaker": "Walter",
      "time": "00:35:16",
      "upperBoundTime": "00:35:34",
      "content": "I had a stroke too. And this cancer, has taken a toll on me as well. I wish you was here 8 years ago when I can really give you some details on the whole outlook on this penitentiary. The whole thing. I could be able to explain it even better."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:34",
      "upperBoundTime": "00:35:36",
      "content": "I think you're explaining it pretty well."
    },
    {
      "speaker": "Walter",
      "time": "00:35:36",
      "upperBoundTime": "00:35:46",
      "content": "Yeah but, it's kind of difficult at times. I got a few impediments. Even in my speech. I would've done a lot better than what I'm doing right now, you now."
    },
    {
      "speaker": "Marcus",
      "time": "00:35:46",
      "upperBoundTime": "00:36:04",
      "content": "Well, you're doing very well. Can you tell me, you've obviously you made all kinds of changes here, and you've accomplished a great deal in your life here, even if it's in the penitentiary. Of all the things that you've done, what are you most proud of?"
    },
    {
      "speaker": "Walter",
      "time": "00:36:04",
      "upperBoundTime": "00:36:59",
      "content": "Education is really. I found Jesus too. That's one of the things that God's in my life. Everybody don't believe in God. I believe God took, He got me here now. If anybody got me still living, out of all the guys that hate cancel before me, have gone. Some after me are gone. And I'm still here."
    },
    {
      "speaker": "Walter",
      "time": "00:36:04",
      "upperBoundTime": "00:36:59",
      "content": "So, I know He is playing a major role in my life. But other than that, the education. And the understanding. From a sociological point of view, to understand people in general. And be able to deal with people in general. That's what I say most of all right there. I'm proud of that."
    },
    {
      "speaker": "Marcus",
      "time": "00:36:59",
      "upperBoundTime": "00:37:00",
      "content": "Sure"
    },
    {
      "speaker": "Walter",
      "time": "00:37:00",
      "upperBoundTime": "00:37:15",
      "content": "That I be able to deal with different people. Become calm and, be polite. God didn't put me in New York City. I can deal with people from all different cultures and stuff. Because I'm going to have the same outlook on everybody."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:15",
      "upperBoundTime": "00:37:33",
      "content": "So, Mr. Reed, I can't tell you how grateful I am that you would sit and talk to us, especially when you're not feeling all that well. Is there something else that you've liked me to ask you that I didn't ask you, or something that I didn't give you an opportunity to talk about that you would like to?"
    },
    {
      "speaker": "Walter",
      "time": "00:37:33",
      "upperBoundTime": "00:37:55",
      "content": "Well, no, not really. Probably, one time probably. Like I said, there was a lot of things I'd like to hit on but it's, no consequences. It's really not significant now. Knowing my condition and everything, and how life turned out for me right now. It's really not important."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:55",
      "upperBoundTime": "00:38:01",
      "content": "I understand. I expect it when you have a cancer diagnosis, everything else goes into a different perspective."
    },
    {
      "speaker": "Walter",
      "time": "00:38:01",
      "upperBoundTime": "00:38:36",
      "content": "Yeah, that's right. That's what it does. I mean it's been paramount, important one time. But it's not. Knowing my condition and stuff played a major role in my, it's somehow, the condition can play a major role in your decision, your decision making. And, it's true."
    },
    {
      "speaker": "Walter",
      "time": "00:38:01",
      "upperBoundTime": "00:38:36",
      "content": "At one time, see when I didn't have cancer, I'd be able to ask you a lot of things. Like you just said. What you just say, about something that you could ask me?"
    },
    {
      "speaker": "Marcus",
      "time": "00:38:36",
      "upperBoundTime": "00:38:43",
      "content": "Yeah, if there's something that I should've asked you that I didn't ask you."
    },
    {
      "speaker": "Walter",
      "time": "00:38:43",
      "upperBoundTime": "00:38:56",
      "content": "Yeah, one thing would've been my home, or where I lived or something like that. Or do I have caring people who take care of me or something like that. Something patent to the subjects."
    },
    {
      "speaker": "Marcus",
      "time": "00:38:56",
      "upperBoundTime": "00:39:00",
      "content": "No, I think you did a great job answering the questions I asked. I really appreciate it."
    },
    {
      "speaker": "Walter",
      "time": "00:39:00",
      "upperBoundTime": "00:39:10",
      "content": "Yeah, but I wish I can do more. Cause I can't elaborate on a lot of things now, man. It's just I'm limited now."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:10",
      "upperBoundTime": "00:39:13",
      "content": "That's okay."
    },
    {
      "speaker": "Walter",
      "time": "00:39:13",
      "upperBoundTime": "00:39:47",
      "content": "See I had a stroke too, and it caused speech impediment. It messed with something in your brain. It causes you to be slower. Like a retardation. And my process of thinking not as effectively as it was years ago. Lot of things [inaudible] [00:39:35] was in class with me. During that time, I was sharp then. I'm not that no more."
    },
    {
      "speaker": "Marcus",
      "time": "00:39:47",
      "upperBoundTime": "00:39:49",
      "content": "Well you did very well, and I appreciate that."
    },
    {
      "speaker": "Walter",
      "time": "00:39:49",
      "content": "I appreciate you, appreciate you."
    }
  ]
}
