{
  "name": "",
  "transcript": [
    {
      "upperBoundTime": "00:00:13",
      "content": "Walter Goodwin Transcription REDACTIONS FINAL"
    },
    {
      "speaker": "Walter",
      "time": "00:00:13",
      "upperBoundTime": "00:00:34",
      "content": "My name is Walter Goodwin. I was convicted of second-degree murder and I was convicted when I was, the charge happened when I was 19, I got convicted when I was 20, and I am currently on year 23 right now."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:34",
      "upperBoundTime": "00:00:40",
      "content": "So I'm going to ask you a few questions about your time growing up. I know you were from New Orleans."
    },
    {
      "speaker": "Walter",
      "time": "00:00:40",
      "upperBoundTime": "00:00:42",
      "content": "Yes."
    },
    {
      "speaker": "Marcus",
      "time": "00:00:42",
      "upperBoundTime": "00:00:51",
      "content": "Can you tell me a little bit about your family and those who were close to you, the folks who raised you?"
    },
    {
      "speaker": "Walter",
      "time": "00:00:51",
      "upperBoundTime": "00:01:45",
      "content": "This is where the story, where I'm at odds with so many other guys who I grew up with. I'm the guy that gets to stand up and say it's not about my family or my environment, because I grew up in a house with the most wonderful people."
    },
    {
      "speaker": "Walter",
      "time": "00:00:51",
      "upperBoundTime": "00:01:45",
      "content": "My mom is a college graduate, my dad is a college graduate, my brother is a college graduate, my 2 sisters are college graduates, and me I'm a dope fiend and a murder. They were wonderful people and I can assure you it wasn't anything that I learned from them, which caused me to go the direction that I did in my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:01:45",
      "upperBoundTime": "00:01:52",
      "content": "Sure. So would you say it's accurate to say that you grew up in a loving, caring, nurturing household?"
    },
    {
      "speaker": "Walter",
      "time": "00:01:52",
      "upperBoundTime": "00:03:27",
      "content": "I think it's more accurate to say the most loving and caring household, and that's no exaggeration. They're just wonderful, wonderful people. When I look back at that time, because I share my story often, a lot of other guys know me, know my family. I share my story often about just about the expectations that were asked, that involved me and my family."
    },
    {
      "speaker": "Walter",
      "time": "00:01:52",
      "upperBoundTime": "00:03:27",
      "content": "They were pretty high and I succumbed to the fear of not meeting those expectations and it completely changed everything, it changed my relationship with them. I didn't even want to be around them anymore for fear of not living up to expectations. So it was like I didn't want to be around the people who loved me because I was afraid that if I didn't live up to the expectations they weren't going to love me anymore."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:27",
      "upperBoundTime": "00:03:37",
      "content": "I understand. You mention the drugs. How old were you when drugs became a big part of your life?"
    },
    {
      "speaker": "Walter",
      "time": "00:03:37",
      "upperBoundTime": "00:03:40",
      "content": "13, 14, casually."
    },
    {
      "speaker": "Marcus",
      "time": "00:03:40",
      "upperBoundTime": "00:03:41",
      "content": "What was your drug of choice?"
    },
    {
      "speaker": "Walter",
      "time": "00:03:41",
      "upperBoundTime": "00:05:08",
      "content": "It was marijuana, initially. And I never really could drink, I tried drinking but like I could walk past alcohol and pass out, I just wasn't for me. But the marijuana started me messing with heroin and this was a huge thing for me."
    },
    {
      "speaker": "Walter",
      "time": "00:03:41",
      "upperBoundTime": "00:05:08",
      "content": "I look at, I don't want to sound like I'm making excuses, but it was a huge thing for me, it kept me away from my fears, it kept me away from my family."
    },
    {
      "speaker": "Walter",
      "time": "00:03:41",
      "upperBoundTime": "00:05:08",
      "content": "And even quietly at first because I continued. I went to school I went to high school, graduated. Even did a year at Northwestern in Natchitoches, Louisiana. But it eventually, things started to really snowball on me and I ended up doing some horrible things."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:08",
      "upperBoundTime": "00:05:13",
      "content": "That were completely tied into your drug use?"
    },
    {
      "speaker": "Walter",
      "time": "00:05:13",
      "upperBoundTime": "00:05:43",
      "content": "I don't, this, well yes. In a word, yes. I never thought I would've been capable of some of the things that I did. I was quite amazed at myself. But, it certainly had a direct relationship with the drugs."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:43",
      "upperBoundTime": "00:05:51",
      "content": "Yeah, I mean I think that's a very common experience. Are you still in touch with your family do they visit you a lot?"
    },
    {
      "speaker": "Walter",
      "time": "00:05:51",
      "upperBoundTime": "00:05:59",
      "content": "I am. Oh they love me they love me they love me, and I love them."
    },
    {
      "speaker": "Marcus",
      "time": "00:05:59",
      "upperBoundTime": "00:06:00",
      "content": "Right."
    },
    {
      "speaker": "Walter",
      "time": "00:06:00",
      "upperBoundTime": "00:06:09",
      "content": "They've been supporting me forever."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:09",
      "upperBoundTime": "00:06:12",
      "content": "Are they still all in Louisiana?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:12",
      "upperBoundTime": "00:06:29",
      "content": "Yeah, my immediate family, yes. I have but yes they are. And they're all still in New Orleans, primarily. My brother just got back from Texas, but yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:29",
      "upperBoundTime": "00:06:38",
      "content": "So they come visit you during visitation and you stay in touch with all of them and I suppose now they have children and you're an uncle."
    },
    {
      "speaker": "Walter",
      "time": "00:06:38",
      "upperBoundTime": "00:06:39",
      "content": "Yeah."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:39",
      "upperBoundTime": "00:06:40",
      "content": "Do you have any children of your own?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:40",
      "upperBoundTime": "00:06:42",
      "content": "I have a daughter."
    },
    {
      "speaker": "Marcus",
      "time": "00:06:42",
      "upperBoundTime": "00:06:43",
      "content": "Okay, are you in touch with her?"
    },
    {
      "speaker": "Walter",
      "time": "00:06:43",
      "upperBoundTime": "00:07:53",
      "content": "I am now. When I left, she was 13 months. And me and her mom, we did not have a great relation, all my fault, I was absolutely horrible. But I remember when I saw her, my daughter, she came up here for the first time when she was 15. And I saw her in the visiting shed and she grabbed me and she squeezed me and she looked at me and she said, \"Daddy what happened that my mama hates you for.\" So this was our first words of communication here. Is you are hated by my mom and I would imagine by quite a few other people."
    },
    {
      "speaker": "Marcus",
      "time": "00:07:53",
      "upperBoundTime": "00:08:15",
      "content": "Yeah wow, that's a memory. So I'm also trying to also get a sense of where you grew up, I'm fairly familiar with New Orleans. If I was standing right outside your front door and looking out into the neighborhood, what would I see or smell and hear?"
    },
    {
      "speaker": "Walter",
      "time": "00:08:15",
      "upperBoundTime": "00:09:00",
      "content": "Well, then, you'd see a lot of children, how I grew up. We came from across the canal. That's the lower 9th ward, that's actually in the 9th ward. That's where my whole family is rooted from my mom and my dad. And as a matter of fact, my sister stays in my grandmother's house, she passed away when she was one on one I don't know if you've ever seen that Katrina shot where the barge stopped."
    },
    {
      "speaker": "Marcus",
      "time": "00:09:00",
      "upperBoundTime": "00:09:02",
      "content": "Yes."
    },
    {
      "speaker": "Walter",
      "time": "00:09:02",
      "upperBoundTime": "00:10:09",
      "content": "Well that's my grandmother's house right there when it hit, it went into the yard and it was like this far away from hitting the house, that's my grandmother's house, my dad grew up in that house, my sister now stays in that house. We moved to the 6th ward, it was a neighborhood full of children. It was just bukoo children, and the way that the street is, the sidewalk sits here but all the houses sit so far off the sidewalk. I would say that's my most vivid memory. And in relationship to that, I also remember what crack cocaine did my neighborhood, it did what Katrina's couldn't do and it made it a ghost town."
    },
    {
      "speaker": "Marcus",
      "time": "00:10:09",
      "upperBoundTime": "00:10:10",
      "content": "Oh wow."
    },
    {
      "speaker": "Walter",
      "time": "00:10:10",
      "upperBoundTime": "00:11:28",
      "content": "So that's what I remember. Now obviously I can't tell you much about how it is now. My family they tell me that people are moving back in the neighborhood, and it's not the same. I have a nephew who kind of grew up in that same house, with my sister, after they came back from Katina she was saying that it was a trailer parked in the yard so she had her son there."
    },
    {
      "speaker": "Walter",
      "time": "00:10:10",
      "upperBoundTime": "00:11:28",
      "content": "He couldn't do things that we did regularly like just go outside and go around corner and go a little project, he couldn't do any of those things. I used to ask him about why doesn't he, he said Walter it's not the same there's no children around here like that, it's too dangerous. I've lived around a few guys in the last 23yrs and I know exactly what they're talking about, so."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:28",
      "upperBoundTime": "00:11:29",
      "content": "It's changed."
    },
    {
      "speaker": "Walter",
      "time": "00:11:29",
      "upperBoundTime": "00:11:32",
      "content": "Oh it's changed."
    },
    {
      "speaker": "Marcus",
      "time": "00:11:32",
      "upperBoundTime": "00:11:41",
      "content": "Do you, did you have sort of a best friends or a couple of guys you were very close to growing up? Are you still in touch with them?"
    },
    {
      "speaker": "Walter",
      "time": "00:11:41",
      "upperBoundTime": "00:13:01",
      "content": "I am now. See one of the things about being in jail, you don't notice it immediately, I know I didn't notice it immediately. The effect that it has on communication. Now you would think that would be obvious, but, the way it affects the communication."
    },
    {
      "speaker": "Walter",
      "time": "00:11:41",
      "upperBoundTime": "00:13:01",
      "content": "When I was out there everything that I did, everywhere I went or everything that I encountered, it was able to be shared immediately, with no inhibitions, it was life. But now since I've been in here, that is different now, I mean I can talk, I can communicate to them some things when I see them on a visit. But, so much of what I encounter on a daily basis can't be talked over the phone."
    },
    {
      "speaker": "Marcus",
      "time": "00:13:01",
      "upperBoundTime": "00:13:02",
      "content": "The daily, the everyday. ."
    },
    {
      "speaker": "Walter",
      "time": "00:13:02",
      "upperBoundTime": "00:14:13",
      "content": "The daily, the everyday things. Now those people who I was able to share with everyday have now been exchanged for the ones who I can share with every day in here and its huge the effect that it has had on my family and my friends on the outside but purely because of the objective separation that I've experienced, they we're experiencing."
    },
    {
      "speaker": "Walter",
      "time": "00:13:02",
      "upperBoundTime": "00:14:13",
      "content": "These guys in here they're my family, I can, in a lot of ways equally as much of my family as the ones who I grew up with. In some cases, you have guys in here who I have been knowing longer than my friends out there."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:13",
      "upperBoundTime": "00:14:15",
      "content": "23 years at 19."
    },
    {
      "speaker": "Walter",
      "time": "00:14:15",
      "upperBoundTime": "00:14:24",
      "content": "In here, so. I hope I'm not rambling man, like I get kind of excited."
    },
    {
      "speaker": "Marcus",
      "time": "00:14:24",
      "upperBoundTime": "00:14:32",
      "content": "Actually, you're not rambling at all and what you said about communication makes perfect sense. I hadn't really thought about it that way so, I appreciate you spelling that out."
    },
    {
      "speaker": "Walter",
      "time": "00:14:32",
      "upperBoundTime": "00:15:25",
      "content": "I mean its wild, here you got a guy, he comes and it's an instant thing right here. But the instant thing is against policy and regulation, whatever, the thing that's going on with it. So \"Walter, talk to me\" Or \"Walter, holler at me\". So these, I know these guys $$ I've ran around the penitentiary with them. I understand, I know what's going on but I can't say \"Look, ma\", \"Look, brother\""
    },
    {
      "speaker": "Marcus",
      "time": "00:15:25",
      "upperBoundTime": "00:15:26",
      "content": "Those are for special visits only."
    },
    {
      "speaker": "Walter",
      "time": "00:15:26",
      "upperBoundTime": "00:15:41",
      "content": "And when we talk about them it's not for the sake of anything other than just communicating my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:15:41",
      "upperBoundTime": "00:15:51",
      "content": "I understand completely. Was there a lot of fights when you first got here?"
    },
    {
      "speaker": "Walter",
      "time": "00:15:51",
      "upperBoundTime": "00:18:18",
      "content": "No. When I got here, not for me, let me clarify that, not for me. When I got here, it was a day when they had just moved the trustees from. So the whole side was empty, so guys were telling us that we were probably going to go to the cell block. We were young, they're probably going to put you in cell block before they put you in population. But it just so happened that was his first year, as well that year in 1995 when I came up here."
    },
    {
      "speaker": "Walter",
      "time": "00:15:51",
      "upperBoundTime": "00:18:18",
      "content": "And so he was filling up the dormitory, he was getting rid of people hiding in protective custody, he was doing things much differently. I didn't understand the difference then, it's my first coming up here. So we get up here. There is a mentality here of, it's pretty typical, strong weak, strong preys on the weak. It's not anything forced, it's all just like there is an understood role that people in a real sense they voluntarily enter into some, with some exceptions, even the exceptions are not the norm."
    },
    {
      "speaker": "Walter",
      "time": "00:15:51",
      "upperBoundTime": "00:18:18",
      "content": "The norm here is, guys know their roles here and in these roles, if they then you can avoid a lot of altercations. Now with that said, you won't be able to avoid some altercations. You don't want to be preyed on if you don't want to be preyed on."
    },
    {
      "speaker": "Marcus",
      "time": "00:18:18",
      "upperBoundTime": "00:18:35",
      "content": "So how do people balance that? I understand what you're saying. So you don't want to get into a fight, you don't want to get thrown into the cell block, but you also protect yourself so you don't get preyed on more. How do you find that balance?"
    },
    {
      "speaker": "Walter",
      "time": "00:18:35",
      "upperBoundTime": "00:20:45",
      "content": "This is an individual issue. The guy, me, for instance, I've had fights, that's how it is. If you don't want to be preyed on, then you are going to do whatever is necessary not to be preyed on. And anything can change the situation like, it's not just as cut and dry as \"I want to prey on you\", it's, here is a situation, if you let this go, then you become, you give occasion for guys to prey on you. This is in your mind. Now all of the mentality of not wanting to get written up or not wanting to be in trouble, I didn't know those things."
    },
    {
      "speaker": "Walter",
      "time": "00:18:35",
      "upperBoundTime": "00:20:45",
      "content": "I came up here with this fully in my mind that I was not going to be preyed on. That did not take in any consideration the security or the rules or the, that didn't even consider that. That's just for me. Now you have guys who are different and to go into the differences, it can get real convoluted. Because a guy say well this is why but he could be lying."
    },
    {
      "speaker": "Marcus",
      "time": "00:20:45",
      "upperBoundTime": "00:20:59",
      "content": "So let me ask you, after 23years, do you still on a daily basis have to negotiate these things?"
    },
    {
      "speaker": "Walter",
      "time": "00:20:59",
      "upperBoundTime": "00:22:01",
      "content": "Even for the ones who, even for the guys who never find their way here there is a role that's established, and some guys learn the glory in those roles and they perform their roles as naturally as anything. But these are choices that men make based on their individual position, where they are mentally, spiritually. But, yeah that's an individual."
    },
    {
      "speaker": "Marcus",
      "time": "00:22:01",
      "upperBoundTime": "00:22:33",
      "content": "One of the reasons that we wanted to speak with you is that you're identified by a number of people as a trusted member of your community, you turned your life around. When you look back on the Walter that was driven through the gates of Angola, how would you describe that person?"
    },
    {
      "speaker": "Walter",
      "time": "00:22:33",
      "upperBoundTime": "00:23:52",
      "content": "Lost, ashamed, angry, bitter, mad, rage, betrayed, and most of all full of self-hatred, self-loathing. I hated myself, I didn't want to be myself, and I wanted to be rid of myself. So, this is the person that came here, this is the person who at the time I did not even think was even capable of some of the things that I've done. Yes, and I personally for a while."
    },
    {
      "speaker": "Marcus",
      "time": "00:23:52",
      "upperBoundTime": "00:24:23",
      "content": "How long? Since we all have them, whether it's in prison or out of prison. Sometimes transformations happen as a gradual sort of progression towards and understanding of something; and other times it's a specific event or a specific person, a mentor or something a lightbulb goes off. What was it for you?"
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "This is so spiritual for me. This self-hatred, this self-loathing that I speak of it really was this humongous burden in me. This came from that idea that I didn't want to be around my family anymore because I was afraid of expectations, of not living up to them and them not loving me."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "And here comes the self-hatred and then it grew and it grew and it grew which ultimately led me to the penitentiary. But it's amazing, when I got here, I decided that I wanted to know the truth about who god was and who he is, because I wanted to be rid of my self-hatred. I wanted to be rid of it, so that's what I did. I embarked on a journey to know god."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "And when you get here man, you learn all kind of stuff. I grew up predominantly Catholic, 100% Catholic. And the things that I learned, I knew they couldn't have been the truth because the kind of effect it was for my life. While not doubting god, I just concluded that what I learned about God and that way could not have been the truth I want to know the truth. So I set on my journey, I studied divine metaphysics I've studied the house of Yahweh, I studied Islam."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "And each one of these experiences while it taught a lot of things, it did not have any power to change how I felt about me, wow. Look how simple the truth was for me without just sitting on my bed and knowing that this isn't true because I still feel the same way about myself. So I discarded all of those things. And I was in the blocks, and a friend of the family intervened for me and helped me get out the blocks. Helped me get back in the population, it's amazing that I even got trustee. I had my friends they were telling me \"man, Walter man how you did that, its impossible man, you tore up.\""
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "But I had some help, but the help didn't cause me to be like \"I want to change\", it didn't \"I want to change because I have help\". It just, it almost gave me more license to do more of what I was doing because I knew I had help. So now, when I end up at Camp F, bless it, Camp F. But I was there for 2years, and I used to catch the guys coming from the Chapel and all of the things that I learned I used to try to antagonize them with it and twist them up and I was just horrible. So I did these things for them and then there was a guy who came into the dormitory, I had been knowing him since I'd been here, he's a younger guy around my age, I had been knowing him, he had always been on this walk."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "We're trying to walk with god and live a life pleasing to god. All of it was a bunch of trash to me, I didn't want to hear the name Jesus Christ, it was poisonous to my ears up until that point that's a deal breaker to me once you start talking that. But at this point in my life, when they come to the dorm, I'm just asking him about it. What's going on man you don't watch TV I see you just read the bible. All you do is pray man what's up with that, you keep doing that. And we just started talking, and he was talking about the lord Jesus and it wasn't so poisonous to me."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "I'm not believing a word he's saying, I'm just checking him out. Alright I hear what you're saying. To make a long story short, I'm at my bed and one night I had used an extraordinary amount of drugs that day and I was ready to go, I was ready to die, I was ready to kill myself. I was like, this is it, I know I'm tired of myself, I want to agh. I know why men jump off buildings, I know why men put bullets to their heads. Because they want to be free from themselves, I wanted to be free too. And then I said \"God if you are real\""
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "I don't know where that came from, that was the last thing on my mind, \"if you're real, they told me if I believed in you that your son died for me that you would take this thing away from me. I just want this thing taken.\" and he showed be I needed to be forgiven, and when he showed me that, I bought. Because I was thinking: no way can you forgive me. What I did to those people. What I've done. I'm not even asking for that, I know that's too hard. Just take this thing away from me. But, he was very steady, he didn't move. And he forgave me."
    },
    {
      "speaker": "Walter",
      "time": "00:24:23",
      "upperBoundTime": "00:32:54",
      "content": "When I got up the next morning, the guys from the camp thought I was crazy. All I kept saying was \"he forgave me, he forgave me, and then he opened my heart to the cross\". This is my moment, Mr. Marcus. This is the moment where my whole life, it's the lens for my whole life, past, present, and future, I see through this lens. And it's so powerful because through the cross I kind of I see how things are constructed. How the root of it, how it is."
    },
    {
      "speaker": "Marcus",
      "time": "00:32:54",
      "upperBoundTime": "00:32:57",
      "content": "Have you forgiven yourself?"
    },
    {
      "speaker": "Walter",
      "time": "00:32:57",
      "upperBoundTime": "00:33:42",
      "content": "Absolutely. I used to walk around with what felt like an emblem on my head. I literally could not lift my head up, literally. But he did that, the cross did that. The guys told me \"Walter you're going to be talking about the cross that's all you do\", well it was transforming, and it revolutionized my life."
    },
    {
      "speaker": "Marcus",
      "time": "00:33:42",
      "upperBoundTime": "00:33:52",
      "content": "It's clear. Can you describe what your typical day is now? I mean what's your routine?"
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "Yeah, I get up, I have to work, and I have to be to work anywhere between 7 and 7:30. I work at a place, the control center, it's the hub of the place, but there's a lot of security business going on, the armory is even over there they got the guns and stuff. So it's very sensitive stuff that goes on over there. And I'm in awe of it, I clean up, I help whenever they need help, I do it. Wow it took away my laziness. I remember when I first went back there to Camp F, I had never worked, and I had never been a worker. I didn't know anything about work."
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "So I come up here worrying I don't want to work. I only worked because that was my concession to the help that I was getting from the friend, \"Okay I'm going to do some work.\" But I only wanted to do my job, I'm not going beyond, I'm not doing the step, they took me off one job, they put me in the kitchen and the lady told me I couldn't leave the kitchen, I worked the pots and pans."
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "Now this is the way this works, the bakers the cooks, they cook food, and since I'm the pots because I wash the pots, they have to use the pots that I have to wash. So what they do is they break me off whatever they cook, they give me in exchange for washing the pots. So I went in there \"I don't want any of your food, I don't want your cookies, I don't want your pastries, I don't want your food."
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "Wash your own pots, I'm not doing anything,\" I was horrible."
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "They hated me in that kitchen, I didn't want to do anything except for what I wanted to do. The lady wouldn't let me leave one time, I couldn't leave because this old man, this 70 year old man who I'm supposed to care about, he needs help cutting the vegetables, well I'm not helping him. They hated me in that kitchen. And when he opened my heart to the cross, everything changed."
    },
    {
      "speaker": "Walter",
      "time": "00:33:52",
      "upperBoundTime": "00:37:45",
      "content": "I couldn't stand to see nobody in that kitchen when I leave, I mean I'm going from my area to the scullery, to cleaning the pots and going on the line. And I went from the laziest man ever born, to being known for all I want to do is work man, it's impossible all the time. I even got my next job because the coronel came in and said \"Look, Walter we heard that you're the one that needs to be over here, I worked."
    },
    {
      "speaker": "Marcus",
      "time": "00:37:45",
      "upperBoundTime": "00:37:58",
      "content": "You clearly have a joyfulness that is just coming out of you. What would you say is the worst part of being here?"
    },
    {
      "speaker": "Walter",
      "time": "00:37:58",
      "upperBoundTime": "00:41:27",
      "content": "Of being here? So much comes to my mind. I think for me, it was the realization of, it wasn't just how bad I was, which I didn't know I was that bad. But when I learned that I could've been much worse had I stayed out there. It could've been worse had I been out there. That it could've been, I did not know I was that horrible. I did not know I was that messed up."
    },
    {
      "speaker": "Walter",
      "time": "00:37:58",
      "upperBoundTime": "00:41:27",
      "content": "I did not know everything that I've done, the things that I've done, the people that I've hurt. Which resulted in enough pain to fill up 50 lifetimes. I did not know I was capable of those things. And so to be confronted with that like wow. Boy that's rough that hurt, it hurt man, and especially when you consider the family. But I learned, when I learned it's like, what do I do?"
    },
    {
      "speaker": "Walter",
      "time": "00:37:58",
      "upperBoundTime": "00:41:27",
      "content": "Because now it wasn't any longer about just being in jail, this was much more horrible for me. In a real sense I felt like jail was the perfect place to hide me, from me. For me, I'm not talking about it was like I didn't want to face the world anymore, with me. I knew that what was required, what I was seeking for some answer for me that had nothing to do with being in jail or being out of jail."
    },
    {
      "speaker": "Walter",
      "time": "00:37:58",
      "upperBoundTime": "00:41:27",
      "content": "But these were not things that I thought about. These are not things that I was like let me think about this like this was a revelation in my journey. I end up here one moment, one moment I didn't know something and the next moment I know it."
    },
    {
      "speaker": "Marcus",
      "time": "00:41:27",
      "upperBoundTime": "00:41:50",
      "content": "It's almost like, the way you're describing it. It's the best and the worst thing that happened to you because, I'm understanding that the worst part of it is being confronted with yourself, and yet confronting yourself is also the way you forgave yourself. Do you understand what I'm saying?"
    },
    {
      "speaker": "Walter",
      "time": "00:41:50",
      "upperBoundTime": "00:44:00",
      "content": "I understand exactly what you're saying. It was necessary, look, I believe in the cross of Jesus Christ. It is everything for me, it is the life of me. This is the life that was given to me and I know that there are guys who have gotten out of here and they wish to god that they were back. They would do anything to be back here, from not knowing him. For me, I know I guess a more natural thing that comes to the mind is being away from the family and look, I love my family with all my heart. But I was with my family all those years and it wasn't the answer for me, just having a family."
    },
    {
      "speaker": "Walter",
      "time": "00:41:50",
      "upperBoundTime": "00:44:00",
      "content": "Look at my life, if that's all it took, was just having a family who loved me, then I wouldn't be here. If that's all it took. Guys will be like, \"Well look, Walter well if I had this and I didn't have this\". Well I had that, and I had that, and I had that too. If that's all it took, I wouldn't' be here. It's like, I'm not the poster child for the broken home."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:00",
      "upperBoundTime": "00:44:01",
      "content": "No yeah, I understand that. Do you envision your life outside of here?"
    },
    {
      "speaker": "Walter",
      "time": "00:44:01",
      "upperBoundTime": "00:44:07",
      "content": "I do."
    },
    {
      "speaker": "Marcus",
      "time": "00:44:07",
      "upperBoundTime": "00:44:11",
      "content": "How do you envision what you'd be doing?"
    },
    {
      "speaker": "Walter",
      "time": "00:44:11",
      "upperBoundTime": "00:46:12",
      "content": "I know I'm going to minister the cross. I've said this to the brothers, the fellowship. This life has been giving to me, it's not one of, how can I say it, it's not based on thinking in a sense of how I'm going to think about, I'm going to plan. While there is nothing right or wrong in that, I'm just saying that this life is, this is my life. So now when I get out of here, I'm going to tell my story. It's what I'm going to do, lord willing, I might just tell my story."
    },
    {
      "speaker": "Walter",
      "time": "00:44:11",
      "upperBoundTime": "00:46:12",
      "content": "And I'm going to tell my story and my story is directly interwoven with the story of Christ Jesus, and I'm going to tell my story and I'm going to see how that affects me. It does not matter now I get love. I have no picture of a particular happy ending with a house. I want to tell my story, and I want to see me get supported off of that."
    },
    {
      "speaker": "Marcus",
      "time": "00:46:12",
      "upperBoundTime": "00:46:59",
      "content": "Let me ask you this, so, if you're before a pardon board, parole board, and you can tell them that you've had this spiritual conversion, and they may be cynical about that, I think that you understand that too. So what else would you want the folks on that board to know about you? Such that they would feel comfortable pardoning you."
    },
    {
      "speaker": "Walter",
      "time": "00:46:59",
      "upperBoundTime": "00:49:02",
      "content": "I know I don't deserve to be here. I knew I wouldn't deserve to be there. I would convey that as simply as possible, that I know that I don't deserve anything because of the life that I've taken. And that that judgement that is made there is purely in the hands of god I'm sorry Mr. Marcus, but this is my life. It's not a religious side vs. another side, the cross has transcended all of religion for me, and it's my life."
    },
    {
      "speaker": "Walter",
      "time": "00:46:59",
      "upperBoundTime": "00:49:02",
      "content": "Where I go right now, I know this is the grace of god. Right now I know that this is his business, how he uses it with your work, that's his business. I know that this was an occasion to tell my story and that's what I'm going to do if given the opportunity to do that. I'm just going to tell my story. I'm not concerned about convincing them, I'm concerned about them hearing my story and let them be used however, whichever way that the lord is willing. My life was forfeit."
    },
    {
      "speaker": "Marcus",
      "time": "00:49:02",
      "upperBoundTime": "00:49:16",
      "content": "How do you make sense of life without parole as a punishment to give somebody, a human being?"
    },
    {
      "speaker": "Walter",
      "time": "00:49:16",
      "upperBoundTime": "00:52:38",
      "content": "I could tell you how I used to feel. I used to feel that everything was relative, it depended on the situation, the circumstance. And then, since the cross, it's like there is a reality that has to be dealt with. You got guys here who didn't do it for real, but they're right here with me. They don't segregate us, they don't say the ones who really didn't do it you get to eat out of reentry cheeseburgers and hamburgers. So now you are here, you didn't do it, I'm here I did it, so you can't be here for what you did because you didn't do it."
    },
    {
      "speaker": "Walter",
      "time": "00:49:16",
      "upperBoundTime": "00:52:38",
      "content": "So why are you here? So when I reconcile that with the sentencing, I know without a doubt in my mind that there are men who have, who I have seen, who I've encountered, could have received a lesser penalty and would have been able, according to the social stand, to succeed. Even now I feel like that, but the reality is life without parole."
    },
    {
      "speaker": "Walter",
      "time": "00:49:16",
      "upperBoundTime": "00:52:38",
      "content": "So now this is where I proceed from, I proceed from I have a life sentence no parole, but I have a story. Now, I can tell you I am so ashamed of the things that I've done Mr. Marcus, but I'm no longer ashamed to talk about them. The life without parole is not my business, I got it, it's mine, and I possess it, and look what happens."
    },
    {
      "speaker": "Walter",
      "time": "00:49:16",
      "upperBoundTime": "00:52:38",
      "content": "Two guys named Marcus come to Angola and decide they're part of a circumstance that says well what, life without parole we think it's inhumane because in my country this is not even the case there. We want to help. Now, look, I didn't think about that, I didn't say well what, I think there should be two guys named Marcus we are heading to. I didn't have anything to do with that, but I had a story, and because of my story somebody was able to say to you, \"Look, I think you should talk to Walter\"."
    },
    {
      "speaker": "Marcus",
      "time": "00:52:38",
      "upperBoundTime": "00:52:54",
      "content": "Yeah. Okay, last question. Was there something that I should've asked you, if I'm trying to understand your experience? Is there something that I should've asked you that I didn't ask you, or something else that you want to tell me?"
    },
    {
      "speaker": "Walter",
      "time": "00:52:54",
      "upperBoundTime": "00:53:12",
      "content": "No at least not listen, I can go on and on and on believe me. Listen, I am marveling at your patience."
    },
    {
      "speaker": "Marcus",
      "time": "00:53:12",
      "upperBoundTime": "00:53:29",
      "content": "I'm enjoying every minute of talking to you. So how much punishment is enough for what you've done? Does it matter?"
    },
    {
      "speaker": "Walter",
      "time": "00:53:29",
      "upperBoundTime": "00:53:32",
      "content": "You said this is the last question?"
    },
    {
      "speaker": "Marcus",
      "time": "00:53:32",
      "upperBoundTime": "00:54:11",
      "content": "Let me say this, we don't make a distinction. We give life without parole for a whole series of offenses, including driving the car, being a principle to something, all the way to chopping up babies, all those guys have the same sentence, okay. We don't take into account anything, if you have a life sentence without parole, we are then saying, we don't care what you do afterwards, we don't care how you change your life, I don't care if you find god or the cross or sit in your cell all day. Does that make any sense to you?"
    },
    {
      "speaker": "Walter",
      "time": "00:54:11",
      "upperBoundTime": "00:56:45",
      "content": "Does yes and no apply? Because, I understand that's how men think. Look you described it perfectly. If a man kills somebody should he receive life without parole? Yes, okay well look. John Smith he came, this is how he grew up, he had a family, got in some trouble, got to jail, got his GED, got some carpentry, turn around and help people in the community do you think John Smith should have life without parole? No not him. You literally described this situation, that's how people think. Look, when you talk about a crime, when you talk about a murder."
    },
    {
      "speaker": "Walter",
      "time": "00:54:11",
      "upperBoundTime": "00:56:45",
      "content": "This is a horrible thing, there's so much feeling and emotion and pain invested in that, for every party but especially the victims. So, at first glance, it is. Yes that's what you deserve. But we're human. So we can say yes that's what you deserve with the right hand and then the next conversation change our minds about it. It's clear to me that this is certainly the mindset that you're trying to reach and trying to tap into with your work here, and I wish you well."
    },
    {
      "speaker": "Walter",
      "time": "00:54:11",
      "upperBoundTime": "00:56:45",
      "content": "Man, I really do, but if you're asking me about time and what a man deserves I trust the cross. Look, he said that hell is the home for all who do not believe in Christ. So anything short of hell is grace, so now here I am, you're telling me well Walter you deserve to be in jail and I'm saying man I'm glad I'm not in hell."
    },
    {
      "speaker": "Marcus",
      "time": "00:56:45",
      "content": "Okay that's a good place to stop. I'm glad you're not in hell too, Walter."
    }
  ]
}
