{"name":"","transcript":[{"content":"William Hall Transcription REDACTIONS FINAL"},{"speaker":"William","time":"00:00:00-0","content":"My name is William hall I was born may 9th 1969 I'm here for first degree murder I was 19 years old when the crime occurred."},{"speaker":"Marcus","time":"00:00:12-4","content":"And how long have you served will?"},{"speaker":"William","time":"00:00:13-5","content":"28 years."},{"speaker":"Marcus","time":"00:00:16-7","content":"Where were you born?"},{"speaker":"William","time":"00:00:18-2","content":"Born in Delaware, Dover Delaware raised in Georgia came to Louisiana finished up high school. Live on my own for a little while and then got in trouble."},{"speaker":"Marcus","time":"00:00:28-3","content":"Where in Louisiana?"},{"speaker":"William","time":"00:00:29-5","content":"Baton Rouge."},{"speaker":"Marcus","time":"00:00:32-0","content":"Baton Rouge. So I'm gonna ask you a few questions about your life before you came to Angola and then a few questions about some changes that you'd gone through since coming here. But to start with can you tell me a little bit about your childhood growing up the folks who raised you the folks you were close to?"},{"speaker":"William","time":"00:00:53-5","content":"My mother and father were very young when I was born. My mom was 16 my dad was 19. They did what the best they could that was in the early 70s different completely different atmosphere than now but they didn't get along they wound up divorcing there was some back and forth stuff I was actually living with dad but he didn't have custody. Mom kind of kidnapped me and it went downhill from there. My stepfather ray and I was 7 when I was kidnapped my mom kidnapped me up til then it was rough but I was happy, normal kid when mom kidnapped me I was not happy anymore."},{"speaker":"William","time":"00:00:53-5","content":"Shortly thereafter my stepfather was sexually abusive a little physically abusive but mostly just sexually. Alright so that's very early so I hit 12, 13, 14 very spiteful very rebellious full of hate bitterness and anger no whatever help was there I rejected in my hate and bitterness and no one could reach me because I was putting walls around the wounds. At 15 my behavior had gotten bad enough mom still in denial about all this my behavior had gotten bad enough they finally sent me back to dad and that was a year or so of growth."},{"speaker":"William","time":"00:00:53-5","content":"Dad was a safe place I respected him so his authority was respected. We got along well the authority was there but we were also friends we hadn't seen each other since I was 7."},{"speaker":"Marcus","time":"00:02:45-4","content":"Do you have siblings?"},{"speaker":"William","time":"00:02:46-5","content":"No well. No they divorced when I was five I was the only product of that marriage. When I was living with mom I was 12 when my little brother was born 13, 14 when my little sister was born. That little boy was special he was cute I held him when he was 30 minutes old and he grabbed my little pinky he had me wrapped around his finger from then forward but then I left he was only 5 so there was no real relationship."},{"speaker":"William","time":"00:02:46-5","content":"When I went to live with my dad he had a 5 year old, 5 or 6 they're a year apart and but we didn't have that closeness but he was still my little brother but he was just a kid I had just met I didn't hold him when he was 30 minutes old. But we got along good."},{"speaker":"Marcus","time":"00:03:34-3","content":"Did you ever fear for your younger siblings with your stepdad?"},{"speaker":"William","time":"00:03:39-2","content":"Not when they were that young no. By the time they reach age where I was worried I was here. I did broach the subject with mom she's still in denial and there's been no contact with that branch of the family for 10, 15 years it's been a while. But I did like I said I reached out I tried to I was rejected okay."},{"speaker":"William","time":"00:03:39-2","content":"So any help or whatever was rejected as well safeguarding or alerting now come to find out now he's in his 20s now my little brother and he has I don't know I think he's got some sex offenses now which is in the cycle right. I got out of that cycle I left and safeguarded well I also came to prison so but I did safeguard break the cycle break the chains got out of that even in my hate and anger and bitterness I still separated I got away. I did."},{"speaker":"Marcus","time":"00:03:39-2","content":"Was there a lot of fighting?"},{"speaker":"William","time":"00:04:55-0","content":"Not physical but there was a lot of tension secrets not spoken about the house I mean we went to church dad was a deacon mom was involved so on the surface to the public it was normal household. Internal not so much so no fisticuffs very little very very little I would actually say no more than any other adolescent growing up authorities that's going to happen that was I did not fear getting beaten up."},{"speaker":"Marcus","time":"00:05:37-4","content":"What about school how was school for you?"},{"speaker":"William","time":"00:05:39-8","content":"School was an escape school was I didn't have to be at home I didn't have to be around it I didn't have to be subjected to it you would think my grades would reflect that but they didn't I was still dysfunctional but I enjoyed school I went to school I finished school even at the worst of all of the in betweens I went to school I did graduate high school."},{"speaker":"Marcus","time":"00:06:04-6","content":"Eventually in Baton Rouge"},{"speaker":"William","time":"00:06:05-7","content":"Eventually in Baton Rouge I finished out I graduated in 87 McKinley right up there in downtown Baton Rouge. My grades weren't that good because I didn't have to work I was gifted with academics are not a problem for me I can read the books listen to the lecture give you what you want back information regurgitation that's not difficult application thereof was very difficult then. Not so much now there's a big difference between 19 and 50."},{"speaker":"Marcus","time":"00:06:42-0","content":"So, you graduated high school did you ever have plans to go to college?"},{"speaker":"William","time":"00:06:51-3","content":"Not really like my grades weren't that good I graduated with a d average and I got that really just paying attention to the tests I wasn't participatory the homework the classroom discussions there was no Applica there was even then even at 17 I still didn't have a vision of the future that was anything other than I'm at 17 I'm heavily off into my drug abuse."},{"speaker":"Marcus","time":"00:07:21-1","content":"Ok let's talk a little bit about that"},{"speaker":"William","time":"00:07:23-8","content":"So there was no future in there that was my future no life skills the drug abuse ok I left my mom and stepdad when I was 15. At that point I had dabbled I had tried experimented like any adolescent is subject to do. Went and left and lived with dad for a year or so and didn't even dabble once maybe twice the guys but it wasn't a requirement at all that was not a part of having fun that was part of the scene. So I participated but not in any dependent way it was use not abuse clear line there."},{"speaker":"William","time":"00:07:23-8","content":"Me and my father as much respect and love that was there I was still dysfunctional I mean when I met him I couldn't make eye contact with almost anybody I had a serious inferiority complex along with all the dysfunctions the abuses whatnot. But he brought me out of a lot of that he brought me out and just gave me a safe place to be okay. But still being wounded still having those walls up and it was a lot of hero worship because he was an ideal from that kidnapping until 15 I kept waiting on rescue and he was the ideal knight in shining armor waiting and he never showed up."},{"speaker":"William","time":"00:07:23-8","content":"So at 15 I'm alright well reality meets fantasy and he's human. He's still a good guy I still have the utmost respect for him he's more than just dad he is actually a good person but he stumbles and in my wounds that was too much of a let down and my dysfunction and so I went back to my mom and stepdad which they had moved to Louisiana by then so I came to Louisiana and Louisiana then I'm 16 and that wound and then coming back into this situation again."},{"speaker":"William","time":"00:07:23-8","content":"Only now I'm big enough for my no means no alright so that wasn't on the table anymore that was off the table that or for his particular sickness I was too old or whatever. But so I was only out of my little brother's life for that one year and everything's still good and so I know what to look for everything's still good with the little brother and my little sisters only 3 and I don't think that was in his sickness but so the drug abuse."},{"speaker":"William","time":"00:07:23-8","content":"Yeah we were living in a fairly decent neighborhood but they were bussing at the time bussing us downtown and that downtown area- I used to skip school a lot I didn't pay attention I didn't need to I'm gifted with intelligence or cursed however you want to call it because there is the curse of intelligence all I needed was to show up to the tests and I could pass the classes its still a D but it was a pass go to the next grade."},{"speaker":"William","time":"00:07:23-8","content":"So I cut school a lot I spent a lot of time in the places I shouldnta been."},{"speaker":"William","time":"00:07:23-8","content":"So the drug abuse the use went to abuse because now it's an escape there's too much at that time there was just too much negativity in my life that I had no skills to deal with no support system or if it was there I was rejecting it in my own illness okay this is the benefit of looking back. At the time I'm just an angry 16 year old."},{"speaker":"Marcus","time":"00:11:09-5","content":"Of course and you're having a normal reaction to a very abnormal situation."},{"speaker":"William","time":"00:11:14-4","content":"I didn't know that then. Then I was an angry bitter spiteful rebellious hurt individual. But lots of people are and lots of people don't wind up in prison because of it so its not making justifications for that part you wanted some background information on who I was. That's a very significant part of who I was."},{"speaker":"Marcus","time":"00:11:39-5","content":"What were the drugs?"},{"speaker":"William","time":"00:11:41-3","content":"It started with alcohol because its legal its easy to get and alcohol became a serious serious problem I had two lockers at school one with books one with alcohol they had the tall lockers the two locker I had both of them and that one had alcohol it in and I went in that one more than I went in that one. It by any definition in any of the books of alcoholic I was an alcoholic in my senior year of high school I literally do not remember my senior picture."},{"speaker":"William","time":"00:11:41-3","content":"My wife which we'll get into that- my wife has a copy of the yearbook and there I am. And she goes that's you! And I'm here by then and she says I got a picture of you in your cap and gown and I said I never wore a cap and gown because I never walked across the stage I graduated but I didn't get my diploma or wear a ring or any of that. She said no its you I said well maybe there's 2 redheads at the school She said no it's you. I said baby there was two redheads at the school you got the other guy. She didn't argue with me, she sent me the picture."},{"speaker":"William","time":"00:11:41-3","content":"Yep that's me. I literally do not remember wearing a cap and gown in high school which would be a significant event in anybody's life this is a celebratory moment this is one of those milestones in your life right? I don't remember it. Which is just one example of how the alcohol was that bad. When I graduated moved out on my own it became whatever drugs were available. Whatever. Even then it was whatever was available."},{"speaker":"William","time":"00:11:41-3","content":"But drug of choice was alcohol drug of choice changed to marijuana and when I was high I just I noticed that the alcohol interfered with the weed High so it became I could function better on weed. On alcohol I couldn't function when I had a job when I had to work I could function better loaded on weed than I could alcohol. I was definitely a functional addict paid bills I had my own apartment- well I had a roommate but still I had bills food to put on the table I had to live with a lady and I'm meeting socially accepted requirements."},{"speaker":"William","time":"00:11:41-3","content":"I'm doing all that completely loaded. Yeah so the drug use was no longer use it was full-blown abuse. And that is why I'm so interested in teaching it now. I have the background and the history and it didn't it didn't slow down when I got arrested. No there was a bump in the road"},{"speaker":"Marcus","time":"00:14:27-3","content":"What were you first arrested for?"},{"speaker":"William","time":"00:14:29-6","content":"My very first arrest was I was 16 I was a senior in high school and I cut school that was one of the things I used to do I had cut school I'm at the supermarket paying for my beer with my fake ID two other kids from the same school are stealing cartons of cigarettes from the cigarette spot I'm at the counter, putting money on the counter at the checkout I've got my beer it's paid for I'm fixing to walk outta there."},{"speaker":"William","time":"00:14:29-6","content":"They're stuffing a carton of cigarettes down their pants. They snatch them up and they snatched me up just because we walk through the door together. Okay I'm sorry I got caught up on a theft by association and a contributing charge however they offered a pre-trial fine they put me on probation community service and it's supposedly disappeared and I was juvenile but I was arrested they put the cuffs on charged me but I completed the program successfully."},{"speaker":"William","time":"00:14:29-6","content":"So it should have went away. I don't know if it's in a jacket somewhere. But being honest and transparent was really my one and only brush with the law until what led me here. I was an alcoholic I was buying alcohol."},{"speaker":"Marcus","time":"00:15:57-2","content":"I'm trying to sort of I'm trying to get a visual. Picture of things so let's just go back to that apartment that you were living in did you say with the girlfriend? Roommate?"},{"speaker":"William","time":"00:16:11-7","content":"Yes at first it was just a Roommate. I had graduated high school I had a job I couldn't really afford an apartment on my own minimum wage and I was working at Waffle House and I was sitting at the counter talking with a girl looking at a girl behind the counter looking for a place to stay."},{"speaker":"William","time":"00:16:11-7","content":"I'm still living with my mother and my stepfather and so the conversation has gone on do we know of any places now I didn't have transportation I had a 10 speed so it needs to be within the guy sitting there drinking coffee goes I need a roommate."},{"speaker":"William","time":"00:16:11-7","content":"Didn't know him from Adam okay let's go look and his name is. Gary Guidry I had to think about that he turned out to be okay he was a decent guy. He work days and I work nights so we got along fine period a month or two down the road one of the girls I knew from high school she was coming over and I never really knew for certain it was sexual abuse but she was coming from a rough house I knew that. And she ran away needed a place to stay now I'm only 17 she's 15."},{"speaker":"William","time":"00:16:11-7","content":"So I call her uncle whoever it was her uncle and her aunt where her Guardians her grandfather had just died she stayed with her aunt and Uncle. It deteriorated very quickly so I gave her a place to stay stayed in touch with her guardians So I can say look I'll let her get her feet under her but we need to work together here she doesn't need to live with me."},{"speaker":"William","time":"00:16:11-7","content":"I can't afford it and but she was special to me but it was not sexual she had her own bed it was a 2 bedroom apartment we shared a bedroom but I really was just trying to help her out but there were still needs to be met."},{"speaker":"William","time":"00:16:11-7","content":"It was a responsibility Make sure she had food a pair of shoes whatever and for a 17 year old on minimum wage and a functioning addict and she was not a functioning addict she was simply an addict. I wasn't equipped to help her I thought I was I thought I was helping."},{"speaker":"Marcus","time":"00:18:47-7","content":"What would I see standing out right outside your apartment door looking out?"},{"speaker":"William","time":"00:18:53-1","content":"Well that was south park it was in a Decent neighborhood it was right down something highway so you got a lot of traffic right there it was my mother and stepfather right across the highway I was living there I walked to get a job so I still needed to live in walking distance so I just moved across the street. But it was nice 84 Lumber was right there it was a good neighborhood."},{"speaker":"Marcus","time":"00:19:24-0","content":"Did you have a best friend?"},{"speaker":"William","time":"00:19:25-8","content":"No in that back and forth and moving around I went to 11 different schools in four different states in 12 years of education I didn't go to kindergarten first through 12 was in 4 different states and 11 different schools I moved a lot even living in one State we moved a lot. There were people I would get to know but then we would move again I was always the new kid on the Block there was a type I thought about the question there was a type that I made friends with it wasn't the highly dysfunctional."},{"speaker":"William","time":"00:19:25-8","content":"But it was not the goodie-goodies it was a little bit to the left of middle. On the edge of trouble not fully respectful but not completely all the way. Insane I guess. That was the type that was the crowd I usually hung with. And it's not hard to find them"},{"speaker":"Marcus","time":"00:20:27-8","content":"So what led to you ending up here?"},{"speaker":"William","time":"00:20:31-0","content":"The actual event? Okay as I mentioned I was full of hate and bitterness I had no healthy way I was never taught a healthy way to deal with that anger. That internal conflict and strife and bitterness if anything was there I rejected it in my heart I never had a skill for that and I know people in my life reached out to me at times I know they did and I can remember rejecting some of that. Not wanting to share I'm 50 now I don't know you I shared that with you I don't share that with everybody but I have gotten better."},{"speaker":"William","time":"00:20:31-0","content":"Sharing that at 16 was not going to happen. 16 17 18 I never shared it I never told anybody. And some of the guys I was running with we didn't go picking flowers we went drugs buying selling or using. Once you're loaded we go have fun and fun was never picking flowers that wasn't what we did. We go around beating people up or stealing things but we weren't sitting in church."},{"speaker":"William","time":"00:20:31-0","content":"So that was a rough crowd I was running with and eventually I wound up in a situation where the wrong switches got threw and all that had been built up inside me came out at once. They say things happen in a process and it's one of the things I teach in my life skills relapse prevention process. Trigger thought craving relapse and if you interrupt the process you can stop the Relapse it's a very simple process. And that night that anger all came out I can look back and see okay there was a process."},{"speaker":"William","time":"00:20:31-0","content":"But it happened like that I went from whatever level of functionality I had to 0 function it just all came out it took the anger and bitterness it all took control and came out I was no longer conscious or thinking I did not black out I remember everything but it was all seen through that Haze of the negativity."},{"speaker":"Marcus","time":"00:22:56-8","content":"Sure so when you look back it's been a long time-"},{"speaker":"William","time":"00:23:02-4","content":"It has. And you can see it's still emotional."},{"speaker":"Marcus","time":"00:23:06-5","content":"Sure. Of course. When you look back on that and the victim how do you make sense of it now how do you feel about it today? 28 years later?"},{"speaker":"William","time":"00:23:20-8","content":"The emotions are here you can see them. How do I feel? There is some wrongs I've done that I can make amends for there are some things where I can repair the damage reconciliation of restoration is something that can happen. In this instant there is absolutely nothing that can be done. I took something that can't be given back if the victim's family were sitting here what can I possibly say or do? There is nothing can fix that. No amount of apologies no amount of Tears ever going to help that."},{"speaker":"William","time":"00:23:20-8","content":"I can only hope that I can only hope that they've gotten some help somewhere. I've never been able to tell them anything. I've never they don't know whether it was as I explained it just a rage thing or if it was a planned thing or if there was a Target they don't know. And I've never had the chance to talk to them I'm actually legally far from I can't. But how do I feel about it I still haven't said how I feel about it. I really wish it had never never never ever happened."},{"speaker":"William","time":"00:23:20-8","content":"There is no making it up it's the worst thing defining identity it's one of the worst things I've absolutely ever done. The worst. Not one of it is the worst I've never done anything that bad ever in my life before or after. Milestone a life-defining moment that is that's the one."},{"speaker":"Marcus","time":"00:25:17-7","content":"So you're obviously one of the reasons that we're talking with you is that you've been identified as somebody who's really turned their lives around since being incarcerated but can we look back to the person who was driven through those Gates. How would you describe that person?"},{"speaker":"William","time":"00:25:44-1","content":"Okay you say through those Gates do you mean when I was first arrested put handcuffs on or when I first arrived in Angola?"},{"speaker":"Marcus","time":"00:25:51-5","content":"How much time passed between those?"},{"speaker":"William","time":"00:25:53-0","content":"It was 16 months so there was some transformation already."},{"speaker":"Marcus","time":"00:25:57-3","content":"So you spent some time in the Parish Jail"},{"speaker":"William","time":"00:25:59-5","content":"Yes."},{"speaker":"Marcus","time":"00:26:00-1","content":"How was that?"},{"speaker":"William","time":"00:26:02-5","content":"The parish was rough there was no programs there was no nothing it was warehousing. But I mean it's the parish if you're a very short weekend, DWI or something what programs you need to get the programs then you go. The parish really just isn't equipped for anything so it's warehousing."},{"speaker":"Marcus","time":"00:26:23-0","content":"So let's talk about Angola"},{"speaker":"William","time":"00:26:25-0","content":"Now so 16 months later but that guy who first got arrested that's what that was your question right? oh I can remember the first night it was there is so much guilt but there was never the guilt of I got caught right because in my situation it wasn't that I was doing a whole lot of bad things I know now I got caught with my hand in the cookie jar. I expect you to get in trouble with the drug use eventually I never got caught I figured eventually I would I was willing to pay that consequence. One of the things with addiction you don't care about the consequences you keep using."},{"speaker":"William","time":"00:26:25-0","content":"So that first initial time. They're that guy there was a lot of shock that I've done it cuz that wasn't me I wasn't a fighter I wasn't an aggressive person I still haven't learned how to be comfortable with making eye contact with people. I was not an aggressor all that had been suppressed and bottled up. Okay so right in the parish at first that first week or so I had to spend some time between my ears sanity was actually a question here what just happened why how?"},{"speaker":"William","time":"00:26:25-0","content":"A complete loss of control. And that kid was so screwed up and so looking back who was that kid? That kid was so screwed up. No life skills no coping skills- answer to everything was to get loaded. And that wasn't immediately available so all that transition was terrible. And then I'm looking at the death penalty so let's add some more pressure to it so personally it was very difficult to deal with."},{"speaker":"William","time":"00:26:25-0","content":"No programs nobody to talk to except to other people in very similar circumstances. We're not highly functional individuals at this point we're in the parish waiting for whatever we're waiting. It's not Angola todays Angola When I got here it still wasn't today's Angola It was awhile ago. But yeah that guy any opportunities rough."},{"speaker":"William","time":"00:29:12-4","content":"Too personal? Too informal?"},{"speaker":"Marcus","time":"00:29:15-5","content":"No it's great."},{"speaker":"William","time":"00:29:16-9","content":"Okay."},{"speaker":"Marcus","time":"00:29:18-1","content":"It's great. Okay let's take the batteries out we can always stop and restart if the power goes out. So let's pick up where we left off. So no programs tons of pressure and now you're having to sober up."},{"speaker":"William","time":"00:29:47-9","content":"That didn't last very long. Yeah moving around all the time I learned to ID people and okay you come here what you got?"},{"speaker":"Marcus","time":"00:29:58-8","content":"Right. So and of course drugs are readily available in Parish prisons."},{"speaker":"William","time":"00:30:06-6","content":"When you congregate a bunch of type of people together that's what you're going to get."},{"speaker":"Marcus","time":"00:30:13-6","content":"So what was Angola a like when you first got here?"},{"speaker":"William","time":"00:30:17-9","content":"I came to Angola in 90 the crime happened in 88 after 88 I came to Angola in March and I of 90 they put me I was already in a cell because I was looking at the death penalty and so I was in a cell I got here they left me in a cell for a little while. So I didn't get to experience Angola as a concept. I'm in a cell."},{"speaker":"Marcus","time":"00:30:43-6","content":"You're in solitary."},{"speaker":"William","time":"00:30:45-6","content":"I did 18 years in a one man cell. I don't know what you do with the editing here but one of the things I say in my teaching classes and whatnot is I've done 18 years in a one-man cell and I can still fool you into thinking I'm sane. It did not kill me. Those 18 years were very therapeutic. I was sent here once I got my life sentence the misbehavior ceased. The pressure was gone. I have a life sentence I'm sitting here to die of old age and I'm in a cell and they're telling me I'm going to be in a cell until I die of old age."},{"speaker":"William","time":"00:30:45-6","content":"They're not going to let me out of the cell and they're not going to let me out of prison that Reality is starting to sink in. It takes some years for that to fully sink in but that reality is in my face. And you don't do that amount of cell time without becoming comfortable with you. You're going to spend a lot of time between your ears you're going to examine your heart you are forced to. I do not recommend it however in my case it was very therapeutic."},{"speaker":"William","time":"00:30:45-6","content":"I was able to safely at my own pace deal with my history my past. Look at it make I didn't learn the concepts the vocabulary for the concepts until bible college but I can't control what you do I can control my reaction to it. I had 12 I was not responsible for what happened to me. What time 12 year old kid is not in control of their lives in any way shape form or fashion?"},{"speaker":"William","time":"00:30:45-6","content":"At 16, 18 now I'm wrapped up in the hurt and anger bitterness of it I still have no control over it. Eventually learn I have to take responsibility for that kid. Not for what happened to him but that's still me now I have to be responsible for what I do. And that can't control that. It can't. I did not have that vocabulary at the time. I worked through this Well it. I didn't the cells there's no programming there's nobody to talk to. I had my wife I have my support my outside support regular visits."},{"speaker":"Marcus","time":"00:33:13-2","content":"Were you married before you came to Angola?"},{"speaker":"William","time":"00:33:15-1","content":"I was living with her before I came to Angola. We've been together for about 6 months before I got in trouble. She was this is part of what led up to the event that led me here she had children she's older than I am I was 19 she was 43 she had 8 children. Four of them were older than me 4 of them are younger than me. I fall right in the middle I went to school with the ones closest to me and age. The two under me I went to school with. My first live in lady was they were best friends there was history."},{"speaker":"William","time":"00:33:15-1","content":"Right but she also had to 10 and 12 year old girl living with her and she gave me a sense of comfort a sense of loving for the first time ever. Like I said the first girl that was living with me was not I was not sexual. It was I'm trying to help someone in similar circumstances. There was a lot of compassion a lot of empathy and my heart was so soft it's like come here I'll help you. And I couldn't. But my wife we met and we started living together. And there was love which I did not know how to handle. I did not know how to accept."},{"speaker":"William","time":"00:33:15-1","content":"Or respond to very well. But she's got a heart of gold. She doesn't have a training but she has a heart. She held me. She loved me. But it was transforming. I started I would rather spend time with her and the girls movie night or helping them with their homework or fixing sandwiches I would rather do that than go get loaded. I became more important. And I knew those two worlds cannot coexist. I knew that. That I'm breaking cycles I'm breaking chains I'm not trying to pass my dysfunction on."},{"speaker":"William","time":"00:33:15-1","content":"So that was a good thing. Right? Again I was not equipped. I'm still not reaching out for help. But 19 is plenty of programs out there I can go get involved with. I didn't know that. And I'm still thinking I'm the only person on the planet going through this. I know it up here I don't know what in here right. So I'd rather spend more time with them doing family things then ripping and running in the streets getting loaded whatever. But not having the skill set to do that I have the willpower to put it down. I had the willpower I stopped using drugs."},{"speaker":"William","time":"00:33:15-1","content":"I stop the ripping and running and I would rather spend there and going through that sobriety was- like I said it didn't last long- that was so- I had no skills to deal with life my answer to every problem in life was to go get loaded. And now I'm trying to be not just an adult but a responsible adult with children in the room. Yeah that was a disaster. I tried. But it was a disaster. It did not work. I mean I did not harm them they didn't see any of that but didn't hear that was a complete disaster."},{"speaker":"William","time":"00:33:15-1","content":"So when I got that phone call from one of my street friends yeah I knew we weren't going to pick flowers like I said. And so in that Dysfunction there and on top of now as I already explained all the other hate and bitterness and anger now is the detox going through it I'm not thinking straight. It was not a straight thought going through my head I couldn't think in a straight line for anything in that point in time. Only been two or three weeks I had put the drugs down and that's part of what led to the event."},{"speaker":"William","time":"00:33:15-1","content":"So then in the parish I start using again. There was absolutely nothing if nothing else a lot of people use out of boredom in the parish there's nothing there no programs there's nothing to fill your time. Positive or negative there's just nothing you create your own so that's usually negative. What was the question again?"},{"speaker":"Marcus","time":"00:37:32-1","content":"Well actually I want to talk a little bit about that process of change. 18 years"},{"speaker":"William","time":"00:37:38-7","content":"Process of change that was the motivation that was the motivation: my wife. So when I get here her. They had a very very effective but simple carrot and stick. In CCR you are allowed to have contact visits if you didn't get in trouble. If you got in trouble you lose your contact visits and you had to go 6 months or whatever it was and get another one. Very very simple. It's very simple."},{"speaker":"Marcus","time":"00:38:08-4","content":"CCR?"},{"speaker":"William","time":"00:38:09-8","content":"It's just an extended locked on. Another cell. Isolation. And having a contact visit sitting in a room with your family and the kids are 13, 14 it's a wonderful thing. Visits being able to spend time with your family keeping that hope alive keeping a little separation between what life is here and the reality. That's important that work your social networks so very important."},{"speaker":"William","time":"00:38:09-8","content":"To intentionally caught yourself off from it with negative behavior and then see how you're hurting them and it's like well hold up we got to think this through. Is this little negative behavior here worth this? Very simple carrot and stick. But in my case very effective. The change had already begun I'm 20, 21 now and things are starting to make a little bit more sense and spending all that time in the cells now I can start thinking Instead of reacting I'm in that safe place now where I can deal with things if I do with this much of it gray I dealt with something."},{"speaker":"William","time":"00:38:09-8","content":"One more light bulb goes off picture at a little brighter okay? It was a very slow and long process but that process did begin in the cells. Looking Back Now I 50 I would say it was mostly just maturing. I grew up. I finally grew up. And having that geographical and chronological difference from the original horrible hurts that's part of a boundary and that wall is really hard to overcome because it's so far but that wall is also safe. So that primary motivation for the drug abuse isn't there."},{"speaker":"William","time":"00:38:09-8","content":"Okay so now what do we do. We don't need to get loaded. We can function. What's that look like? Now that's a learning process. And without again in a cell with no life skills no programs but the process is definitely begun. It was begun. Now it's grown so much since then but the process started there it started to grow and mature. And I'm still married the woman still comes to see me she's in her seventies now. I talked to her last night on the phone."},{"speaker":"William","time":"00:38:09-8","content":"Marcus: Wow."},{"speaker":"William","time":"00:40:40-2","content":"Great woman. Not highly skilled in this conversation but Heart of Gold. She gave me that safety that safe place."},{"speaker":"Marcus","time":"00:40:52-0","content":"Sure. Can you tell us a little bit about what your daily routine looks like now maybe some of the organizations you're involved with?"},{"speaker":"William","time":"00:41:06-0","content":"Today wow I just spent a lot of time there that's a whole transition cuz it's so different. Now I'm teaching life skills which requires a certain amount of Mastery of them. I'm primary jobs a tutor at the Bible College which I interact with the outside professors what do you want to teach them how do you want to grade them what's their accountability? What percentage goes to this what percentage goes to that what we focus so forth. Which is very very rewarding just in and of itself in an academic setting going through the Bible College taught me so much."},{"speaker":"William","time":"00:41:06-0","content":"It put vocabulary to those concepts that I just explained. So now I'm helping someone else get that vocabulary the life skills. That's my primary job that's what I get paid for. I'm also an Inmate Minister So I teach various faith-based classes. We take a lot of counseling classes that's most of our encounters require some degree of counseling. Everybody is in a crisis or crises depending it's a maximum security penitentiary there's a high level of dysfunction is a high-level crisis at all times."},{"speaker":"William","time":"00:41:06-0","content":"So I teach various different classes LifeWay and Providence Learning Center their faith-based classes here Celebrate Recovery that's a church based a program that's based on the 12 steps."},{"speaker":"William","time":"00:41:06-0","content":"I teach that through my local church grace Baptist. Which we don't have a very structured hierarchy we have one we have our bylaws and what not we actually have an ordained Pastor which is a wonderful thing. But we don't have a structure as far as you're a deacon you're a treasurer do you operate as a deacon operationally without a title we don't need that those who are called and equipped to do."},{"speaker":"William","time":"00:41:06-0","content":"Right and then my gifting has been teaching even in all my dysfunction if I understood something I had the ability to get you to understand that. That was just a gift thing one of those God things without a doubt I spend a lot of time teaching now."},{"speaker":"William","time":"00:41:06-0","content":"Now my club stuff I'm in sober Group AA Alcoholics Anonymous sober group there's two AA's up here. I'm in sober group I started teaching for them around about 08. The reentry program When I started I was one of their very first guys teaching them a. The concepts it really wasn't introductory class these are the steps this is what you do this is how they work. As opposed to let's me and you work the steps that's where I started. I took that to a much higher level but I am actually rewrote their manual for that class which I'm kind of proud."},{"speaker":"William","time":"00:41:06-0","content":"So I teach a lot. That's mostly what I do. When I wake up in the morning I'm thinking about where do I have to be where do I have to go what classes do I have? When I'm walking up and down the walk asking me to do we have this class we have that class do I have my certificate yet? I got you don't panic there's a lot of that."},{"speaker":"William","time":"00:41:06-0","content":"That's really my day in a nutshell and on top of that trying to have my tent making job I try to get ready for a rodeo I paint which is something I did in the cells."},{"speaker":"William","time":"00:41:06-0","content":"That was some really good therapy I learned how to paint in the cells and apparently I learned fairly decently because now I have privilege here working for the wardens of the painter. Painter builder that's one of those natural skills. But that's simply tent making I do not take that serious at all my life skills teaching very very serious."},{"speaker":"Marcus","time":"00:45:28-5","content":"Yeah I can tell. What are you most proud of?"},{"speaker":"William","time":"00:45:33-7","content":"There are two things my life I'm very proud of. My wife I've been married 28 years. And my bachelor's. I got my bachelor's. That's 2 things well there's a lot of things I've done that can never be taken away. Those life milestones in my life they will always be there."},{"speaker":"William","time":"00:45:33-7","content":"Those are measurable here I got a certificate right? But what lets me sleep well at night after a good hard day's work and the next day and do it again? Those lives I get to impact. Right there's a lot of who I was running around here. There's a lot of that."},{"speaker":"William","time":"00:45:33-7","content":"And if I can impact intersect that life at that point and give them what I needed okay take a little bit of hurt out of the world. If I can get you function a little bit higher in a little bit higher."},{"speaker":"William","time":"00:45:33-7","content":"But that's not measurable and you don't get a certificate for that. The measurable things okay I've done that. That's why I'm sitting here you've seen the measurable things. But those on measurable things I think are a little bit more important. They have more internal certificates and a piece of paper."},{"speaker":"Marcus","time":"00:46:56-5","content":"Yeah. Yeah they do. What's the worst thing you still have to deal with?"},{"speaker":"William","time":"00:47:06-4","content":"Me. I'm still dealing with a hurt 12 year old. The worst thing to deal with though. First and foremost supervisors are with you internally if you're not a piece if you're not at if you're still alone to 12 year old what can you do you're going to act like it right? And that can manifest and developmental problems or life scale problems or what have you."},{"speaker":"William","time":"00:47:06-4","content":"But if you can deal with that if you can grow up and mature you can realize that your external circumstances do not dictate your internal circumstances right? So would would change. That's a basic basic life skill. Measureable things? Tangible things that are hard to deal with I mean its prison and I bought my ticket to be here. I'm not here they don't have me bad I'm not interested in my charge. So the difficulties here security or I don't have problems with authority but all Securities not created equal either."},{"speaker":"William","time":"00:47:06-4","content":"You have your good and your bad and dealing with the good in the bad is part of the prison experience. But I don't take any of it personal. So in the parish yeah I was still dysfunctional when I got here in the early years I was still learning how not to be dysfunctional there were a lot of clashes. But I never took it personal. They're just people are earning a paycheck."},{"speaker":"William","time":"00:47:06-4","content":"Some of them care some of them don't. Some of them are mean some of them are nice it's still not personal you don't know me well enough to be personal yet right? I learn that early. But the hard things I'm still dealing with me that's the hardest thing. Still dealing with me it's internal."},{"speaker":"Marcus","time":"00:49:11-4","content":"So one of the things that we are trying to Understand a little bit more and have maybe others understand a little bit more is the reality of a punishment that is essentially I want to die in prison. You have so clearly changed your life around. You're now ministering to people teaching other people. Does it make sense to you to keep you here till you die?"},{"speaker":"William","time":"00:49:55-8","content":"That's a big question. I think that deserves a big answer. When I was in the parish I seen guys come in for the weekend and you'll never see those guys in trouble ever ever ever again whatever that charge was they sold bicycle it didn't matter. That initial shock that initial crisis that initial. Best words for it shock and crisis that change has such an impact you'll never see them again. Whatever dysfunction they had they got over it. I will never do that again and they never do. One little brush all they need."},{"speaker":"William","time":"00:49:55-8","content":"Okay so it's not the length of the punishment it is the impact the punishment has. If you could have woke me up at 16 if you could have got in there I got in trouble here and there but none of it had that impact. Right? The punishment never had the impact that my realization of my crime hat. In that first week or so what did I do? Why did I do it? Right it's internal. That impact is was the transformation that's very very key to the transformation."},{"speaker":"William","time":"00:49:55-8","content":"Okay now in that having a life sentence the life sentence without parole where I'm sent here to die of old age been here twenty eight years I've seen plenty of them die of old age. There's a reality to the sentence. Warden Cain would say often and regular that 95% of you going to die here of old age. Let's change that. He was trying to make some of the things happen that you're following up on. But saying that to a population he had a vision."},{"speaker":"William","time":"00:49:55-8","content":"All right personally I was here before he was so I still had to come to grips with that. Does that sentence make sense do I stay here after having tube out these skills okay do you keep punishing that 90 year old kids who did this? That 19 year old kid doesn't exist anymore clearly. Measurable or immeasurable whatever degree whatever measurement you use I am not that 19 year old anymore ok. Do you keep me here? It's so hard to answer because I want to say it this."},{"speaker":"Marcus","time":"00:52:48-8","content":"Take all the time you need."},{"speaker":"William","time":"00:53:06-6","content":"I don't normally talk this much about myself or being this transparent. Do I deserve to still be here after not being the same kid I was? Okay at what point have I paid whatever society debts which is determined by legislators and what not. I can never apologize to the victim. A tearful I'm sorry hopefully it'll make em feel better. I hope I don't know I don't know where they're at with any of that. I don't know if they had me or not I don't know I will never know."},{"speaker":"William","time":"00:53:06-6","content":"The only thing I'll ever get from them is some stage thing from a DA at a pro here and I'll never get and interaction with them. Hopefully they can look at the person and see that I don't even want to use the words to something good came of it but they lost a father and grandfather brother whatever the relation was. They lost somebody in their lives right? So do I deserve to still be here? Who makes that decision? And how? Now if you want to go on measurable things can I be a benefit out there as I am in here?"},{"speaker":"William","time":"00:53:06-6","content":"Tax burden to the taxpayer. What do I do want to do when I get out? I want to keep doing what I'm doing me want to intersect someone's life in a meaningful way to teach someone life skills and enroll in a master's program to become better equipped to do what I'm doing. Right that's very very important to me personally. Do I deserve to go home? That's a very difficult concept to deal with. Taking full and total responsibility for what that 19 year old kid cuz that was me I did that and there's no fixing that okay taking full responsibility for what happened that night does that kid deserve to go home?"},{"speaker":"William","time":"00:53:06-6","content":"Absolutely not no that kid was dysfunctional that kid was so full of hate bitterness and anger and negativity no someone got to go sit down with him talk to him he's got to learn he's got to grow up he's got to mature. Would I like to go? Absolutely 28 years later leaving is just as scary as coming here was the worlds moved on. There's all that to deal with which is separate."},{"speaker":"William","time":"00:53:06-6","content":"But the victim's family the people that cared about him the people that I impacted so negatively I can't across the board I can't say the victim should be the ones to judge what level are they functioning at? What education what hurt and bitterness they have- elsewhere just besides this. But who gets to judge that? And by what criteria? You get a checklist of you did this and you did that everything's not measurable. I don't have a good answer I'm sorry. By any measurable definition of whatever philosophical platform you launch from I meet the criteria. I'm rehabilitated."},{"speaker":"Marcus","time":"00:56:49-9","content":"Yeah."},{"speaker":"William","time":"00:56:50-1","content":"I'm not that 19 year old kid. I'm 48 almost 50. I'm not a kid anymore. I function at a higher level. Now I'm trying to reach others."},{"speaker":"Marcus","time":"00:57:04-3","content":"Well let's look at that for a second so let's say there is an expansion of parallel eligibility for lifers. I'm sure you've thought about it about what that might be for you. When you think of all the things that you're doing in here how do you envision that life where you could be granted parole?"},{"speaker":"William","time":"00:57:32-2","content":"Like you say it's you have to think about it. Part of the conversation here is someone doing a life sentence why do they get out of the bed in the morning? You have a variety of options giving up is one of them. Continuing in your dysfunction or why don't they just make them shoot them off the fence I'm going to die here. That whole mentality is in there so where does your help like? What's the motivation for me not to be that 19 year old kid anymore?"},{"speaker":"William","time":"00:57:32-2","content":"Aside from just growing up and maturing okay if you want to call me special in that regard okay but the average person what is their hope when they're doing a life without parole? Why bother to get out of bed? I bother to get rehabilitated? When I first got here programs like GED and whatnot were not available to lifers. You're not going home why waste a resource we only have so much resource the guy with an out date lets give him a GED you don't qualify."},{"speaker":"William","time":"00:57:32-2","content":"So that whole mentality now think about that impact there for a second. You don't qualify for the programs with the guys going home. You're not going home. So then why should I go teach GED? So internal external I can't control what's going on here but I can control how I react to it. Okay that's ones Gill there. So your motivation and why would I do when I went out?"},{"speaker":"William","time":"00:57:32-2","content":"Well that hope to go it's a balance. And sometimes it's precarious on a razor's edge of I'm going to die here so what's my point or they're going to do something for lifers. I got here in 90 and those cells back there and camp H which is closed and decrepit now it's a ghost town it's actually shot full of holes that use it for their combat training stuff there's a testimony for you and when I got here they were talking then about budget crisis."},{"speaker":"William","time":"00:57:32-2","content":"And they got to do something for us. Now the money will be found. So that hope that false hope is constantly talked about amongst us it doesn't go very far. It definitely doesn't go very far for life change. For life change where does that motivation come from? That motivation it has to come from internal that impact full of the realization of what you've done or where you've been or who you were. Not wanting to be that person anymore not wanting to hurt anybody else anymore. And that was my only crime of violence I was not an aggressive guy."},{"speaker":"William","time":"00:57:32-2","content":"But in my drug abuse and in my own hurt I know there are people I hurt. I didn't beat him up but they still walked away wounded. I don't want to be that guy anymore okay. So what's life look like should I get parole? Like I said I've enrolled in a master's program to become better at what I'm already doing. Ideally pipe dreamed I would a smooth transition I would want some reentry stuff I want a halfway house I would want to ease into this big shock."},{"speaker":"William","time":"00:57:32-2","content":"So I'd be sitting on the other side of the classroom for a good little while. I need skills. How do I deal with these things? I have life skills I have a plan what do you do when your plan falls apart and you're blind sided that's when you rely on your life skills and past accomplishments. Okay so that's where I would be in a very unsure place for a little while."},{"speaker":"William","time":"00:57:32-2","content":"And then go right back once I got my feet under me. Start impacting lives again. Ideally at a parish level. In the Bible College we go on missionary I've tried to go to the parish a couple times there's very few parishes that are open or that are taking people that door is just cracking open and I haven't gotten in yet. But the programs I run I can go and teach anywhere. I got you all your life skills classes all your GED classes I can go there and have an impact."},{"speaker":"William","time":"00:57:32-2","content":"I've had an impact here. I can go anywhere and have that impact. As a prisoner I can still I'm still trying to do that I'm trying to get equipped to do that that's not going to change if you put me on the other side of the fence that might change. I'm sure I'll encounter some problems coming here to teach all right maybe not so much at the parish you understand there are some programs where they want former inmates to have some access there. That's really a pipe dream? I would go from doing what I do here to doing it out there ideally. Fantasy meets reality?"},{"speaker":"William","time":"00:57:32-2","content":"I'll be flipping hamburgers or digging ditches until I get my feet under me. Till I get none I have a support system waiting the alumni NOBTS. Robinson definitely put me in touch with people he's in Baton Rouge I will plug right into the local church I say plug right in like it's a easy easy thing but some of those people come here and we have a relationship. It will be a transition it will be rough and it may take a five-year plan to get to where I'm thinking and that may change but ideally I would keep doing what I do now."},{"speaker":"Marcus","time":"01:03:19-4","content":"Sure I understand that. I'm so grateful to you for sharing all of this with us. Is there something I should have asked you that I haven't asked you something that you would want to talk about something that you want people to know that you haven't had a chance to talk about?"},{"speaker":"William","time":"01:03:43-6","content":"I've mentioned a couple times I'm Not allowed to contact the victim Okay now I understand you got to safeguard the victim's you don't want just anybody riding that many old crazy thing but I think it's very important in my head it should be as simple as I write whatever it is I write my apology my sorry my story I give it to security security reads it makes a copy of it make sure it's okay maybe goes to whatever legal processes they have to go through but there should be a point of contact. Where I can tell them something."},{"speaker":"William","time":"01:03:43-6","content":"My crime was horrible I killed somebody that is top of the pile of horrible all crimes are not and we still can't and I say we inmates we can't reach out to them. And I understand you got a safeguard we're not all at this level yet. But that's something that needs to be explored. Restoration reconciliation if I still give back 4 fold whatever at least look somebody in the eyes and say something. Besides an impersonal system."},{"speaker":"Marcus","time":"01:04:57-0","content":"Or perhaps even offer the person the opportunity right? For restorative."},{"speaker":"William","time":"01:05:01-9","content":"At least the opportunity absolutely."},{"speaker":"Marcus","time":"01:05:06-1","content":"They're free to turn it down."},{"speaker":"William","time":"01:05:07-6","content":"Absolutely yeah and there are systems in place where they can Sign up to be notified of every little thing that happens. And I'm sure on there there's a thing leave me alone or they can check I don't want to be bothered. Okay so either way they can have their safeguards they can be safeguarded. But for them as well as for us I hurt other people as well I'm able to go make amends there I'm able to reach out to them because that wasn't an actual crime. It was still hurt. It was still negativity I'm able to go fix some of that."},{"speaker":"William","time":"01:05:07-6","content":"These people have been hurt but they're denied the same opportunity. Just because now it's become legislative. Because now it made it in the paper instead of I just hurt your feelings. Those hurt feelings that 12 year old kid I was to never make the papers. But those hurt feelings keep going. And without an opportunity there. I think that's a very very important. The only time I broke down that's where I was talking."},{"speaker":"Marcus","time":"01:06:17-9","content":"That's fair. That's a good place to stop"}]}