{"name":"","transcript":[{"content":"Winfred Davenport REDACTIONS FINAL"},{"speaker":"Resp","time":"00:00:01-1","content":"Winfred Davenport. 390368. I was 20 years old at the age of the crime and I've been doing 23 years."},{"speaker":"Intvr","time":"00:00:10-5","content":"And what was the conviction?"},{"speaker":"Resp","time":"00:00:12-9","content":"Second degree murder."},{"speaker":"Intvr","time":"00:00:15-3","content":"So I want to learn about your life before that, if we go back to your child. Can you tell me about the folks who raised you?"},{"speaker":"Resp","time":"00:00:24-0","content":"Well, up the age of, I could say that I remember, 5 years old. My father and my mother raised me. But they separated. So basically my father raised me up until this crime. And my next door neighbor helped him also so when he was working to provide for me and my little brother."},{"speaker":"Intvr","time":"00:00:50-6","content":"Okay. And so your father raised you and your little brother after the separation."},{"speaker":"Resp","time":"00:00:55-0","content":"Yes sir."},{"speaker":"Intvr","time":"00:00:56-1","content":"And what was your relationship like with your mother after that?"},{"speaker":"Resp","time":"00:01:01-9","content":"Real distant. Yeah, it was real distant. Every now and then maybe for a couple years after they separated. Me and my brother used to go spend the night over there for like a day or two during the weekend."},{"speaker":"Intvr","time":"00:01:18-7","content":"Right. As, the way we do things is usually the other way around after a separation. Where kids tend to stay with their mothers and visit your fathers. How did you make sense of that time?"},{"speaker":"Resp","time":"00:01:32-1","content":"Well, to be honest. I really didn't understand. I just remember hearing arguments transpiring between him and her. One day she told me and my brother she was going to the store and never came back."},{"speaker":"Intvr","time":"00:01:53-0","content":"What's your relationship with your mother like now?"},{"speaker":"Resp","time":"00:01:56-0","content":"Distant. I mean she never been here to come see me before the whole 23 years that I've been incarcerated. But, throughout the years I reached out to her to allow her to be a mother figure in my life. Every now and then she'll respond back to me."},{"speaker":"Intvr","time":"00:02:19-4","content":"Do you know if she has a relationship with your little brother?"},{"speaker":"Resp","time":"00:02:23-4","content":"It's distant also. Yeah it's distanced."},{"speaker":"Intvr","time":"00:02:25-4","content":"Okay. Where did you grow up?"},{"speaker":"Resp","time":"00:02:28-7","content":"Alexandra, Pineville, Louisiana."},{"speaker":"Intvr","time":"00:02:34-9","content":"Tell me about your brother?"},{"speaker":"Resp","time":"00:02:38-7","content":"Growing up we was like twins because we're one year apart. So we basically did everything together."},{"speaker":"Intvr","time":"00:02:44-7","content":"Okay, and what's his name?"},{"speaker":"Resp","time":"00:02:46-8","content":"Demarcus Davenport."},{"speaker":"Intvr","time":"00:02:49-7","content":"Demarcus. And what is he doing now?"},{"speaker":"Resp","time":"00:02:56-0","content":"I'm hearing that he's a manager at a shoe store somewhere at a mall facility."},{"speaker":"Intvr","time":"00:03:02-8","content":"Okay, in Alexandria?"},{"speaker":"Resp","time":"00:03:04-3","content":"In Alexandria."},{"speaker":"Intvr","time":"00:03:05-6","content":"What's your relationship like with him now?"},{"speaker":"Resp","time":"00:03:08-7","content":"I had to laugh at that one because it's distanced. He hasn't been to see me in the 20 years that I've been down here, of the 23. And we don't communicate. I reach out to him every now and then since they started the Jpay system where we have the emailing service. For my birthday he'll probably greet me happy birthday and that's about it."},{"speaker":"Intvr","time":"00:03:38-7","content":"That seems strange to me, if you guys were like twins."},{"speaker":"Resp","time":"00:03:42-1","content":"Yeah we was like twins. I don't understand, I try to ask questions whenever I can and reach out to him, but."},{"speaker":"Intvr","time":"00:03:49-9","content":"Okay. What about your dad, do you have a relationship with your dad still?"},{"speaker":"Resp","time":"00:03:55-8","content":"Yeah, me and him. We been rocking 100 since all of this. Anything he can do for me, he does. Which I don't never try to put no burden on him. But through my early years he was always there for me. When I needed something he took care of it."},{"speaker":"Intvr","time":"00:04:13-7","content":"So even though you're in a slightly unusual living arrangement. Is it safe to say that you grew up knowing that there were adults who loved you and cared for you? Or did you feel like you had to make it on your own?"},{"speaker":"Resp","time":"00:04:26-4","content":"I felt like I had to make it on my own."},{"speaker":"Intvr","time":"00:04:31-7","content":"Okay, sure. What about school, how was school for you?"},{"speaker":"Resp","time":"00:04:38-5","content":"It was good because I played sports. But it was also a distraction. When I think about it, because I didn't really focus on the educational part of it. I didn't know, didn't understand or realize how powerful knowledge really is. So I basically did enough to get by, but I ended up getting kicked out."},{"speaker":"Intvr","time":"00:05:10-6","content":"Over what?"},{"speaker":"Resp","time":"00:05:12-0","content":"Fighting."},{"speaker":"Intvr","time":"00:05:14-8","content":"How old were you then?"},{"speaker":"Resp","time":"00:05:16-6","content":"I think about 18."},{"speaker":"Intvr","time":"00:05:20-4","content":"Oh, okay. So what was the highest year of school you completed?"},{"speaker":"Resp","time":"00:05:24-4","content":"Junior."},{"speaker":"Intvr","time":"00:05:25-7","content":"Okay. And then you got kicked out right before graduating it seems, right?"},{"speaker":"Resp","time":"00:05:29-6","content":"Well-"},{"speaker":"Intvr","time":"00:05:31-2","content":"Were you in the middle of your senior year?"},{"speaker":"Resp","time":"00:05:32-7","content":"Well I was in the GED program at that time."},{"speaker":"Intvr","time":"00:05:37-9","content":"Okay."},{"speaker":"Resp","time":"00:05:38-8","content":"I went back to school anyway and got a GED and I end up getting into a fight and getting kicked out and I just never went back."},{"speaker":"Intvr","time":"00:05:44-2","content":"Okay, were you in trouble with the law as a teenager?"},{"speaker":"Resp","time":"00:05:48-8","content":"Yes sir."},{"speaker":"Intvr","time":"00:05:51-6","content":"Tell me a little bit about that."},{"speaker":"Resp","time":"00:05:57-8","content":"Being affiliated with different guys involved in gang activity and drug activity. Seeing it around, and really just keeping my loyalty with guys with guys, if they got in trouble, I got in trouble or if I got in trouble, they got in trouble. Not saying just going out looking for it. But when it came to us, we just took care of it."},{"speaker":"Intvr","time":"00:06:25-1","content":"But would you say you hung out with these friends but you weren't in a gang?"},{"speaker":"Resp","time":"00:06:32-7","content":"I was affiliated with it."},{"speaker":"Intvr","time":"00:06:34-4","content":"Okay, alright. And do you remember the first time you ever got arrested?"},{"speaker":"Resp","time":"00:06:44-8","content":"I think maybe I was like 16."},{"speaker":"Intvr","time":"00:06:47-1","content":"And what was that for?"},{"speaker":"Resp","time":"00:06:49-4","content":"Selling drugs."},{"speaker":"Intvr","time":"00:06:51-4","content":"Okay, alright. So your dads house, if I'm standing at his front door looking out into the neighborhood in Alexandria, in Pineville. Can you paint a picture for me because I've never been there?"},{"speaker":"Resp","time":"00:07:08-6","content":"Oh how can I paint a picture for you dealing with that? It was basically like your typical neighborhood where you see the poverty aspect of things. With men and women struggling on drugs, alcohol, guys that's not completed school. That's basically it."},{"speaker":"Intvr","time":"00:07:41-5","content":"Was there a lot of fighting and violence in the neighborhood?"},{"speaker":"Resp","time":"00:07:44-7","content":"You had some violence, you had some fighting."},{"speaker":"Intvr","time":"00:07:53-0","content":"Was it a housing development or was it just a neighborhood."},{"speaker":"Resp","time":"00:07:58-1","content":"Well in some areas it was housing development, in some areas is it was neighborhood."},{"speaker":"Intvr","time":"00:08:07-9","content":"Do you have a memory of a particular teacher who might've taken an interest in you, all these years later?"},{"speaker":"Resp","time":"00:08:20-1","content":"I can remember my coaches. My basketball coaches, that was trying to keep me going down the right path and really trying to push me because I had pretty good game on the basketball court. I felt like I could've at least made it to college for sure. Because some of the guys I grew up with playing with, they ended up going to college."},{"speaker":"Resp","time":"00:08:20-1","content":"So, but other than that, I don't feel like a lot of the teachers really just put a lot of pressure on me to really just teach me why it's so serious to learn and educate yourself. So basically the things I learned was from like hands on experiences. Going through different decisions I made, doesn't matter if it was good or bad I just had to learn from that."},{"speaker":"Intvr","time":"00:09:15-4","content":"Did you have a job at all before this happened?"},{"speaker":"Resp","time":"00:09:19-8","content":"Well, I tried. I tried working at Wendy's and I tried working at the Boys and Girls club because I used to participate up in there and play sports with them. I think I was a good influence when I was working."},{"speaker":"Intvr","time":"00:09:19-8","content":"Were you working at the time of this arrest?"},{"speaker":"Resp","time":"00:09:42-7","content":"Nah I wasn't working."},{"speaker":"Intvr","time":"00:09:47-6","content":"I didn't ask you about grandparents, were grandparents at all in your life?"},{"speaker":"Resp","time":"00:09:53-4","content":"None of my grandfathers. Both of them had died before I was born. But my dad's mother, she always been there because she helped raise me till I grew up."},{"speaker":"Intvr","time":"00:10:09-5","content":"Okay."},{"speaker":"Resp","time":"00:10:10-5","content":"And as far as my mother's mother. She always stayed in the San Diego California. But I had the opportunity to meet her whenever she came back to visit once a year."},{"speaker":"Intvr","time":"00:10:23-0","content":"Okay, alright. So between the two it would be your paternal grandmother that you were closest to?"},{"speaker":"Resp","time":"00:10:28-1","content":"Yeah."},{"speaker":"Intvr","time":"00:10:30-9","content":"Okay. So what about intimate relationships?"},{"speaker":"Resp","time":"00:10:39-2","content":"I basically allowed myself to stay distanced because of trust factors. So I wasn't really just into intimate relationships. Even though I was in relations though."},{"speaker":"Intvr","time":"00:10:55-9","content":"Alright, sure. So what do you think, what was behind that? That lack of trust."},{"speaker":"Resp","time":"00:11:02-8","content":"Well, for a while I felt like if my mother walked out of my life, I felt like anybody would walk out of my life. And I really didn't want to put myself in that position for that to happen so I basically stayed to myself. Or me and my brother."},{"speaker":"Intvr","time":"00:11:23-2","content":"Do you have any children?"},{"speaker":"Resp","time":"00:11:24-4","content":"No sir."},{"speaker":"Intvr","time":"00:11:31-0","content":"Did you ever have a firearm?"},{"speaker":"Resp","time":"00:11:33-1","content":"Yes."},{"speaker":"Intvr","time":"00:11:35-3","content":"Okay. Let me ask you this: life's complicated, it's very rare is there one reason for anything. But what do you think is the single most important cause behind the situation that got you to this charge was?"},{"speaker":"Resp","time":"00:11:52-9","content":"Lack of knowledge. And really, what else could I add to that. I'd say lack of knowledge."},{"speaker":"Intvr","time":"00:12:15-1","content":"Okay. I mean, do you- when you look back on it now, you've got the wisdom of a couple of decades to kind of put it in perspective. Would you say that this was kind of a weird one off thing, or you were going down a wrong path?"},{"speaker":"Resp","time":"00:12:26-3","content":"I'd say I was going down a wrong path."},{"speaker":"Intvr","time":"00:12:29-2","content":"So let me ask you this, let's say this particular charge didn't happen. I don't know, you were out of town or something and it didn't happen. How do you anticipate that the next few months and years would've gone? Where was your life going?"},{"speaker":"Resp","time":"00:12:47-9","content":"I look at it- either being incarcerated with a life sentence or dead. Just being honest. Because of the things that was going on at the time; and in the areas, I was in the poverty area, to the gang violence. It was bad to the point where, guys that grew up together really changed against each other because of different neighborhoods. Wear different colors and stuff like that so. That's how the environment was, so most guys had the attitude where they was going to protect themselves by all causes and if anything came their way they were going to take care of it."},{"speaker":"Intvr","time":"00:13:44-1","content":"Did you know quite a few people who ended up in prison?"},{"speaker":"Resp","time":"00:13:47-3","content":"I know a lot. Only a few made it out that actually got a scholarship, went to college, playing sports. One guy that I remember, they was trying to get me to play football with him in high school because the principal always say \"man, you would be a good football player\". Though I chose to play basketball."},{"speaker":"Resp","time":"00:13:47-3","content":"And I remember one of the guys I used to work out with, he ended up getting drafted to LSU and he ended up getting drafted to Miami Dolphins, and then from there he went to Minnesota. So that was kind of inspirational for me and I seen a couple other guys had the chance to see him on television playing, and that was kind of like motivation for me. I still think back on that, and I hate that I made a lot of decisions that I made because I had great passion-"},{"speaker":"Intvr","time":"00:14:45-7","content":"And skill."},{"speaker":"Resp","time":"00:14:46-6","content":"And still do."},{"speaker":"Intvr","time":"00:14:48-5","content":"I mean, and skill, you obviously had skill."},{"speaker":"Resp","time":"00:14:50-6","content":"Right, right."},{"speaker":"Intvr","time":"00:14:54-6","content":"Were drugs and alcohol part of your own lifestyle?"},{"speaker":"Resp","time":"00:14:58-6","content":"Well, I smoked weed and I, I used to drink a little bit."},{"speaker":"Intvr","time":"00:15:03-9","content":"But nothing that was as."},{"speaker":"Resp","time":"00:15:06-2","content":"For addiction? Nah, none of that."},{"speaker":"Intvr","time":"00:15:13-0","content":"So I want to shift gears to coming here."},{"speaker":"Resp","time":"00:15:16-2","content":"Okay."},{"speaker":"Intvr","time":"00:15:17-9","content":"And, before I do, is there something about your first 20 years of your life that's really shaped the person that you are; that's critical to understanding what happened that we didn't get a chance to talk about?"},{"speaker":"Resp","time":"00:15:33-5","content":"Well, I think that, that everything that I went through up until the age of 20 when I was out there in society, plays a factor to, I'm going say the man that I'm becoming right now."},{"speaker":"Intvr","time":"00:15:51-3","content":"So explain that."},{"speaker":"Resp","time":"00:15:53-3","content":"Well, really just-"},{"speaker":"Intvr","time":"00:15:56-3","content":"I mean in a sense, everybody can say that. That my first 20 years of my life has shaped who I am today. But in your case, how is that specifically, what experiences?"},{"speaker":"Resp","time":"00:16:08-4","content":"Well, really not experiencing what love really is, and not really just raised feeling like I was loved. I mean, it put me in places to really do soul-searching to try to find myself and find who I am. To the point where I began really seeking God. And through that seeking and searching it's like my heart started to soften up because it got hard over the course of those years."},{"speaker":"Resp","time":"00:16:08-4","content":"And, I- really and truthfully I always had a compassion for people too though. I feel their pains, I feel when they feel good, and things like that. And that really helped me just want to make change. And at the same time be a blessing to everybody that I'm connected to, be a blessing in they life. And really just hopefully show them a better way."},{"speaker":"Intvr","time":"00:17:34-2","content":"Yeah that makes perfect sense. So those negative experiences in those first 20 years have been a catalyst for the positive experiences that you've had. Okay, yeah, that makes sense. So let's switch gears to here. Did you go to trial?"},{"speaker":"Resp","time":"00:17:55-1","content":"Did I go to trial?"},{"speaker":"Intvr","time":"00:17:56-0","content":"Yes."},{"speaker":"Resp","time":"00:17:57-0","content":"No."},{"speaker":"Intvr","time":"00:17:58-1","content":"So you didn't go to trial but you were in the parish? I mean you're in a jail somewhere before coming here."},{"speaker":"Resp","time":"00:18:02-5","content":"Right."},{"speaker":"Intvr","time":"00:18:03-9","content":"So hold old were you when you came through the gates of Angola?"},{"speaker":"Resp","time":"00:18:12-1","content":"21 going on 22."},{"speaker":"Intvr","time":"00:18:14-1","content":"So relatively quickly then. So tell me about the bus ride."},{"speaker":"Resp","time":"00:18:28-9","content":"Just really just thinking about the bus ride and really just thinking what I was going to be up against inside this prison institution. I really just had it on my mind that I was going to be a man no matter what."},{"speaker":"Intvr","time":"00:18:45-8","content":"Was it cold, what time of year was it?"},{"speaker":"Resp","time":"00:18:49-5","content":"February."},{"speaker":"Intvr","time":"00:18:51-1","content":"Oh so it was cold."},{"speaker":"Resp","time":"00:18:51-9","content":"Yeah it was cold."},{"speaker":"Intvr","time":"00:18:55-1","content":"And so they put you in a working cellblock?"},{"speaker":"Resp","time":"00:18:57-7","content":"Yeah in the working cellblock."},{"speaker":"Intvr","time":"00:18:59-3","content":"And out in the field?"},{"speaker":"Resp","time":"00:19:01-1","content":"Yeah."},{"speaker":"Intvr","time":"00:19:01-7","content":"Wow, tell me about that."},{"speaker":"Resp","time":"00:19:03-7","content":"Well I didn't really know what to expect but I just know that a couple guys that was on the tier with me they was really explaining how things work and what you have to do. And I could just remember putting my clothes and boots on and going out there. It was just something that I had never seen before. You have people on horses with guns watching over us as we are- and we did field work."},{"speaker":"Resp","time":"00:19:03-7","content":"I can remember some of the guys, that they used to come and help me out because they know what they say, they use guys that freshly coming in so guys was coming over there, helping me out. Explain to me, about the prison life. And so basically all the lessons within that I just, took it and learned and I was just always the quiet and observative type. So I watch and I learn."},{"speaker":"Intvr","time":"00:20:19-7","content":"Did you find yourself getting into disciplinary problems, fights, in the first few months, years, here?"},{"speaker":"Resp","time":"00:20:25-2","content":"Nah, because it's basically a respect factor. You give respect, you receive respect. Now, during that time when I first come, you probably had people that would try to challenge. And see what person you are or see if their kindness is sweetness. And, this throughout the course of my years. It's just always been silent."},{"speaker":"Intvr","time":"00:20:58-7","content":"Yeah. So, can you describe the 21, 22 year old Winfred who came in and in his first few months, what kind of a person was that?"},{"speaker":"Resp","time":"00:21:18-3","content":"The guy that first come here? Well, if I had to describe him, I'd say that he was lost. He didn't know his way. And I could actually say when I was here, when I first come here too, I still didn't know my way. And when you don't know your way, it causes you to, participate in some of the things that's going on inside the institution that can really cause you to drift and not be focused on what your main objectives are supposed to be being in prison while you're here."},{"speaker":"Resp","time":"00:21:18-3","content":"Cause some guys, they, hustle to try to take care of themselves, try to make ends meet without really knowing where their next money order will come from. Just you can get caught up, it's like a cycle in here. You could get caught up and you can be in this cycle for 30, 40 years. Or even you can come in focused, you either have people around you that can help guide you that's focused and help put you on the right path as soon as you get in..."},{"speaker":"Resp","time":"00:21:18-3","content":"And there's no telling what can happen within the process of that. Cause if you get on your case and start studying your case, you can find loopholes towards your freedom. Then you can make all the necessary choices that can help push you towards at least the front door or the front gate. You can put yourself in the position for that."},{"speaker":"Intvr","time":"00:22:59-9","content":"And did you find yourself going that direction?"},{"speaker":"Resp","time":"00:23:03-6","content":"Not when I first came here, no. I got caught up in the penitentiary lifestyle. Gambling to try to make ends meet. And that's a lot of energy and time, chasing a few cigarettes. At that time they still had cigarettes in here to make currency. -"},{"speaker":"Intvr","time":"00:23:31-0","content":"Did you have any financial support outside?"},{"speaker":"Resp","time":"00:23:33-0","content":"Well, my father, he did what he could, he did what he could. I never put no burden on him or anything like that. Just, whenever he felt like he wanted to do something for me he did and I highly appreciated that."},{"speaker":"Intvr","time":"00:23:48-0","content":"When you look at the young guys coming in today. Do you recognize yourself a little bit, your old self?"},{"speaker":"Resp","time":"00:23:56-6","content":"Yeah I can see some of my old self in a lot of the guys that's coming from out there. With the attitudes, not really caring. But I understand that if you don't know better you really can't do better. So I can see it but I can see that come of those guys also look at some of the guys that been here as an influential figure too."},{"speaker":"Resp","time":"00:23:56-6","content":"Because I been seeing, a lot of guys that's coming to do the reentry program. I'm seeing a lot of them leave out of here a changed person from when they first come in here. Because of the influence of the guys that's bringing a positive impact into they life."},{"speaker":"Intvr","time":"00:24:39-3","content":"Yeah, the irony is that those same mentors, are doing life without parole."},{"speaker":"Resp","time":"00:24:47-4","content":"Exactly, exactly."},{"speaker":"Intvr","time":"00:24:55-6","content":"So how are you a different person today? We all change in 2 decades, more than that. But how specifically have you changed?"},{"speaker":"Resp","time":"00:25:03-0","content":"More caring, more loving, more understanding, a relationship with God. An understanding that, as man think as he saw. I understand that no matter what, I just have to stay positive."},{"speaker":"Resp","time":"00:25:03-0","content":"Through everything in life, because all things work together for our good, and every negative decision that a person makes will put him in a situation. Find yourself, find yourself and change the way you think. Transform your mind, transform your thinking. When we do that, it allows doors to open for positive things to come into our life. If we thinking negative things and we say the same negative things out of our mouth, that's what we're going to receive."},{"speaker":"Intvr","time":"00:25:54-2","content":"Yeah. Do you find yourself mentoring the younger guys, even informally?"},{"speaker":"Resp","time":"00:26:01-4","content":"Yeah because most of them- really how I practice now, entertaining negative conversations. So if a guy come around me, basically it's going to be me giving an encouraging word and just not entertain their negativity. So hopefully through that with guys where I come from. Which I hear guys tell me man you done changed and this, and you would have changed that, but the thing is man I'm still fighting. I'm still fighting to be a better man, and not just still really just learning."},{"speaker":"Intvr","time":"00:26:46-2","content":"So, can you describe your routine, what's your typical day like here, today?"},{"speaker":"Resp","time":"00:26:52-7","content":"Well basically when I...when I take care of my job for the state, I spend-"},{"speaker":"Intvr","time":"00:27:07-6","content":"What's that, what's that job?"},{"speaker":"Resp","time":"00:27:10-1","content":"Catering in the kitchen, the main prison kitchen."},{"speaker":"Intvr","time":"00:27:13-6","content":"Alright."},{"speaker":"Resp","time":"00:27:15-1","content":"Basically after I finished that, I spend time in the hobby shop, because I picked up a trade that's been helping me provide for myself in the hobby shop. Over the last couple years. And through what I do it's kind of been opening doors for me."},{"speaker":"Intvr","time":"00:27:40-4","content":"Marcus can you grab that belt? So that we can put that in there? Let me show an example of his work. So that's what you do in the hobby shop."},{"speaker":"Resp","time":"00:27:59-9","content":"Yeah this is what I do in the hobby shop, right here. It's a trade that I picked up that I didn't know that I had in me. But at the same time if you see the belt, it's a reflection of what is going on within myself."},{"speaker":"Intvr","time":"00:28:18-2","content":"It looks great. And you said that was your best seller"},{"speaker":"Resp","time":"00:28:22-5","content":"Yeah this is my work signs. Anything I put signs on. Just like this one. This is a different style of signs. But this don't have the kids on it."},{"speaker":"Intvr","time":"00:28:30-8","content":"Right, right. Cool. So after the hobby shop when you're done with the belts, then what do you do?"},{"speaker":"Resp","time":"00:28:38-6","content":"I like to get meditation time when I'm in the dorm and I like to read, Read and just relax my mind wisely"},{"speaker":"Intvr","time":"00:28:52-7","content":"Earlier on you were saying something about learning how to love others and care for others as an important thing and part of your life now, and I know that you fell in love with hospice in Angola and that's one thing that I find that you can't fake your way through hospice. It takes a special person to do that. Tell me a little bit on how you got into that and whether or not you're doing that anymore?"},{"speaker":"Resp","time":"00:29:26-7","content":"Well, the club that I'm involved in, which is the main prison concept club. And there's the president of that club is my fall partner, and he have a great compassion to reach out to the guys on the hospital ward that can't do for themselves. So when I come out the cellblocks, he used to, well he used to get me to go to church with him and he also used to get me to go on the hospital wards with him to help feed those guys and give them care packages and stuff like that."},{"speaker":"Resp","time":"00:29:26-7","content":""},{"speaker":"Resp","time":"00:29:26-7","content":"And me seeing that for myself, guys I mean that's paralyzed from the neck down. Just really in situations where it's like they on a time clock between there and death. And then I also witnessed a lot of guys that I grew up with up in here, or either that was here before I made it here. A lot of them has passed away now and it really touched me. I mean, right now I can look at a movie with, anything, but emotions that sum up in there."},{"speaker":"Resp","time":"00:29:26-7","content":"And, I can just, I mean I can feel it, I can feel the pain. I can feel the emotions. And whenever I do go over there, on the hospital ward, I mean a lot of the guys that might know me, I mean it brings joy to they situation in one of the worst moments that they going through. And just to see that smile on their face, or even them just to reach and grab my hand and shake my hand. They just really, highly appreciate us going over there and taking care of them. I mean, that's a lot to me."},{"speaker":"Intvr","time":"00:31:41-8","content":"How many hours a week do you think you spend over there?"},{"speaker":"Resp","time":"00:31:45-3","content":"Well, I only go whenever we go over there to feed those guys or take care of them. Which is maybe like once every couple months or something like that."},{"speaker":"Intvr","time":"00:32:03-6","content":"It's just that like the club, it has more things that it does."},{"speaker":"Resp","time":"00:32:07-9","content":"Yeah, right. You see its like-"},{"speaker":"Intvr","time":"00:32:10-6","content":"They raise money for that and then they- okay."},{"speaker":"Resp","time":"00:32:12-0","content":"Right, right. It's not like I just have the job to have the green light to just go over there every day to visit with those guys. So I get to go whenever the club goes."},{"speaker":"Intvr","time":"00:32:23-5","content":"Okay, I get it. So let me ask you a difficult question that follows from that. Which is, that you are, when you go over there, you're confronted by the all too real possibility that you could be that person."},{"speaker":"Resp","time":"00:32:40-3","content":"Yeah."},{"speaker":"Intvr","time":"00:32:42-0","content":"Right. I mean so, one of the things I'm also trying to explore in this project is how people cope when they are told that we promise that you are sentenced to die in prison. How do people cope with that when it rears its head?"},{"speaker":"Resp","time":"00:32:58-3","content":"Man, to be honest, all we have is hope. All we have is hope. All we have is hope that one day things will change. And that if people can see the changes and the transformations that actually going on in this prison system for the good. And all the guys that's being helped. That's coming in- I mean just look at the whole function of things I'm talking about from the rodeos, you got ministries that come up in here and their lives are being changed behind what God is doing in the midst of this place. And just hopefully the people that come in here and go through those experiences can be a voice for us on the outside."},{"speaker":"Intvr","time":"00:33:48-2","content":"So you're hopeful for some kind of sentencing reform?"},{"speaker":"Resp","time":"00:33:52-2","content":"Man, sentencing reform and I also I pray to God for that the supernatural happen on this land where people really know that God is who he say he is. A lot of times God be taken out the equation from what's really going on in our society today and that's crime by me. You have people that's searching and looking for answers and they don't have the answers right now."},{"speaker":"Resp","time":"00:33:52-2","content":"And a lot of the things that's going on, in society has been prophesized. And they call this end times. I just hope that, that people can find it in they heart to forgive because I know that...that everybody didn't make the right decisions in life. And sometimes, you just don't get caught. Even today...I mean I just look for that change."},{"speaker":"Intvr","time":"00:35:05-2","content":"Yeah. So has God played a big role in the way you cope?"},{"speaker":"Resp","time":"00:35:18-5","content":"Yeah."},{"speaker":"Intvr","time":"00:35:26-6","content":"I'm interested in how you today, over 2 decades later, how do you make sense of things and what do you think about when you think about the victim's family? And what transpired. Is it present in your life or no?"},{"speaker":"Resp","time":"00:35:44-4","content":"Yeah, it's present. Just hoping that they can forgive. Find it in they hearts."},{"speaker":"Intvr","time":"00:36:00-5","content":"You have no way of knowing, right? In terms of how the victim feels?"},{"speaker":"Resp","time":"00:36:09-2","content":"No I have no way of knowing."},{"speaker":"Intvr","time":"00:36:11-5","content":"Right. Have you come across the victim family dialogue program?"},{"speaker":"Resp","time":"00:36:19-7","content":"I was- when they first started the victim awareness, I was in that program."},{"speaker":"Intvr","time":"00:36:27-0","content":"Yeah it's a DSE program, but they unfortunately, the victim's family has to initiate the contact with them to start a conversation. But I think most people just don't know it exists, so what about the impact on your own family? Two families get affected. When you are sentenced to life without parole, what has that done to your family?"},{"speaker":"Resp","time":"00:36:57-6","content":"I think that it put a lot on them. And I...I know by them not really understanding the system that - that they don't really understand that life without parole means that you're actually not going home; and you're sentenced to die in the penitentiary. Till your last breath."},{"speaker":"Intvr","time":"00:37:32-4","content":"Do you think that your families been in denial about that?"},{"speaker":"Resp","time":"00:37:36-4","content":"Nah."},{"speaker":"Intvr","time":"00:37:42-8","content":"Who do you think was impacted the worst by it? There's always- I mean there tends to be always one primary person who has the toughest time with it all? Who do you think that might have been?"},{"speaker":"Resp","time":"00:37:53-7","content":"Ask me that again."},{"speaker":"Intvr","time":"00:37:55-2","content":"Of the folks in your family that have been impacted by this whole tragedy, who do you think has had the hardest time with it?"},{"speaker":"Resp","time":"00:38:07-3","content":"My mother and my father."},{"speaker":"Intvr","time":"00:38:09-0","content":"Okay."},{"speaker":"Resp","time":"00:38:12-2","content":"I'd say my grandmother too...maybe my brother."},{"speaker":"Intvr","time":"00:38:21-1","content":"When things like this happen, do you think part of that distance is just wanting to get away from what happened and not be affiliated with it? It's sometimes about shame that comes with that for people, for parents. I'm sorry actually, I didn't mean to get you into that state. We can move on."},{"speaker":"Resp","time":"00:38:49-7","content":"Ask me that again."},{"speaker":"Intvr","time":"00:38:51-9","content":"Well I didn't want to put you into a very painful place; but I think that part of the experience of serving life without parole is this impact that it has on families of the person who committed the offense, right. We always focus on the victim's family and I was asking you about the impact that you having to come here has had on your family. And you had said that your brother, who you considered to be your twin has distanced himself from you, do you think that had to do with trying to get away from what happened?"},{"speaker":"Resp","time":"00:39:36-2","content":"Yeah I think that plays a part, in that, him not really understanding. He was 19 when this happened, and I still don't think that he really truly understands my position and what the system is about. And the reality of this. So, I know that he's been going through a lot of spiritual warfare within himself. Honestly I think that he feels, he feels like he's alone out there."},{"speaker":"Intvr","time":"00:40:15-2","content":"Yeah, I guess I'm just wondering if part of that distance is that it's just too much to deal with. When you see a loved one go to prison it can be overbearing. Is he a spiritual person?"},{"speaker":"Resp","time":"00:40:31-3","content":"Yes sir."},{"speaker":"Intvr","time":"00:40:38-1","content":"So, you're a changed person from the person that you were when you came here, right? And sometimes people can point to a specific event or a person who came into their lives who kind of turned them around. Is that the case for you, or was it more of a gradual aging process? What was the transformation point for you?"},{"speaker":"Resp","time":"00:40:59-8","content":"Going to church and hearing the word of God."},{"speaker":"Intvr","time":"00:41:02-2","content":"Okay, and when did that happen? In your time coming in here, how far along into your sentence was that?"},{"speaker":"Resp","time":"00:41:15-9","content":"Maybe, I could say probably within the last 10 years. The last 10 years, going to service and going to ministries with people coming from the outside. Hearing the word, the word go forth- the word will work within you and help transform you. And me doing that, it has helped change my life because many a times, being in here, hearing that word; and hearing that word come directly to me."},{"speaker":"Resp","time":"00:41:15-9","content":"I know that God had a message for me and he was using people to tell me things that I needed to hear and things that I needed to do. To better myself as a man. And going to these service up in here has truly helped me and helped me change my perspective on how I look at things."},{"speaker":"Intvr","time":"00:42:26-6","content":"So, before this happened, okay- the first decade and a half of this whole process, how were you dealing with it before God came into your life?"},{"speaker":"Resp","time":"00:42:40-3","content":"Well, when I was going through the things that I was going through and making the decisions I was making- I always had acknowledgement for him, even when I was doing cellblock time I always reached up to him. And I ain't going to say I always picked up my bible, but I picked up my bible and read the scripts."},{"speaker":"Intvr","time":"00:43:06-2","content":"Okay, so it's been an ongoing thing, alright. If you go before a pardon or parole board, what would you want to say to them?"},{"speaker":"Resp","time":"00:43:14-1","content":"Man, I'll just really let God speak to my heart. And whatever God put on my heart that's what I'll share with those people. From a sincere heart; and just hopefully that they can see the genuine and the man that I become right now."},{"speaker":"Intvr","time":"00:43:42-8","content":"Sure, to focus on the transformation. I think- I'm learning that there are different things that are difficult at different stages of your time here. When you first come in the challenges are different and the way you're thinking, right. For you now, what's the worst and hardest part?"},{"speaker":"Resp","time":"00:44:17-7","content":"Being separated from my family and watching them grow old. Right now, my mother is battling cancer; and my father a couple years ago he had a stroke. I mean they getting older and my grandmother, she- she been struggling with her health. And so, I mean that really has a big effect on me. I been gone so long, and I should be there for them to take care of them."},{"speaker":"Intvr","time":"00:44:56-0","content":"I understand that. Let me ask you this, of all the things you've accomplished. What are you most proud of?"},{"speaker":"Resp","time":"00:45:11-2","content":"Changing from a negative to a positive."},{"speaker":"Intvr","time":"00:45:24-7","content":"What's the, tell me a little bit more about the concept club. When you first mentioned it I thought it was the hospice club; but it's not. What else does the concept club do?"},{"speaker":"Resp","time":"00:45:36-9","content":"Well, basically that's what they do. They have fundraisers to take care of those guys on the- hospital"},{"speaker":"Intvr","time":"00:45:52-9","content":"Oh okay so it is the hospital ward, I misunderstood that."},{"speaker":"Resp","time":"00:45:55-3","content":"Right."},{"speaker":"Intvr","time":"00:45:59-4","content":"So let's look a bit further into the future and let's say you go before a pardon board and they see the transformation in you and they say they're going to make you parole eligible. And you get the signature and you start moving forward and you get parole. Do you have a vision for that chapter of your life? The next chapter of your life, if you were to get parole out of here."},{"speaker":"Resp","time":"00:46:27-2","content":"Well really what I wanted to do is...is do this. Like I said, I grew to have a passion to design fashion. And if I was to get out there today or tomorrow I'd want to try to launch my own fashion brand. And at the same time, just utilize the resources that I have here also too. The guys that I've developed relationships with; and really be a help towards them also because I mean you have talent up in here that really needs to be out there."},{"speaker":"Resp","time":"00:46:27-2","content":"But I just want to be an impact for change too. I mean, do ministry, giving back to the communities. Being a voice in those communities. Really just being a positive example because I know me being a negative influence when I was out there- I know that they had guys that followed behind the negative that I had but I want to reverse that negative influence."},{"speaker":"Resp","time":"00:46:27-2","content":"And allow the positive influence to be a factor in their lives, really for them to see the change. It's been 27 years and a lot of people seen me, and I know that there's a lot of hopeless people out there. I mean I just want to give back."},{"speaker":"Intvr","time":"00:48:21-1","content":"Sure, sure. I think that's actually a good place to end. I really want to thank you for doing this. I know that it wasn't all easy, and I really enjoyed learning about your life, so thank you."},{"speaker":"Resp","time":"00:48:35-4","content":"I appreciate it."}]}